{
  "id": "http://arxiv.org/abs/0908.4431v1",
  "title": "An OLAC Extension for Dravidian Languages",
  "authors": [
    "B Prabhulla Chandran Pillai"
  ],
  "abstract": "OLAC was founded in 2000 for creating online databases of language resources.\nThis paper intends to review the bottom-up distributed character of the project\nand proposes an extension of the architecture for Dravidian languages. An\nontological structure is considered for effective natural language processing\n(NLP) and its advantages over statistical methods are reviewed",
  "text": "arXiv:cs/0908.4431v1      02 Sep 2009\nAn OLAC Extension for Dravidian Languages\nDr. B Prabhulla Chandran Pillai,\nCatholicate College,\n(Affiliated to Mahatma Gandhi University, Kottayam),\nPathanamthitta, Kerala, India1\nAbstract\nOLAC  was  founded  in  2000  for  creating \nonline  databases  of  language  resources. This \npaper intends to review the bottom-up distributed \ncharacter of the project and proposes an extension \nof  the  architecture  for  Dravidian  languages.  An \nontological  structure  is  considered  for  effective \nnatural  language  processing  (NLP)  and  its \nadvantages over statistical methods are reviewed\nKeywords: Dravidian language, Natural language processing, \nOntology, Semantics\n1 \nIntroduction\nThough  the  compilation  of  morphological  and \nphonological rules are effectively done using finite-\nstate acceptors and transducers, (Mehryar  Mohri, \nFernando  Pereira,  Michael  Riley,  1996)  when  it \ncomes to Dravidian languages a semantic counter \nrevolution is very much needed and it should be \nbased on an ontological structure that also considers \nthe common  sense view  of  human  brain.  It has \nalready been shown that (W. S. Saba, 2008), this is \ntrue in the case with non phonetic languages like \nEnglish. \nIn  this  paper,  the  author  tries  to  provide  a \ntechnically  feasible  methodology  for  the \npreservation of Dravidian Languages based on an \nOLAC  Extension  and  a  semantic ontological \nstructure. Further, using variables and quantification \nwe can improvise the whole concept of Ontology. \nFred Sommers (1963) suggested the idea of strongly \ntyped ontology that is quite evident in the spoken \nlanguage, where two objects x and y are considered \nto  be  of  the  same  type  iff  the  set  of  monadic \npredicates that are significantly (that is, truly or \nfalsely but not absurdly) predicable of x is \nequivalent  to  the  set  of  predicates  that  are \nsignificantly predicable of y. \nThe  agreement  to  this  idea  makes  the  phonetic \nlanguages  like  Dravidian  languages  more \ncomputationally analyzable languages. \nThe knowledge- based approaches in the ordinary \nnatural  language  processing  (NLP)  using \nquantitative (say statistical, corpus-based or machine \nlearning) tools are not fully fool proof. \n2. Review\nThe preservation and nourishing of the language \nis viable only if the mode of accessing is akin to \nthe one illustrated in the figure (Fig. 1) (Steven \nBirdGary Simons  and Chu-Ren Huang, 2001)\nThe Open Language Archives Community (OLAC) \nwas  formulated  to  have  a  federated  language \narchives based on the Open Archives Initiative and \nthe Dublin Core Metadata Initiative. \n1 Email: bprabhullachandran@gmail.com \nThe project is mostly pivoted around the goal that \nenables researchers and linguists to document their \nresources,  tools  and  data.  In  order  to  avoid  the \ncomplexities in finding the right information, the \nproject  employed  the  OAI  Shared  Metadata  Set \n(Dublin  Core),  which  facilitated  interoperability \nacross all repositories that are involved in the OAI \nand the OAI Metadata Harvesting Protocol, which \nhelps the user to query a repository using HTTP \nrequests. Though OAI archives have a submission \nprocedure,  a  long-term  storage  system,  and  a \nretrieval  mechanism,  it  is  not  effective  for \npreserving the classical documents which are very \nvital  when  it comes  to Dravidian  languages like \nSanskrit. So is the case with the folklore languages \nthat are strongly connected to this.\nEven  though  the  project  follows  a  bottom-up \ndistributed character of the web, it id quite effective \nsince it  has a  structured nature of a centralized \ndatabase.  What  interests  more  to  the  Dravidian \nlanguage linguists is that it can support metadata \nstandards in addition to the Dublin Core. The user \n(using  Ethnologue  database)  has  also  access  to \nspecific  information  for  each  language;  viz.  a \nunique  three-letter  code,  the  country  where  this \nlanguage  is  spoken,  alternative  names,  dialects, \nlanguage classification, comments, and references \nto the SIL bibliography.\nHere we summarize the Meta information normally \ncarried by the OLAC entry:\nTitle:\nCreator: \nSubject:\nSubject.language:\nDescription:\nPublisher:\nContributor: \nDate:\nType: \nType.linguistic: \nType.functionality: \nFormat: \nFormat.cpu: \nFormat.encoding: \nFormat.markup: \nFormat.os: \nFormat.sourcecode: \nSource:\nLanguage: \nThough  language  identification  and  supporting \nmultilingual resources are few hurdles in the way, \nOLAC still stands out as a potential candidate for \nlanguage preservation (and promotion). \nWe can find that the MT (Machine Translation) \nsystem  is  a  unidirectional  system  which  has  the \nability to translate language A to language B. And \nfor  handling  the  bidirectional  situation,  where  a \nsystem  translates  in  both  directions  between  the \nlanguages,  say  between  X  and  Y,  as  illustrated \nbelow: \npair><Subject.language code= X/>\n<Language code= Y/></pair>\n<pair><Subject.language code= Y/>\n<Language code= X/></pair>\nAnd a fully bidirectional lexicon specified for the \nusers of either language would be described in the \nsame way as a bidirectional MT system as shown \nbelow:\n<Language code= X/>\n<Language code= Y/>\n<Subject.language code= X/>\n<Subject.language code= Y/>\n3. Analysis and Suggestions\nThe  disappointments  with  purely  engineering \nmethodologies  were  discussed  briefly  in  the \nintroduction.  And  these  eventually  led  to  the \nconstruction of very large knowledge bases for NLP \n(Lenat  and  Ghua,  1990).  Thus  with  a  sound \nlinguistic  and  ontological  underpinnings,  a  good \nextension of OLAC can be done for the preservation \n(and promotion) of Dravidian languages. \nThe root cause for the development is that most of \nthe documents still exist in manuscript format. And \nwhen  it  comes  to  languages  like  Sanskrit,  the \nresources are mostly in ‘copylefted state’. NLP can \nhelp in converting this to digitally readable format \nand  using  MT  technique  the  languages  can  be \npopularised. These two points are elucidated further \nin the rest of this paper. \nThe whole scenario is practical since we are in a \nPlatonic  universe  which  admits  the  existence  of \nanything that we can discuss using our language. \nCocchiarella (1996) went one more step ahead by \narguing that the language can speak about things \nthat may have existed in the past or may exist in the \nfuture. It is interesting to note that, once we endorse \nthese ideas the processing of Dravidian languages \n(especially Dravidian literature) becomes a task that \ncan be ‘quantised’. \nNow, as suggested by Saba, let’s take a very simple \ncase.\na. Olga is an old dancer.\nb. Olga is an elderly teacher.\nThis  can  be  represented  quantitatively  using \nmathematical  expressions.  But  we  are  after \nontological representations. So, we can have show \nthis as (Saba, 2008)\nSince the Dravidian languages are phonetic in \nnature  the  processing  becomes  easier  as  the \npresentations are simpler. Just as in the final step, \nwe had ‘Olga is a beautiful dancer’ as Olga is the \nagent of some dancing Activity, and either Olga is \nBEAUTIFUL  or  her  DANCING  (or,  of  course, \nboth). And for the second statement as:  there is a \nunique object named Olga, an object that must be of \ntype Human, and an object a of type Activity, such \nthat a is a teaching activity, Olga is the agent of the \nactivity, and such that elderly is true of Olga.\nNLTK (Natural Language Processing Kit) can \nhandle these using threading and combination of \ndifferent rule types as shown (Edward Loper and \nSteven Bird, 2002) below:\ncascade = [\nChunkRule(’<DT><NN.*><VB.><NN.*>’),\nChunkRule(’<DT><VB.><NN.*>’),\nChunkRule(’<.*>’),\nUnChunkRule(’<IN|VB.*|CC|MD|RB.*>’),\nUnChunkRule(\"<,|\\\\.|‘‘|’’>\"),\nMergeRule(’<NN.*|DT|JJ.*|CD>’,\n’<NN.*|DT|JJ.*|CD>’),\nSplitRule(’<NN.*>’, ’<DT|JJ>’)\n]\nThe  Weighted  Transducers’  (Mehryar  Mohri, \nFernando Pereira, Michael Riley, 1996) method will \nbe  further  incorporated  to  improvise  the  overall \nefficiency as shown below:\n4. Conclusion and Remarks\nThe  existing  structure  of  OLAC  can  easily  be \nextended (by keeping the architecture structure as \nsuch) to incorporate the copylefted contents from the \nDravidian literature branch. By opting for an \neffective cloud (or parallel) computing architecture \nthe processing can be made effective and faster. For \nbest  results,  we  need  to  follow  a  semantic  and \nontological  structure  based  on  commonsense \nobservations  rather  than  purely  engineering \nmethodologies. \n5. References \nMontague, R. (1970), English as a Formal \nLanguage, In R. Thomasson (Ed.), Formal \nPhilosophy – Selected Papers of Richard Montague, \nNew Haven, Yale University Press.\nMontague, R. (1960), On the Nature of certain \nPhilosophical Entities, The Monist, 53, pp. 159-\n194.\nNg, Tou H. and Zelle, J. (1997), Corpus-based \nApproaches to Semantic Interpretation in Natural \nlanguage, AI Magazine, Winter 1997, pp. 45-64.\nPartee, B. (2007), Compositionality and Coercion \nin Semantics – the Dynamics of Adjective \nMeanings, In G. Bouma et. al. (Eds.), Cognitive \nFoundations of Interpretation, Amsterdam: Royal \nNetherlands Academy of Arts and Sciences, pp.\n145-161. \nPartee, B. H. and M. Rooth. (1983), Generalized \nConjunction and Type Ambiguity. In R. Bauerle, C. \nSchwartze, and A. von Stechow (eds.), Meaning, \nUse, & Interpretation of Language. Berlin: Walter \nde Gruyter, pp. 361-383.\nRais-Ghasem, M. and Coriveaue, J.-P. (1998), \nExemplar-Based Sense Modulation, In Proceedings \nof COLING-ACL '98 Workshop on the \nComputational Treatment of Nominals.\nSaba, W. (2007), Language, logic and ontology: \nUncovering the structure of commonsense \nknowledge, International Journal of Human-\nMachine Studies, 65(7), pp. 610-623.\nEncyclopedia of Linguistics. Oxford University \nPress.\nDCMI. 2000. Dublin Core qualifiers.\nhttp://dublincore.org/documents/2000/07/11/dcm\nes-qualifiers/. \nBarbara F. Grimes, editor. 2000. Ethnologue: \nLanguages of the World. Dallas: Summer \nInstitute of Linguistics, 14th edition\nCarl Lagoze and Herbert Van de Sompel. 2001. \nThe Open Archives Initiative: Building a low-\nbarrier interoperability framework.\nRonald Cole, editor. 1997. Survey of the State of \nthe Art in Human Language Technology. Studies \nin Natural Language Processing. Cambridge \nUniversity Press. \nDCMI. 1999. Dublin Core Metadata Element Set, \nversion 1.1: Reference description. \nhttp://dublincore.org/documents/1999/\n07/02/dces/  .\n[Carlsson & Beldiceanu 2002] Carlsson, M., and\nBeldiceanu, N. 2002. Arc-consistency for a chain of\nlexicographic ordering constraints. Technical report\nT2002-18, Swedish Institute of Computer Science.\nDemassey, S.; Pesant, G.; and Rousseau, L. 2006. \nA cost-regular based hybrid column generation \napproach. Constraints 11(4):315– 333.\nGolden, K., and Pang, W. 2003. Constraint \nreasoning over strings. In Rossi, F., ed., Proc.\nof 9th Int. Conf. on Principles and Practice of \nConstraint Programming (CP2003), 377–391.\nSeigel, E. (1976), Capturing the Adjective, Ph.D. \ndissertation\nSteven Bird and Gary Simons. 2001. The OLAC \nmetadata set and controlled vocabularies. In \nProceedings of ACL/EACL Workshop on Sharing \nTools and Resources for Research and Education. \nhttp://arXiv.org/abs/cs/0105030\n \n .  \n",
  "categories": [
    "cs.CL"
  ],
  "published": "2009-08-30",
  "updated": "2009-08-30"
}