{
  "id": "http://arxiv.org/abs/1207.1033v1",
  "title": "Alan Turing's Legacy: Info-Computational Philosophy of Nature",
  "authors": [
    "Gordana Dodig-Crnkovic"
  ],
  "abstract": "Alan Turing's pioneering work on computability, and his ideas on\nmorphological computing support Andrew Hodges' view of Turing as a natural\nphilosopher. Turing's natural philosophy differs importantly from Galileo's\nview that the book of nature is written in the language of mathematics (The\nAssayer, 1623). Computing is more than a language of nature as computation\nproduces real time physical behaviors. This article presents the framework of\nNatural Info-computationalism as a contemporary natural philosophy that builds\non the legacy of Turing's computationalism. Info-computationalism is a\nsynthesis of Informational Structural Realism (the view that nature is a web of\ninformational structures) and Natural Computationalism (the view that nature\nphysically computes its own time development). It presents a framework for the\ndevelopment of a unified approach to nature, with common interpretation of\ninanimate nature as well as living organisms and their social networks.\nComputing is understood as information processing that drives all the changes\non different levels of organization of information and can be modeled as\nmorphological computing on data sets pertinent to informational structures. The\nuse of infocomputational conceptualizations, models and tools makes possible\nfor the first time in history the study of complex selforganizing adaptive\nsystems, including basic characteristics and functions of living systems,\nintelligence, and cognition.",
  "text": "Alan Turing’s Legacy:  \nInfo-Computational Philosophy of Nature\nGordana Dodig-Crnkovic1\nAbstract. Alan Turing’s pioneering work on computability, and \nhis ideas on morphological computing support Andrew Hodges’ \nview of Turing as a natural philosopher. Turing’s natural \nphilosophy differs importantly from Galileo’s view that the book \nof nature is written in the language of mathematics (The \nAssayer, 1623). Computing is more than a language of nature as \ncomputation produces real time physical behaviors. This article \npresents the framework of Natural Info-computationalism as a \ncontemporary natural philosophy that builds on the legacy of \nTuring’s computationalism. Info-computationalism is a synthesis \nof Informational Structural Realism (the view that nature is a \nweb of informational structures) and Natural Computationalism \n(the view that nature physically computes its own time \ndevelopment). It presents a framework for the development of a \nunified approach to nature, with common interpretation of \ninanimate nature as well as living organisms and their social \nnetworks. Computing is understood as information processing \nthat drives all the changes on different levels of organization of \ninformation and can be modeled as morphological computing on \ndata sets pertinent to informational structures. The use of info-\ncomputational conceptualizations, models and tools makes \npossible for the first time in history the study of complex self-\norganizing adaptive systems, including basic characteristics and \nfunctions of living systems, intelligence, and cognition. \n1 Turing and Natural Philosophy1 \nAndrew Hodges [1] describes Turing as a Natural philosopher: \n“He thought and lived a generation ahead of his time, and yet the \nfeatures of his thought that burst the boundaries of the 1940s are \nbetter described by the antique words: natural philosophy.” \nTuring’s natural philosophy differs from Galileo’s view that the \nbook of nature is written in the language of mathematics (The \nAssayer, 1623). Computation is not just a language of nature; it \nis the way nature behaves. Computing differs from mathematics \nin that computers not only calculate numbers, but more \nimportantly they can produce real time physical behaviours. \nTuring studied a variety of natural phenomena and proposed \ntheir \ncomputational \nmodeling. \nHe \nmade \na \npioneering \ncontribution in the elucidation of connections between \ncomputation and intelligence and his work on morphogenesis \nprovides evidence for natural philosophers’ approach. Turing’s \n1952 paper on morphogenesis [2] proposed a chemical model as \nthe basis of the development of biological patterns such as the \nspots and stripes that appear on animal skin. \n                                                 \n1 School of Innovation, Design and Engineering, Mälardalen University, \nSweden. Email: gordana.dodig-crnkovic@mdh.se \nTuring did not originally claim that the physical system \nproducing patterns actually performs computation through \nmorphogenesis. Nevertheless, from the perspective of info-\ncomputationalism, [3,4] argues that morphogenesis is a process \nof morphological computing. Physical process, though not \ncomputational in the traditional sense, presents natural \n(unconventional), physical, morphological computation.  \nAn essential element in this process is the interplay between the \ninformational structure and the computational process – \ninformation self-structuring. The process of computation \nimplements physical laws which act on informational structures. \nThrough the process of computation, structures change their \nforms, [5]. All computation on some level of abstraction is \nmorphological computation – a form-changing/form-generating \nprocess, [4]. \nIn this article, info-computationalism is identified as a new \nphilosophy of nature providing the basis for the unification of \nknowledge from currently disparate fields of natural sciences, \nphilosophy, and computing. An on-going development in \nbioinformatics, computational biology, neuroscience, cognitive \nscience and related fields shows that in practice biological \nsystems are currently already studied as information processing \nand are modelled using computation-theoretical tools [6,7,8]. \nDenning declares: “Computing is a natural science” [9] and info-\ncomputationalism provides plenty of support for this claim. \nContemporary biologists such as Kurakin [10] also add to this \ninformation-based naturalism, claiming that “living matter as a \nwhole represents a multiscale structure-process of energy/matter \nflow/circulation, \nwhich \nobeys \nthe \nempirical \nlaws \nof \nnonequilibrium thermodynamics and which evolves as a self-\nsimilar structure (fractal) due to the pressures of competition and \nevolutionary selection”. [11, p5]  \n2 Universe as Informational Structure \nThe universe is, from the metaphysical point of view, \"nothing \nbut processes in structural patterns all the way down\" [12, p228]. \nUnderstanding patterns as information, one may infer that \ninformation is a fundamental ontological category. The ontology \nis scale-relative. What we know about the universe is what we \nget from sciences, as \"special sciences track real patterns\" [12, \np242]. This idea of an informational universe coincides with \nFloridi’s Informational Structural Realism [13,14]. We know as \nmuch of the world as we explore and cognitively process: \n“Reality in itself is not a source but a resource for knowledge. \nStructural objects (clusters of data as relational entities) work \nepistemologically like constraining affordances: they allow or \ninvite certain constructs (they are affordances for the \ninformation system that elaborates them) and resist or impede \nsome others (they are constraints for the same system), \ndepending on the interaction with, and the nature of, the \ninformation system that processes them.” [13, p370]. \nWolfram [15] finds equivalence between the two descriptions – \nmatter and information: \n“[M]atter is merely our way of representing to ourselves things \nthat are in fact some pattern of information, but we can also say \nthat matter is the primary thing and that information is our \nrepresentation of that. It makes little difference, I don’t think \nthere’s a big distinction – if one is right that there’s an ultimate \nmodel for the representation of universe in terms of \ncomputation.” [16, p389]. \nMore detailed discussion of different questions of the \ninformational universe, natural info-computationalism including \ncognition, meaning and intelligent agency is given by Dodig \nCrnkovic and Hofkirchner in [17]. \n3 The Computing Universe – Naturalist \nComputationalism \nZuse was the first to suggest (in 1967) that the physical behavior \nof the entire universe is being computed on a basic level, \npossibly on cellular automata, by the universe itself, which he \nreferred to as \"Rechnender Raum\" or Computing Space/Cosmos. \nConsequently, Zuse was the first pancomputationalist (natural \ncomputationalist), [18]. Chaitin in [19, p.13] claims that the \nuniverse can be considered to be a computer “constantly \ncomputing its future state from its current state, constantly \ncomputing its own time-evolution account!” He quotes Toffoli, \npointing out that “actual computers like your PC just hitch a ride \non this universal computation!”  \nWolfram too advocates for a pancomputationalist view [15], a \nnew dynamic kind of reductionism in which the complexity of \nbehaviors and structures found in nature are derived (generated) \nfrom a few basic mechanisms. Natural phenomena are thus the \nproducts of computation processes. In a computational universe \nnew and unpredictable phenomena emerge as a result of simple \nalgorithms operating on simple computing elements such as \ncellular automata, and complexity originates from the bottom-up \nemergent processes. Cellular automata are equivalent to a \nuniversal Turing Machine. Wolfram’s critics remark, however, \nthat cellular automata do not evolve beyond a certain level of \ncomplexity; the mechanisms involved do not produce \nevolutionary development. Wolfram meets this criticism by \npointing out that cellular automata are models and as such \nsurprisingly successful ones. Also Fredkin [20] in his Digital \nphilosophy builds on cellular automata, suggesting that particle \nphysics can emerge from cellular automata. For Fredkin, humans \nare software running on a universal computer.  \nWolfram and Fredkin, in the tradition of Zuse, assume that the \nuniverse is, on a fundamental level, a discrete system, and is thus \nsuitably modelled as an all-encompassing digital computer. \nHowever, \nthe \ncomputing \nuniverse \nhypothesis \n(natural \ncomputationalism) does not critically depend on the discreteness \nof the physical world, as there are digital as well as analog \ncomputers. On a quantum-mechanical level, the universe \nperforms computation on characteristically dual wave-particle \nobjects [21], i.e. both continuous and discrete computing. Maley \n[22] demonstrates that it is necessary to distinguish between \nanalog and continuous, and between digital and discrete \nrepresentations. Even though typical examples of analog \nrepresentations use continuous media, this is not what makes \nthem analog. Rather, it is the relationship that they maintain with \nwhat they represent. Similar holds for digital representations. \nThe lack of proper distinctions in this respect is a source of much \nconfusion on discrete vs. continuous computational models. \nMoreover, even if in some representations it may be discrete \n(and thus conform to the Pythagorean ideal of number as a \nprinciple of the world), computation in the universe is performed \nat many different levels of organization, including quantum \ncomputing, bio-computing, spatial computing, etc. – some of \nthem discrete, others continuous. So computing nature seems to \nhave a use for both discrete and continuous computation, [23]. \n4 Information Processing Model of Computation \nComputation is nowadays performed by computer systems \nconnected in global networks of multitasking, interacting \ndevices. The classical understanding of computation as syntactic \nmechanical symbol manipulation performed by an isolated \ncomputer is being replaced by the information processing view \nby Burgin, [24]. Info-computationalism adopts Burgin definition \nof computation as information processing. \nIn what follows, I will focus on explaining this new idea of \ncomputation, which is essentially different from the notion of \ncontext-free execution of a given procedure in a deterministic \nmechanical way. Abramsky summarizes this changing paradigm \nof computing as follows:  \n“Traditionally, the dynamics of computing systems, their \nunfolding behaviour in space and time has been a mere means to \nthe end of computing the function which specifies the algorithmic \nproblem which the system is solving. In much of contemporary \ncomputing, the situation is reversed: the purpose of the \ncomputing system is to exhibit certain behaviour. (…)  \nWe need a theory of the dynamics of informatic processes, of \ninteraction, and information flow, as a basis for answering such \nfundamental questions as: What is computed? What is a \nprocess? What are the analogues to Turing completeness and \nuniversality when we are concerned with processes and their \nbehaviours, rather than the functions which they compute?”  \n[25, p483] \nAccording to Abramsky, there is a need for second generation \nmodels of computation, and in particular there is a need for \nprocess models such as Petri nets, Process Algebra, and similar. \nThe first generation models of computation originated from \nproblems of formalization of mathematics and logic, while \nprocesses or agents, interaction, and information flow are \ngenuine products of the development of computers and \nComputer Science. In the second generation models of \ncomputation, previous isolated systems with limited interactions \nwith the environment are replaced by processes or agents for \nwhich interactions with each other and with the environment are \nfundamental.  \nAs a result of interactions among agents and with the \nenvironment, complex behaviour emerges. The basic building \nblock of this interactive approach is the agent, and the \nfundamental operation is interaction. The ideal is the \ncomputational behaviour of an organism, not mechanical \nmachinery. This approach works at both the macro-scale (such \nas processes in operating systems, software agents on the \nInternet, transactions, etc.) and on the micro-scale (from program \nimplementation, down to hardware).  \nThe above view of the relationship between information and \ncomputation presented in [25] agrees with ideas of info-\ncomputational naturalism of Dodig-Crnkovic [3] which are \nbased on the same understanding of computation and its relation \nto information. Implementation of info-computationalism, \ninteractive computing (such as, among others, agent-based) \nnaturally suits the purpose of modelling a network of mutually \ncommunicating processes/agents, see [3,4,5]. \n5 Natural Computation \nNatural computing is a new paradigm of computing which deals \nwith computability in the natural world. It has brought a new \nunderstanding of computation and presents a promising new \napproach to the complex world of autonomous, intelligent, \nadaptive, and networked computing \nthat has emerged \nsuccessively in recent years. Significant for Natural computing is \na bidirectional research [7]: as natural sciences are rapidly \nabsorbing ideas of information processing, computing is \nconcurrently assimilating ideas from natural sciences.  \nThe classical mathematical theory of computation was devised \nlong before global computer networks. Ideal, classical theoretical \ncomputers are mathematical objects and they are equivalent to \nalgorithms, Turing machines, effective procedures, recursive \nfunctions or formal languages. Compared with new computing \nparadigms, Turing machines form the proper subset of the set of \ninformation processing devices, in much the same way as \nNewton’s theory of gravitation presents a special case of \nEinstein’s theory, or Euclidean geometry presents a limited case \nof non-Euclidean geometries, [5]. \nNatural/Unconventional computing as a study of computational \nsystems includes computing techniques that take inspiration \nfrom nature, use computers to simulate natural phenomena or \ncompute with natural materials (such as molecules, atoms or \nDNA). Natural computation is well suited for dealing with large, \ncomplex, \nand \ndynamic \nproblems. \nIt \nis \nan \nemerging \ninterdisciplinary area closely related to artificial intelligence and \ncognitive science, vision and image processing, neuroscience, \nsystems biology and bioinformatics, to mention but a few.  \nComputational paradigms studied by natural computing are \nabstracted from natural phenomena such as self-* attributes of \nliving (organic) systems (including -replication, -repair, -\ndefinition and -assembly), the functioning of the brain, \nevolution, \nthe \nimmune \nsystems, \ncell \nmembranes, \nand \nmorphogenesis.  \nUnlike in the Turing model, where the Halting problem is \ncentral, the main issue in Natural computing is the adequacy of \nthe computational response (behaviour). The organic computing \nsystem adapts dynamically to the current conditions of its \nenvironments by self-organization, self-configuration, self-\noptimization, \nself-healing, \nself-protection \nand \ncontext-\nawareness. In many areas, we have to computationally model \nemergence which is not algorithmic according to Cooper [26] \nand Cooper and Sloman [27]. This makes the investigation of \ncomputational \ncharacteristics \nof \nnon-algorithmic \nnatural \ncomputation (sub-symbolic, analog) particularly interesting.  \nIn sum, solutions are being sought in natural systems with \nevolutionary developed strategies for handling complexity in \norder to improve complex networks of massively parallel \nautonomous engineered computational systems. Research in \ntheoretical foundations of Natural computing is needed to \nimprove understanding of the fundamental level of computation \nas information processing which underlies all computing. \n6 Information as a Fabric of Reality \n “Information is the difference that makes a difference. “ [29] \nMore specifically, Bateson’s difference is the difference in the \nworld that makes the difference for an agent. Here the world also \nincludes agents themselves. As an example, take the visual field \nof a microscope/telescope: A difference that makes a difference \nfor an agent who can see (visible) light appears when she/he/it \ndetects an object in the visual field. What is observed presents a \ndifference that makes the difference for that agent. For another \nagent who may see only ultra-violet radiation, the visible part of \nthe spectrum might not bring any difference at all. So the \ndifference that makes a difference for an agent depends on what \nthe agent is able to detect or perceive. Nowadays, with the help \nof scientific instruments, we see much more than ever before, \nwhich is yet further enhanced by visualization techniques that \ncan graphically represent any kind of data.  \nA system of differences that make a difference (information \nstructures that build information architecture), observed and \nmemorized, represents the fabric of reality for an agent. \nInformational Structural Realism [13] [30] argues exactly that: \ninformation is the fabric of reality. Reality consists of \ninformational structures organized on different levels of \nabstraction/resolution. A similar view is defended in [12]. Dodig \nCrnkovic [3] identifies this fabric of reality (Kantian 'Ding an \nsich') as potential information and makes the distinction between \nit and actual information for an agent. Potential information for \nan agent is all that exists as not yet actualized for an agent, and it \nbecomes information through interactions with an agent for \nwhom it makes a difference. \nInformational structures of the world constantly change on all \nlevels of organization, so the knowledge of structures is only half \nthe story. The other half is the knowledge of processes – \ninformation dynamics. \nIt is important to note the difference between the potential \ninformation (world in itself) and actual information (world for an \nagent). Meaningful information, which is what in everyday \nspeech is meant by information, is the result of interaction \nbetween an agent and the world. Meaning is use, and for an \nagent information has meaning when it has certain use. Menant \n[31] proposes to analyze relations between information, meaning \nand representation through an evolutionary approach. \n7 Info-Computationalism as Natural Philosophy \nInfo-computationalist \nnaturalism \nidentifies \ncomputational \nprocess with the dynamic interaction of informational structures. \nIt includes digital and analog, continuous and discrete, as \nphenomena existing in the physical world on different levels of \norganization. Our present-day digital computing is a subset of a \nmore \ngeneral \nNatural \ncomputing. \nIn \nthis \nframework, \ncomputational processes are understood as natural computation, \nsince information processing (computation) is not only found in \nhuman communication and computational machinery but also in \nthe entirety of nature. \nInformation represents the world (reality as an informational \nweb) for a cognizing agent, while information dynamics \n(information processing, computation) implements physical laws \nthrough which all the changes of informational structures unfold.  \nComputation, as it appears in the natural world, is more general \nthan the human process of calculation modelled by the Turing \nmachine. Natural computing takes place through the interactions \nof concurrent asynchronous computational processes, which are \nthe most general representation of information dynamics [5]. \n8 Conclusions \nAlan Turing’s work on computing machinery, which provided \nthe basis for artificial intelligence and the study of its \nrelationship \nto \nnatural \nintelligence, \ntogether \nwith \nhis \ncomputational models of morphogenesis, can be seen as a \npioneering contribution to the field of Natural Computing and \nthe Computational Philosophy of Nature. Today’s info-\ncomputationalism \nbuilds \non \nthe \ntradition \nof \nTuring’s \ncomputational Natural Philosophy. It is a kind of epistemological \nnaturalism based on the synthesis of two fundamental \ncosmological ideas: the universe as informational structure \n(informationalism) and the universe as a network of \ncomputational \nprocesses \n(pancomputationalism/naturalist \ncomputationalism).  \nInformation and computation in this framework are two \ncomplementary concepts representing structure and process, \nbeing and becoming. Info-computational conceptualizations, \nmodels and tools enable the study of nature and its complex, \ndynamic structures, and uncover unprecedented new possibilities \nin the understanding of the connections between earlier unrelated \nphenomena of non-living and living nature [28]. \nREFERENCES \n[1] A. Hodges, Turing. A Natural philosopher. London: Phoenix, 1997. \n[2] A. M. Turing, The Chemical Basis of Morphogenesis. Philosophical \nTransactions of the Royal Society of London, 237(641), 37-72, 1952. \n[3] \nG. \nDodig-Crnkovic, \nInformation \nand \nComputation \nNets. \nInvestigations into Info-computational World. Information and \nComputation (pp. 1-96). Saarbrucken: Vdm Verlag, 2009. \n[4] \nG. \nDodig-Crnkovic, \nThe \nInfo-computational \nNature \nof \nMorphological Computing. In V. C. Müller (Ed.), Theory and \nPhilosophy of Artificial Intelligence (SAPERE., p. forthcoming). \nBerlin: Springer, 2012. \n[5] G. Dodig-Crnkovic, Significance of Models of Computation from \nTuring Model to Natural Computation. Minds and Machines, 21(2), \n301-322. Springer, 2011. \n[6] G. Rozenberg, & L. Kari, The many facets of natural computing. \nCommunications of the ACM, 51, 72–83. 2008. \n[7] L. F. Landweber, and, & L. Kari, The evolution of cellular \ncomputing: nature’s solution to a computational problem. Biosystems, \n52(1-3), 3-13. 1999. \n[8] K. Van Hornweder, Models and Mechanisms of the Morphogenesis \nof \nBiological \nStructures \n(Technical \nReport \nUT-CS-11-681). \nftp://cs.utk.edu/pub/TechReports/2011/ut-cs-11-681.pdf, 2011. \n[9] P. Denning, Computing is a natural science. Comm. ACM, 50(7), 13-\n18 http://cs.gmu.edu/cne/pjd/PUBS/CACMcols/cacmJul07.pdf, 2007. \n[10] A. Kurakin, Scale-free flow of life: on the biology, economics, and \nphysics of the cell. Theoretical biology & medical modelling, 6(6). \n2009. \n[11] A. Kurakin, The self-organizing fractal theory as a universal \ndiscovery method: the phenomenon of life. Theoretical Biology and \nMedical Modelling, 8(4). http://www.tbiomed.com/content/8/1/4 \n2011. \n[12] J. Ladyman, D. Ross, D. Spurrett, & J. Collier, Everything must go: \nmetaphysics \nnaturalised. \nOxford: \nClarendon \nPress. \nhttp://www.worldcat.org/title/everything-must-go-metaphysics-\nnaturalised/oclc/84150765&referer=brief_results 2007. \n[13] L. Floridi, (2008). A defense of informational structural realism. \nSynthese, 161(2), 219-253. \n[14] L. Floridi, Against digital ontology. Synthese, 168(1), 151–178, \n2009. \n[15] S. Wolfram, A New Kind of Science. Wolfram Media. 2002. \n[16] H. Zenil, Randomness Through Computation: Some Answers, More \nQuestions. Singapore: World Scientific Pub Co Inc. (2011). \n[17] G. Dodig Crnkovic, and, & W. Hofkirchner, Floridi’s “Open \nProblems in Philosophy of Information”, Ten Years After. \nInformation, 2(2), 327-359, 2011. \n[18] K. Zuse, Rechnender Raum. Braunschweig: Friedrich Vieweg & \nSohn, 1969. \n[19] G. Chaitin, Epistemology as Information Theory: From Leibniz to \nΩ. In G. Dodig Crnkovic (Ed.), Computation, Information, Cognition \n– The Nexus and The Liminal, 2-17. Newcastle UK: Cambridge \nScholars Publishing, 2007. \n[20] E. Fredkin, Finite Nature. XXVIIth Rencotre de Moriond, 1992. \n[21] S. Lloyd, Programming the universe: a quantum computer scientist \ntakes on the cosmos (1st ed.). New York: Knopf, 2006. \n[22] C. J. Maley, Analog and digital, continuous and discrete. Philos. \nStud, 155, 117–131, 2010. \n[23] A. Lesne, The discrete versus continuous controversy in physics. \nMathematical Structures in Computer Science, 17, 185–223, 2007. \n[24] Burgin, M. Super-Recursive Algorithms (Monographs., pp. 1-320). \nNew York: Springer-Verlag New York Inc., 2004. \n[25] S. Abramsky, Information, Processes and Games. In J. Benthem van \n& P. Adriaans (Eds.), Philosophy of Information, 483-549. \nAmsterdam, The Netherlands: North Holland, 2008. \n[26] S. B. Cooper, B. Löwe, & A. Sorbi, New Computational Paradigms. \nChanging \nConceptions \nof \nWhat \nis \nComputable. \nSpringer \nMathematics of Computing series, XIII. (S. B. Cooper, B. Löwe, & \nA. Sorbi, Eds.). Springer. 2008. \n[27] G. Dodig-Crnkovic, and, & M. Burgin, Information and \nComputation, Singapore: World Scientific Pub Co Inc., 2011. \n[28] G. Dodig-Crnkovic, and, & V. Müller, A Dialogue Concerning Two \nWorld Systems: Info-Computational vs. Mechanistic. In G. Dodig \nCrnkovic & M. Burgin (Eds.), Information and Computation, 149-\n184, World Scientific. (2011). \n[29] G. Bateson, Steps to an Ecology of Mind. Ballantine, NY, pp. xxv-\nxxvi. 1972. \n[30] K. M. Sayre, Cybernetics and the Philosophy of Mind, Routledge & \nKegan Paul, London. 1976. \n[31] C. Menant, Computation on Information, Meaning and \nRepresentations. An Evolutionary Approach. In G. Dodig Crnkovic \n& M. Burgin Information and Computation, World Scientific. \n(2011).  \n      All the links accessed at 08 06 2012 \n",
  "categories": [
    "cs.GL"
  ],
  "published": "2012-07-03",
  "updated": "2012-07-03"
}