{
  "id": "http://arxiv.org/abs/1406.3460v1",
  "title": "Are Style Guides Controlled Languages? The Case of Koenig & Bauer AG",
  "authors": [
    "Karolina Suchowolec"
  ],
  "abstract": "Controlled natural languages for industrial application are often regarded as\na response to the challenges of translation and multilingual communication.\nThis paper presents a quite different approach taken by Koenig & Bauer AG,\nwhere the main goal was the improvement of the authoring process for technical\ndocumentation. Most importantly, this paper explores the notion of a controlled\nlanguage and demonstrates how style guides can emerge from non-linguistic\nconsiderations. Moreover, it shows the transition from loose language\nrecommendations into precise and prescriptive rules and investigates whether\nsuch rules can be regarded as a full-fledged controlled language.",
  "text": "Are Style Guides Controlled Languages?\nThe Case of Koenig & Bauer AG\nKarolina Suchowolec⋆\nUniversity of Hildesheim, Germany\nkarolina.suchowolec@uni-hildesheim.de\nAbstract Controlled languages for industrial application are often re-\ngarded as a response to the challenges of translation and multilingual\ncommunication [3, pp. 52–53], [5, p. 212], [2, pp. i–iii]. This paper presents\na quite diﬀerent approach taken by Koenig & Bauer AG, where the main\ngoal was the improvement of the authoring process for technical docu-\nmentation. Most importantly, this paper explores the notion of a con-\ntrolled language and demonstrates how style guides can emerge from non-\nlinguistic considerations. Moreover, it shows the transition from loose\nlanguage recommendations into precise and prescriptive rules and inves-\ntigates whether such rules can be regarded as a full-ﬂedged controlled\nlanguage.\n1\nIntroduction\nA considerable amount of research on controlled languages deals with English. In\nthis paper, I examine an approach for an industrial application of a controlled\nlanguage in German at the printing press manufacturer Koenig & Bauer AG\n(KBA).1 In comparison to well-known industrial examples such as CFE/CTE\nor ASD-STE100 [2], [13], [cf. 3], KBA did not create an independent project\non a controlled language. Instead, the company’s main goal was to redeﬁne the\nauthoring process for technical documentation. Language standardization was\nneeded to support this goal. I will explain this background in the ﬁrst section.\nThe following section will give a closer look at the results of diﬀerent projects that\noriginated diﬀerent language rules. These rules and style guides will illustrate\nhow KBA unintentionally laid the foundations for a de facto controlled language.\nAfter showing some future directions for the project, I will discuss its results\nwithin the current theoretical frameworks.\nAlthough this paper derives from a case study, its main goal is to explore\nthe notion of a controlled language and to demonstrate how style guides can\n⋆I would like to thank Koenig & Bauer AG for the permission to publish this paper, in\nparticular Elmar Tober, who has been supervising the projects, and Sabine Lobach\nfor providing up-to-date data. In addition, I would like to thank Klaus Schubert,\nWolfgang Ziegler, and the anonymous reviewers for their critical comments.\n1 The author was employed at the company and implemented the terminology man-\nagement as well as advised other projects on linguistic matters.\narXiv:1406.3460v1  [cs.CL]  13 Jun 2014\nemerge from non-linguistic considerations. Moreover, this paper shows the tran-\nsition from loose language recommendations to precise and prescriptive rules. It\nalso investigates whether such rules can be regarded as a full-ﬂedged controlled\nlanguage.\n2\nBackground\nKoenig & Bauer AG is one of the leading printing press manufacturers, operat-\ning from Würzburg, Germany, employing around 6,200 (2012) people worldwide.\nThe variety of products covers a. o. web oﬀset, sheetfed oﬀset, and security print-\ning. The annual reports2 indicate that over 80 % of the products are exported,\nwhich makes translation of documentation and localization of the press soft-\nware an important step in the production process. Further, the web printing\npresses are unique custom-made production plants rather than standard mod-\nels. In consequence, every operating manual is a unique document, describing\nspeciﬁc features and the conﬁguration of the press for a given customer. Such\na document can be up to 800 pages long. It is translated into one language\n(national or regional language of the customer) and some customers require an\nadditional English translation. In short it means: one press – one manual in\nthe source language (German) – one manual in the target language. There are\ncertainly some core parts of the press and some partial conﬁgurations recur-\nring for many customers. In order to make the authoring process for technical\ndocumentation more eﬃcient, it was, therefore, important to facilitate identify-\ning, indexing, storing, retrieving, and combining the recurring information units.\nThis task had to be accomplished before addressing any issues of translation. In\nother words: the company was mainly interested in increasing the reuse of the\ncontent.\nIn order to redeﬁne standard procedures for technical documentation, the\ncompany launched six projects in 2007. These projects contribute to the overar-\nching goal of improving the reuse as follows [14], [21]:\n1. CMS: Project aiming at the implementation of a content management system\nfor editing, storing, retrieving and managing modularized content.\nTIM-RS R\n⃝by Fischer Computertechnik3 was chosen as the CMS with the\nPI-Mod4 as a data model for authoring. PI-Mod allows semantic as well as\ntopic-based XML markup for text chunks and modular reusable information.\nThis project provides the technology foundation for the reuse.\n2. Writers’ manual: In this project, meta documentation of the CMS project\nwas developed. The manual describes allowed XML elements: their content,\ndependencies, and, where necessary, their linguistic form. Moreover, it pro-\nvides general recommendations on orthography and style for the technical\ndocumentation.\n2 http://www.kba.com/investor-relations/berichte\n3 http://www.fct.de/de/loesungen/technische-dokumentation.html\n4 http://www.pi-mod.de\n3. Terminology management: A project on standardization of the specialized\nvocabulary. The goals were here to deﬁne standard procedures for the termi-\nnology management, to model the terminology database in SDL MultiTerm,5\nand to develop linguistic rules for evaluation and selection of preferred terms.\n4. Translation: Most documents at KBA are written in German and the com-\npany does not have in-house translators; therefore the project deﬁnes general\nconditions for the translation services. In the context of this paper, the most\nimportant decisions are the prescribed use of Translation Memories, develop-\nment of and adherence to the foreign-language equivalents to the provided\nGerman terminology as well as development of and adherence to general\nstyle guides for each foreign language as needed.\n5. Graphics: Due to the variability of the products, a full reuse of graphics\nin operating manuals is impossible. This project should nonetheless deﬁne\ncommon standards regarding the exporting of graphics from CAD systems,\nfurther processing and managing in the CMS environment.\n6. Parts catalog: In contrast to the above, this project focuses not on reuse,\nbut on making the editing and publishing of the parts catalog more simple\nand transparent.\nAs we see, there was no particular project for developing a controlled language as\nsuch. Yet, relevant issues and requirements concerning language use are scattered\nacross all projects.\n3\nLanguage Constraints at KBA\nKBA chose a modular approach towards development of technical documenta-\ntion, which means that the documents are built up by combining diﬀerent text\nmodules and chunks. These chunks can already be stored in a database; however,\nthey could be written by diﬀerent writers at a diﬀerent time and for diﬀerent\nproducts. The reuse principle requires not only homogeneous layout and typog-\nraphy, but also explicit linguistic rules for all writers involved in order to keep or\nachieve consistent language. Not only does consistent language make the manu-\nals more readable for the target (human) audience, but at the same time it also\nsupports the implementation of the reuse technology; for instance: the vocab-\nulary is used to index modules and chunks. Therefore, consistent terminology\nimproves the (machine-aided) retrieval.\nIn conclusion, it was the variability of the products as well as the desire to\nmake the process of the technical writing more eﬃcient that led to the develop-\nment of the style/syntax and lexical rules. In addition, improving the readability\nand translatability was an important aspect of standardizing the vocabulary.\nIn the following section, I will elaborate on the linguistic results of the\nprojects 1–4 described above dividing them into issues concerning lexicon and\nsyntax/style. By giving some examples of the rules and by describing the rule-\nformation process, I would like to draw attention to some aspects that will be\n5 http://www.sdl.com/products/sdl-multiterm/desktop.html\nsubsequently crucial to the understanding of a controlled language. First, KBA\nwent beyond the regular terminology management by developing a rule-based\nselection of preferred terms. Second, some imprecise style guides emerged from\nnon-linguistic considerations. Thanks to human and later machine-aided editing,\nthe rules have become more explicit and prescriptive. The following sections will\nillustrate this transition.\n3.1\nLexical Level\nKBA imposed two constraints to the standardization of the specialized vocab-\nulary.6 The ﬁrst constraint limited the in-house standardization to the German\nterms only. The second one restricted the scope of standardization to the speciﬁc\nprinting vocabulary, leaving out the more general technical terms or terms used\nin other domains such as economics. Importantly, KBA required the selection\nof preferred terms to be reproducible and transparent to the writers. Therefore,\nlinguistic criteria were developed for evaluating existing terms, which can be\napplied for coining new terms as well. Using a corpus of company’s vocabulary,\nsemantic and morphological aspects of the word formation patterns were iden-\ntiﬁed and evaluated. An essential part was to identify the patterns leading to\nambiguity and synonymy, for instance:\n– Ambiguity: Nominalization using the suﬃx -ung can both indicate a process\nor a device performing the process: wenden (to turn a sheet for perfecting)\n→Wendung (the process of perfecting or a perfecting unit).\n– Synonymy:\n• A process can be expressed through nominalization with suﬃx -ung (see\nabove) or conversion of the inﬁnite verb form: wenden →Wendung vs.\nWenden.\n• Diﬀerent features of a concept can be stressed in synonymous terms:\nChromwalze (chrome roller, focus on material) vs. Feuchtreibwalze\n(dampener distributor roller, focus on function).\n• The hypernymy can be explicitly stated using the hypernym in com-\npound nouns, or this relation can be stated implicitly: Farbreibwalze\n(oscillating ink roller) vs. Farbreiber (*ink oscillator).\nOne of the goals in developing the linguistic criteria/rules was to achieve a\none-to-one relation between the word formation pattern and the semantic class\nof the objects. In other words, the signiﬁant should indicate the class of the\nsigniﬁé, as illustrated by the following rules:\n– Use conversion to indicate the process: Wenden.\n– Use the nominalization with -ung or -or/-er to indicate a (complex) device:\nWendung, Längsschneider (slitter).7\n6 This section is based on [21].\n7 The corpus indicates a complementary distribution of both patterns with only few\nexceptions.\n– Use hypernym for composition of (less complex) parts: Farbreibwalze, Schneid-\nmesser (cutting knife).\n– Use the following ranking of features to be included in the term: 1) function\n2) object 3) working principle 4) shape 5) material 6) temporal, graduate,\ninternal features [cf. 18, p. 14].\n– Do not use more than 4 lexical morphemes in a compound noun, 3 mor-\nphemes are preferred.\nThese criteria are intended to be an assistance rather than absolute rules\nfor selecting the preferred terms. In case they lead to the selection of extremely\nunusual forms, established terms are preferred.\nThese rules, steps and roles in the terminology management process as well\nas the deﬁnition of the data structure for the terminology database were ﬁxed in\na terminology manual. Only after this deﬁnition task was completed, the actual\nstandardization of the lexicon began. Contrary to the manual, which recom-\nmended management similar to model B of ISO 15188 [10], the initial standard-\nization followed rather model D. The ﬁrst terminology draft was proposed by\nthe terminologist and consulted with the technical writers. The ﬁnal form was\nreleased only after consulting with the constructing engineers, who gave their\nfeedback on every term in the draft.\nApplying the theoretical principles of terminology management by Wüster\n[22], [cf. 1], the standardization process was concept-driven. Manually extracted\nterms were ﬁrst arranged into concept systems (multiple arrangement of one term\nwas allowed) and then given a deﬁnition. Only after both the concept systems\nand the deﬁnition were speciﬁed, the preferred term was chosen according to the\nrules described above.\nSDL MultiTerm was used from the very beginning. In addition, the initial\nmanagement employed MS PowerPoint (concept systems) and MS Excel (def-\ninitions and synonyms), in order to facilitate the feedback by the engineers.\nMoreover, the workﬂow software quickTerm by Kaleidoscope8 is now being im-\nplemented, which will help to shift back to the originally intended management\nas in the model B.\nCurrently, the database contains 614 concepts (1689 terms), covering almost\nentirely the printing speciﬁc vocabulary for the operating manuals. Roughly\n30 % of the German terms have an approved foreign-language equivalent in one\nor more of the following languages: English, French, Dutch, Russian, Swedish,\nand Spanish. The equivalents are provided by the translation services based on\nthe given German terminology and are not double-checked by KBA before ﬁnal\nrelease. However, quickTerm allows users to send their feedback on all languages.\n3.2\nSyntactic and Stylistic Level\nUnlike the lexical level, where an eﬀort was put in the linguistic evaluation\nof the corpus data and development of systematic rules for word formation,\n8 http://www.kaleidoscope.at/Deutsch/Software/QuickTerm/quickterm.php\nthe development of the stylistic and syntactic rules was a byproduct of the\nimplementation of PI-Mod.\nPI-Mod uses XML elements to mark up information in a text according to its\nsemantics, for instance as <step>, <descriptive>, <precondition>, <cause>, or\n<solution>. After agreeing on the elements needed for operating manuals, the\nstandardization of syntax and style for some elements began. This standardiza-\ntion was necessary for a similar reason as the lexical one: competing syntactic\npatterns were in use, for instance, imperative verb form vs. inﬁnite verb form\nused as imperative in <step> (in <action>), full sentence vs. ellipsis in <cause>\netc.\nThere is no record of the decision-making process for these rules, as the fo-\ncus of the CMS project was on the technical rather than linguistic speciﬁcation\n[14]. However, the original writers’ manual and personal communication indicate\nthat the prescribed style patterns were a combination of so-called good practice\nfor technical documentation, implicit or explicit but merely oral arrangements\namong the writers, and the standard examples used in the general PI-Mod spec-\niﬁcation.\nThe rules can be divided into general and element speciﬁc rules. Here are some\nexamples of the original recommendations developed during the CMS project:\n– Avoid Passive Voice.\n– Structure information logically, for instance if – then, or condition – step.\n– Element <step> (as child element of <action>):\nUse the formal imperative verb form (‘Sie’).\n– Element <symptom>:\nWrite from user’s perspective, do not use questions.\nExample: Mastarm fährt nicht richtig hoch. [sentence with a ﬁnite verb]9\n– Element <cause> (as child element of <safetyadvice>):\nName the cause of the hazard with one word or in a short and expressive\nsentence. Use an exclamation point.\nExample 1: Verbrühungsgefahr durch herausspritzendes Öl! [ellipsis, no ﬁnite\nverb]\nExample 2: Öldruck in Arbeitshydraulik kann Manometer zerstören! [sen-\ntence with a ﬁnite verb]\n– Element <cause> (as child element of <errordescription>):\nDescribe the cause of an error in one word or in a short and expressive\nsentence.\nExample 1: Kein Kraftstoﬀim Tank. [ellipsis, no ﬁnite verb]\nExample 2: Pumpe hat zu wenig Leistung. [sentence with a ﬁnite verb]\nInitially, the syntactic and stylistic rules were enforced by human editing\nwithin the department. Already at that point it became clear that some rules\nremained ambiguous. As demonstrated in the examples above, some rules were\nlinguistically imprecise, some lacked an explicit form, some depended on (some-\ntimes contradicting) examples and did not indicate whether they were recom-\nmendations or prescriptions. The room for interpretation lowered the consistency\n9 Information in brackets was not indicated in the manual.\nof the texts and in consequence – the reuse. Therefore, the rules and examples\nin the writers’ manual have been gradually replaced by more precise ones, for\ninstance:\n– Element <cause> (as child element of <safetyadvice>):\nUse ellipsis (construction with no ﬁnite verb). Do not use full sentences with\nverbs. Name the cause of the hazard with one word (Verbrührungsgefahr,\nVerbrennungsgefahr). Use an exclamation point.\nPositive example: Maschinenschaden durch liegengebliebenes Werkzeug!\nNegative example: Liegengebliebenes Werkzeug führt zu Maschinenschaden.\n– Element <cause> (as child element of <errordescription>):\nUse a full sentence with a verb. Do not use ellipsis. Use a period at the end\nof the sentence.\nPositive example: Kein Kraftstoﬀist im Tank.\nNegative example: Kein Kraftstoﬀim Tank.\nFurther speciﬁcation of the rules has been reinforced by the implementation\nof a controlled language checker (CLC, Acrolinx10), since the rules had to be\neasily transformed into a machine-readable form. Hence, the syntactic/stylistic\nlevel is being further consolidated.\nAlthough not used from the beginning, a CLC was considered a medium-\nterm goal. At this time, the system is being implemented to ﬁt into the already\nexisting linguistic environment. With respect to style and syntax, KBA rules\nare being mapped to the standard Acrolinx set of rules and the system is being\nchecked in a test environment. Practical application is expected not earlier than\nin the summer 2014. Despite oﬀering solutions for terminology management,\nAcrolinx will solely be used for proofreading. SDL MultiTerm will remain the\nprimary source for the lexical level of the language.\n4\nProspects\nThe four crucial projects resulting in the linguistic rules – CMS, terminology,\nwriters’ manual and translation – are completed. Yet, the maintenance and fur-\nther development of the rules is an on-going process. Other tasks like the pro-\nductive use of a CLC are still to be accomplished. More importantly, described\ndevelopment is normative only to the department of technical documentation;\nhowever other departments can obviously beneﬁt from the use of language re-\nstrictions as well. Some applications might regard CAD models, ERM (mainly\nterminology), and press software (both terminology and syntax/style). Although\nsome ways of implementing a controlled language to these applications have al-\nready been explored, they still remain a challenge for the future.\nOverall the main goal of modular approach and reuse still has to be evaluated.\nKBA is going to track the reuse applying the REx method [16]. Resulting data\ncould then be used for further interpretation of the linguistic contribution to the\n(improved) reuse.11\n10 http://www.acrolinx.com\n11 Wolfgang Ziegler, email communication (February 20, 2014)\n5\nDiscussion\nBefore any speciﬁc issues concerning language at KBA can be discussed, it needs\nto be determined whether the rules and developments described above constitute\na controlled language.\nThe term controlled language is not used in any internal documents to de-\nscribe the lexical or syntactic rules for technical documentation. Rather, there\nis an issue of terminology and writing rules (Schreibregeln) – both being treated\nseparately. The constraints on the language are put into an overarching context\nof standardization, just like XML markup, modular editing or data indexing in\nthe CMS. This might be the result of the distribution of the linguistic decisions\nover the four projects. In consequence, an explicit notion of a controlled language\nhas not yet emerged.\nFrom the theoretical point of view, however, the linguistic constraints at\nKBA satisfy all of the criteria by Kuhn [12, p. 123]: They are based on just one\nlanguage and restrict its system on the orthographic, morphological, lexical, syn-\ntactic and textual level, combining both prescriptive and proscriptive rules [5, p.\n228]. Although no empirical studies are available, we can assume that the output\nis easily recognizable as German to an expert familiar with the sublanguage of\nprinting. And ﬁnally, although the already established forms that had developed\nin an unsystematic way were preferred, the codiﬁcation of the forms in manuals\nwas a deliberate and, to a certain extent, systematic process. Therefore, we can\nregard these linguistic constraints as a controlled language.\nHaving clariﬁed the status of the linguistic constraints at KBA as controlled\nlanguage, we can try to determine its type.\nWe can apply to it the categories human-oriented and machine-oriented as\nproposed by Huijsen [9]. The development of the controlled language at KBA\nindicates an expansion of originally predominant human-oriented language to a\nlanguage that comprises both human- and machine-relevant features, but a clear\ndetermination is diﬃcult. Both categories seem to be tendencies rather than a\ndichotomy, which supports the main view in the literature [9, p. 2], [cf. 12, p.\n125].\nMoreover, we can examine further motives for this controlled language. There\nare three main groups of motives discussed in the literature: 1) to improve the\ncommunication among humans, 2) to improve the translation, and 3) to represent\nformal notations [12, p. 125], [cf. 9, p. 1], [cf. 19, p. 225], [cf. 20, p. 134], leading\nKuhn to postulate three main types of controlled languages [12, p. 125]. As\ndemonstrated above, these motives were not of primary concern for the style\nrules at KBA, where the increase of reuse was the main goal. The reuse issue of\na controlled language is not a new topic in the literature. It has been discussed\nin several case studies (CTE: [6, p. 422], [13, p. 194]). It is also mentioned in\nsome general overviews on controlled languages, but it rarely seems to be the\nmajor aspect discussed (in detail: [5, pp. 206–207], brieﬂy: [8, p. 11], [15, p. 248],\n[17, p. 62], left out: [2, pp. i–iii], [3]). Clearly, the reuse motive is missing in\nthe classiﬁcation by Kuhn. This might suggest the fourth type of a controlled\nlanguage – to improve (the eﬃciency of) the authoring process for technical\ndocumentation – an issue which seems to be underrepresented in the literature.\nCertainly, a legitimate question may arise whether a controlled language for\nthe content reuse serves solely the purpose of ensuring the readability of the text\nfor the target audience. As such, it could be subsumed under the ﬁrst type of\ncontrolled languages. As we saw, controlled language at KBA, in particular the\nvocabulary, ensures not only the consistency of a text, but also the retrieval of\nmodules, and, hence, contributes to the reuse in various ways. It is not to say that\nKBA was unaware that the improved clarity and precision of a controlled lan-\nguage have impact on the readability for the target audience, as well as improve\n(human and machine-aided) translatability and help control company’s liability\nin case of damage to persons or facilities [14], [21], [cf. 11, p. 443], [cf. 19, pp.\n225–230]. These secondary motives were certainly important for the support of\nthe projects at diﬀerent management levels in the company [cf. 4, Modul 1]. Yet\nthese general considerations only became tangible once the modular editing for\nimproving the reuse started to be implemented, since, in an obvious way, the\nmodular approach jeopardizes the consistency with all the consequences.\nWhat is more, the aspect of human understanding can also be found in\ncontrolled languages for translation – a controlled language ensures a. o. a cor-\nrect and readable output of (human, machine-aided or machine) translation.\nNonetheless, controlled languages for translation constitute their own type. Alto-\ngether, taken the classiﬁcation by Kuhn as a starting point, it seems, by analogy\nto the controlled languages for translation, reasonable to add the fourth type of\ncontrolled languages mentioned above to the classiﬁcation.\nAnother matter to discuss is the use of CLC and a general acceptance of a\ncontrolled language. Based on observation, the need for the application of lan-\nguage rules is generally understood and accepted by the technical writers. First\ntests of CLC seem to conform this. However, ambiguous terms lower the precision\nof the CLC, which is consistent with the diﬃculties mentioned in the literature\n[9, p. 8], [15, p. 252]. Splitting the vocabulary into domains, as suggested by the\nsoftware provider and by some authors [15, p. 276] seems to lack of a good split-\nting criterion that would not cause too much term overlap between the domains,\nrequiring some essential changes in the database deﬁnition and a reconsideration\nof the concept-driven terminology management. Currently, diﬀerent models for\nsoftware feedback and score in case of ambiguity are being tested. Overall, the\nproblem remains unsolved. The main question concerning this type of feedback\nis whether it will have an impact on the eﬀectiveness and on general acceptance\nof a CLC by the writers.\nLooking from a broader perspective, the case of KBA sheds some light on\nthe more general issue of the acceptance of a controlled language by the writers.\nGodden reports on the diﬃculties with the editor-centered model for CASL\nat General Motors, where the writers not previously trained in the rules were\nreluctant to accepting the changes proposed by the editor. Some better results\nwere achieved by a hybrid model, requiring prior training of the writers [7], [cf.\n5, pp. 215–216], [cf. 8, pp. 107–112]. We do not have similar data concerning\nmachine editing at KBA yet, but the experience with the human editing shows\na promising degree of acceptance of the language rules and proposed changes\nin case of a clear violation of the rules. I presume that there is a link between\ncooperative approach to the deﬁnition of the rules, resulting on the one hand\nin a ‘sense of community’ and on the other in a better comprehension of the\nrules, leading altogether to an increase of acceptance. There has already been\nan awareness of this phenomenon, particularly in the literature on terminology\nmanagement [5, p. 166], [cf. 17, p. 63] but empirical studies are still needed.\n6\nConcluding Remarks\nThe case of KBA shows that the notion of a controlled language needs to be\nreexamined. It can emerge as a result of deliberate decisions that are not neces-\nsarily labeled and conceived as a design of a controlled language. The distinction\nbetween controlled languages and style guides is indeed vague [12, p. 124] and\nneeds to be examined on a case by case basis, and perhaps only at a given\npoint in time. This also suggests that there might be more companies having\nlanguage regulations that do not see themselves as being concerned by the dis-\ncourse of controlled languages. Furthermore, a new type of a controlled language\n– to improve the authoring process for technical documentation – needs to be\nconsidered.\nFrom the practical point of view, the case of KBA shows that the develop-\nment in technology has made a controlled language more attainable. There is\nno longer a need for custom-built software solutions to implement the speciﬁca-\ntions of a controlled language. There is an array of standard software that can\nbe customized to ﬁt speciﬁc needs, which makes a controlled language easier\nand more aﬀordable to develop and implement, opening the ﬁeld to medium-size\ncompanies.\nReferences\n1. Arntz, R., Picht, H., Schmitz, K.D.: Einführung in die Terminologiearbeit. Olms,\nHildesheim, 7 edn. (2014)\n2. ASD Industries Association of Europe: Simpliﬁed Technical English. Speciﬁcation\nASD-STE100. International speciﬁcation for preparation of maintenance documen-\ntation in a controlled language (01 2013), issue 6\n3. Crabbe, S.: Controlled languages for technical writing and translation. In: Confer-\nence proceedings. The Ninth Portsmouth Translation Conference. The Translator\nas Writer. pp. 48–62. Portsmouth (2009)\n4. Deutscher Terminologie-Tag e.V., Deutsches Institut für Terminologie e.V: Termi-\nnologiearbeit – Best Practices 2.0 (Ordner) (2014)\n5. Drewer, P., Ziegler, W.: Technische Dokumentation. Übersetzungsgerechte Texter-\nstellung und Content-Management. Vogel Verlag, Würzburg (2011)\n6. Gallup, S.: Caterpillar Technical English and automatic machine translation. In:\nSTC Proceedings. pp. 421–424 (1993)\n7. Godden, K.: The evolution of CASL controlled authoring at General Motors. In:\nProceedings of the third international workshop on controlled language applica-\ntions. CLAW 2000. pp. 14–19 (2000)\n8. Hebling, U.: Controlled Language am Beispiel des Controlled English. Diplomar-\nbeit, Universität Heidelberg (2002)\n9. Huijsen, W.O.: Controlled language – an introduction. In: Proceedings of the sec-\nond international workshop on controlled language applications. CLAW 98. pp.\n1–15 (1998)\n10. International Organization for Standardization: ISO 15188:2001(E): Project man-\nagement guidelines for terminology standardization (2001)\n11. Kittredge, R.I.: Sublanguages and controlled languages. In: Mitkov, R. (ed.) The\nOxford handbook of computational linguistics, pp. 430–447. Oxford University\nPress, Oxford (2003)\n12. Kuhn, T.: A survey and classiﬁcation of controlled natural languages. Compu-\ntational Linguistics 40(1), 121–170 (2014), http://www.mitpressjournals.org/\ndoi/abs/10.1162/COLI_a_00168\n13. Lockwood, R.: Machine translation and controlled authoring at Caterpillar. In:\nSprung, R.C. (ed.) Translating into Success. Cutting-edge strategies for going\nmultilingual in a global age, American Translators Association Scholarly Mono-\ngraph Series, vol. XI, pp. 187–202. John Benjamins Publishing Company, Amster-\ndam/Philadelphia (2000)\n14. Messaoudi, N.: Content Engineering zur Einführung eines Redaktionssystems\nbei der Koenig & Bauer AG – Informationsmodellierung, Modularisierung und\nautomatisierte Publikation. Diplomarbeit, Hochschule Karlsruhe – Technik und\nWirtschaft (2009), undisclosed\n15. Nyberg, E., Mitamura, T., Huijsen, W.O.: Controlled language for authoring and\ntranslation. In: Somers, H. (ed.) Computers and translation. A translator’s guide,\nBenjamins Translation Library, vol. 35, pp. 245–281. John Benjamins Publishing\nCompany, Amsterdam/Philadelphia (2003)\n16. Oberle, C., Ziegler, W.: Content Intelligence für Redaktionssysteme. CMS-\nKennzahlen mit der REx-Methode. technische kommunikation (6), 48–54 (2012)\n17. Ramírez Polo, L.: Use and evaluation of controlled languages in industrial environ-\nments and feasibility study for the implementation of machine translation. Ph.D.\nthesis, Universidad de Valencia (2012)\n18. Reinhardt, W., Köhler, C., Neubert, G.: Deutsche Fachsprache der Technik. Olms,\nHildesheim (1992)\n19. Schubert, K.: Gestaltete Sprache. Plansprachen und die regulierten Sprachen der\ninternationalen Fachkommunikation. In: Schubert, K. (ed.) Planned Languages:\nFrom Concept to Reality, pp. 223–257. Hogeschool voor Wetenschap & Kunst,\nBrussel (2001)\n20. Schubert,\nK.:\nKommunikationsoptimierung.\nVorüberlegungen\nzu\neinem\nfachkommunikativen\nForschungsfeld.\ntrans-kom\n2(1),\n109–150\n(2009),\nhttp://www.trans-kom.eu/bd02nr01/trans-kom_02_01_06_Schubert_\nKommunikationsoptimierung.20090721.pdf\n21. Suchowolec,\nK.:\nTerminologiearbeit\nim\nUnternehmen.\nEinführung\neines\nGesamtkonzeptes.\nMagisterarbeit,\nTechnische\nUniversität\nDresden\n(2009),\nundisclosed\n22. Wüster, E.: Einführung in die allgemeine Terminologielehre und terminologische\nLexikographie. Romanistischer Verlag, Bonn (1991)\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2014-06-13",
  "updated": "2014-06-13"
}