{
  "id": "http://arxiv.org/abs/1508.00459v1",
  "title": "Unsupervised Learning in Genome Informatics",
  "authors": [
    "Ka-Chun Wong",
    "Yue Li",
    "Zhaolei Zhang"
  ],
  "abstract": "With different genomes available, unsupervised learning algorithms are\nessential in learning genome-wide biological insights. Especially, the\nfunctional characterization of different genomes is essential for us to\nunderstand lives. In this book chapter, we review the state-of-the-art\nunsupervised learning algorithms for genome informatics from DNA to MicroRNA.\n  DNA (DeoxyriboNucleic Acid) is the basic component of genomes. A significant\nfraction of DNA regions (transcription factor binding sites) are bound by\nproteins (transcription factors) to regulate gene expression at different\ndevelopment stages in different tissues. To fully understand genetics, it is\nnecessary of us to apply unsupervised learning algorithms to learn and infer\nthose DNA regions. Here we review several unsupervised learning methods for\ndeciphering the genome-wide patterns of those DNA regions.\n  MicroRNA (miRNA), a class of small endogenous non-coding RNA (RiboNucleic\nacid) species, regulate gene expression post-transcriptionally by forming\nimperfect base-pair with the target sites primarily at the 3$'$ untranslated\nregions of the messenger RNAs. Since the 1993 discovery of the first miRNA\n\\emph{let-7} in worms, a vast amount of studies have been dedicated to\nfunctionally characterizing the functional impacts of miRNA in a network\ncontext to understand complex diseases such as cancer. Here we review several\nrepresentative unsupervised learning frameworks on inferring miRNA regulatory\nnetwork by exploiting the static sequence-based information pertinent to the\nprior knowledge of miRNA targeting and the dynamic information of miRNA\nactivities implicated by the recently available large data compendia, which\ninterrogate genome-wide expression profiles of miRNAs and/or mRNAs across\nvarious cell conditions.",
  "text": "Unsupervised Learning in Genome Informatics\nKa-Chun Wong1 Yue Li2 Zhaolei Zhang3\n1 City University of Hong Kong kc.w@cityu.edu.hk\n2 University of Toronto yueli@cs.toronto.edu\n3 University of Toronto zhaolei.zhang@utoronto.ca\nWith diﬀerent genomes available, unsupervised learning algorithms are es-\nsential in learning genome-wide biological insights. Especially, the functional\ncharacterization of diﬀerent genomes is essential for us to understand lives.\nIn this book chapter, we review the state-of-the-art unsupervised learning\nalgorithms for genome informatics from DNA to MicroRNA.\nDNA (DeoxyriboNucleic Acid) is the basic component of genomes. A sig-\nniﬁcant fraction of DNA regions (transcription factor binding sites) are bound\nby proteins (transcription factors) to regulate gene expression at diﬀerent de-\nvelopment stages in diﬀerent tissues. To fully understand genetics, it is neces-\nsary of us to apply unsupervised learning algorithms to learn and infer those\nDNA regions. Here we review several unsupervised learning methods for de-\nciphering the genome-wide patterns of those DNA regions.\nMicroRNA (miRNA), a class of small endogenous non-coding RNA (Ri-\nboNucleic acid) species, regulate gene expression post-transcriptionally by\nforming imperfect base-pair with the target sites primarily at the 3′ untrans-\nlated regions of the messenger RNAs. Since the 1993 discovery of the ﬁrst\nmiRNA let-7 in worms, a vast amount of studies have been dedicated to func-\ntionally characterizing the functional impacts of miRNA in a network context\nto understand complex diseases such as cancer. Here we review several rep-\nresentative unsupervised learning frameworks on inferring miRNA regulatory\nnetwork by exploiting the static sequence-based information pertinent to the\nprior knowledge of miRNA targeting and the dynamic information of miRNA\nactivities implicated by the recently available large data compendia, which in-\nterrogate genome-wide expression proﬁles of miRNAs and/or mRNAs across\nvarious cell conditions.\n1 Introduction\nSince the 1990s, the whole genomes of a large number of species have been\nsequenced by their corresponding genome sequencing projects. In 1995, the\narXiv:1508.00459v1  [q-bio.GN]  3 Aug 2015\n2\nKa-Chun Wong Yue Li Zhaolei Zhang\nﬁrst free-living organism Haemophilus inﬂuenzae was sequenced by the Insti-\ntute for Genomic Research [46]. In 1996, the ﬁrst eukaryotic genome (Saccha-\nromyces cerevisiase) was completely sequenced [59]. In 2000, the ﬁrst plant\ngenome, Arabidopsis thaliana, was also sequenced by Arabidopsis Genome\nInitiative [77]. In 2004, the Human Genome Project (HGP) announced its\ncompletion [32]. Following the HGP, the Encyclopedia of DNA Elements (EN-\nCODE) project was started, revealing massive functional putative elements\non the human genome in 2011 [42]. The drastically decreasing cost of se-\nquencing enables the 1000 Genomes Project to be carried out, resulting in an\nintegrated map of genetic variation from 1,092 human genomes published in\n2012 [1]. The massive genomic data generated by those projects impose an\nunforeseen challenge for large-scale data analysis at the scale of gigabytes or\neven terabytes.\nComputational methods are essential in analyzing the massive genomic\ndata. They are collectively known as bioinformatics or computational biol-\nogy; for instance, motif discovery [64] helps us distinguish real signal subse-\nquence patterns from background sequences. Multiple sequence alignment [4]\ncan be used to study the similarity between multiple sequences. Protein struc-\nture prediction [110, 168] can be applied to predict the 3D tertiary structure\nfrom an amino acid sequence. Gene network inference [35] are the statistical\nmethods to infer gene networks from correlated data (e.g. microarray data).\nPromoter prediction [2] help us annotate the promoter regions on a genome.\nPhylogenetic tree inference [131] can be used to study the hierarchical evo-\nlution relationship between diﬀerent species. Drug scheduling [101, 171] can\nhelp solve the clinical scheduling problems in an eﬀective manner. Although\nthe precision of those computational methods is usually lower than the ex-\nisting wet-lab technology, they can still serve as useful preprocessing tools\nto signiﬁcantly narrow search spaces. Thus prioritized candidates can be se-\nlected for further validation by wet-lab experiments, saving time and funding.\nIn particular, unsupervised learning methods are essential in analyzing the\nmassive genomic data where the ground truth is limited for model training.\nTherefore, we describe and review several unsupervised learning methods for\ngenome informatics in this chapter.\n2 Unsupervised Learning for DNA\nIn human and other eukaryotes, gene expression is primarily regulated by\nthe DNA binding of various modulatory transcription factors (TF) onto cis-\nregulatory DNA elements near genes. Binding of diﬀerent combinations of\nTFs may result in a gene being expressed in diﬀerent tissues or at diﬀerent\ndevelopmental stages. To fully understand a gene’s function, it is essential to\nidentify the TFs that regulate the gene and the corresponding TF binding\nsites (TFBS). Traditionally, these regulatory sites were determined by labor-\nintensive experiments such as DNA footprinting or gel-shift assays. Various\nUnsupervised Learning in Genome Informatics\n3\ncomputational approaches have been developed to predict TF binding sites in\nsilico. Detailed comparisons can be found in the survey by Tompa et al. [156].\nTFBS are relatively short (10-20 bp) and highly degenerate sequence motifs,\nwhich makes their eﬀective identiﬁcation a computationally challenging task.\nA number of high-throughput experimental technologies were developed re-\ncently to determine protein-DNA binding such as protein binding microarray\n(PBM) [16], chromatin immunoprecipitation (ChIP) followed by microarray\nor sequencing (ChIP-Chip or ChIP-Seq) [129, 81], microﬂuidic aﬃnity analysis\n[48], and protein microarray assays [74, 73] .\nOn the other hand, it is expensive and laborious to experimentally iden-\ntify TF-TFBS sequence pairs, for example, using DNA footprinting [53], gel\nelectrophoresis [55], and SELEX [158]. The technology of Chromatin immuno-\nprecipitation (ChIP) [129, 81] measures the binding of a particular TF to the\nnucleotide sequences of co-regulated genes on a genome-wide scale in vivo,\nbut at low resolution. Further processing are needed to extract precise TF-\nBSs [104]. Protein Binding Microarray (PBM) was developed to measure the\nbinding preference of a protein to a complete set of k-mers in vitro [16]. The\nPBM data resolution is unprecedentedly high, comparing with the other tra-\nditional techniques. The DNA k-mer binding speciﬁcities of proteins can even\nbe determined in a single day. It has also been shown to be largely consistent\nwith those generated by in vivo genome-wide location analysis (ChIP-chip\nand ChIP-seq) [16].\nTo store and organize the precious data, databases have been created.\nTRANSFAC is one of the largest databases for regulatory elements includ-\ning TFs, TFBSs, weight matrices of the TFBSs, and regulated genes [109].\nJASPAR is a comprehensive collection of TF DNA-binding preferences [125].\nOther annotation databases are also available (e.g. Pfam [14], UniProbe [130],\nScerTF [148], FlyTF [123], YeTFaSCo [22], and TFcat [52]). Notably, with\nthe open-source and open-access atmosphere wide-spreads on the Internet in\nrecent years, a database called ORegAnno appeared in 2008 [113]. It is an\nopen-access community-driven database and literature curation system for\nregulatory annotation. The ENCODE consortium has also released a consid-\nerable amount of ChIP-Seq data for diﬀerent DNA-binding proteins [42].\nIn contrast, unfortunately, it is still diﬃcult and time-consuming to extract\nthe high-resolution 3D protein-DNA (e.g. TF-TFBS ) complex structures with\nX-Ray Crystallography [146] or Nuclear Magnetic Resonance (NMR) spectro-\nscopic analysis [112]. As a result, there is strong motivation to have unsuper-\nvised learningl methods based on existing abundant sequence data, to pro-\nvide testable candidates with high conﬁdence to guide and accelerate wet-lab\nexperiments. Thus unsupervised learning methods are proposed to provide\ninsights into the DNA binding speciﬁcities of transcription factors from the\nexisting abundant sequence data.\n4\nKa-Chun Wong Yue Li Zhaolei Zhang\n2.1 DNA Motif Discovery and Search\nTranscription Factor Binding Sites (TFBSs) are represented in DNA motif\nmodels to capture its sequence degeneracy [170]. They are described in the\nfollowing sections.\nRepresentation (DNA Motif Model)\nThere are several motif models proposed. For example, consensus string rep-\nresentation, a set of motif instance strings, count matrix, position frequency\nmatrix (PFM), and position weight matrix (PWM). Among them, the most\npopular motif models are the matrix ones. They are the count matrix, PFM,\nand PWM. In particular, the most common motif model is the zero-order\nPWM which has been shown to be related to the average protein-DNA binding\nenergy in the experimental and statistical mechanics study [15]. Nonetheless, it\nassumes independence between diﬀerent motif positions. A recent attempt has\nbeen made to generalize PWM but the indel operations between diﬀerent nu-\ncleotide positions are still challenging [150]. Although the column dependence\nand indel operations could be modeled by Hidden Markov Model (HMM) si-\nmultaneously, the number of training parameters is increased quadratically.\nThere is a dilemma between accuracy and model complexity.\nCount Matrix\nThe count matrix representation is the de facto standard adopted in databases.\nIn the count matrix representation, a DNA motif of width w is represented as\na 4-by-w matrix C. The jth column of C corresponds to the jth position of\nthe motif, whereas the ith row of C correspond to the ith biological character.\nIn the context of DNA sequence, we have 4 characters {A,C,G,T}. Cij is the\noccurring frequency of the i biological character at the jth position. For ex-\nample, the count matrix Csox9 of the SOX9 protein (JASPAR ID:MA0077.1\nand UniProt ID:P48436) is tabulated in the following matrix form. The motif\nwidth is 9 so we have a 4 × 9 matrix here. The corresponding sequence logo\nis also depicted in Figure 1.\nCsox9 =\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\nA\n24\n54\n59\n0\n65\n71\n4\n24\n9\nC\n7\n6\n4\n72\n4\n2\n0\n6\n9\nG\n31\n7\n0\n2\n0\n1\n1\n38\n55\nT\n14\n9\n13\n2\n7\n2\n71\n8\n3\n\n\n\n\nNotably, adenine has not been found at the 4th position, resulting in a\nzero value. It leads to an interesting scenario. Is adenine really not found at\nthat position or the sample size (the number of binding sites we have found\nso far for SOX9) is too small that the sites having adenine at that position\nUnsupervised Learning in Genome Informatics\n5\nFig. 1. DNA Motif Sequence Logo for SOX9 (JASPAR ID:MA0077.1 and UniProt\nID:P48436). The vertical axis measures the information content, while the horizontal\naxis denotes the positions. The consensus string is DAACAATRG, following the\nstandard IUPAC nucleotide code.\nhave not been veriﬁed experimentally yet ? To circumvent the problem, people\nusually add pseudo counts to the matrix which is justiﬁed from the use of prior\nprobability in statistics [41, 118]. Such techniques are also found in natural\nlanguage computing and machine learning.\nPosition Frequency Matrix (PFM)\nIn practice, a count matrix is usually converted to PFM, and thus a zero-order\nPWM for scanning a long sequence. The dimension and layout of count matrix\nis exactly the same as those of the corresponding PFM and zero-order PWM.\nTheir main diﬀerence is the element type. For count matrix, each element is\nsimply a count. For PFM, each element is a Maximum Likelihood Estimate\n(MLE) parameter. For zero-order PWM, each element is a weight.\nTo derive a PFM F from a count matrix, C, maximum likelihood estima-\ntion (MLE) is used [116]. Mathematically, we aim at maximizing the likelihood\nfunction L(C) = P(C|F) = Qw\ni=1\nQ4\nj=1 F Cji\nji . In addition, we impose a param-\neter normalization constraint P4\nj=1 Fji = 1 for each ith position. It is added\nto the likelihood function with a Lagrange multiplier λi, resulting in a new\nlog likelihood function:\nlnL′(C) =\nw\nX\ni=1\n4\nX\nj=1\nCjilog(Fji) +\nw\nX\ni=1\nλi(\n4\nX\nj=1\nFji −1)\nBy taking its partial derivatives to zero, it has been shown that Fji =\nCji\nP4\nj=1 Cji .\nThe MLE parameter deﬁnition is quite intuitive. It is simply the occurring\nfraction of a nucleotide at the same position. For example, given the previous\nSOX9 count matrix Csox9, we can convert it to a PFM Fsox9 as follows:\n6\nKa-Chun Wong Yue Li Zhaolei Zhang\nFsox9 =\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\nA\n0.31\n0.68\n0.75\n0.01\n0.83\n0.89\n0.06\n0.31\n0.13\nC\n0.10\n0.09\n0.06\n0.91\n0.06\n0.04\n0.01\n0.09\n0.13\nG\n0.40\n0.10\n0.01\n0.04\n0.01\n0.03\n0.03\n0.49\n0.69\nT\n0.19\n0.13\n0.18\n0.04\n0.10\n0.04\n0.90\n0.11\n0.05\n\n\n\n\nwhere a pseudocount = 1 is added to each element of Csox9.\nWe can observe that the most invariant positions of the SOX9 motif are\nthe 4th and 6th position. At the 4th position, cytosines have been found most\nof the times while guanines and thymines have just been found few times.\nPosition Weight Matrix (PWM)\nTo scan a long sequence for motif matches using a PFM F, we need to derive a\nPWM M ﬁrst so that the background distribution can be taken into account.\nAs aforementioned, each element of PWM is a weight. Each weight can be\nviewed as a preference score. In practice, it is usually deﬁned as the log likeli-\nhood ratio between the motif model and background model. Mathematically,\nMji = log( Fji\nBj ) where Bj is the occurring fraction of the jth nucleotide in all\nthe background sequences such that, given a subsequence a of the same width\nas the PWM (width w), we can compute a score S(a) by summation only:\nS(a) = log\nP(a|F)\nP(a|Background)\n(1)\n= log\nQw\ni=1\nQ4\nj=1 F [ai=j]\nji\nQw\ni=1\nQ4\nj=1 B[ai=j]\nj\n(2)\n= log\nw\nY\ni=1\n4\nY\nj=1\n(\nF [ai=j]\nji\nB[ai=j]\nj\n)\n(3)\n=\nw\nX\ni=1\n4\nX\nj=1\n[ai = j]log(Fji\nBj\n)\n(4)\n=\nw\nX\ni=1\n4\nX\nj=1\n[ai = j]Mji\n(5)\nwhere ai is the numeric index for the nucleotide at ith position of the subse-\nquence a. For example, given the previous SOX9 PFM Fsox9, we can convert\nit to a PWM Msox9 as follows:\nMsox9 =\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\nA\n0.32\n1.46\n1.58\n−4.32\n1.72\n1.85\n−2.00\n0.32\n−1.00\nC\n−1.32\n−1.51\n−2.00\n1.87\n−2.00\n−2.74\n−4.32\n−1.51\n−1.00\nG\n0.68\n−1.32\n−4.32\n−2.74\n−4.32\n−3.32\n−3.32\n0.96\n1.49\nT\n−0.42\n−1.00\n−0.51\n−2.74\n−1.32\n−2.74\n1.85\n−1.15\n−2.32\n\n\n\nwhere we have assumed that the background distribution is uniform (i.e. Bj =\n0.25 for 1 ≤j ≤4) for illustration purposes.\nUnsupervised Learning in Genome Informatics\n7\nLearning (Motif Discovery)\nIn general, motif discovery aims at building motif models (e.g. PFM) from\nrelated sequences. Nonetheless, there is a variety of motif discovery methods\nin diﬀerent biological settings. From a computing perspective, they can be\nclassiﬁed into several paradigms by its input data types:\n1. A Set of Sequences\n2. A Set of Sequences with Quantitative Measurements\n3. A Set of Orthologous Sequences\nMotif Discovery for A Set of Sequences\nThe most classical one is de novo motif discovery which just takes a set of\nsequences as the inputs. The set of sequences is extracted such that a common\ntranscription factor is believed to bind to them, assuming that motif models\n(e.g. consensus substrings) can be found from those sequences. For example,\nthe promoter and enhancer sequences of the genes co-regulated by a common\ntranscription factor or the sequence regions around the next generation paral-\nlel sequencing peaks called for a common transcription factor. Theoretically,\nZia and Moses have proved a theoretical upper bound on the p-value which\nat least one motif with a speciﬁc information content occur by chance from\nbackground distribution (false positive) for the one-occurrence per sequence\nmotif discovery problem [182].\nChan et al. applied evolutionary computation techniques to the problem\n[28, 167]. Hughes et al. proposed a Gibbs sampling algorithm called Alig-\nnACE, to sample and evaluate diﬀerent possible motif models using a priori\nlog likelihood scores [76]. Workman et al. have proposed a machine learn-\ning approach using artiﬁcial neural networks (ANN-Spec) [172]. Hertz et al.\nutilized the maximal information content principle to greedily search for a\nset of candidate sequences for building motif models (Consensus) [72]. Frith\net al. have adopted simulated annealing approaches to perform multiple lo-\ncal alignment for motif model building (GLAM) [50]. Ao et al. have used\nexpectation maximization to determine DNA motif position weight matrices\n(Improbizer) [5]. Bailey et al. have proposed MEME to optimize the expected\nvalue of a statistic related to the information content of motif models [9]. A\nparameter enumeration pipeline wrapping MEME (MUSI) was proposed for\nelucidating multiple speciﬁcity binding modes [88]. Eskin et al. employed a\ntree data structure to ﬁnd composite weak motifs (MITRA) [43]. Thijs et al.\nhave further improved the classic Gibbs sampling method and called it Mo-\ntifSampler [154]. Van Helden et al. have proposed a counting algorithm to\ndetect statistically signiﬁcant motifs [69]. Regnier and Denise have proposed\nan exhaustive search algorithm (QuickScore) [128]. Favorov et al. have uti-\nlized Markov Chain Monte Carlo to solve the problem in a Bayesian manner\n(SeSiMCMC) [44]. Pavesi et al. have proposed an exhaustively enumerated\n8\nKa-Chun Wong Yue Li Zhaolei Zhang\nand consensus-based method (Weeder) [121]. Another exhaustive search al-\ngorithm to optimize z-scores (YMF) has been proposed by Sinha and Tompa\n[144].\nAlthough diﬀerent statistical techniques have been developed for the motif\ndiscovery problem, most of the existing methods aim at building motif models\nin the form of either a set of strings or a zero-order PWM. Nonetheless, it\nis well known that nucleotide dependencies and indel operations exist within\nsome TFBSs (a.k.a. motifs) [155, 65]. It is desirable to develop new methods\nwhich can capture and model such information.\nMotif Discovery for A Set of Sequences with Quantitative Aﬃnity\nMeasurements\nIt has been pointed out that a fundamental bottleneck in TFBS identiﬁcation\nis the lack of quantitative binding aﬃnity data for a large portion of tran-\nscription factors. The advancement of new high-throughput technologies such\nas ChIP-Chip, ChIP-Seq, and Protein Binding Microarray (PBM) has made\nit possible to determine the binding aﬃnity of these TFs (i.e. each sequence\ncan be associated with a binding intensity value) [8]. In particular, the PBM\ntechnology can enable us to enumerate all the possible k-mers, providing an\nunprecedentedly high resolution binding site aﬃnity landscape for each TF.\nIn light of this deluge of quantitative aﬃnity data, robust probabilistic meth-\nods were developed to take into account those quantitative aﬃnity data. Seed\nand Wobble has been proposed as a seed-based approach using rank statistics\n[16]. RankMotif++ was proposed to maximize the log likelihood of their prob-\nabilistic model of binding preferences [29]. MatrixREDUCE was proposed to\nperform forward variable selections to minimize the sum of squared devia-\ntions [47]. MDScan was proposed to combine two search strategies together,\nnamely word enumeration and position-speciﬁc weight matrix updating [104].\nPREGO was proposed to maximize the Spearman rank correlation between\nthe predicted and the actual binding intensities [152]. Notably, Wong et al.\nhave proposed and developed a hidden Markov model approach to learn the\ndependence between adjacent nucleotide positions rigorously; they also show\nthat their method (kmerHMM) can deduce multiple binding modes for a given\nTF [166].\nNote that this paradigm is a generalization from the motif discovery for a\nset of sequences with binary measurements. For example, SeedSearch [11] and\nDME [145]. In other words, it also includes the discriminative motif discovery\nmethod in which a set of motif-containing sequences and a set of background\nsequences are given as the input since we can assign a value of 1 to each\nmotif-containing sequence and 0 to each background sequence.\nMotif Discovery for A Set of Orthologous Sequences\nIt is generally acknowledged that by comparing evolutionarily related DNA or\nprotein sequences, functionally important sequences or motifs can be revealed\nUnsupervised Learning in Genome Informatics\n9\nby such comparison. A functional motif is assumed to be more conserved\nacross diﬀerent species than the background sequences [56]. By incorporating\nthe evolutionary conservation with sequence-speciﬁc DNA binding aﬃnity,\ndiﬀerent methods have been proposed. Moses et al. have proposed an exten-\nsion of MEME to take the sequence evolution into account probabilistically\n[114]. Kellis et al. have proposed a spaced hexamer enumeration approach to\nidentify conserved motifs [84]. FootPrinter has been proposed as a substring-\nparsimony based approach using dynamic programming to ﬁnd statistically\nenriched motif substrings [20]. A Gibbs sampling approach named PhyloGibbs\nhas also been proposed [137].\nPrediction (Motif Search)\nAfter a motif model has been found, it is always desirable to apply it to\nsearch for motif instances over a given sequence (e.g. ChIP-Seq peak se-\nquences). Some basic search methods have been developed to search motif\ninstances over a sequence. Nonetheless, those methods do not have suﬃcient\nmotif model complexity to distinguish false positives from true positives over\na long sequence (e.g. 100k bp) [162]. To cope with that, some improvements\nhave been made. In general, most of them utilize the biological information\nbeyond the motif sequence speciﬁcity to augment the motif model complex-\nity insuﬃciency. In particular, multiple motif information and evolutionary\nconservation have been readily adopted to improve the discovery accuracy\n[116].\nBasic Searches\nLikelihood Ratio\nGiven a sequence b1b2b3...bl of length l and a PWM M of the motif x of\nwidth w, we scan b1b2b3...bl with a window of width w such that the subse-\nquences which likelihood ratio score is higher than a pre-speciﬁed threshold\nare considered the instances (hits) of the motif x. Mathematically, a subse-\nquence bk+1bk+2...bk+w is considered as a motif instance (hit) if and only if\nthe following condition is satisﬁed:\nSx(bk+1bk+2...bk+w) =\nw\nX\ni=1\n4\nX\nj=1\nI(bk+i = nj)Mji > threshold\nwhere nj is the jth nucleotide among {A,C,G,T} and I(...) is the Iverson\nbracket. Nonetheless, diﬀerent motifs may have diﬀerent likelihood score dis-\ntributions. It is diﬃcult to set a single and ﬁxed threshold which can work\nfor all the motifs. To solve the problem, one can normalize the score to the\ninterval [0,1] based on the maximal and minimal scores as follows:\n10\nKa-Chun Wong Yue Li Zhaolei Zhang\nS′(bk+1bk+2...bk+w) =\nSx(bkbk+1bk+2...bn) −min\nseq Sx(seq)\nmax\nseq Sx(seq) −min\nseq Sx(seq)\nPosterior Ratio\nIf we know the prior probability of motif occurrence π, it can also be incorpo-\nrated into the scoring function in a posterior manner [116]. Mathematically,\ngiven a sequence a, motif model (including PFM F and PWM M), and back-\nground distribution B, we can compute the posterior ratio as follows:\nS′′(a) = log P(F|a)\nP(B|a)\n(6)\n= log\nP (a|F )P (F )\nP (a)\nP (a|B)P (B)\nP (a)\n(7)\n= log P(a|F)P(F)\nP(a|B)P(B)\n(8)\n= log\nQw\ni=1\nQ4\nj=1 F [ai=j]\nji\nπ\nQw\ni=1\nQ4\nj=1 B[ai=j]\nj\n(1 −π)\n(9)\n= log\nw\nY\ni=1\n4\nY\nj=1\n(Fji\nBj\n)[ai=j](\nπ\n1 −π )\n(10)\n= S(a) + log(\nπ\n1 −π )\n(11)\nIt can be observed that the posterior ratio can be computed from the likelihood\nratio by simply adding the logarithm of the prior probability ratio.\nP-value\nGiven the previous scoring functions, it is not easy to set a threshold since\nthey are just ratios. For example, if S(a) > 0 in the above example, it just\nmeans the likelihood that the sequence a is generated by the motif model\nis higher than the background and vice versa. To justify it in a meaningful\nway, P-value distribution can be calculated from a motif model. Given a motif\nPWM M of width w, an exhaustive search can be applied to traverse all the\npossible sequences of width w. Nonetheless, it takes 4w time complexity for\nthe DNA alphabet {A, C, G, T}. Interestingly, if the PWM M is of zero-order,\nwe can exploit the column independence assumption and apply dynamic pro-\ngramming to calculate the exact P-value distribution in 4w time complexity\n[149]. In practice, the empirical P-value distribution may also be used.\nNonetheless, the speciﬁcity of a PWM of width w is still not high if it\nis applied to a very long sequence of length L. Mathematically, even if we\njust assign the best match as the hit, L−w+1\n4w\nhits are still expected (e.g. If\nUnsupervised Learning in Genome Informatics\n11\nL = 10000 and w = 6, 2.44 hits are expected), assuming that the sequence is\nuniform in background nucleotide distribution. To solve the problem, people\nhave spent eﬀorts on incorporating more biological information to improve\nthe motif search.\nIncorporating Multiple Motif Information\nTo improve motif search, multiple motif information can be incorporated.\nMultiple motif sites are usually clustered together, resulting in higher signal-\nto-noise ratios which can be easier to be detected than alone. If multiple sites\nof the same motif are clustered together within a short distance, it is called\nhomotypic clustering [102]. On the other hand, if multiple sites of diﬀerent\nmotifs are clustered together within a short distance, it is called heterotypic\nclustering.\nTo exploit the additional clustering signals beyond sequence speciﬁcity,\nMAST was proposed to multiply the P-values of multiple motif matches (hits)\ntogether, which has demonstrated superior performance in sequence homol-\nogy search than the other two methods proposed in the same study [10].\nCIS-ANALYST was proposed as a sliding window approach to predict the\nwindows which have at least min sites motif matches (hits) with pvalues\n< site p [17]. Sinha et al. have proposed a probabilistic model, Stubb, to\neﬃciently detect clusters of binding sites (i.e. cis-regulatory modules) over\ngenomic scales using maximum likelihood estimation [140]. To determine the\nwindow size parameter, a window size adjustment procedure has been used\nin ClusterBuster to ﬁnd clusters of motif matches [51]. Segal et al. have also\nderived an expectation maximization algorithm to model the clusters of motif\nmatches as probabilistic graphical models [134]. Recently, Hermann et al. have\nproposed an integrative system (i-cisTarget) to combine the high-throughput\nnext generation sequencing data with motif matches to provide accurate motif\ncluster search [71]. Notably, Zhou and Wong have shown that it is possible to\nsearch for clusters of motifs in a de novo way (i.e. without any given motif\nmodel and information) [181].\nIncorporating Evolutionary Conservation\nAnother approach to improve motif search is to incorporate evolutionary con-\nservation. The rationale behind that is similar to that behind phylogenetic\nmotif discovery which we have described in a previous section. Deleterious\nmutations will be removed from population by negative selection. To make\nuse of that fact, we could imply that a true motif match should be more con-\nserved across closely related species (For example, chimpanzee and mouse)\nthan background sequences [56]. For instance, a windowing approach with sev-\neral thresholds for motif matches and conservation, ConSite, was proposed by\nSandelin et al. [133]. Nonetheless, it is limited to pair-wise analysis. rVISTA\nis a similar approach [39] using the Match program for motif matching in\nTRANSFAC [109]. Bayesian Branch Length Score (BBLS) was proposed as\n12\nKa-Chun Wong Yue Li Zhaolei Zhang\na evolutionary conservation score without relying on any multiple sequence\nalignment [175]. A parsimonious method for ﬁnding statistically signiﬁcant\nk-mers with dynamic programming was proposed (FoorPrinter) [21]. Notably,\nMoses et al. proposed a comprehensive probabilistic model to search for motif\ninstances with eﬃcient p-value estimation (MONKEY) [115].\nTo search for novel motif instances, there are programs aimed at search-\ning for motif matches without any given motif model and information. For\ninstance, Ovcharenko et al. have used likelihood ratio tests to distinguish con-\nserved regions from the background [119]. Siepel et al. have demonstrated an\napproach in identifying conserved regions using hidden Markov models called\nPhastCons [138].\nIncorporating Both Approaches\nBoth motif clustering information and evolutionary conservation were demon-\nstrated beneﬁcial to motif search. Since they are independent of each other,\nit is straightforward to combine them. Philippakis et al. have proposed a\nmethod to combine both types of information (i.e. motif clustering and evolu-\ntionary conservation), achieving good performance on experimentally veriﬁed\ndatasets [124]. MONKEY has been extended by Warner et al. to exploit the\nmotif clustering information to predict motif clusters (PhylCRM) [161]. It has\nbeen reported that the misalignment errors of the input reference sequences\nfrom other species could aﬀect the quality of phylogenetic footprinting for mo-\ntif search. Thus statistical alignments have been used to assist motif search in\nEMMA [68]. Stub has also been extended to StubMS to take multiple species\nconservation into account using a HMM phylogenetic model [142]. Notably, a\nuniﬁed probabilistic framework which integrates multiple sequence alignment\nwith binding site predictions, MORPH, was proposed by the same group [139].\nIts eﬀectiveness has been demonstrated and veriﬁed in an independent com-\nparison study [151].\n2.2 Genome-wide DNA Binding Pattern Discovery\nChromatin immunoprecipitation (ChIP) followed by high-throughput sequenc-\ning (ChIP-Seq) measures the genome-wide occupancy of transcription factors\nin vivo. In a typical ChIP-Seq study, the ﬁrst step is to call the peaks, i.e.\ndetermining the precise location in the genome where the TF binds. A number\nof peak calling tools have been developed; for instance, model-based analysis\nof ChIP-Seq data (MACS) was proposed to model the shift size of ChIP-Seq\ntags and local biases to improve its peak-calling accuracy [180]. Spp is another\nmethod with a strong focus on background signal correction [86]. PeakSeq is\na two-pass strategy method. The ﬁrst pass accounts for the sequence mappa-\nbility while the second pass is to ﬁlter out statistically insigniﬁcant regions\ncomparing to controls [132]. CisGenome reﬁnes peak boundaries and uses\na conditional binomial model to identify peak regions [78]. However, recent\nUnsupervised Learning in Genome Informatics\n13\nbenchmark studies suggest that their predicted peaks are distinct from each\nother [164, 92].\nDiﬀerent combinations of DNA-binding protein occupancies may result in\na gene being expressed in diﬀerent tissues or at diﬀerent developmental stages.\nTo fully understand a gene’s function, it is essential to develop unsupervised\nlearning models on multiple ChIP-Seq proﬁles to decipher the combinatorial\nregulatory mechanisms by multiple transcription factors.\nSince multiple transcription factors often work in cis regulatory modules\nto confer complex gene regulatory programs, it is necessary to develop models\non multiple ChIP-Seq datasets to decipher the combinatorial DNA-binding\nmechanism. In the following, we brieﬂy review some of the previous works\nin this area. Gerstein et al. used pair-wise peak overlapping patterns to con-\nstruct a human regulatory network [57]. Xie et al. proposed self organizing\nmap methods to visualize the co-localization of DNA-binding proteins [174].\nGiannopoulou et al. proposed a non-negative matrix factorization to eluci-\ndate the clustering of DNA-binding proteins [58]. Zeng and colleagues pro-\nposed jMOSAiCS to discover histone modiﬁcation patterns across multiple\nChIP-Seq datasets [178]. Ferguson et al. have described a hierarchical Bayes\napproach to integrate multiple ChIP-Seq libraries to improve DNA binding\nevent predictions. In particular, they have applied the method to histone\nChIP-Seq libraries and predicted the gene locations associated with the ex-\npected pathways [45]. Mahony et al. also proposed a mixture model (Multi-\nGPS) to detect diﬀerential binding enrichment of a DNA-binding protein in\ndiﬀerent cell lines, which can improve the protein’s DNA binding location pre-\ndictions (i.e. Cdx2 protein in their study) [108]. On the other hand, Chen et\nal. proposed a statistical framework (MM-ChIP) based on MACS to perform\nan integrative analysis of multiple ChIP datasets to predict ChIP-enriched\nregions with known motifs for a given DNA-binding protein (i.e. ER and\nCTCF proteins in their study) [30]. On the other hand, Ji et al. proposed\na diﬀerential principal component analysis method on ChIP-Seq to perform\nunsupervised pattern discovery and statistical inference to identify diﬀerential\nprotein-DNA interactions between two biological conditions [79]. Guo et al.\ndescribed a generative probabilistic model (GEM) for high resolution DNA\nbinding site discovery from ChIP data [67]. Interestingly, that model combines\nChIP signals and DNA motif discovery together to achieve precise predictions\nof the DNA binding locations of a DNA-binding protein. The authors have\nfurther demonstrated how GEM can be applied to reveal spatially constrained\ntranscription factor binding site pairs on a genome.\nDespite the success of the methods described above, to fully understand\na gene’s function, it is essential to develop probabilistic models on multi-\nple ChIP-Seq proﬁles to decipher the genome-wide combinatorial patterns of\nDNA-binding protein occupancy. Unfortunately, the majority of the previous\nwork usually focused on large-scale clustering of called peaks, which is an intu-\nitive and straightforward approach. However such approaches have two limita-\ntions, as (i) peak-calling ignores the contributions from weak bindings of TFs,\n14\nKa-Chun Wong Yue Li Zhaolei Zhang\nand (ii) pair-wise analysis ignores the complex combinatorial binding pattern\namong the TFs. Thus an unsupervised learning model called SignalSpider has\nbeen proposed to directly analyze multiple normalized ChIP-Seq signal pro-\nﬁles on all the promoter and enhancer regions quantitatively so that weak\nbindings can be taken into account [169, 31]. Especially, its computational\ncomplexity has been carefully designed to scale with the increasing ChIP-Seq\ndata (i.e. linear complexity). With such a linear complexity, the method (Sig-\nnalSpider) has been successfully applied to more than 100 ChIP-Seq proﬁles\nin an integrated way, revealing diﬀerent genome-wide DNA-binding modules\nacross the entire human genome (hg19) [169].\n3 Unsupervised Learning for inferring microRNA\nregulatory network\nWhile transcription factors (TFs) are the major transcriptional regulator pro-\nteins, microRNA (miRNA), a small ∼22 nucleotide noncoding RNA species,\nhas been shown to play a crucial role in post-transcriptional and/or transla-\ntional regulation [12]. Since the 1993 discovery of the ﬁrst miRNA let-7 in\nworms, a vast amount of studies have been dedicated to functionally charac-\nterizing miRNAs with a special emphasis on their roles in cancer. While TFs\ncan serve either as a transcriptional activator or as a repressor, miRNAs are\nprimarily known to confer mRNA degradation and/or translational repres-\nsion by forming imperfect base-pair with the target sites primarily at the 3′\nuntranslated regions of the messenger RNAs [66]. While miRNAs are typi-\ncally ∼22 nt long, several experimental studies combined with computational\nmethods [98, 37, 89, 25, 97, 3, 177] have shown that only the ﬁrst six or seven\nconsecutive nucleotides starting at the second nucleotide from the 5′ end of\nthe miRNA are the most crucial determinants for target site recognition (Fig-\nure 2). Accordingly, the 6mer or 7mer close to the 5′ region of the miRNA\nis termed as the “seed” region or seed. miRNAs that share common seeds\nbelong to an miRNA family as they potentially target a vastly common set of\nmRNAs. Moreover, the target sites at the 3′UTR Watson-Crick (WC) pairing\nwith the miRNA seed are preferentially more conserved within mammalian\nor among all of the vertebrate species [98]. In humans, more than one third\nof the genes harbour sites under selective pressure to maintain their pairing\nto the miRNA seeds [98, 62]. An important variation around this seed-target\npairing scheme was discovered by Lewis et al. (2005), where the target site\nis ﬂanked by a conserved adenosine ‘A’ facing to the ﬁrst nucleotide of the\ntargeting miRNA [97].\nThe dynamics of the miRNA regulatory network are implicated in various\nphenotypic changes including embryonic development and many other com-\nplex diseases [147, 33]. Although abnormal miRNA expression can sometimes\nbe taken as a stronger indicator of carcinoma in clinical samples than aberrant\nmRNA expression [127, 106], the system level mechanistic eﬀects are usually\nUnsupervised Learning in Genome Informatics\n15\nmRNA\n5′ −· · · [ORF] · · · · · · · · · · · · · · · · · · · · · · · · · · ·\nSeed match\nN\f\f\nz\n}|\n{\nN\f\f N\f\f N\f\f N\f\f N\f\f N\f\f [A|N] · · ·\nPoly(A) −3′\n3′ −(NNNNN)NNNNNNNNNN\n8 N\n7 N\n6 N\n5 N\n4 N\n3 N\n2\n|\n{z\n}\nSeed\nN\n1 −5′\nmiRNA\nFig. 2. Canonical miRNA Watson-Crick base pairing to the 3′UTR of the mRNA\ntarget site. The most critical region is a 6mer site termed as the “seed” occurs at\nthe 2-7 position of the 5′ end of the miRNA [98]. Three other variations centring at\nthe 6mer seed are also known to be (more) conserved: 7mer-m8 site, a seed match\n+ a Watson-Crick match to miRNA nucleotide 8; 7mer-t1A site, a seed match +\na downstream A in the 3′UTR; 8mer, a seed match + both m8 and t1A. The site\neﬃcacy has also been proposed in the order of 8mer > 7mer-m8 > 7mer- A1 > 6mer\n[49, 62]. The abbreviations are: ORF, open reading frame; (NNNNN), the additional\nnucleotides to the shortest 19 nt miRNA; [A|N], A or other nucleotides; Poly(A),\npolyadenylated tail.\nunclear. A single miRNA can potentially target ∼400 distinct genes, and there\nare thousands of distinct endogenous miRNAs in the human genome. Thus,\nmiRNAs are likely involved in virtually all biological processes and pathways\nincluding carcinogenesis. However, functional characterizing miRNAs hinges\non the accurate identiﬁcation of their mRNA targets, which has been a chal-\nlenging problem due to imperfect base-pairing and condition-speciﬁc miRNA\nregulatory dynamics. In this section, we discuss the current state-of-art ap-\nproaches in referring miRNA or miRNA-mediated transcriptional regulatory\nnetwork. Table 1 summarizes these methods. As we will see, each method is\nestablished through an eﬀective unsupervised learning model by exploiting the\nstatic sequence-based information pertinent to the prior knowledge of miRNA\ntargeting and/or the dynamic information of miRNA activities implicated by\nthe recently available large data compendia, which interrogate genome-wide\nexpression proﬁles of miRNAs and/or mRNAs across various cell conditions.\nTable 1. Unsupervised learning methods reviewed in this chapter\nMethod Algorithm\nSection Ref\nPicTar Hidden Markov Model\n3.1\n[91]\nTargetScore Variational Bayesian Mixture Model\n3.2\n[99]\nGroupMiR Nonparametric Bayesian with Indian Buﬀet Process\n3.3\n[94]\nSNMNMF Constrained nonnegative matrix factorization\n3.4 [179]\nMirsynergy Deterministic overlapping neighbourhood expansion\n3.5 [100]\nPicTar: Probabilistic identiﬁcation of combinations of Target sites; GroupMiR:\nGroup MiRNA target prediction; SNMNMF: Sparse Network-regularized Multiple\nNonnegative Matrix Factorization; PIMiM: Protein Interaction-based MicroRNA\nModules.\n16\nKa-Chun Wong Yue Li Zhaolei Zhang\n3.1 PicTar\nPicTar (Probabilistic identiﬁcation of combinations of Target sites) is one of\nthe few models that rigorously considers the combinatorial miRNA regula-\ntions on the same target 3′UTR [91]. As an overview, PicTar ﬁrst pre-ﬁlters\ntarget sites by their conservation across select species. However, the funda-\nmental framework of PicTar is based on hidden Markov model (HMM) with\na maximum likelihood (ML) approach, which is built on the logics of several\nearlier works from Siggia group [40, 26, 143, 126]. Among these works, Pic-\nTar was most inspired by “Ahab”, an HMM-based program developed (by\nthe same group) to predict the combinatorial TF binding sites (TFBS) [126].\nAlthough PicTar has been successfully applied to three studies on vertebrates\n[91] (where the original methodology paper was described), ﬂy [63], and worm\n[93] (where some improvements were described), the description of the core\nHMM algorithm of PicTar is rather brief. Here we will lay out the detailed\ntechnicality of the algorithm based on the information collected from several\nrelated works [40, 26, 143, 126, 18], which will help highlight its strengths,\nlimitations, and possible future extensions.\nLet S be a 3′UTR sequence, L the length of S, and w ∈{1, . . . , K} the\ntarget sites for miRNA “word” w of length lw, pw the transition probabil-\nity of the occurrence of miRNA w, and pb the transition probability for the\nbackground of length lb = 1, which is simply estimated from the fraction of\nA, U, G, C (i.e., Markov model of order 0) either in S with length >300\nnt or from all query UTRs. To simplify notation, the background letters are\ntreated as a special word w0 so that pb ≡pw0 and lb ≡lw0 = 1. Thus, S can\nbe represented by multiple diﬀerent ways of concatenating the segments cor-\nresponding to either miRNA target sites or background. The goal is to obtain\nat any arbitrary nucleotide position i of the 3′UTR sequence S the posterior\nprobability p(πi = w|S, θ) that i is the last position of the word, where θ is\nthe model parameters controlling emission probabilities (see below).\nFollowing Markov’s assumption, p(πi = w|S, θ) is proportional to the prod-\nucts of the probabilities before and after position i, which can be computed in\ntime O(L×K) by Forward-Backward algorithm as described below. Formally,\np(πi = w|S, θ) = p(s1, . . . , sL, πi = w|θ)\np(S|θ)\n(12)\n= p(s1, . . . , si, πi = w|θ)p(si+1, . . . , sL|s1, . . . , si, πi = w, θ)\np(S|θ)\n(13)\n= p(s1, . . . , si, πi = w|θ)p(si+1, . . . , sL|πi = w, θ)\np(S|θ)\n(14)\n= Z(1, i, πi = w)Z(i + 1, . . . , L|πi = w)\np(S|θ)\n(15)\nUnsupervised Learning in Genome Informatics\n17\nwhere p(S|θ) is the likelihood of sequence S or the objective function to be\nmaximized in the ML framework, Z(1, i, πi = w) and Z(i + 1, . . . , L|πi = w)\ncan be represented in recursion forms and computed via forward and backward\nalgorithm, respectively in time O(L × K) for K words. Formally, the forward\nalgorithm is derived as follows:\nZ(1, i, πi = w)\n= p(s1, . . . , si, πi = w)\n(16)\n= p(s1, . . . , si|πi = w)p(πi = w)\n(17)\n= p(si−lw+1, . . . , si|πi = w)p(s1, . . . , si−lw|πi = w)p(πi = w)\n(18)\n= p(si−lw+1, . . . , si|πi = w)p(s1, . . . , si−lw, πi = w)\n(19)\n= p(si−lw+1, . . . , si|πi = w)\nX\nw′\np(s1, . . . , si−lw, πi−lw = w′)p(πi = w|πi−lw = w′)\n(20)\n= e(i −lw + 1, . . . , i|w)\nX\nw′\nZ(1, i −lw, πi−lw = w′)pw\n(21)\nwhere e(i −lw + 1, . . . , i|w) is the emission probability assumed known (see\nbelow) and pw ≡p(πi = w|πi−lw = w′) is the transition probability to word w.\nNote that pw is position independent. To start the recursion, Z(1, i ≤1) = 1.\nThe backward algorithm is similarly derived:\nZ(i + 1, . . . , L|πi = w)\n= p(si+1, . . . , sL|πi = w)\n(22)\n=\nX\nw′\np(si+1, . . . , sL, πi+1 = w′|πi = w)\n(23)\n=\nX\nw′\np(si+1, . . . , sL|πi+1 = w′)p(πi+1 = w′|πi = w)\n(24)\n=\nX\nw′\np(si+2, . . . , sL|πi+1 = w′)p(si+2−lw′, . . . , si+1|πi+1 = w′)p(πi+1 = w′|πi = w)\n=\n′\nX\nw\nZ(i + 2, . . . , L|πi+1 = w′)e(i + 2 −lw′, . . . , i + 1|w′)pw′\n(25)\nTo start the backward recursion, Z(L −lw + 1, L) = p0(w), which is simply\nthe frequency of word w in the 3′UTR sequence S.\nGiven the emission probabilities, pw’s (transition probability) are the only\nparameters that need to be set in order to maximize p(S|θ). Following the ML\nsolution,\npw =\nP\ni p(πi = w|S, θ)\nP\nw′\nP\ni p(πi = w′|S, θ)\n(26)\nwhere the posterior p(πi = w|S, θ) is calculated by Eq (15), which is in turn\ncomputed by forward-backward algorithm. Finally, the likelihood (objective)\nfunction is evaluated by a simple forward pass to the end of the sequence:\n18\nKa-Chun Wong Yue Li Zhaolei Zhang\nAlgorithm 1 Baum-Welch HMM algorithm in PicTar [91]\nInitialize Z(1, i ≤1) = 1 and Z(L −lw + 1, L) = p0(w)\nE-step:\nForward recursion (i = 1, . . . , L): compute Z(1, i, πi = w) by Eq (21)\nBackward recursion (i = L −lw, . . . , 1): compute Z(i + 1, . . . , L|πi = w) by Eq\n(25)\nM-step:\nUpdate pw by Eq (26)\nEvaluate likelihood:\nCompute p(S|θ) by Eq (28)\nRepeat EM steps until p(S|θ) increases by less than a cutoﬀ\np(S|θ) =\nX\nw′\np(s1, . . . , sL, πL = w′|θ)\n(27)\n=\nX\nw′\nZ(1, L, πL = w′)\n(28)\nTogether, the optimization of pw in PicTar is performed using Baum-Welch\nalgorithm for Expectation-Maximization (EM) as summarized in Algorithm\n1. Finally, the PicTar score is deﬁned as a log ratio (F = −log Z) of the ML\nover background likelihood FB:\nPicTarScore = FB −F\n(29)\nwhere FB is the likelihood when only background is considered.\nAs previously mentioned, the emission probabilities e(s|w) in PicTar are\nassumed known. In Ahab for modelling TFBS, e(s|w) or m(s|w) is based on\nthe position frequency matrix (PFM): m(s|w) = Ql\nj=1 fj(n|w), where fj(n|w)\nis the normalized frequency of the nucleotide n at the j-th position of the\nPFM. However, miRNAs do not have PFM. The original PicTar arbitrarily\nsets e(s|w) to be 0.8 if there is perfect seed-match at 1-7 or 2-8 nt positions\nof the miRNA 5′ end AND the free binding energy as estimated by RNAhy-\nbrid is no less than 33% of the optimal binding energy of the entire miRNA\nsequence to the UTR [105]; otherwise e(s|w) is set to 0.2 divided by M for M\nimperfect seed matches with only 1 mismatch allowed, provided it is above\n66% of the optimal binding energy. Thus, the setting highly disfavours imper-\nfect seed match. The later version of PicTar changes the emission probability\ncalculation to be the total number of occurrences in conserved 3′UTR sites\ndivided by the total number of sites 3′UTR [93]. The setting appears to im-\nprove the sensitive/speciﬁcity of the model but makes it more dependent on\nthe cross-species conservation, potentially prone to false negatives (for the\nnon-conserved but functional sites).\nThe major advantage of PicTar over other simpler methods is that the co-\nordinate actions of the miRNAs (synergistic in case of optimally spaced sites or\nantagonistic in case of overlapping binding sites) are naturally captured within\nUnsupervised Learning in Genome Informatics\n19\nthe emission and transition probabilities. For instance, the PicTarScore as\nthe joint ML of multiple miRNA target sites will be higher than the linear sum\nof individual miRNA target sites (i.e., synergistic eﬀects). Longer 3′UTR will\nscore less than shorter 3′UTR if both contain the same number of target sites.\nPicTar demonstrated a comparable signal:noise ratio relative to TargetScan\nand was compared favourably with some of the earlier published methods\nbased on several surveys [3, 177, 135, 99]. When applied to vertebrates, Pic-\nTar identiﬁed roughly 200 genes per miRNA, which is a rather conservative\nestimate compared to the recent ﬁndings by TargetScan with a conserved\ntargeting scoring approach [49]. When applied to C. elegans (worm), Pic-\nTar identiﬁed 10% of the C. elegans genes that are under conserved miRNA\nregulation.\nNonetheless, PicTar has three important limitations. First, PicTar does\nnot consider the correlation between miRNA target sites since pw is essen-\ntially position independent. This is perhaps largely due to the increased model\ncomplexity when considering all pairwise transition probabilities between K\nmiRNAs and background since there will be (K + 1) × K + 1 parameters\nto model (as apposed to only K + 1). Supported by [62], however, the spe-\nciﬁc spatial arrangement of the target sites may be functionally important. In\nparticular, the optimal distance between miRNA sites was estimated as 8 to\n∼40 nt based on transfection followed by regression analysis [62]. Although\nunsupported by experimental evidence, the ordering of some speciﬁc target\nsites may be also important. For instance, target site x must be located before\ntarget site y (for the same or diﬀerent miRNA) to achieve optimal synergistic\nrepression. The model that takes into account the spatial correlation between\nmotifs is called the hcHMM (history conscious HMM) implemented in a pro-\ngram called Stubb for detecting TF binding sites (TFBS) rather than miRNA\ntarget predictions [141].\nSecond, the ML approach is prone to local optimal especially for long\nUTRs or many coordinated miRNA actions considered simultaneously (i.e.,\nmany pw’s). An alternative HMM formulation is to impose Bayesian priors on\nthe HMM parameters [107]. In particular, [173] demonstrated such Bayesian\nformalism of HMM in modelling combinatorial TFBS. In their model so-called\n“module HMM”, the transition probabilities is assumed to follow a Dirich-\nlet distribution with hyperparameters α = {α0, α1, . . . , αK, αK+1}, where\nα0 corresponds to the background, {α1 . . . αK} to the K TFs, and αK+1 to\nthe background inside of cis-regulatory module. Inference is performed via\nMarkov Chain Monte Carlo (MCMC) procedure or Gibbs sampling in partic-\nular. Brieﬂy, a forward pass and backward pass are run to generate marginal\nprobabilities at each nucleotide position. Starting at the end of the sequence,\nhidden states are sampled at each position based on the marginals until reach-\ning the front of the sequence. Given the hidden states, the hyperparameters\nfor Dirichlet distribution of the transition probabilities are then updated by\nsimply counting the occurrences of each state. The posteriors of the hidden\nstates at each nucleotide position are inferred as the averaged number of times\n20\nKa-Chun Wong Yue Li Zhaolei Zhang\nthe states are sampled in 1000 samplings, and the states with the maximum\na posteriori (MAP) are chosen. The model is demonstrated to perform better\nthan Ahab and Stubb (which are the basis for PicTar) in TFBS predictions\nbut have not yet been adapted to miRNA target predictions.\nThird, since data for expression proﬁling of mRNAs and miRNAs by mi-\ncroarrays or RNA-seq is now rather abundant (e.g., [7], GSE1738; GSE31568,\n[83]; GSE40499, [111] from GEO) or ENCODE (GSE24565, [36]) or TCGA\n[27, 163], the combinatorial regulation needs to be revisited by taking into ac-\ncount whether or not the co-operative miRNAs are indeed expressed in vivo\nand/or the expression correlation between mRNA and miRNA. In particu-\nlar, the emission probabilities e(s|w) need to be redeﬁned to integrate both\nsequence-based and expression-based information.\n3.2 A probabilistic approach to explore human miRNA target\nrepertoire by integrating miRNA-overexpression data and\nsequence information\nOne of the most direct way to query the targets of a given miRNA is by\ntransfecting the miRNA into a cell and examine the expression changes of\nthe cognate target genes [103]. Presumably, a bona ﬁde target will exhibit de-\ncreased expression upon the miRNA transfection. In particular, overexpression\nof miRNA coupled with expression proﬁling of mRNA by either microarray\nor RNA-seq has proved to be a promising approach [103, 6]. Consequently,\ngenome-wide comparison of diﬀerential gene expression holds a new promise to\nelucidate the global impact of a speciﬁc miRNA regulation without solely re-\nlying on evolutionary conservation. However, miRNA transfection is prone to\noﬀ-target eﬀects. For instance, overexpressing a miRNA may not only repress\nthe expression of its direct targets but also cause a cascading repression of in-\ndirect targets of the aﬀected transcription activators. To improve prediction\naccuracy for direct miRNA targets, this chapter describes a novel model called\nTargetScore that integrates expression change due to miRNA overexpression\nand sequence information such as context score [62, 54] and other orthogonal\nsequence-based features such as conservation [49] into a probabilistic score.\nIn one of our recent papers, we described a novel probabilistic method\nfor miRNA target prediction problem by integrating miRNA-overexpression\ndata and sequence-based scores from other prediction methods [99]. Brieﬂy,\neach score feature is considered as an independent observed variable, which\nis the input to a Variational Bayesian-Gaussian Mixture Model (VB-GMM).\nWe chose a Bayesian over a maximum likelihood approach to avoid overﬁt-\nting. Speciﬁcally, given expression fold-change (due to miRNA transfection),\nwe use a three-component VB-GMM to infer down-regulated targets account-\ning for genes with little or positive fold-change (due to oﬀ-target eﬀects [85]).\nOtherwise, two-component VB-GMM is applied to unsigned sequence scores.\nThe parameters for the VB-GMM are optimized using Variational Bayesian\nExpectation-Maximization (VB-EM) algorithm. The mixture component with\nUnsupervised Learning in Genome Informatics\n21\nthe largest absolute means of observed negative fold-change or sequence score\nis associated with miRNA targets and denoted as “target component”. The\nother components correspond to the “background component”. It follows that\ninferring miRNA-mRNA interactions is equivalent to inferring the posterior\ndistribution of the target component given the observed variables. The tar-\ngetScore is computed as the sigmoid-transformed fold-change weighted by the\naveraged posteriors of target components over all of the features.\nBayesian mixture model\nAssuming there are N genes, we denote x = (x1, . . . , xN)T as the log expres-\nsion fold-change (xf) or sequence scores (xl, l ∈{1, . . . , L}). Thus, for L sets\nof sequence scores, x ∈{xf, x1, . . . , xL}. To simplify the following equations,\nwe use x to represent one of the independent variables without loss of gen-\nerality. To infer target genes for a miRNA given x, we need to obtain the\nposterior distribution p(z|x) of the latent variable z ∈{z1, . . . , zK}, where\nK=3 (K=2) for modelling signed (unsigned) scores such as logarithmic fold-\nchanges (sequence scores).\nWe follow the standard Bayesian GMM based on [19] (p474-482) with\nonly minor modiﬁcations. Although univariate GMM (D = 1) is applied to\neach variable separately, we implemented and describe the following formal-\nism as a more general multivariate GMM, allowing modeling the covariance\nmatrices. Brieﬂy, the latent variables z are sampled at probabilities π (mix-\ning coeﬃcient), that follow a Dirichlet prior Dir(π|α0) with hyperparameters\nα0 = (α0,1, . . . , α0,K). To account for the relative frequency of targets and\nnon-targets for any miRNA, we set the α0,1 (associated with the target com-\nponent) to aN and other α0,k = (1 −a) × N/(K −1), where a = 0.01 (by\ndefault). Assuming x follows a Gaussian distribution N(x|µ, Λ−1), where Λ\n(precision matrix) is the inverse covariance matrix, p(µ, Λ) together follow\na Gaussian-Wishart prior QK\nk N(µk|m0, (β0Λ)−1)W(Λk|W0, ν0), where the\nhyperparameters {m0, β0, W0, ν0} = {ˆµ, 1, ID×D, D + 1}.\nVariational Bayesian Expectation Maximization\nLet θ = {z, π, µ, Λ}. The marginal log likelihood can be written in terms\nof lower bound L(q) (ﬁrst term) and Kullback-Leibler divergence KL(q||p)\n(second term):\nln p(x) =\nZ\nq(θ) ln p(x, θ)\nq(θ) dθ +\nZ\nq(θ) ln q(θ)\np(θ|x)dθ\n(30)\nwhere q(θ) is a proposed distribution for p(θ|x), which does not have a closed\nform distribution. Because ln p(x) is a constant, maximizing L(q) implies min-\nimizing KL(q||p). The general optimal solution ln q∗\nj (θj) is the expectation\nof variable j w.r.t other variables, Ei̸=j[ln p(x, θ)]. In particular, we deﬁne\n22\nKa-Chun Wong Yue Li Zhaolei Zhang\nq(z, π, µ, Λ) = q(z)q(π)q(µ, Λ). The expectations for the three terms (at log\nscale), namely ln q∗(z), ln q∗(π), ln q∗(µ, Λ), have the same forms as the ini-\ntial distributions due to the conjugacy of the priors. However, they require\nevaluation of the parameters {z, π, µ, Λ}, which in turn all depend on the\nexpectations of z or the posterior of interest:\np(znk|xn, θ) ≡E[znk] =\nρnk\nPK\nj=1 ρnj\n(31)\nwhere ln ρnk = E[ln πk]+ 1\n2E[ln |Λk|]−D\n2 ln(2π)−1\n2Eµk,Λk[(xn−µk)T Λk(xn−\nµk)]. The inter-dependence between the expectations and model parameters\nfalls naturally into an EM framework, namely VB-EM. Brieﬂy, we ﬁrst ini-\ntialize the model parameters based on priors and randomly sample K data\npoints µ. At the ith iteration, we evaluate (31) using the model parameters\n(VB-E step) and update the model parameters using (31) (VB-M step). The\nEM iteration terminates when L(q) improves by less than 10−20 (default).\nPlease refer to [19] for more details.\nTargetScore\nWe deﬁne the targetScore as an integrative probabilistic score of a gene being\na target t (meaning that znk = 1 for the target component k) of a miRNA:\ntargetScore = σ(−log FC)\n\n\n1\nL + 1\nX\nx∈{xf ,x1,...,xL}\np(t|x)\n\n\n(32)\nwhere σ(−log FC) =\n1\n1+exp(log F C),\np(t|x) is the posterior in (31).\nTargetScore demonstrates superior statistical power compared to exist-\ning methods in predicting validated miRNA targets in various human cell-\nlines. Moreover, the conﬁdence targets from TargetScore exhibit comparable\nprotein downregulation and are more signiﬁcantly enriched for Gene Ontol-\nogy terms. Using TargetScore, we explored oncomir-oncogenes network and\npredicted several potential cancer-related miRNA-messenger RNA interac-\ntions. TargetScore is available at Bioconductor http://www.bioconductor.\norg/packages/devel/bioc/html/TargetScore.html.\nNetwork-based methods to detect miRNA regulatory modules\nAlthough targets of individual miRNAs are signiﬁcantly enriched for certain\nbiological processes [120, 157], it is also likely that multiple miRNAs are coor-\ndinated together to synergistically regulate one or more pathways [91, 23, 176].\nIndeed, despite their limited number (2578 mature miRNAs in human genome,\nmiRBase V20, [90]), miRNAs may be in charge of more evolutionarily robust\nand potent regulatory eﬀects through coordinated collective actions. The hy-\npothesis of miRNA synergism is also parsimonious or biologically plausible\nUnsupervised Learning in Genome Informatics\n23\nbecause the number of possible combinations of the 2578 human miRNAs is\nextremely large, enough to potentially react to virtually countless environ-\nmental changes. Intuitively, if a group of (miRNA) workers perform similar\ntasks together, then removing a single worker will not be as detrimental as\nassigning each worker a unique task [23].\nSeveral related methods have been developed to study miRNA synergism.\nSome early methods were based on pairwise overlaps [136] or score-speciﬁc\ncorrelation [176] between predicted target sites of any given two (co-expressed)\nmiRNAs. For instance, Shalgi et al. (2007) devised an overlapping scoring\nscheme to account for diﬀerential 3′UTR lengths of the miRNA targets, which\nmay otherwise bias the results if standard hypergeometric test was used [136].\nMethods beyond pairwise overlaps have also been described. These methods\nconsidered not only the sequence-based miRNA-target site information but\nalso the respective miRNA-mRNA expression correlation (MiMEC) across\nvarious conditions to detect miRNA regulatory modules (MiRMs).\nFor instance, Joung et al. (2007) developed a probabilistic search pro-\ncedure to separately sample from the mRNA and miRNA pools candidate\nmodule members with probabilities proportional to their overall frequency\nof being chosen as the “ﬁttest”, which was determined by their target sites\nand MiMEC relative to the counterparts [82]. The algorithm found only\nthe single best MiRM, which varied depending on the initial mRNA and\nmiRNA set. Other network-based methods using either the sequence infor-\nmation only or using m/miRNA expression proﬁles only as a ﬁlter for a more\ndisease-focused network construction on only the diﬀerentially expressed (DE)\nm/miRNAs. For instance, Peng et al. (2006) employed an enumeration ap-\nproach to search for maximal bi-clique on DE m/miRNAs to discover com-\nplete bipartite subgraphs, where every miRNA is connected with every mRNA\n[122]. The approach operated on unweighted edges only, which required dis-\ncretizing miRNA-mRNA expression correlation. Also, maximal bi-clique does\nnot necessarily imply functional MiRMs and vice versa.\nThe following subsections review in details three recently developed net-\nwork methods (Table 1) to detect MiRMs. Despite distinct unsupervised\nlearning frameworks, all three methods exploit the widely available paired\nm/miRNA expression proﬁles to improve upon the accuracy of earlier devel-\noped (sequence-based) network approaches.\n3.3 GroupMiR: inferring miRNA and mRNA group memberships\nwith Indian Buﬀet Process\nThe expression-based methods reviewed elsewhere [177] were essentially de-\nsigned to explain the expression of each mRNA in isolation using a subset of\nthe miRNA expression in a linear model with a ﬁxed set of parameters. How-\never, the same mRNAs (miRNAs) may interact with diﬀerent sets of miRNAs\n(mRNAs) in diﬀerent pathways. The exact number of pathways is unknown\nand may grow with an increase of size or quality of the training data. Thus,\n24\nKa-Chun Wong Yue Li Zhaolei Zhang\nit is more natural to infer the number of common features shared among dif-\nferent groups of miRNAs and mRNAs. Accordingly, Le et al. (2011) proposed\na powerful alternative model called GroupMiR (Group MiRNA target predic-\ntion) [94]. As an overview, GroupMiR ﬁrst explored the latent binary features\nor memberships possessed within mRNAs, miRNAs, or shared between mR-\nNAs and miRNAs on a potentially inﬁnite binary feature space empowered\nby a nonparametric Bayesian (NBP) formalism. Thus, the number of features\nwas inferred rather than determined arbitrarily. Importantly, the feature as-\nsignment took into account the prior information for miRNA and mRNA\ntargeting relationships, obtained from sequence-based target prediction tools\nsuch as TargetScan or PicTar. Based on the shared memberships, mRNAs\nand/or miRNAs formed groups (or clubs). The same miRNAs (mRNAs) could\npossess multiple memberships and thus belong to multiple groups each cor-\nresponding to a latent feature. This was also biologically plausible since a\nmiRNA (mRNA) may participate in several biological processes. Similar to\nGenMiR++ [75], GroupMiR then performed a Bayesian linear regression on\neach mRNA expression using all miRNA expression but placing more weight\non the expression of miRNAs that shared one or more common features with\nthat mRNA.\nSpeciﬁcally, the framework of GroupMiR was based on a recently devel-\noped general nonparametric Bayesian prior called the Indian Buﬀet Process\n(IBP) [60] (which was later on proved to be equivalent to Beta process [153]).\nAs the name suggests, IBP can be understood from an analogy of a type of\nan ‘Indian buﬀet’ as follows. A ﬁnite number of N customers or objects form\na line to enter one after another a buﬀet comprised of K dishes or features.\nEach customer i samples P\nk\nmk\ni\ndishes selected by mk previous customers,\nand Poisson( α\ni ) new dishes, where α is a model parameter. The choices of N\ncustomers on the K dishes are expressed in an N ×K binary matrix Z. A left-\norder function lof(·) maps a binary matrix Z to a left-ordered binary matrix\nwith columns (i.e., dishes) sorted from left to right by decreasing order of mk\nand breaking ties in favour of customers who enter the buﬀet earlier. This pro-\ncess deﬁnes an exchangeable distribution on equivalence class [Z] comprising\nall of the Z that have the same left-ordered binary matrix lof(Z) regardless\nof the order the customers enter the buﬀet (i.e., row order) or the dish order\n(i.e., column order).\nBefore reviewing the IBP derivation, we need to establish some notations\n[60]. (z1k, . . . , z(i−1)k) (i ∈{1, . . . , N}) denotes the history h of feature k at\nobject i, which is encoded by a single decimal number. At object i = 3, for\ninstance, a feature k has one of four histories encoded by 0, 1, 2, 3 correspond-\ning to all of the four possible permutations of choices for objects 1 and 2:\n(0, 0), (0, 1), (1, 0), (1, 1). Accordingly, for N objects, there are 2N histories\nfor each feature k and 2N −1 histories excluding the history of all zeros (i.e.,\n(0)1×N). Additionally, Kh denotes the number of features possessing the same\nhistory h, K0 for all features with mk = 0, and K+ = P2N−1\nh=1\nKh for all fea-\nUnsupervised Learning in Genome Informatics\n25\ntures for which mk > 0. Thus, K = K0 + K+. It is easy to see that binary\nmatrices belong to an equivalence class if and only if they have the same his-\ntory proﬁle h for each feature k. The cardinality (card) of an equivalence class\n[Z] is the number of all of the binary matrices with the same history proﬁle:\ncard([Z]) =\n\u0012\nK\nK0 . . . K2N−1\n\u0013\n=\nK!\nQ2N−1\nh=0\nKh!\n(33)\nAs shown below, Eq (33) is essential in order to establish the close-formed\nsolution of IBP prior when K →∞leads to an inﬁnite feature space or\ninﬁnite number of columns in Z. After establishing the above properties, the\ncentral steps in deriving the IBP prior used in GroupMiR is reviewed below. I\nwill focus on some steps neglected from the original work and refer the reader\nto the full derivation when appropriate. As in the original papers, we ﬁrst\nderive IBP on a ﬁnite number of latent features K and then take the limit\nmaking use of Eq (33).\nLet Z be an N ×K binary matrix, where N = M +R for M mRNAs and R\nmiRNAs, and K is the number of latent features. Assuming the binary value\nzk in Z for each feature k is sampled from Bernoulli(πk) and are conditionally\nindependent given πk, the joint distribution of zk is then:\np(zk|πk) =\nY\ni\n(1 −πk)1−zikπzik\nk\n= exp\n X\ni\n(1 −zik) log(1 −πk) + zik log πk\n!\n(34)\nwhere πk follows a Beta prior πk|α ∼Beta(r, s) with r = α\nK , s = 1:\np(πk|α) = πr−1\nk\n(1 −πk)s−1\nB(r, s)\n=\nπ\nα\nk −1\nk\nB( α\nK , 1)\n(35)\nwhere B(·) is a Beta function. To take into account the prior information be-\ntween miRNA and mRNA targeting from sequence-based predictions, Group-\nMiR incorporated in Eq (35) an N × N weight matrix W:\nW =\n\u0012 0 C\nCT 0\n\u0013\n(36)\nwhere interaction within mRNAs and within miRNAs were set to zeros and\ninteraction between mRNA and miRNA followed the R × M scoring matrix\nC obtained from a quantitative sequence-based predictions. In particular, Mi-\nRanda scores were used in their paper. Thus, wij is either 0 or deﬁned as a\npairwise potential of interactions between mRNA i and miRNA j. The mod-\niﬁed p∗(πk|α) was then deﬁned as:\np∗(πk|α) = π\nα\nK −1\nk\nZ′\nΦzk\n(37)\n26\nKa-Chun Wong Yue Li Zhaolei Zhang\nwhere Φzk and the partition function Z′ were deﬁned as:\nΦzk = exp\n\nX\ni<j\nwijzikzjk\n\n\n(38)\nZ′ =\n2N−1\nX\nh=0\nΦhB( α\nK + mh, N −mh + 1)\n(39)\nThe marginal probability of P(Z) is derived by integrating out πk as follows:\nP(Z) =\nK\nY\nk=1\nZ 1\n0\nP(zk|πk)P(πk|α)dπk\n(40)\n=\nK\nY\nk=1\nZ 1\n0\nexp\n X\ni\n(1 −zik) log(1 −πk) + zik log πk\n!  \nπ\nα\nK −1\nk\nZ′/Φzk\n!\ndπk\n(41)\n=\nK\nY\nk=1\nZ 1\n0\nΦzk\nZ′ exp\n X\ni\n(1 −zik) log(1 −πk) + zik log πk\n!\nexp\nh\u0010 α\nK −1\n\u0011\nlog πk\ni\ndπk\n(42)\n=\nK\nY\nk=1\nΦzk\nZ′\nZ 1\n0\nexp\n\u0010\n(N −mk) log(1 −πk) + mk log πk + ( α\nK −1) log πk\n\u0011\ndπk\n(43)\n=\nK\nY\nk=1\nΦzk\nZ′\nZ 1\n0\nexp\n\u0010\n(N −mk) log(1 −πk) + ( α\nK + mk −1) log πk\n\u0011\ndπk\n(44)\n=\nK\nY\nk=1\nΦzk\nZ′ B( α\nK + mk, N −mk + 1)\n(45)\nwhere mk in Eq (43) is the sum over all zik = 1, and (45) directly follows\nthe deﬁnition of Beta function. However, when limK→∞P(Z) = 0 since the\nprobability of sampling a speciﬁc binary matrix from an inﬁnite number of\nmatrices is 0. Instead, the inference was performed over the equivalence class\n[Z] with the number of lof-equivalent matrices deﬁned above:\nUnsupervised Learning in Genome Informatics\n27\nP([Z]) =\nX\nZ∈[Z]\nP(Z)\n(46)\n=\nK!\nQ2N−1\nh=0\nKh!\nK\nY\nk=1\nΦzk\nZ′ B( α\nK + mk, N −mk + 1)\n\u0012\nEq 33, 45\n\u0013\n(47)\nlim\nK→∞P([Z]) =\nαK+\nQ2N−1\nh=0\nKh!\nK+\nY\nk=1\nΦzk\n(N −mk)!(mk −1)!\nN!\nexp(−αΨ)\n(48)\nwhere\nΨ =\n2N−1\nX\nh=0\nΦh\n(N −mk)!(mk −1)!\nN!\n(49)\nA more elaborate derivation of (48) was described in the Appendix from [94]\nand omitted here. Additionally, the authors also showed that when W = 0 or\nequivalently Φh = 1 for all histories h, then Eq (48) reduces to the original\nIBP introduced in [60], which is thus a special case of the weighted IBP in\nGroupMiR.\nGiven the IBP prior Eq (48), the generative process for zik corresponding\nto an existing feature k (where mk > 0) was derived as follows:\nP(zik = 1|Z−ik) =\nP(zik = 1, Z−ik)\nP(zik = 0, Z−ik) + P(zik = 1, Z−ik)\n(50)\n=\nΦzk,zik=1(N −m−ik −1)!(m−ik + 1 −1)!\nΦzk,zik=0(N −m−ik)!(m−ik −1)! + Φzk,zik=1(N −m−ik −1)!(m−ik + 1 −1)!\n(51)\n=\nexp(P\nj̸=i wij · 1 · zjk)(N −m−ik −1)!(m−ik + 1 −1)!\nexp(P\nj̸=i wij · 0 · zjk)(N −m−ik)!(m−ik −1)!+\nexp(\nX\nj̸=i\nwij · 1 · zjk)(N −m−ik −1)!(m−ik + 1 −1)!\n=\nexp(P\nj̸=i wijzjk)m−ik\n(N −m−ik) + exp(P\nj̸=i wijzjk)m−ik\n(52)\nwhere the subscript −ik (e.g., Z−ik or m−ik) denotes all objects for k except\nfor i, Eq (51) arose from cancellations of the common terms in (48), and\nsimilar for (52). The number of new feature k∗(where mk∗= 0) are sampled\nfrom Poisson( α\ni ).\nNotably, Z can be expressed as Z = (UT , VT )T , where U is a M × K\nbinary matrix for mRNA and V is a R × K binary matrix for miRNA. Thus,\nmRNA i and miRNA j are in the same group k if uikvjk = 1. Given U and\nV, the regression model in GroupMiR was deﬁned as:\nxi ∼N(µ −\nX\nj\n(rj +\nX\nk:uikvjk=1\nsk)yj, σ2I)\n(53)\n28\nKa-Chun Wong Yue Li Zhaolei Zhang\nwhere xi is the expression of mRNA i, µ is the baseline expression for i,\nrj is the regulatory weight of miRNA j, sk is a group-speciﬁc coeﬃcient for\ngroup k, and yj is the expression of miRNA j. With the Gaussian distribution\nassumption for xi, the data likelihood then follows as:\nP(X, Y|Z, Θ) ∝exp\n \n−1\n2σ2\nX\ni\n(xi −¯xi)T (xi −¯xi)\n!\n(54)\nwhere Θ = (µ, σ2, s, r) and ¯xi = µ −P\nj(rj + P\nk:uikvjk=1 sk)yj. The (conju-\ngate) priors over the parameters in Θ were deﬁned and omitted here.\nFinally, the marginal posterior of Z are deﬁned as:\nP(zik|X, Y, Z−(ik)) ∝P(X, Y|Z−(ik), zik)P(zik|z−ik)\n(55)\nwhere P(X, Y|Z−(ik), zik) was obtained by integrating the likelihood (Eq (54))\nover all parameters in Θ and P(zik|z−ik) from Eq (50).\nDue to the integral involved above, analytical solution for posterior in (55)\nis diﬃcult to obtain. Accordingly, the inference in GroupMiR was performed\nvia MCMC:\n1. Sample an existing column zik from Eq (50);\n2. Assuming object i is the last customer in line (i.e., i = N), sample\nPoisson( α\nN ) new columns and sample sk from its prior (Gamma distri-\nbution) for each new column;\n3. Sample the remaining parameters by Gibbs sampler if closed-form poste-\nrior of the parameter exists (due to conjugacy) or by Metropolis-Hasting\nusing likelihood Eq (54) to determine the acceptance ratio;\n4. Repeat 1-3 until convergence.\nFinally, the posteriors of Z in Eq (55) for all feature column with at least one\nnonzero entry serve as the target prediction of GroupMiR.\nGroupMiR was applied to simulated data generated from Eq (53) with\nK = 5 (i.e., 5 latent features shared among miRNA and mRNA) and increas-\ning noise level (0.1, 0.2, 0.4, 0.8) to the prior scoring matrix C, mimicking the\nhigh false positive and negative rates from the sequence-based predictors. At\nthe low noise levels of 0.1, 0.2, or 0.4, GroupMiR was able to identify exactly 5\nlatent features and above 90% accuracy in predicting the correct memberships\nbetween miRNA and mRNA. At the high noise level of 0.8, on the other hand,\nGroupMiR started to identify > 5 latent features but the accuracy remained\nabove 90%, demonstrating its robustness. In contrast, GenMiR++ had much\na lower performance than GroupMiR on the same data, scoring lower than\n60% accuracy at the high noise level. GroupMiR was also applied to the real\nmicroarray data with 7 time points proﬁling the expression of miRNA and\nmRNA in mouse lung development. However, only the top 10% of the genes\nwith highest variance were chosen leading to 219 miRNAs and 1498 mRNAs.\nAlthough the authors did not justify using such a small subset of the data, it\nUnsupervised Learning in Genome Informatics\n29\nis likely due to the model complexity that prohibited the full exploration of\nthe data. Nonetheless, GroupMiR identiﬁed higher network connectivity and\nhigher GO enrichment for the predicted targets than GenMiR++ on the same\ndataset. It would have been even more convincing, however, if GroupMiR was\nalso tested on the same datasets of 88 human tissues, which were used in the\nGenMiR++ study [75].\nAlthough the time complexity was not analyzed for GroupMiR, it appears\nsimilar to, if not higher, than the general IBP, which has a time complexity\nof O(N 3) per iteration for N objects [38]. The slow mixing rate is the main\nissue for IBP-based framework due to the intensive Gibbs samplings required\nto perform the inference, which prevented GroupMiR from fully exploring the\ndata space at a genome scale oﬀered by microarray or RNA-seq platforms,\nand consequently compromised the model accuracy. Adaptations of eﬃcient\ninference algorithms that were recently developed for IBP are crucial to un-\nleash the full power of the NPB framework [38]. Additionally, GroupMiR did\nnot consider the spatial relationships between adjacent target sites of the\nsame mRNA 3′UTR for the same or diﬀerent miRNAs as in PicTar (Section\n3.1). A more biologically meaningful (IBP) prior may improve the accuracy\nand/or the model eﬃciency by restricting the possible connections in Z. Fi-\nnally, it would be interesting to further examine the biological revelation of\nthe groupings from Z on various expression consortia. In particular, miRNAs\nparticipating in many groups or having higher out-degrees in network con-\ntext are likely to be more functionally important than others. Moreover, the\ngroupings may not only reveal miRNA and mRNA targeting relationships but\nalso the regulatory roles of mRNAs as TFs on miRNA when a modiﬁed IBP\nprior is used. Taken together, many directions remained unexplored with the\npowerful NBP framework.\n3.4 SNMNMF: sparse network-regularized multiple nonnegative\nmatrix factorization\nThe nonnegative matrix factorization (NMF) algorithm was originally de-\nveloped to extract latent features from images [96, 160]. NMF serves as\nan attractive alternative to conventional dimensionality reduction techniques\nsuch as Principle Component Analysis (PCA) because it factorizes the orig-\ninal matrix Vs×n (for s images and n pixels) into two non-negative matri-\nces Vs×n = Ws×kHk×n, where Ws×k and Hk×n are the “image encoding”\nand “basis image” matrices, respectively4. Notably, k needs to be known be-\nforehand. The non-negativity of the two factorized matrices enforced by the\nNMF algorithm provides the ground for intuitive interpretations of the latent\nfeatures because the factorized matrices tend to be sparse and reﬂective to\n4In the original paper [96], the image matrix Vs×n was transposed, where the\nrows and columns represent the pixel and image, respectively. The representation\nused here is to be consistent with the one used by [179] reviewed below.\n30\nKa-Chun Wong Yue Li Zhaolei Zhang\ncertain distinct local features of the original image matrix. Kim and Tidor\n(2003) were among the very ﬁrst groups that introduced NMF into the world\nof computational biology [87]. In particular, the authors used NMF to assign\nmemberships to genes based on the “image encoding” matrix Hk×n in order\nto decipher yeast expression network using gene expression data measured by\nmicroarray. Since then, many NMF-based frameworks were developed [34].\nIn particular, Zhang et al. (2011) extended the NMF algorithm to de-\ntecting miRNA regulatory modules (MiRMs) [179]. Speciﬁcally, the authors\nproposed a sparse network-regularized multiple NMF (SNMNMF) technique\nto minimize the following objective function:\nW, H1, H2 ←arg min\nW,H1,H2\nX\nl=1,2\n||Xl −WHl||2 −λ1Tr(H2AHT\n2 ) −λ2Tr(H1BHT\n2 )\n+ γ1||W||2 + γ2(\nX\nj\n||hj||2 +\nX\nj′\n||hj′||2)\n(56)\nwhere\n•\nX1 and X2 are the s × n mRNA and s × m miRNA expression matrices,\nrespectively, for s samples, n mRNAs, and m miRNAs;\n•\nW is the s × k encoding matrix using k = 50 latent features (chosen\nbased on the number of spatially separable miRNA clusters in the human\ngenome);\n•\nH1 and H2 are the k × n and k × m “image basis” matrices for genes and\nmiRNAs, respectively;\n•\nA is the n × n binary gene-gene interactions matrices as a union of the\ntranscription factor binding sites (TFBS) from TRANSFAC [165] and the\nprotein-protein interactions from [24];\n•\nB is the n × m binary miRNA-mRNA interaction matrix obtained from\nMicroCosm [61] database that hosts the target predictions from MiRanda\n[80];\n•\nγ1||W||2+γ2(P\nj ||hj||2+P\nj′ ||hj′||2 are regularization terms that prevent\nthe parameter estimates from growing too large;\n•\nthe weights λ1,2 and regularization parameters γ1,2 were selected post hoc.\nThe original optimization algorithm of NMF was based on a simple gradient\ndecent procedure, which operated on only a single input matrix. Here, how-\never, the partial derivative of Eq (56) with respect to each matrix (W, H1, H2)\ndepends on the optimal solution from the other two matrices. Accordingly, the\nauthors developed a two-stage heuristic approach, which nonetheless guar-\nantees to converge to a local optimal: (1) update W ﬁxing H1, H2 (which\nare initialized randomly); (2) update H1, H2 ﬁxing W, repeat 1 & 2 until\nconvergence. To cluster m/miRNAs, the authors exploited the encoding ma-\ntrices H1 (k × n) and H2 (k × m) by transforming each entry into z-score:\nzij = (hij −¯h.j)/σj, where ¯h.j and σj are the mean and standard deviation\nof column j of H1 (or H2) for mRNA j (or miRNA j′), respectively. Thus,\nUnsupervised Learning in Genome Informatics\n31\neach m/miRNA was assigned to zero or more features if their corresponding\nz-score is above a threshold.\nSNMNMF was applied to ovarian cancer dataset containing paired m/miRNA\nexpression proﬁles from TCGA measuring 559 miRNAs and 12456 genes for\neach of the 385 patient samples. The authors found that more than half of\nthe 49 modules (1 module was empty) identiﬁed by SNMNMF were enriched\nfor at least one GO terms or KEGG pathway. Also, miRNAs involved in\nthe SNMNMF-MiRMs were enriched for cancer-related miRNAs. Moreover,\nKaplan-Meier survival analysis revealed that some of the k latent features\nfrom the basis matrix Ws×k oﬀerred promising prognostic power. Finally,\nSNMNMF compared favourably with the enumeration of bi-clique (EBC) al-\ngorithm proposed by Peng et al. (2009) in terms of the number of miRNAs\ninvolved in the modules and GO/pathway enrichments [122]. Speciﬁcally, the\nauthors found that EBC tended to produce modules involving only a single\nmiRNA and multiple mRNAs. The star-shape modules are instances of a triv-\nial case that can be derived directly from miRNA-mRNA interaction scores\nrather than network analysis.\nDespite the statistical rigor, there are several limitations of the SNMNMF\nalgorithm. First, the NMF approach requires a predeﬁned number of modules\nin order to perform the matrix factorization, which may be data-dependent\nand diﬃcult to determine beforehand. Additionally, the NMF solution is of-\nten not unique, and the identiﬁed modules do not necessarily include both\nmiRNAs and mRNAs, which makes reproducing and interpreting the results\ndiﬃcult. Moreover, the SNMNMF does not enforce negative MMEC (miRNA-\nmRNA expression correlation), whereas the negative MMEC is necessary to\nascertain the repressive function of the miRNAs on the mRNAs within the\nMiRMs. Finally, SNMNMF incurs a high time complexity of O(tk(s+m+n)2)\nfor t iterations, k modules, s samples, m miRNAs, and n mRNAs. Because n\nis usually large (e.g., 12456 genes in the ovarian cancer dataset), the compu-\ntation is expensive even for a small number of iterations or modules. Thus,\nan intuitively simple and eﬃcient deterministic framework may serve as an\nattractive alternative, which we describe next.\n3.5 Mirsynergy: detecting synergistic miRNA regulatory modules\nby overlapping neighbourhood expansion\nIn one of our recent works, we described a novel model called Mirsynergy\nthat integrates m/miRNA expression proﬁles, target site information, and\ngene-gene interactions (GGI) to form MiRMs, where an m/miRNA may par-\nticipate in multiple MiRMs, and the module number is systematically deter-\nmined given the predeﬁned model parameters [100]. The clustering algorithm\nof Mirsynergy adapts from ClusterONE [117], which was intended to identify\nprotein complex from PPI data. The ultimate goal here however is to construct\napriori the MiRMs and exploit them to better explain clinical outcomes such\nas patient survival rate.\n32\nKa-Chun Wong Yue Li Zhaolei Zhang\nWe formulate the construction of synergistic miRNA regulatory modules\n(MiRMs) as an overlapping clustering problem with two main stages. Prior to\nthe two clustering stages, we ﬁrst inferred miRNA-mRNA interaction weights\n(MMIW) (W) using m/miRNA expression data and target site information.\nAt stage 1, we only cluster miRNAs to greedily maximize miRNA-miRNA\nsynergy, which is proportional to the correlation between miRNAs in terms\nof their MMIW. At stage 2, we ﬁx the MiRM assignments and greedily add\n(remove) genes to (from) each MiRM to maximize the synergy score, which\nis deﬁned as a function of the MMIW matrix and the gene-gene interaction\nweight (GGIW) matrix (H).\nTwo-stage clustering\nLet W denote the expression-based N × M MMIW matrix obtained from\nthe coeﬃcients of a linear regression model such as LASSO, determined as\nthe best performing target prediction model on our data, where wi,k is the\nscoring weight for miRNA k targeting mRNA i. Similar to the “Meet/Min”\nscore deﬁned by [136] for binary interactions of co-occurring targets of miRNA\npairs, we deﬁne an M × M scoring matrix denoted as S, indicating miRNA-\nmiRNA synergistic scores between miRNA j and k (j ̸= k):\nsj,k =\nPN\ni=1 wi,jwi,k\nmin[P\ni wi,j, P\ni wi,k]\n(57)\nNotably, if W were a binary matrix, Eq 57 became the ratio of number of\ntargets shared between miRNA j and k over the minimum number of targets\npossessed by j or k, which is essentially the original “Meet/Min” score. We\nchose such scoring system to strictly reﬂect the overlapping between the two\nmiRNA target repertoires rather than merely correlated trends as usually\nintended by alternative approaches such as Pearson correlation.\nSimilar to the cohesiveness deﬁned by [117], we deﬁne synergy score s(Vc)\nfor any given MiRM Vc as follows. Let win(Vc) denote the total weights of the\ninternal edges within the miRNA cluster, wbound(Vc) the total weights of the\nboundary edges connecting the miRNAs within Vc to the miRNAs outside Vc,\nand α(Vc) the penalty scores for forming cluster Vc. The synergy of Vc (i.e.,\nthe objective function) is:\ns(Vc) =\nwin(Vc)\nwin(Vc) + wbound(Vc) + α(Vc)\n(58)\nwhere α(Vc) reﬂects our limited knowledge on potential unknown targets of\nthe added miRNA as well as the false positive targets within the cluster. Pre-\nsumably, these unknown factors will aﬀect our decision on whether miRNA k\nbelong to cluster Vc. For instance, miRNA may target noncoding RNAs and\nseedless targets, which are the mRNAs with no perfect seed-match [70]. We\nUnsupervised Learning in Genome Informatics\n33\nconsidered only mRNA targets with seed-match to minimize the number of\nfalse positives. By default, we set α(Vc) = 2|Vc|, where |Vc| is the cardinal-\nity of Vc. Additionally, we deﬁne two scoring functions to assess the overlap\nω(Vc, Vc′) between Vc and Vc′ for c ̸= c′ and the density d1(Vc) of any given\nVc:\nω(Vc, Vc′) = |Vc ∩Vc′|2\n|Vc||Vc′|\n(59)\nd1(Vc) = 2win(Vc)\nm(m −1)\n(60)\nwhere |Vc ∩Vc′| is the total number of common elements in Vc and Vc′, and\nm is the number of miRNAs in Vc.\nThe general solution for solving an overlapping clustering problems is NP-\nhard [13]. Thus, we adapt a greedy-based approach [117]. The algorithm can\nbe divided into two major steps. In step 1, we select as an initial seed miRNA\nk with the highest total weights. We then grow an MiRM Vt from seed k\nby iteratively including boundary or excluding internal miRNAs to maximize\nthe synergy s(Vt) (Eq 58) until no more node can be added or removed to\nimprove s(Vt). We then pick another miRNA that has neither been considered\nas seed nor included in any previously expanded Vt to form Vt+1. The entire\nprocess terminates when all of the miRNAs are considered. In step 2, we\ntreat the clusters as a graph with Vc as nodes and ω(Vc, Vc′) ≥τ as edges.\nHere τ is a free parameter. Empirically, we observed that most MiRMs are\nquite distinct from one another in terms of ω(Vc, Vc′) (before the merging).\nAccordingly, we set τ to 0.8 to ensure merging only very similar MiRMs, which\navoids producing very large MiRMs (when τ is too small). We then perform a\nbreath-ﬁrst search to ﬁnd all of the weakly connected components (CC), each\ncontaining clusters that can reach directly/indirectly to one another within\nthe CC. We merge all of the clusters in the same CC and update the synergy\nscore accordingly.\nAfter forming MiRMs at stage 1, we perform a similar clustering procedure\nby adding (removing) only the mRNAs to (from) each MiRM. Diﬀerent from\nstage 1, however, we grow each existing MiRM separately with no prioritized\nseed selection or cluster merging, which allows us to implement a parallel\ncomputation by taking advantage of the multicore processors in the mod-\nern computers. In growing/contracting each MiRM, we maximize the same\nsynergy function (Eq 58) but changing the edge weight matrix from S to a\n(N + M) × (N + M) matrix by combining W (the N × M MMIW matrix)\nand H (the N × N GGIW matrix). Notably, here we assume miRNA-miRNA\nedges to be zero. Additionally, we do not add/remove miRNAs to/from the\nMiRM at each greedy step at this stage. Finally, we deﬁne a new density\nfunction due to the connectivity change at stage 2:\nd2(Vc) =\nwin(Vc)\nn(m + n −1)\n(61)\n34\nKa-Chun Wong Yue Li Zhaolei Zhang\nwhere n (m) are the number of mRNAs (miRNAs) in the Vc. By default,\nwe ﬁlter out MiRMs with d1(Vi) < 1e-2 and d2(Vj) < 5e-3 at stage 1 and\n2, respectively. Both density thresholds were chosen based on our empirical\nanalyses. For some datasets, in particular, we found that our greedy approach\ntends to produce a very large cluster involving several hundred miRNAs or\nseveral thousand mRNAs at Stage 1 or 2, respectively, which are unlikely to\nbe biologically meaningful. Despite the ever increasing synergy (by deﬁnition),\nhowever, the anomaly modules all have very low density scores, which allows\nus to ﬁlter them out using the above-chosen thresholds.\nNotably, standard clustering methods such as k-means or hierarchical clus-\ntering are not suitable for constructing MiRMs since these methods assign\neach data point to a unique cluster [159]. A recently developed greedy-based\nclustering method ClusterONE is more realistic because it allows overlap be-\ntween clusters [117]. However, ClusterONE was developed with physical PPI\nin mind. Mirsynergy extends from ClusterONE to detecting MiRMs. The nov-\nelty of our approach resides in a two-stage clustering strategy with each stage\nmaximizing a synergy score as a function of either the miRNA-miRNA syner-\ngistic co-regulation or miRNA-mRNA/gene-gene interactions. Several meth-\nods have incorporated GGI as PPI and TFBS into predicting MiRMs [179, 95],\nwhich proved to be a more accurate approach than using miRNA-mRNA\nalone. Comparing with recent methods such as SNMNMF [179] and PIMiM\n[95], however, an advantage of our deterministic formalism is the automatic\ndetermination of module number (given the predeﬁned thresholds to merge\nand ﬁlter low quality clusters) and eﬃcient computation with the theoretical\nbound reduced from O(K(T + N + M)2) per iteration to only O(M(N + M))\nfor N (M) mRNA (miRNA) across T samples. Because N is usually much\nlarger than M and T, our algorithm runs orders faster. Based on our tests on a\nlinux server, Mirsynergy took about 2 hours including the run time for LASSO\nto compute OV (N=12456; M=559; T=385), BRCA or THCA (N=13306;\nM=710; T=331 or 543, respectively), whereas SNMNMF took more than\na day for each dataset. Using expression data for ovarian, breast, and thy-\nroid cancer from TCGA, we compared Mirsynergy with internal controls and\nexisting methods including SNMNMF reviewed above. Mirsynergy-MiRMs\nexhibit signiﬁcantly higher functional enrichment and more coherent miRNA-\nmRNA expression anti-correlation. Based on the Kaplan-Meier survival anal-\nysis, we proposed several prognostically promising MiRMs and envisioned\ntheir utility in cancer research. Mirsynergy is available as an R/Bioconductor\npackage at http://www.bioconductor.org/packages/release/bioc/html/\nMirsynergy.html.\nThe success of our model is likely attributable to its ability to explicitly\nleverage two types of information at each clustering stage: (1) the miRNA-\nmiRNA synergism based on the correlation of the inferred miRNA target\nscore proﬁles from MMIW matrix; (2) the combinatorial miRNA regulatory\neﬀects on existing genetic network, implicated in the combined MMIW and\nGGIW matrices. We also explored other model formulations such as cluster-\nUnsupervised Learning in Genome Informatics\n35\ning m/miRNAs in a single clustering stage or using diﬀerent MMIW matrices\nother than the one produced from LASSO, which tends to produce MiRMs\neach containing only one or a few miRNAs or several very large low qual-\nity MiRMs, which were then ﬁltered out by the density threshold in either\nclustering stage. Notably, an MiRM containing only a single miRNA can be\ndirectly derived from the MMIW without any clustering approach. More-\nover, Mirsynergy considers only neighbour nodes with nonzero edges. Thus,\nour model works the best on a sparse MMIW matrix such as the outputs\nfrom LASSO, which is the best performing expression-based methods based\non our comparison with other alternatives. Nonetheless, the performance of\nMirsynergy is sensitive to the quality of MMIW and GGIW. In this regard,\nother MMIW or GGIW matrices (generated from improved methods) can be\neasily incorporated into Mirsynergy as the function parameters by the users\nof the Bioconductor package (please refer to the package vignette for more\ndetails). In conclusion, with large amount of m/miRNA expression data be-\ncoming available, we believe that Mirsynergy will serve as a powerful tool for\nanalyzing condition-speciﬁc miRNA regulatory networks.\nReferences\n1. Abecasis, G.R., Auton, A., Brooks, L.D., DePristo, M.A., Durbin, R.M., et al.:\nAn integrated map of genetic variation from 1,092 human genomes. Nature\n491(7422), 56–65 (2012)\n2. Abeel, T., Van de Peer, Y., Saeys, Y.: Toward a gold standard for promoter\nprediction evaluation.\nBioinformatics 25(12), i313–i320 (2009).\nDOI http:\n//dx.doi.org/10.1093/bioinformatics/btp191\n3. Alexiou, P., Maragkakis, M., Papadopoulos, G.L., Reczko, M., Hatzigeorgiou,\nA.G.: Lost in translation: an assessment and perspective for computational\nmicroRNA target identiﬁcation.\nBioinformatics (Oxford, England) 25(23),\n3049–3055 (2009)\n4. Altschul, S.F., Gish, W., Miller, W., Myers, E.W., Lipman, D.J.: Basic local\nalignment search tool. Journal of molecular biology 215(3), 403–410 (1990).\nDOI 10.1006/jmbi.1990.9999. URL http://dx.doi.org/10.1006/jmbi.1990.\n9999\n5. Ao, W., Gaudet, J., Kent, W.J., Muttumu, S., Mango, S.E.: Environmentally\ninduced foregut remodeling by PHA-4/FoxA and DAF-12/NHR. Science 305,\n1743–1746 (2004)\n6. Arvey, A., Larsson, E., Sander, C., Leslie, C.S., Marks, D.S.: Target mRNA\nabundance dilutes microRNA and siRNA activity. Molecular systems biology\n6, 1–7 (2010)\n7. Babak, T., Zhang, W., Morris, Q., Blencowe, B.J., Hughes, T.R.: Probing\nmicroRNAs with microarrays: tissue speciﬁcity and functional inference. RNA\n(New York, N.Y.) 10(11), 1813–1819 (2004)\n8. Badis, G., Berger, M.F., Philippakis, A.A., Talukder, S., Gehrke, A.R., Jaeger,\nS.A., Chan, E.T., Metzler, G., Vedenko, A., Chen, X., Kuznetsov, H., Wang,\nC.F., Coburn, D., Newburger, D.E., Morris, Q., Hughes, T.R., Bulyk, M.L.:\n36\nKa-Chun Wong Yue Li Zhaolei Zhang\nDiversity and complexity in DNA recognition by transcription factors. Science\n324(5935), 1720–1723 (2009)\n9. Bailey, T.L., Elkan, C.: The value of prior knowledge in discovering motifs with\nMEME. Proc Int Conf Intell Syst Mol Biol 3, 21–29 (1995)\n10. Bailey, T.L., Gribskov, M.: Methods and statistics for combining motif match\nscores. J. Comput. Biol. 5(2), 211–221 (1998)\n11. Barash, Y., Bejerano, G., Friedman, N.: A simple hyper-geometric approach\nfor discovering putative transcription factor binding sites. In: Proceedings of\nthe First International Workshop on Algorithms in Bioinformatics, WABI ’01,\npp. 278–293. Springer-Verlag, London, UK, UK (2001). URL http://dl.acm.\norg/citation.cfm?id=645906.673098\n12. Bartel, D.P.: MicroRNAs: Target Recognition and Regulatory Functions. Cell\n136(2), 215–233 (2009)\n13. Barth´elemy, J.P., Brucker, F.: Np-hard approximation problems in overlapping\nclustering. Journal of classiﬁcation 18(2), 159–183 (2001)\n14. Bateman, A., Coin, L., Durbin, R., Finn, R.D., Hollich, V., GrifRths-Jones, S.,\nKhanna, A., Marshall, M., Moxon, S., Sonnhammer, E.L.L., Studholme, D.J.,\nYeats, C., Eddy, S.R.: The pfam protein families database. Nucleic Acids Res\n32, D138–141 (2004)\n15. Berg, O.G., von Hippel, P.H.: Selection of DNA binding sites by regulatory\nproteins. Statistical-mechanical theory and application to operators and pro-\nmoters. J. Mol. Biol. 193(4), 723–750 (1987)\n16. Berger, M.F., Philippakis, A.A., Qureshi, A.M., He, F.S., Estep, P.W., Bu-\nlyk, M.L.: Compact, universal DNA microarrays to comprehensively determine\ntranscription-factor binding site speciﬁcities. Nat. Biotechnol. 24, 1429–1435\n(2006)\n17. Berman, B.P., Nibu, Y., Pfeiﬀer, B.D., Tomancak, P., Celniker, S.E., Levine,\nM., Rubin, G.M., Eisen, M.B.: Exploiting transcription factor binding site\nclustering to identify cis-regulatory modules involved in pattern formation in\nthe Drosophila genome. Proc. Natl. Acad. Sci. U.S.A. 99(2), 757–762 (2002)\n18. Bishop, C.: Pattern recognition and machine learning. No. 605–631 in Infor-\nmation Science and Statisitcs. Springer Science, New York, NY, USA (2006)\n19. Bishop, C.M.: Pattern recognition and machine learning. Springer, Information\nScience and Statistics. NY, USA (2006)\n20. Blanchette, M., Schwikowski, B., Tompa, M.: Algorithms for phylogenetic foot-\nprinting. J. Comput. Biol. 9(2), 211–223 (2002)\n21. Blanchette, M., Tompa, M.: Discovery of regulatory elements by a compu-\ntational method for phylogenetic footprinting. Genome Res. 12(5), 739–748\n(2002)\n22. de Boer, C.G., Hughes, T.R.: YeTFaSCo: a database of evaluated yeast tran-\nscription factor sequence speciﬁcities. Nucleic Acids Res. 40(Database issue),\nD169–179 (2012)\n23. Boross, G., Orosz, K., Farkas, I.J.: Human microRNAs co-silence in well-\nseparated groups and have diﬀerent predicted essentialities.\nBioinformatics\n(Oxford, England) 25(8), 1063–1069 (2009)\n24. Bossi, A., Lehner, B.: Tissue speciﬁcity and the human protein interaction\nnetwork. Molecular systems biology 5, 260 (2009)\n25. Burgler, C., Macdonald, P.M.: Prediction and veriﬁcation of microRNA targets\nby MovingTargets, a highly adaptable prediction method. BMC Genomics 6,\n88 (2005)\nUnsupervised Learning in Genome Informatics\n37\n26. Bussemaker, H.J., Li, H., Siggia, E.D.: Building a dictionary for genomes: iden-\ntiﬁcation of presumptive regulatory sites by statistical analysis. Proceedings\nof the National Academy of Sciences of the United States of America 97(18),\n10,096–10,100 (2000)\n27. Cancer Genome Atlas Research Network: Comprehensive genomic charac-\nterization deﬁnes human glioblastoma genes and core pathways.\nNature\n455(7216), 1061–1068 (2008)\n28. Chan, T.M., Leung, K.S., Lee, K.H.: TFBS identiﬁcation based on genetic\nalgorithm with combined representations and adaptive post-processing. Bioin-\nformatics 24, 341–349 (2008)\n29. Chen, X., Hughes, T.R., Morris, Q.: RankMotif++: a motif-search algorithm\nthat accounts for relative ranks of K-mers in binding transcription factors.\nBioinformatics 23, i72–79 (2007)\n30. Chen, Y., Meyer, C.A., Liu, T., Li, W., Liu, J.S., Liu, X.S.: Mm-chip enables\nintegrative analysis of cross-platform and between-laboratory chip-chip or chip-\nseq data. Genome Biol 12(2), R11 (2011)\n31. Cheng, C., Alexander, R., Min, R., Leng, J., Yip, K.Y., Rozowsky, J., Yan,\nK.K., Dong, X., Djebali, S., Ruan, Y., Davis, C.A., Carninci, P., Lassman, T.,\nGingeras, T.R., Guigo, R., Birney, E., Weng, Z., Snyder, M., Gerstein, M.: Un-\nderstanding transcriptional regulation by integrative analysis of transcription\nfactor binding data. Genome Res. 22(9), 1658–1667 (2012)\n32. Consortium, I.H.G.S.: Finishing the euchromatic sequence of the human\ngenome. Nature 431(7011), 931–945 (2004)\n33. Croce, C.M.: Causes and consequences of microRNA dysregulation in cancer.\nNature reviews. Genetics 10(10), 704–714 (2009)\n34. Devarajan, K.: Nonnegative Matrix Factorization: An Analytical and Inter-\npretive Tool in Computational Biology. PLoS Computational Biology 4(7),\ne1000,029 (2008)\n35. D’Haeseleer, P., Liang, S., Somogyi, R.: Genetic network inference: from co-\nexpression clustering to reverse engineering. Bioinformatics (Oxford, England)\n16(8), 707–726 (2000).\nDOI http://dx.doi.org/10.1093/bioinformatics/16.8.\n707. URL http://dx.doi.org/10.1093/bioinformatics/16.8.707\n36. Djebali, S., Davis, C.A., Merkel, A., Dobin, A., Lassmann, T., Mortazavi, A.,\nTanzer, A., Lagarde, J., Lin, W., Schlesinger, F., et al.: Landscape of tran-\nscription in human cells. Nature 488(7414), 101–108 (2013)\n37. Doench, J.G., Sharp, P.A.: Speciﬁcity of microRNA target selection in trans-\nlational repression. Genes & development 18(5), 504–511 (2004)\n38. Doshi-Velez, F., Ghahramani, Z.: Accelerated sampling for the indian buﬀet\nprocess. In: Proceedings of the 26th Annual International Conference on Ma-\nchine Learning, ICML ’09, pp. 273–280. ACM, New York, NY, USA (2009).\nDOI 10.1145/1553374.1553409\n39. Dubchak, I., Ryaboy, D.V.: VISTA family of computational tools for compar-\native analysis of DNA sequences and whole genomes. Methods Mol. Biol. 338,\n69–89 (2006)\n40. Durbin, R., Eddy, S., Krogh, A., Mitchison, G.: Biological sequence analysis:\nprobabilistic models of proteins and nucleic acids. Cambridge University Press,\nCambridge, United Kingdom (1998)\n41. Durbin, R., Eddy, S.R., Krogh, A., Mitchison, G.: Biological Sequence Anal-\nysis: Probabilistic Models of Proteins and Nucleic Acids. Cambridge Univer-\n38\nKa-Chun Wong Yue Li Zhaolei Zhang\nsity Press (1998). URL http://www.amazon.ca/exec/obidos/redirect?tag=\nciteulike09-20&amp;path=ASIN/0521629713\n42. ENCODE: An integrated encyclopedia of DNA elements in the human genome.\nNature 489(7414), 57–74 (2012)\n43. Eskin, E., Pevzner, P.A.: Finding composite regulatory patterns in DNA se-\nquences. Bioinformatics 18 Suppl 1, S354–363 (2002)\n44. Favorov, A.V., Gelfand, M.S., Gerasimova, A.V., Ravcheev, D.A., Mironov,\nA.A., Makeev, V.J.: A Gibbs sampler for identiﬁcation of symmetrically struc-\ntured, spaced DNA motifs with improved estimation of the signal length. Bioin-\nformatics 21, 2240–2245 (2005)\n45. Ferguson, J.P., Cho, J.H., Zhao, H.: A new approach for the joint analysis of\nmultiple chip-seq libraries with application to histone modiﬁcation. Statistical\napplications in genetics and molecular biology 11(3) (2012)\n46. Fleischmann, R., Adams, M., White, O., Clayton, R., Kirkness, E., Kerlavage,\nA., Bult, C., Tomb, J., Dougherty, B., Merrick, J.: Whole-genome random\nsequencing and assembly of Haemophilus inﬂuenzae Rd. Science 269, 496–512\n(1995)\n47. Foat, B.C., Houshmandi, S.S., Olivas, W.M., Bussemaker, H.J.: Proﬁling\ncondition-speciﬁc, genome-wide regulation of mRNA stability in yeast. Proc.\nNatl. Acad. Sci. U.S.A. 102, 17,675–17,680 (2005)\n48. Fordyce, P.M., Gerber, D., Tran, D., Zheng, J., Li, H., DeRisi, J.L., Quake,\nS.R.: De novo identiﬁcation and biophysical characterization of transcription-\nfactor binding sites with microﬂuidic aﬃnity analysis. Nat. Biotechnol. 28(9),\n970–975 (2010)\n49. Friedman, R.C., Farh, K.K.H., Burge, C.B., Bartel, D.P.: Most mammalian\nmRNAs are conserved targets of microRNAs. Genome Research 19(1), 92–105\n(2009)\n50. Frith, M.C., Hansen, U., Spouge, J.L., Weng, Z.: Finding functional sequence\nelements by multiple local alignment. Nucleic Acids Res. 32, 189–200 (2004)\n51. Frith, M.C., Li, M.C., Weng, Z.: Cluster-Buster: Finding dense clusters of\nmotifs in DNA sequences. Nucleic Acids Res. 31(13), 3666–3668 (2003)\n52. Fulton, D.L., Sundararajan, S., Badis, G., Hughes, T.R., Wasserman, W.W.,\nRoach, J.C., Sladek, R.: TFCat: the curated catalog of mouse and human\ntranscription factors. Genome Biol. 10(3), R29 (2009)\n53. Galas, D.J., Schmitz, A.: DNAse footprinting: a simple method for the detec-\ntion of protein-DNA binding speciﬁcity. Nucleic Acids Res. 5(9), 3157–3170\n(1987)\n54. Garcia, D.M., Baek, D., Shin, C., Bell, G.W., Grimson, A., Bartel, D.P.: Weak\nseed-pairing stability and high target-site abundance decrease the proﬁciency\nof lsy-6 and other microRNAs. Nature structural & molecular biology 18(10),\n1139–1146 (2011)\n55. Garner, M.M., Revzin, A.: A gel electrophoresis method for quantifying the\nbinding of proteins to speciﬁc DNA regions: application to components of the\nescherichia coli lactose operon regulatory system. Nucleic Acids Res. 9(13),\n3047–3060 (1981)\n56. Gasch, A.P., Moses, A.M., Chiang, D.Y., Fraser, H.B., Berardini, M., Eisen,\nM.B.: Conservation and evolution of cis-regulatory systems in ascomycete\nfungi.\nPLoS Biology 2(5), e398 (2004-12-01).\nDOI 10.1371/journal.pbio.\n0020398\nUnsupervised Learning in Genome Informatics\n39\n57. Gerstein, M.B., Kundaje, A., Hariharan, M., Landt, S.G., Yan, K.K., Cheng,\nC., Mu, X.J., Khurana, E., Rozowsky, J., Alexander, R., Min, R., Alves, P.,\nAbyzov, A., Addleman, N., Bhardwaj, N., Boyle, A.P., Cayting, P., Charos, A.,\nChen, D.Z., Cheng, Y., Clarke, D., Eastman, C., Euskirchen, G., Frietze, S.,\nFu, Y., Gertz, J., Grubert, F., Harmanci, A., Jain, P., Kasowski, M., Lacroute,\nP., Leng, J., Lian, J., Monahan, H., O’Geen, H., Ouyang, Z., Partridge, E.C.,\nPatacsil, D., Pauli, F., Raha, D., Ramirez, L., Reddy, T.E., Reed, B., Shi,\nM., Slifer, T., Wang, J., Wu, L., Yang, X., Yip, K.Y., Zilberman-Schapira, G.,\nBatzoglou, S., Sidow, A., Farnham, P.J., Myers, R.M., Weissman, S.M., Snyder,\nM.: Architecture of the human regulatory network derived from ENCODE\ndata. Nature 489(7414), 91–100 (2012)\n58. Giannopoulou, E.G., Elemento, O.: Inferring chromatin-bound protein com-\nplexes from genome-wide binding assays. Genome Res. 23(8), 1295–1306 (2013)\n59. Goﬀeau, A., Barrell, B., Bussey, H., Davis, R., Dujon, B., Feldmann, H., Galib-\nert, F., Hoheisel, J., Jacq, C., Johnston, M., Louis, E., Mewes, H., Murakami,\nY., Philippsen, P., Tettelin, H., Oliver, S.: Life with 6000 genes. Science 274,\n563–567 (1996)\n60. Griﬃths, T., Ghahramani, Z.: Inﬁnite latent feature models and the Indian\nbuﬀet process. In: In NIPS, pp. 475–482. MIT Press (2005)\n61. Griﬃths-Jones, S., Saini, H.K., van Dongen, S., Enright, A.J.: miRBase: tools\nfor microRNA genomics. Nucleic acids research 36(Database issue), D154–8\n(2008)\n62. Grimson, A., Farh, K.K.H., Johnston, W.K., Garrett-Engele, P., Lim, L.P.,\nBartel, D.P.: MicroRNA targeting speciﬁcity in mammals: determinants be-\nyond seed pairing. Molecular Cell 27(1), 91–105 (2007)\n63. Gr¨un, D., Wang, Y.L., Langenberger, D., Gunsalus, K.C., Rajewsky, N.: mi-\ncroRNA target predictions across seven Drosophila species and comparison to\nmammalian targets. PLoS Computational Biology 1(1), e13 (2005)\n64. GuhaThakurta, D.: Computational identiﬁcation of transcriptional regulatory\nelements in DNA sequence. Nucleic Acids Res. 34, 3585–3598 (2006)\n65. Gunewardena, S., Zhang, Z.: A hybrid model for robust detection of transcrip-\ntion factor binding sites. Bioinformatics 24(4), 484–491 (2008)\n66. Guo, H., Ingolia, N.T., Weissman, J.S., Bartel, D.P.: Mammalian microRNAs\npredominantly act to decrease target mRNA levels. Nature 466(7308), 835–840\n(2010)\n67. Guo, Y., Mahony, S., Giﬀord, D.K.: High resolution genome wide binding event\nﬁnding and motif discovery reveals transcription factor spatial binding con-\nstraints. PLoS computational biology 8(8), e1002,638 (2012)\n68. He, X., Ling, X., Sinha, S.: Alignment and prediction of cis-regulatory mod-\nules based on a probabilistic model of evolution. PLoS Comput. Biol. 5(3),\ne1000,299 (2009)\n69. van Helden, J., Andre, B., Collado-Vides, J.: Extracting regulatory sites from\nthe upstream region of yeast genes by computational analysis of oligonucleotide\nfrequencies. J. Mol. Biol. 281, 827–842 (1998)\n70. Helwak, A., Kudla, G., Dudnakova, T., Tollervey, D.: Mapping the Human\nmiRNA Interactome by CLASH Reveals Frequent Noncanonical Binding. Cell\n153(3), 654–665 (2013)\n71. Herrmann, C., Van de Sande, B., Potier, D., Aerts, S.: i-cisTarget: an in-\ntegrative genomics method for the prediction of regulatory features and cis-\nregulatory modules. Nucleic Acids Res. 40(15), e114 (2012)\n40\nKa-Chun Wong Yue Li Zhaolei Zhang\n72. Hertz, G.Z., Stormo, G.D.: Identifying DNA and protein patterns with statisti-\ncally signiﬁcant alignments of multiple sequences. Bioinformatics 15, 563–577\n(1999)\n73. Ho, S.W., Jona, G., Chen, C.T., Johnston, M., Snyder, M.: Linking DNA-\nbinding proteins to their recognition sequences by using protein microarrays.\nProc. Natl. Acad. Sci. U.S.A. 103(26), 9940–9945 (2006)\n74. Hu, S., Xie, Z., Onishi, A., Yu, X., Jiang, L., Lin, J., Rho, H.S., Woodard,\nC., Wang, H., Jeong, J.S., Long, S., He, X., Wade, H., Blackshaw, S., Qian,\nJ., Zhu, H.: Proﬁling the human protein-DNA interactome reveals ERK2 as a\ntranscriptional repressor of interferon signaling. Cell 139(3), 610–622 (2009)\n75. Huang, J.C., Babak, T., Corson, T.W., Chua, G., Khan, S., Gallie, B.L.,\nHughes, T.R., Blencowe, B.J., Frey, B.J., Morris, Q.D.: Using expression pro-\nﬁling data to identify human microRNA targets. Nature Methods 4(12), 1045–\n1049 (2007)\n76. Hughes, J.D., Estep, P.W., Tavazoie, S., Church, G.M.: Computational identiﬁ-\ncation of cis-regulatory elements associated with groups of functionally related\ngenes in Saccharomyces cerevisiae. J. Mol. Biol. 296, 1205–1214 (2000)\n77. Initiative, A.G.: Analysis of the genome sequence of the ﬂowering plant Ara-\nbidopsis thaliana. Nature 408, 796–815 (2000)\n78. Ji, H., Jiang, H., Ma, W., Johnson, D.S., Myers, R.M., Wong, W.H.: An in-\ntegrated software system for analyzing ChIP-chip and ChIP-seq data. Nat.\nBiotechnol. 26(11), 1293–1300 (2008)\n79. Ji, H., Li, X., Wang, Q.f., Ning, Y.: Diﬀerential principal component analysis of\nchip-seq. Proceedings of the National Academy of Sciences 110(17), 6789–6794\n(2013)\n80. John, B., Enright, A.J., Aravin, A., Tuschl, T., Sander, C., Marks, D.S.: Human\nMicroRNA Targets. PLoS Biology 2(11), e363 (2004)\n81. Johnson, D.S., Mortazavi, A., Myers, R.M., Wold, B.: Genome-wide mapping\nof in vivo protein-DNA interactions. Science 316(5830), 1497–1502 (2007)\n82. Joung, J.G., Hwang, K.B., Nam, J.W., Kim, S.J., Zhang, B.T.: Discovery of\nmicroRNA-mRNA modules via population-based probabilistic learning. Bioin-\nformatics (Oxford, England) 23(9), 1141–1147 (2007)\n83. Keller, A., Leidinger, P., Bauer, A., ElSharawy, A., Haas, J., Backes, C., Wend-\nschlag, A., Giese, N., Tjaden, C., Ott, K., Werner, J., Hackert, T., Ruprecht,\nK., Huwer, H., Huebers, J., Jacobs, G., Rosenstiel, P., Dommisch, H., Schaefer,\nA., M¨uller-Quernheim, J., Wullich, B., Keck, B., Graf, N., Reichrath, J., Vogel,\nB., Nebel, A., Jager, S.U., Staehler, P., Amarantos, I., Boisguerin, V., Staehler,\nC., Beier, M., Scheﬄer, M., B¨uchler, M.W., Wischhusen, J., Haeusler, S.F.M.,\nDietl, J., Hofmann, S., Lenhof, H.P., Schreiber, S., Katus, H.A., Rottbauer,\nW., Meder, B., Hoheisel, J.D., Franke, A., Meese, E.: Toward the blood-borne\nmiRNome of human diseases. Nature Methods 8(10), 841–843 (2011)\n84. Kellis, M., Patterson, N., Birren, B., Berger, B., Lander, E.S.: Methods in com-\nparative genomics: genome correspondence, gene identiﬁcation and regulatory\nmotif discovery. J. Comput. Biol. 11(2-3), 319–355 (2004)\n85. Khan, A.A., Betel, D., Miller, M.L., Sander, C., Leslie, C.S., Marks, D.S.:\nTransfection of small RNAs globally perturbs gene regulation by endogenous\nmicroRNAs. Nature Biotechnology 27(6), 549–555 (2009)\n86. Kharchenko, P.V., Tolstorukov, M.Y., Park, P.J.: Design and analysis of ChIP-\nseq experiments for DNA-binding proteins. Nat. Biotechnol. 26(12), 1351–1359\n(2008)\nUnsupervised Learning in Genome Informatics\n41\n87. Kim, P.M.: Subsystem Identiﬁcation Through Dimensionality Reduction of\nLarge-Scale Gene Expression Data. Genome Research 13(7), 1706–1718 (2003)\n88. Kim, T., Tyndel, M.S., Huang, H., Sidhu, S.S., Bader, G.D., Gfeller, D., Kim,\nP.M.: MUSI: an integrated system for identifying multiple speciﬁcity from very\nlarge peptide or nucleic acid data sets. Nucleic Acids Res. 40(6), e47 (2012)\n89. Kiriakidou, M., Nelson, P.T., Kouranov, A., Fitziev, P., Bouyioukos, C., Moure-\nlatos, Z., Hatzigeorgiou, A.: A combined computational-experimental approach\npredicts human microRNA targets. Genes & development 18(10), 1165–1178\n(2004)\n90. Kozomara, A., Griﬃths-Jones, S.: miRBase: annotating high conﬁdence mi-\ncroRNAs using deep sequencing data. Nucleic acids research 42(1), D68–73\n(2014)\n91. Krek, A., Gr¨un, D., Poy, M.N., Wolf, R., Rosenberg, L., Epstein, E.J., MacMe-\nnamin, P., da Piedade, I., Gunsalus, K.C., Stoﬀel, M., Rajewsky, N.: Combi-\nnatorial microRNA target predictions. Nature Genetics 37(5), 495–500 (2005)\n92. Laajala, T.D., Raghav, S., Tuomela, S., Lahesmaa, R., Aittokallio, T., Elo,\nL.L.: A practical comparison of methods for detecting transcription factor bind-\ning sites in ChIP-seq experiments. BMC Genomics 10, 618 (2009)\n93. Lall, S., Gr¨un, D., Krek, A., Chen, K., Wang, Y.L., Dewey, C.N., Sood, P.,\nColombo, T., Bray, N., MacMenamin, P., Kao, H.L., Gunsalus, K.C., Pachter,\nL., Piano, F., Rajewsky, N.: A Genome-Wide Map of Conserved MicroRNA\nTargets in C. elegans. Current Biology 16(5), 460–471 (2006)\n94. Le, H.S., Bar-Joseph, Z.: Inferring interaction networks using the ibp applied\nto microrna target prediction. In: Advances in Neural Information Processing\nSystems, pp. 235–243 (2011)\n95. Le, H.S., Bar-Joseph, Z.: Integrating sequence, expression and interaction data\nto determine condition-speciﬁc miRNA regulation.\nBioinformatics (Oxford,\nEngland) 29(13), i89–97 (2013)\n96. Lee, D.D., Seung, H.S.: Learning the parts of objects by non-negative matrix\nfactorization. Nature 401(6755), 788–791 (1999)\n97. Lewis, B.P., Burge, C.B., Bartel, D.P.: Conserved Seed Pairing, Often Flanked\nby Adenosines, Indicates that Thousands of Human Genes are MicroRNA Tar-\ngets. Cell 120(1), 15–20 (2005)\n98. Lewis, B.P., Shih, I.h., Jones-Rhoades, M.W., Bartel, D.P., Burge, C.B.: Pre-\ndiction of mammalian microRNA targets. Cell 115(7), 787–798 (2003)\n99. Li, Y., Goldenberg, A., Wong, K.C., Zhang, Z.: A probabilistic approach to\nexplore human miRNA targetome by integrating miRNA-overexpression data\nand sequence information. Bioinformatics (Oxford, England) 30(5), 621–628\n(2014)\n100. Li, Y., Liang, C., Wong, K.C., Luo, J., Zhang, Z.: Mirsynergy: detecting syn-\nergistic miRNA regulatory modules by overlapping neighbourhood expansion.\nBioinformatics (Oxford, England) 30(18), 2627–2635 (2014)\n101. Liang, Y., Leung, K.S., Mok, T.S.K.: Evolutionary drug scheduling models\nwith diﬀerent toxicity metabolism in cancer chemotherapy. Appl. Soft Comput.\n8(1), 140–149 (2008). DOI http://dx.doi.org/10.1016/j.asoc.2006.12.002\n102. Lifanov, A.P., Makeev, V.J., Nazina, A.G., Papatsenko, D.A.: Homotypic reg-\nulatory clusters in Drosophila. Genome Res. 13(4), 579–588 (2003)\n103. Lim, L.P., Lau, N.C., Garrett-Engele, P., Grimson, A., Schelter, J.M., Cas-\ntle, J., Bartel, D.P., Linsley, P.S., Johnson, J.M.: Microarray analysis shows\n42\nKa-Chun Wong Yue Li Zhaolei Zhang\nthat some microRNAs downregulate large numbers of target mRNAs. Nature\n433(7027), 769–773 (2005)\n104. Liu, X.S., Brutlag, D.L., Liu, J.S.: An algorithm for ﬁnding protein-DNA bind-\ning sites with applications to chromatin-immunoprecipitation microarray ex-\nperiments. Nat. Biotechnol. 20, 835–839 (2002)\n105. Lorenz, R., Bernhart, S.H., H¨oner Zu Siederdissen, C., Tafer, H., Flamm, C.,\nStadler, P.F., Hofacker, I.L.: ViennaRNA Package 2.0. Algorithms for molec-\nular biology : AMB 6, 26 (2011)\n106. Lu, J., Getz, G., Miska, E.A., Alvarez-Saavedra, E., Lamb, J., Peck, D., Sweet-\nCordero, A., Ebert, B.L., Mak, R.H., Ferrando, A.A., Downing, J.R., Jacks,\nT., Horvitz, H.R., Golub, T.R.: MicroRNA expression proﬁles classify human\ncancers. Nature 435(7043), 834–838 (2005)\n107. MacKay, D.J.: Ensemble learning for hidden markov models.\nTech. rep.,\nCavendish Laboratory, Cambridge (1997)\n108. Mahony, S., Edwards, M.D., Mazzoni, E.O., Sherwood, R.I., Kakumanu, A.,\nMorrison, C.A., Wichterle, H., Giﬀord, D.K.: An integrated model of multiple-\ncondition chip-seq data reveals predeterminants of cdx2 binding. PLoS com-\nputational biology 10(3), e1003,501 (2014)\n109. Matys, V., Kel-Margoulis, O.V., Fricke, E., Liebich, I., Land, S., Barre-Dirrie,\nA., Reuter, I., Chekmenev, D., Krull, M., Hornischer, K., Voss, N., Stegmaier,\nP., Lewicki-Potapov, B., Saxel, H., Kel, A.E., Wingender, E.: Transfac and\nits module transcompel: transcriptional gene regulation in eukaryotes. Nucleic\nAcids Research 34, 108–110 (2006)\n110. McGuﬃn, L.J., Bryson, K., Jones, D.T.: The psipred protein structure pre-\ndiction server.\nBioinformatics (Oxford, England) 16(4), 404–405 (2000).\nDOI 10.1093/bioinformatics/16.4.404.\nURL http://dx.doi.org/10.1093/\nbioinformatics/16.4.404\n111. Meunier, J., Lemoine, F., Soumillon, M., Liechti, A., Weier, M., Guschanski,\nK., Hu, H., Khaitovich, P., Kaessmann, H.: Birth and expression evolution of\nmammalian microRNA genes. Genome Research (2012)\n112. Mohan, P.M., Hosur, R.V.: Structure-function-folding relationships and native\nenergy landscape of dynein light chain protein: nuclear magnetic resonance\ninsights. J. Biosci. 34, 465–479 (2009)\n113. Montgomery, S., Griﬃth, O., Sleumer, M., Bergman, C., Bilenky, M., Plea-\nsance, E., Prychyna, Y., Zhang, X., Jones, S.: ORegAnno: an open access\ndatabase and curation system for literature-derived promoters, transcription\nfactor binding sites and regulatory variation.\nBioinformatics 22, 637–640\n(2006)\n114. Moses, A.M., Chiang, D.Y., Eisen, M.B.: Phylogenetic motif detection by\nexpectation-maximization on evolutionary mixtures.\nPac Symp Biocomput\npp. 324–335 (2004)\n115. Moses, A.M., Chiang, D.Y., Pollard, D.A., Iyer, V.N., Eisen, M.B.: MONKEY:\nidentifying conserved transcription-factor binding sites in multiple alignments\nusing a binding site-speciﬁc evolutionary model.\nGenome Biol. 5(12), R98\n(2004)\n116. Moses, A.M., Sinha, S.: Regulatory motif analysis. Bioinformatics: Tools and\nApplications (Edwards D, Stajich J,Hansen D) Springer Biomedical and Life\nSciences collection pp. 137–163 (2009)\n117. Nepusz, T., Yu, H., Paccanaro, A.: Detecting overlapping protein complexes\nin protein-protein interaction networks. Nature Methods 9(5), 471–472 (2012)\nUnsupervised Learning in Genome Informatics\n43\n118. Nishida, K., Frith, M.C., Nakai, K.: Pseudocounts for transcription factor bind-\ning sites. Nucleic Acids Res. 37(3), 939–944 (2009)\n119. Ovcharenko, I., Boﬀelli, D., Loots, G.G.: eShadow: a tool for comparing closely\nrelated sequences. Genome Res. 14(6), 1191–1198 (2004)\n120. Papadopoulos, G.L., Alexiou, P., Maragkakis, M., Reczko, M., Hatzigeorgiou,\nA.G.: DIANA-mirPath: Integrating human and mouse microRNAs in path-\nways. Bioinformatics (Oxford, England) 25(15), 1991–1993 (2009)\n121. Pavesi, G., Mereghetti, P., Mauri, G., Pesole, G.: Weeder Web: discovery of\ntranscription factor binding sites in a set of sequences from co-regulated genes.\nNucleic Acids Res. 32, 199–203 (2004)\n122. Peng, X., Li, Y., Walters, K.A., Rosenzweig, E.R., Lederer, S.L., Aicher, L.D.,\nProll, S., Katze, M.G.: Computational identiﬁcation of hepatitis C virus asso-\nciated microRNA-mRNA regulatory modules in human livers. BMC Genomics\n10, 373 (2009)\n123. Pfreundt, U., James, D.P., Tweedie, S., Wilson, D., Teichmann, S.A., Adryan,\nB.: FlyTF: improved annotation and enhanced functionality of the Drosophila\ntranscription factor database. Nucleic Acids Res. 38(Database issue), D443–\n447 (2010)\n124. Philippakis, A.A., He, F.S., Bulyk, M.L.: Moduleﬁnder: a tool for computa-\ntional discovery of cis regulatory modules. Pac Symp Biocomput pp. 519–530\n(2005)\n125. Portales-Casamar, E., Thongjuea, S., Kwon, A.T., Arenillas, D., Zhao, X.,\nValen, E., Yusuf, D., Lenhard, B., Wasserman, W.W., Sandelin, A.: JASPAR\n2010: the greatly expanded open-access database of transcription factor binding\nproﬁles. Nucleic Acids Res. 38(Database issue), D105–110 (2010)\n126. Rajewsky, N., Vergassola, M., Gaul, U., Siggia, E.D.: Computational detection\nof genomic cis-regulatory modules applied to body patterning in the early\nDrosophila embryo. BMC Bioinformatics 3, 30 (2002)\n127. Ramaswamy, S., Tamayo, P., Rifkin, R., Mukherjee, S., Yeang, C.H., Angelo,\nM., Ladd, C., Reich, M., Latulippe, E., Mesirov, J.P., Poggio, T., Gerald, W.,\nLoda, M., Lander, E.S., Golub, T.R.: Multiclass cancer diagnosis using tumor\ngene expression signatures. Proceedings of the National Academy of Sciences\nof the United States of America 98(26), 15,149–15,154 (2001)\n128. R´egnier, M., Denise, A.: Rare events and conditional events on random strings.\nDiscrete Mathematics an Theoretical Computer Science 6(2), 191–214 (2004).\nURL http://dmtcs.loria.fr/volumes/abstracts/dm060203.abs.html\n129. Ren, B., Robert, F., Wyrick, J.J., Aparicio, O., Jennings, E.G., Simon, I.,\nZeitlinger, J., Schreiber, J., Hannett, N., Kanin, E., Volkert, T.L., Wilson, C.J.,\nBell, S.P., Young, R.A.: Genome-wide location and function of DNA binding\nproteins. Science 290(5500), 2306–2309 (2000)\n130. Robasky, K., Bulyk, M.L.: UniPROBE, update 2011: expanded content and\nsearch tools in the online database of protein-binding microarray data on\nprotein-DNA interactions. Nucleic Acids Res. 39, D124–128 (2011)\n131. Ronquist, F., Huelsenbeck, J.P.: Mrbayes 3: Bayesian phylogenetic inference\nunder mixed models. Bioinformatics 19(12), 1572–1574 (2003). DOI 10.1093/\nbioinformatics/btg180. URL http://dx.doi.org/10.1093/bioinformatics/\nbtg180\n132. Rozowsky, J., Euskirchen, G., Auerbach, R.K., Zhang, Z.D., Gibson, T., Bjorn-\nson, R., Carriero, N., Snyder, M., Gerstein, M.B.: PeakSeq enables systematic\n44\nKa-Chun Wong Yue Li Zhaolei Zhang\nscoring of ChIP-seq experiments relative to controls. Nat. Biotechnol. 27(1),\n66–75 (2009)\n133. Sandelin, A., Wasserman, W.W., Lenhard, B.: ConSite: web-based prediction of\nregulatory elements using cross-species comparison. Nucleic Acids Res. 32(Web\nServer issue), W249–252 (2004)\n134. Segal, E., Yelensky, R., Koller, D.: Genome-wide discovery of transcriptional\nmodules from DNA sequence and gene expression. Bioinformatics 19 Suppl\n1, i273–282 (2003)\n135. Sethupathy, P., Megraw, M., Hatzigeorgiou, A.G.: A guide through present\ncomputational approaches for the identiﬁcation of mammalian microRNA tar-\ngets. Nature Methods 3(11), 881–886 (2006)\n136. Shalgi, R., Lieber, D., Oren, M., Pilpel, Y.: Global and local architecture of the\nmammalian microRNA-transcription factor regulatory network. PLoS Com-\nputational Biology 3(7), e131 (2007)\n137. Siddharthan, R., Siggia, E.D., van Nimwegen, E.: PhyloGibbs: a Gibbs sam-\npling motif ﬁnder that incorporates phylogeny. PLoS Comput. Biol. 1(7), e67\n(2005)\n138. Siepel, A., Bejerano, G., Pedersen, J.S., Hinrichs, A.S., Hou, M., Rosenbloom,\nK., Clawson, H., Spieth, J., Hillier, L.W., Richards, S., Weinstock, G.M., Wil-\nson, R.K., Gibbs, R.A., Kent, W.J., Miller, W., Haussler, D.: Evolutionarily\nconserved elements in vertebrate, insect, worm, and yeast genomes. Genome\nRes. 15(8), 1034–1050 (2005)\n139. Sinha, S., He, X.: MORPH: probabilistic alignment combined with hidden\nMarkov models of cis-regulatory modules. PLoS Comput. Biol. 3(11), e216\n(2007)\n140. Sinha, S., Liang, Y., Siggia, E.: Stubb: a program for discovery and analysis of\ncis-regulatory modules. Nucleic Acids Res. 34(Web Server issue), W555–559\n(2006)\n141. Sinha, S., Liang, Y., Siggia, E.: Stubb: a program for discovery and analysis of\ncis-regulatory modules. Nucleic Acids Research 34(Web Server), W555–W559\n(2006)\n142. Sinha, S., van Nimwegen, E., Siggia, E.D.: A probabilistic method to detect\nregulatory modules. Bioinformatics 19 Suppl 1, 292–301 (2003)\n143. Sinha, S., van Nimwegen, E., Siggia, E.D.: A probabilistic method to detect\nregulatory modules. Bioinformatics (Oxford, England) 19 Suppl 1, i292–301\n(2003)\n144. Sinha, S., Tompa, M.: YMF: A program for discovery of novel transcription\nfactor binding sites by statistical overrepresentation. Nucleic Acids Res. 31,\n3586–3588 (2003)\n145. Smith, A.D., Sumazin, P., Zhang, M.Q.: Identifying tissue-selective transcrip-\ntion factor binding sites in vertebrate promoters. Proc. Natl. Acad. Sci. U.S.A.\n102(5), 1560–1565 (2005)\n146. Smyth, M.S., Martin, J.H.: x ray crystallography. Molecular pathology : MP\n53(1), 8–14 (2000). URL http://view.ncbi.nlm.nih.gov/pubmed/10884915\n147. Song, L., Tuan, R.S.: MicroRNAs and cell diﬀerentiation in mammalian devel-\nopment. Birth defects research. Part C, Embryo today : reviews 78(2), 140–149\n(2006)\n148. Spivak, A.T., Stormo, G.D.: ScerTF: a comprehensive database of bench-\nmarked position weight matrices for Saccharomyces species.\nNucleic Acids\nRes. 40(Database issue), D162–168 (2012)\nUnsupervised Learning in Genome Informatics\n45\n149. Staden, R.: Methods for calculating the probabilities of ﬁnding patterns in\nsequences. Comput. Appl. Biosci. 5(2), 89–96 (1989)\n150. Stormo, G.D.: Maximally eﬃcient modeling of dna sequence motifs at all levels\nof complexity. Genetics 187(4), 1219–1224 (2011). DOI http://dx.doi.org/10.\n1534/genetics.110.126052. URL http://dx.doi.org/10.1534/genetics.110.\n126052\n151. Su, J., Teichmann, S.A., Down, T.A.: Assessing computational methods of\ncis-regulatory module prediction. PLoS Comput. Biol. 6(12), e1001,020 (2010)\n152. Tanay, A.: Extensive low-aﬃnity transcriptional interactions in the yeast\ngenome. Genome Res. 16, 962–972 (2006)\n153. Thibaux, R., Jordan, M.I.: Hierarchical beta processes and the Indian buﬀet\nprocess. International Conference on Artiﬁcial Intelligence and Statistics 11,\n564–571 (2007)\n154. Thijs, G., Lescot, M., Marchal, K., Rombauts, S., De Moor, B., Rouze, P.,\nMoreau, Y.: A higher-order background model improves the detection of pro-\nmoter regulatory elements by Gibbs sampling. Bioinformatics 17, 1113–1122\n(2001)\n155. Tomovic, A., Oakeley, E.J.: Position dependencies in transcription factor bind-\ning sites. Bioinformatics 23(8), 933–941 (2007)\n156. Tompa, M., Li, N., Bailey, T.L., Church, G.M., Moor, B.D., Eskin, E., Favorov,\nA.V., Frith, M.C., Fu, Y., Kent, W.J., Makeev, V.J., Mironov, A.A., Noble,\nW.S., Pavesi, G., Pesole, G., Regnier, M., Simonis, N., Sinha, S., Thijs, G.,\nvan Helden, J., Vandenbogaert, M., Weng, Z., Workman, C., Ye, C., , Zhu, Z.:\nAssessing computational tools for the discovery of transcription factor binding\nsites. Nature Biotechnology 23(1), 137–144 (2005)\n157. Tsang, J.S., Ebert, M.S., van Oudenaarden, A.: Genome-wide Dissection of\nMicroRNA Functionsand Cotargeting Networks Using Gene Set Signatures.\nMolecular Cell 38(1), 140–153 (2010)\n158. Tuerk, C., Gold, L.: Systematic evolution of ligands by exponential enrichment:\nRNA ligands to bacteriophage T4 DNA polymerase. Science 249(4968), 505–\n510 (1990)\n159. Wang, J.J., Bensmail, H., Gao, X.: Multiple graph regularized protein domain\nranking. BMC Bioinformatics 13, 307 (2012)\n160. Wang, J.J.Y., Bensmail, H., Gao, X.: Multiple graph regularized nonnegative\nmatrix factorization. Pattern Recognition 46(10), 2840–2847 (2013)\n161. Warner, J.B., Philippakis, A.A., Jaeger, S.A., He, F.S., Lin, J., Bulyk, M.L.:\nSystematic identiﬁcation of mammalian regulatory motifs’ target genes and\nfunctions. Nat. Methods 5(4), 347–353 (2008)\n162. Wasserman, W.W., Sandelin, A.: Applied bioinformatics for the identiﬁcation\nof regulatory elements. Nat. Rev. Genet. 5(4), 276–287 (2004)\n163. Weinstein, J.N., Collisson, E.A., Mills, G.B., Shaw, K.R.M., Ozenberger, B.A.,\nEllrott, K., Shmulevich, I., Sander, C., Stuart, J.M.: The Cancer Genome Atlas\nPan-Cancer analysis project. Nature Genetics 45(10), 1113–1120 (2013)\n164. Wilbanks, E.G., Facciotti, M.T.: Evaluation of algorithm performance in ChIP-\nseq peak detection. PLoS ONE 5(7), e11,471 (2010)\n165. Wingender, E., Chen, X., Hehl, R., Karas, H., Liebich, I., Matys, V., Mein-\nhardt, T., Pr¨uss, M., Reuter, I., Schacherer, F.: TRANSFAC: an integrated\nsystem for gene expression regulation. Nucleic acids research 28(1), 316–319\n(2000)\n46\nKa-Chun Wong Yue Li Zhaolei Zhang\n166. Wong, K.C., Chan, T.M., Peng, C., Li, Y., Zhang, Z.: DNA motif elucidation\nusing belief propagation. Nucleic Acids Res. 41(16), e153 (2013)\n167. Wong, K.C., Leung, K.S., Wong, M.H.: An evolutionary algorithm with species-\nspeciﬁc explosion for multimodal optimization. In: GECCO ’09: Proceedings\nof the 11th Annual conference on Genetic and evolutionary computation, pp.\n923–930. ACM, New York, NY, USA (2009). DOI http://doi.acm.org/10.1145/\n1569901.1570027\n168. Wong, K.C., Leung, K.S., Wong, M.H.: Protein structure prediction on a lattice\nmodel via multimodal optimization techniques. In: Proceedings of the 12th an-\nnual conference on Genetic and evolutionary computation, pp. 155–162. ACM\n(2010)\n169. Wong, K.C., Li, Y., Peng, C., Zhang, Z.: Signalspider: probabilistic pattern\ndiscovery on multiple normalized chip-seq signal proﬁles.\nBioinformatics p.\nbtu604 (2014)\n170. Wong, K.C., Peng, C., Wong, M.H., Leung, K.S.: Generalizing and learning\nprotein-dna binding sequence representations by an evolutionary algorithm.\nSoft Comput. 15(8), 1631–1642 (2011). DOI 10.1007/s00500-011-0692-5. URL\nhttp://dx.doi.org/10.1007/s00500-011-0692-5\n171. Wong, K.C., Wu, C.H., Mok, R.K.P., Peng, C., Zhang, Z.: Evolutionary mul-\ntimodal optimization using the principle of locality. Information Sciences 194,\n138–170 (2012)\n172. Workman, C.T., Stormo, G.D.: ANN-Spec: a method for discovering transcrip-\ntion factor binding sites with improved speciﬁcity. Pac Symp Biocomput pp.\n467–478 (2000)\n173. Wu, J., Xie, J.: Computation-based discovery of cis-regulatory modules by\nhidden Markov model. Journal of computational biology : a journal of compu-\ntational molecular cell biology 15(3), 279–290 (2008)\n174. Xie, D., Boyle, A.P., Wu, L., Zhai, J., Kawli, T., Snyder, M.: Dynamic trans-\nacting factor colocalization in human cells. Cell 155(3), 713–724 (2013)\n175. Xie, X., Rigor, P., Baldi, P.: MotifMap: a human genome-wide map of candidate\nregulatory motif sites. Bioinformatics 25(2), 167–174 (2009)\n176. Xu, J., Li, C.X., Li, Y.S., Lv, J.Y., Ma, Y., Shao, T.T., Xu, L.D., Wang,\nY.Y., Du, L., Zhang, Y.P., Jiang, W., Li, C.Q., Xiao, Y., Li, X.: MiRNA-\nmiRNA synergistic network: construction via co-regulating functional modules\nand disease miRNA topological features. Nucleic Acids Research 39(3), 825–\n836 (2011)\n177. Yue, D., Liu, H., Huang, Y.: Survey of Computational Algorithms for Mi-\ncroRNA Target Prediction. Current genomics 10(7), 478–492 (2009)\n178. Zeng, X., Sanalkumar, R., Bresnick, E.H., Li, H., Chang, Q., Kele, S.: jMO-\nSAiCS: joint analysis of multiple ChIP-seq datasets. Genome Biol. 14(4), R38\n(2013)\n179. Zhang, S., Li, Q., Liu, J., Zhou, X.J.: A novel computational framework\nfor simultaneous integration of multiple types of genomic data to identify\nmicroRNA-gene regulatory modules. Bioinformatics (Oxford, England) 27(13),\ni401–9 (2011)\n180. Zhang, Y., Liu, T., Meyer, C.A., Eeckhoute, J., Johnson, D.S., Bernstein, B.E.,\nNusbaum, C., Myers, R.M., Brown, M., Li, W., Liu, X.S.: Model-based analysis\nof ChIP-Seq (MACS). Genome Biol. 9(9), R137 (2008)\nUnsupervised Learning in Genome Informatics\n47\n181. Zhou, Q., Wong, W.H.: CisModule: de novo discovery of cis-regulatory mod-\nules by hierarchical mixture modeling. Proc. Natl. Acad. Sci. U.S.A. 101(33),\n12,114–12,119 (2004)\n182. Zia, A., Moses, A.M.: Towards a theoretical understanding of false positives in\nDNA motif ﬁnding. BMC Bioinformatics 13, 151 (2012)\n",
  "categories": [
    "q-bio.GN",
    "q-bio.QM",
    "stat.AP",
    "stat.ME",
    "stat.ML"
  ],
  "published": "2015-08-03",
  "updated": "2015-08-03"
}