{
  "id": "http://arxiv.org/abs/1710.04582v1",
  "title": "Is Epicurus the father of Reinforcement Learning?",
  "authors": [
    "Eleni Vasilaki"
  ],
  "abstract": "The Epicurean Philosophy is commonly thought as simplistic and hedonistic.\nHere I discuss how this is a misconception and explore its link to\nReinforcement Learning. Based on the letters of Epicurus, I construct an\nobjective function for hedonism which turns out to be equivalent of the\nReinforcement Learning objective function when omitting the discount factor. I\nthen discuss how Plato and Aristotle 's views that can be also loosely linked\nto Reinforcement Learning, as well as their weaknesses in relationship to it.\nFinally, I emphasise the close affinity of the Epicurean views and the Bellman\nequation.",
  "text": "arXiv:1710.04582v1  [cs.LG]  12 Oct 2017\nIs Epicurus the father of Reinforcement Learning?\nEleni Vasilaki\nDepartment of Computer Science, University of Sheﬃeld, United Kingdom\ne.vasilaki@sheﬃeld.ac.uk\nOctober 13, 2017\nAbstract\nThe Epicurean Philosophy is commonly thought as sim-\nplistic and hedonistic.\nHere I discuss how this is a\nmisconception and explore its link to Reinforcement\nLearning. Based on the letters of Epicurus, I construct\nan objective function for hedonism which turns out to\nbe equivalent of the Reinforcement Learning objective\nfunction when omitting the discount factor. I then dis-\ncuss how Plato and Aristotle ’s views that can be also\nloosely linked to Reinforcement Learning, as well as\ntheir weaknesses in relationship to it.\nFinally, I em-\nphasise the close aﬃnity of the Epicurean views and\nthe Bellman equation.\nWhen we think of Greek Philosophy, for most this\nconstitutes the names Plato and Aristotle. This is not\na surprise given the depth and the amount of their\nwork, which, for the largest part, remains intact till\ntoday. In the famous painting of Raphael, Plato and\nAristotle are portrayed right in the middle, dominating\nthe scene. It is hard to pay attention to the young man\nat the bottom left-hand corner, who is said to be the\nphilosopher Epicurus.\nEpicurus is perhaps the most misunderstood philoso-\npher of the Ancient world. Those who have heard his\nname before associate it with pleasure.\nEpicurus is\ncommonly perceived as a hedonist, as someone who\nonly promoted the immediate pleasures of the ﬂesh.\nThis, however, is a superﬁcial and largely misleading\npresentation of his philosophy.\nBorn in the island of Samos in 341BC [1, 2], also\nbirthplace of the famous mathematician Pythagoras,\nEpicurus consequently lived in Athens, Lesbos, and\nAsia Minor. He was aware of the Aristotelian philoso-\nphy, which was a mainstream philosophical movement\nat the time, however he was dissatisﬁed with this view\nof the world and adopted instead the earlier view of\nDemocritus:\n«ἀρχὰς εἶναι τῶν ὅλων ἀτόμους καὶκενόν, τὰδ΄ ἄλλα\nπάντα νενομίσθαι» [3]\n“The beginning of everything are atoms and\nspace, everything else is in your mind.”\nMuch of his philosophy builds upon the philosophy\nof Democritus, complementing ideas that Aristotle had\nvigorously criticised.\nWith his views not being very\npopular in Athens, where the Aristotelian philosophers\ndominated, Epicurus moved to Lesbos. However, his\nphilosophy was again not accepted; even worse Epicu-\nrus was accused of serious crimes and had to escape\nleaving the island in stormy weather, to reach the Asia\nMinor coast.\nAt the time, there were several Greek cities-colonies\nin Asia Minor. These cities were considered more pro-\ngressive than the mainland cities; a suitable environ-\nment for the Philosophy of Epicurus. For instance it\nwas not uncommon for the women of the colonies to get\nan education, in fact Asia Minor was the birthplace of\nmany famous hetairas who are remembered by history.\nHetairas are thought to be highly educated, high-end\ncourtesans, companions of philosophers. One such ex-\nample is the eminent Aspasia of Miletus, companion of\nPericles who was the most renowned Athenian leader\nin the 5th BC century, the golden age of the Ancient\nGreek world. Aspasia is said to have written Pericles’\nmost inspiring speeches.\nIf there was any place in the Ancient world that could\nhave accepted the revolutionary Epicurean philosophy,\nthis was Asia Minor. Indeed Epicurus established a fa-\nmous school in the city of Lampsacus [1] which, similar\nto the school of Pythagoras, accepted women and slaves\namong the students, something unacceptable at the eli-\ntist schools of Athens at the time.\nTo put the mat-\nter in some perspective, Girton College in Cambridge\nwas established as late as 1869AC to accept female stu-\ndents [4]. Epicurus, similar to Pythagoras, accepted\nstudents based on merit, not gender or status. He was\neven accused of praising his female student Themista,\nwife of Leonteus more than worthy male philosophers.\nThemista, according to one source [1], had previously\nbeen a hetaira. In 307BC, Epicurus, having gathered\nseveral followers returned once again in Athens, where\nhe died in his early 70s [1, 2].\nThe world of Epicurus,\nsimilar to Democritus,\nconsists of a world of interacting atoms, which account\nfor the perceived properties of bodies.\nAccording\nto Epicurus, perception can be explained based on\nthe “interaction of atoms with the sense-organs” [5].\nHe added to the atomist theory the notion that “all\nperception is true” and that we can learn to pursue\nnatural\npleasures\nrather\nthan\nmisleading\ndesires\n1\nimposed by society [2]. This view is much compatible\nto the general framework of Reinforcement Learning,\nwhere an agent interacts with its environment and\nreceives feedback from it. It is reﬂected even closer by\na most elaborated version of the agent-environment\ninteraction proposed by Andy Barto and colleagues [6],\naccording which the external world provides “sensa-\ntions”, that are internally interpreted by the agent (or\norganism) as reward signals, and that together with\nthe perceived internal states will lead to decisions and\nactions. In the Epicurean philosophy, there is a clear\nmapping of good as pleasure, or in the Reinforcement\nLearning terminology positive reward, and evil as\npain, or negative reward, punishment. There is also a\nclearly deﬁned objective function:\n«...τὴν ἡδονὴν ἀρχὴν καὶτέλος λέγομεν εἶναι τοῦ\nμακαρίως ζῆν» [7]\n“We say that pleasure is the beginning and\nthe end of a happy life”,\nEpicurus states in his letter to Menoeceus [8].\nHowever, pleasure in the Epicurean philosophy does\nnot merely have the notion of an immediate reward,\nas perhaps misinterpreted by the critics (or the fol-\nlowers!) of Epicurus. Instead, it has the notion of a\nfunction to be maximised given future rewards or pun-\nishments, as the consequence of present actions. In the\nsimplest form, we can write pleasure as a function R,\nparametrised by time t, which consist of a ﬁnite series\nof rewards of the future r at time t+1, t+2, t+3...T:\nRt = rt+1 + rt+2 + rt+3 + . . . + rT\nAs in Reinforcement Learning [9], the reward r,\nin this context, can be positive, zero or negative,\ncapturing also potential neutral or negative eﬀects of\nan action. According to Epicurus, choices of actions\ndepend on future long-lasting pleasures:\n“For we know pleasure as our ﬁrst and inborn\ngood, and we have it as the beginning of our\nevery choice and avoidance, and we turn to it in\nusing sensation as a standard for judging every\ngood. And since pleasure is our ﬁrst and natu-\nral good, for this reason we do not choose every\npleasure, but there are times when we pass over\nmany pleasures, when greater diﬃculty would\nresult from them for us, and we consider many\npains to be better than pleasures, whenever a\ngreater and long-lasting pleasure will follow for\nus after we have suﬀered the pains.\nSo every\npleasure is a good through being naturally\nagreeable, nevertheless not every pleasure is to\nbe chosen; just as it is also the case that every\npain is bad, but not every pain is always by its\nnature to be avoided.” (Translation taken from [8]).\nIn this context, the word “pleasure” has two diﬀer-\nent meanings, one referring to immediate pleasures\n(or pains), and one referring to the general concept\nof pleasure, the objective function that is captured\nby Rt.\nIn the same letter, the Philosopher oﬀers\nadvices regarding the future consequences of the\npresent actions.\nThis is equivalent of thinking that\nthe Philosopher has obtained, by his experience and\nobservation, the state-action values Q(s,a) deﬁned in\nTemporal-Diﬀerence Reinforcement Learning, which\nexpresses the total reward that can be collected by\nan agent in state s when taking action a. This prior\nknowledge of the Q-values might save others the time\nand eﬀort that would be required to discover if an\naction is beneﬁcial or harmful for their “souls”, or\nwhich types of pleasure should be pursued:\n“For\ncontinual\ndrinking\nand\npartying,\nor\ntaking one’s enjoyment of boys and women\n[...]\ndo not produce a pleasant life, but sober\nreasoning which both examines the basis for\nevery choice and avoidance and drives out the\nopinions which cause very great turmoil to take\nhold of our souls.” (Translation taken from [8]).\nThis is precisely the turning point for all the pre-\nsumed ideas of a simplistic hedonism in the Epicurean\nphilosophy. It is not just the pleasure of now that one\nhas to be concerned with, but its future consequences.\nDrinking, for instance, would have an immediate posi-\ntive reward at time t+1 but a negative reward at some\nother time in the future (i.e., hangover!). In general,\nthe values of the actions in the Epicurean Philosophy\nseem independent of the state of the agent, as they cap-\nture rather general concepts. For instance, Epicurus\nvalued friendship beyond other pleasures and advised\nagainst pursuing romantic love too much as this often\nbrings jealousy and pain in the long run. Considering\nfriendship investment as an action, its value is indepen-\ndent of the state of the agent (human) and higher than\nthe value of the action of pursuing romantic love. In\nfact, to the best of my knowledge, Epicurus never got\nmarried. He lived a long life, and a happy one to the\nend, despite the diﬃculties that he faced. Epicurus, in\nhis letters, advised that death is nothing to be afraid\nof as when we are here, death is not present, and when\ndeath is present, we do not exist [8].\nThe evaluation of an action based on the addition\nof the consequent punishments and rewards is not\nunique in the Epicurean philosophy. Plato had earlier\nsuggested much the same.\nIn Protagoras, Socrates\nargues:\n“Then your idea of evil is pain, and of good\nis pleasure.\nEven enjoying yourself you call\nevil whenever it leads to the loss of a pleasure\ngreater than its own, or lays up pains that\noutweigh its pleasures.” (Translation taken from\n[10])\nFurther in the text, however, Socrates claims that it\nis diﬃcult to measure good and evil, it requires a spe-\ncial skill, an art or science, and Protagoras agrees with\n2\nhim. This claim goes against the idea of Reinforcement\nLearning, where a naive agent can learn a task with a\ntrial and error approach (exploration/exploration).\nIn Reinforcement Learning, the reward function is\nformulated identical to the pleasure function we de-\nﬁned above for ﬁnite time. In the case of an inﬁnite\nseries of future rewards, it includes a discount factor\nas a mathematical necessity. The discount factor also\ncaptures the fact that an immediate reward is prefer-\nable to a future reward of the same size: we would\nrather have a million pounds now than in ﬁve years\ntime. I have not found the notion of discounting fu-\nture rewards in the Epicurean philosophy, and for this,\nthe pleasure function is deﬁned as a ﬁnite series. This\nsimpliﬁcation, however, does not aﬀect the importance\nof the Epicurean philosophy, which can be viewed as a\nsophisticated reward maximisation practice.\nWhy is Epicurus, with his progressive thinking, only\nat the corner of Raphael’s painting, and in the mind\nof most merely a hedonist? For one, most of his work\nis not available; what we know of him today is mainly\ndue to the letters he wrote (Letter to Herodotus, Me-\nnoeceus, Pythocles) [1, 2]. The proliﬁc writing of Plato\nand Aristotle also mesmerised academics and didn’t let\nmuch space for appreciation of the Epicurean philoso-\nphy available via limited sources. There may be one\nmore reason though; Plato with his theory of Ideas\n(Forms) and Aristotle with his notion of the ﬁnal cause\n[2] oﬀered a framework very much compatible with the\nexistence of a God.\nEpicurus with his Democritean\nview of the world did not impose Gods as an implicit\nyet strong necessity of his philosophy. On the contrary,\nhe believed that the soul died with the body and that\nhe could disprove the notion of afterlife [2].\nIs Epicurus the father of Reinforcement Learning?\nPerhaps most, including the author, would save the\nterm for Rich Sutton and Andy Barto who wrote\nthe bible of Reinforcement Learning [9].\nIndeed, in\nthe Epicurean philosophy there is no algorithmic\nprocedure for learning the action values similar to\nTemporal Diﬀerence Reinforcement Learning. Instead,\nthe Philosopher suggests to use reason and experience\n[11] to choose the best action in terms of immediate\nand future pleasure, avoiding these that can cause\ngreat “turmoil” in the future. In this sense, the Epi-\ncurean model does not include a suﬃciently detailed\nexploration/exploitation approach as in Reinforcement\nLearning, and yet it does state that sensation can be\nused to judge every good [8]. On the contrary, Plato\nconsiders the idea of knowing good and evil a diﬃcult\nmatter that requires specialised expertise [10], while\nAristotle, similar to Epicurus [11], appears to have\nembraced learning by trial and error [12] with his\nfollowing statement, loosely linked to Reinforcement\nLearning:\n“For the things we have to learn before\nwe can do them,\nwe learn by doing them”\n(Translation taken from [13]).\nAristotle, however, believed in an intrinsic teleology, ex-\nplaining nature and objects via the purpose that they\nserve. In the context of his Metaphysics [14], this idea\nmight suggest that brains have been designed for a spe-\nciﬁc purpose. To Aristotle, God is “the ultimate cause\nand explanation of rational change and order in nature”\n[14], while Epicurus explained physical phenomena in a\nproto-Darwinian way, as “a process of natural selection”\n[5], a truly advanced idea for his time. The Epicurean\nunderstanding of the world implies that brains have\nbeen evolved rather than designed to purpose.\nEpicurus’ view of pleasure appears to be tightly\nrelated to the concept of Dynamic Programming, a\nkey ingredient of Temporal Diﬀerence Reinforcement\nLearning. In particular, it reminds of the Bellman op-\ntimality equation, which determines that the unique,\noptimal policy of choosing actions is greedy (i.e., choose\nthe action with the highest Q-value) yet assumes that\nQ-values are known or can be explicitly calculated [9].\nAs such, the notion of the Reward function in Rein-\nforcement Learning, as a ﬁnite sum of present and fu-\nture rewards is perfectly and, perhaps, surprisingly cap-\ntured by the philosophy of Epicurus.\nAcknowledgements\nThe following text is largely based on my talk at the\nSheﬃeld Machine Learning Group Retreat, on the 2nd\nJune 2017. Reading again Ancient Greek Philosophy\nfor my own entertainment, I was astonished by the Epi-\ncurean view of pleasure, not quite what I was expect-\ning, and its close correspondence to the notion of the\nReinforcement Learning objective function. Following\na Google search, I was even more astonished that no-\nbody appeared to have made the link. Trapped in a\ncycle of urgent but non-important matters, I ended up\nwriting up the talk as a text a couple of months later,\nduring my summer vacation, which I further revised\nbased on the kind feedback of Professors L´ucia Specia,\nShimon Edelman and Neil Lawrence. I also thank Pro-\nfessor Lawrence for encouraging me to write this up in\nthe ﬁrst place, Professor Georg Struth for initial dis-\ncussions on Epicurean Philosophy and Dr Tom Schaul\nfor giving the thumps up. Special thanks to Professor\nAndy Barto for pointing out that Plato’s ideas were\nalso related to Reinforcement Learning, and for further\ndiscussions.\nReferences\n[1] Carlo Diano.\nEncyclopaedia Britannica.\nEncy-\nclopædia Britannica, Inc., 2010.\n[2] Edward N. Zalta, editor. The Stanford Encyclope-\ndia of Philosophy. The Metaphysics Research Lab,\nCenter for the Study of Language and Information,\nStanford University, 2012.\n[3] Diogenes Laertius. Lives of Eminent Philosophers,\nBook IX, Chapter VII Democritus. Charpentier,\nLibraire-Editeur, http://remacle.org, 1847.\n[4] Griton College. https://www.girton.cam.ac.uk.\n3\n[5] Tim\nO’Keefe.\nEpicurus.\nThe\nInternet\nEncyclopedia\nof\nPhilosophy,\nISSN\n2161-0002\nhttp://www.iep.utm.edu, 2017.\n[6] A. G. Barto. Intrinsically motivated learning in\nnatural and artiﬁcial systems, chapter Intrinsic\nmotivation and reinforcement learning. Springer\nBerlin Heidelberg, 2013.\n[7] Epicurus.\nLetter to menoeceus.\nReproduced\nin\nLives\nof\nEminent\nPhilosophers,\nBook\nX\nhttp://www.perseus.tufts.edu/.\n[8] Epicurus.\nLetter\nto\nmenoeceus.\nTrans-\nlated in English by The Philosophical Garden\nhttp://www.philosophicalgarden.com.\n[9] Richard S. Sutton and Andrew G. Barto. Introduc-\ntion to reinforcement learning. Cambridge: MIT\nPress, 1998.\n[10] Plato.\nProtagoras.\nThe Collected Dialogues of\nPlato. Pantheon Books, a Division of Random\nHouse Inc. NY, 1963.\n[11] Carl J. Richard. Twelve Greeks and Romans who\nChanged the World. Rowman & Littleﬁeld Pub-\nlishers, 2003.\n[12] W.K.C. Guthrie. A History of Greek Philosophy:\nVolume 6, Aristotle: An Encounter. Cambridge\nUniversity Press, 1981.\n[13] Aristotle. Nicomachean ethics. Translated in En-\nglish by W.D.Ross, http://classics.mit.edu.\n[14] Vasilis Politis.\nAristotle and the Mataphysics.\nRoutledge, 2004.\n4\n",
  "categories": [
    "cs.LG",
    "cs.AI",
    "stat.ML"
  ],
  "published": "2017-10-12",
  "updated": "2017-10-12"
}