{
  "id": "http://arxiv.org/abs/1807.02200v1",
  "title": "Natural Language Processing for Music Knowledge Discovery",
  "authors": [
    "Sergio Oramas",
    "Luis Espinosa-Anke",
    "Francisco Gómez",
    "Xavier Serra"
  ],
  "abstract": "Today, a massive amount of musical knowledge is stored in written form, with\ntestimonies dated as far back as several centuries ago. In this work, we\npresent different Natural Language Processing (NLP) approaches to harness the\npotential of these text collections for automatic music knowledge discovery,\ncovering different phases in a prototypical NLP pipeline, namely corpus\ncompilation, text-mining, information extraction, knowledge graph generation\nand sentiment analysis. Each of these approaches is presented alongside\ndifferent use cases (i.e., flamenco, Renaissance and popular music) where large\ncollections of documents are processed, and conclusions stemming from\ndata-driven analyses are presented and discussed.",
  "text": "Natural Language Processing for Music\nKnowledge Discovery\nSergio Oramas1, Luis Espinosa-Anke2, Francisco Gómez3, and\nXavier Serra1\n1Music Technology Group, Universitat Pompeu Fabra\n2School of Computer Science and Informatics, CardiﬀUniversity\n3Technical University of Madrid\n{sergio.oramas,xavier.serra}@upf.edu,\nespinosa-ankel@cardiﬀ.ac.uk, fmartin@etsisi.upm.es\nAbstract\nToday, a massive amount of musical knowledge is stored in written\nform, with testimonies dated as far back as several centuries ago.\nIn\nthis work, we present diﬀerent Natural Language Processing (NLP) ap-\nproaches to harness the potential of these text collections for automatic\nmusic knowledge discovery, covering diﬀerent phases in a prototypical\nNLP pipeline, namely corpus compilation, text-mining, information ex-\ntraction, knowledge graph generation and sentiment analysis.\nEach of\nthese approaches is presented alongside diﬀerent use cases (i.e., ﬂamenco,\nRenaissance and popular music) where large collections of documents are\nprocessed, and conclusions stemming from data-driven analyses are pre-\nsented and discussed.\nKeywords Musicology, Natural Language Processing, Information Extrac-\ntion, Entity Linking, Sentiment Analysis\n1\nIntroduction\nOne of the main tasks carried out in musicology is the development and valida-\ntion of musical hypotheses. The seed that usually leads to most research involves\nlooking for relevant information in written documents, which in general are or-\nganized as compilations, collections or anthologies. Today, it is unsurprising\nto ﬁnd many of these collections stored in digitized machine-readable format,\na scenario which has signiﬁed a great improvement on the way information is\naccessed. These digitized collections are mostly stored in digital libraries and\nmanaged by information systems where documents can be searched by textual\nkeywords.\nThis improvement has increased signiﬁcantly the possibilities for\n1\narXiv:1807.02200v1  [cs.CL]  6 Jul 2018\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nmusicologists to access information. However, in these infrastructures the un-\nderlying semantics in the textual content of each document are not captured by\nsearch engines, which usually operate at an exact text string matching level, and\ntherefore in the majority of cases do not take full advantage of the sophisticated\nprocessing tools that semantic search puts at our disposal. In this context, and\nin order to capture the subtle nuances in musical meaning and thus improving\nmusicological research, we argue that it is not enough to put text corpora on-\nline and make them searchable. Indeed, there still remains the important and\ndiﬃcult task to transform text collections, from searchable repositories, into\nknowledge environments, in what can be seen as the next step in the evolution\nof digital libraries (Fast & Sedig, 2011).\nThis limitation coexists with an opportunity derived from the quick growth\nrate at which online content is generated. Today, speciﬁcally in the music do-\nmain, we have at our disposal vast amounts of knowledge, gathered for centuries\nby musicologists and music enthusiasts and made accessible by various agents.\nMost of this knowledge is encoded in artist biographies, reviews, facsimile edi-\ntions, and other written media. The constant production of this music-related\ntextual information results in large repositories of knowledge, which have great\npotential for musicological and philological studies. However, since most of it is\nrecorded in natural language, processing and analyzing them eﬀectively is a dif-\nﬁcult task. We claim, however, that by leveraging Natural Language Processing\n(NLP) techniques, it is possible to unveil relevant information hidden in large\ndomain-speciﬁc document collections, which would otherwise remain hidden.\nFortunately, targeting NLP techniques to text corpora in the music domain\nhas been the main focus of several works so far (Oramas, Espinosa-Anke, Sordo,\net al., 2016b; Tata & Di Eugenio, 2010; Oramas, Ostuni, et al., 2016; Sutcliﬀe\net al., 2015; Knees & Schedl, 2011; Sordo et al., 2012; Fujinaga & Weiss, 2016).\nThese and other contributions report experimental results of the application\nof intelligent text processing techniques to music-speciﬁc document collections.\nIn addition, many of the upshots of these methods consist in large structured\ndatabases containing musical and musicological information, which can provide\nsearch engines with much richer and ﬁne-grained information about musicians,\ntheir life and work, and even their relation with other musical entities (mu-\nsicians, record labels, venues, and so forth). Conversely, information already\nstructured in online knowledge repositories has also been exploited in the context\nof Computational Musicology. For example, a noteworthy example is provided\nin Crawford et al. (2014), where musicologists are provided with a means to cre-\nate a linked and extensible knowledge structure over a collection of Early Music\nmetadata and facsimile images. In Rose & Tuppen (2014), seven big datasets\nof musical and biographical metadata are aligned, showing how analysis and vi-\nsualization of such data might transform musicological understanding. Despite\nthese valuable contributions, scant musicological research has been carried out\nregarding the speciﬁc challenge of processing text collections.\nWe propose to speciﬁcally address the above challenge by presenting con-\ncrete methodologies aimed at exploring large musicological text corpora. With\nthese methodologies we reconcile, on one the hand, intelligent text processing\n2\nS. Oramas et al.\nNLP for Music Knowledge Discovery\ntechniques, and on the other, musical knowledge acquired both from structured\nand unstructured resources. First, we distill methods for gathering and com-\nbining information coming from diﬀerent sources. The textual data used in our\nexperiments comes in diﬀerent ﬂavors, namely (1) A knowledge base of ﬂamenco\nmusic; (2) A corpus of biographies from artists of the Renaissance period; and\n(3) A dataset of music album reviews of diverse genres.\nThe underlying knowledge expressed in these corpora is thus extracted ap-\nplying diﬀerent NLP pipelines. First, shallow text-mining processing techniques\nare applied to understand main trends in the diﬀerent schools of the Renaissance\nperiod. Second, Information Extraction (IE) techniques constitute the method-\nological basis for populating a novel fully automatic ﬂamenco knowledge base,\nand to analogously study migratory tendencies and the role of diﬀerent Eu-\nropean capitals along the Renaissance period. Third, a methodology for the\ncreation of a knowledge graph from a set of unstructured text documents is\nproposed and evaluated from diﬀerent standpoints. We further show a direct\napplication of this knowledge graph in automatically computing the ranked rel-\nevance of a given artist in the ﬂamenco and Renaissance corpora. Finally, we\npresent an approach for capturing the sentiment expressed in text. Using senti-\nmental information as a starting point, we provide a diachronic study of music\ncriticism via a quantitative analysis of the polarity associated to music album\nreviews gathered from Amazon1. Our analysis hints at a potential correlation\nbetween key cultural and geopolitical events and the language and evolving\nsentiment found in music reviews and, ultimately, opens exciting avenues for\ndiachronic studies of music genres.\nThis paper is an extended version of two previous publications (Oramas,\nGómez, et al., 2015; Oramas, Espinosa-Anke, Lawlor, & Others, 2016) , with\nthe main novel contributions being the uniﬁcation of approaches, the addition\nof more detailed results, and the introduction of an additional use case based\non the study of the Renaissance Music period. The remainder of this paper is\norganized as follows. First, in Section 2, we describe the processes of gather-\ning and combining information from diﬀerent data sources, and apply it to the\ngathering of the three text corpora used throughout the paper: ﬂamenco music,\nRenaissance artists, and albums reviews. Then, in Section 3, a text-mining ap-\nproach based on word frequencies is described and applied to study the diﬀerent\nmusic schools of the Renaissance period. Next, in Section 4, an information ex-\ntraction pipeline for the extraction of biographical information is exposed and\napplied to populate a ﬂamenco knowledge base and to study the Renaissance\nperiod. Later, in Section 5, an approach for the creation of knowledge graphs is\npresented and used to compute a relevance ranking of ﬂamenco and Renaissance\nartists. In Section 6, an aspect-based sentiment analysis method is deﬁned and\napplied to describe how sentiment associated with music reviews changes over\ntime. Following this method, two experiments are performed, one aggregating\nsentiment scores by review publication year, and other by album publication\nyear. Finally, we conclude with a discussion about our ﬁndings (Section 7).\n1http://www.amazon.com\n3\nS. Oramas et al.\nNLP for Music Knowledge Discovery\n2\nCollecting text corpora\nGathering, structuring, and connecting data from diﬀerent sources is a research\nproblem in itself, where diﬀerent and major challenges may arise. Although\nsome existing repositories with music information, such as Wikipedia2, Oxford\nMusic Online3, or MusicBrainz4 are quite complete and accurate, there is still\na vast amount of music information out there that is generally scattered across\ndiﬀerent sources on the Web. Selecting the sources and harvesting and combin-\ning data is a crucial step towards the creation of practical and meaningful music\nresearch corpora (Oramas, 2014)\nIn this work, three diﬀerent datasets are built as testbeds of our knowledge\nextraction methodologies. First, we illustrate in detail a methodology for select-\ning and mixing data coming from diﬀerent sources in the creation of a ﬂamenco\nmusic knowledge base. Then, we apply some of the described approaches to col-\nlect a corpus of artist’s biographies about Renaissance artists and a collection of\nmusic album reviews and metadata. In what follows we describe the gathered\ncorpora and the processes carried on for their compilation.\n2.1\nThe ﬂamenco corpus\nIn this section, we describe the methodology used for the creation of a knowledge\nbase of ﬂamenco music. To this end, a large amount of information is gathered\nfrom diﬀerent data sources, and further combined by applying a process of pair-\nwise entity resolution.\n2.1.1\nFlamenco music overview\nSeveral musical traditions contributed to the genesis of ﬂamenco music as we\nknow it today. Among them, the inﬂuences of the Jews, Arabs, and Spanish\nfolk music are recognizable, but indubitably the imprint of Andalusian Gypsies’\nculture is deeply ingrained in ﬂamenco music. The main components of ﬂa-\nmenco music are: cante or singing, toque or guitar playing, and baile or dance.\nAccording to Gamboa (2005), ﬂamenco music grew out of the singing tradition,\nas a melting process of all the traditions mentioned above, and therefore the\nrole of the singer soon became dominant and fundamental. Toque is subordi-\nnated to cante, especially in more traditional settings, whereas baile enjoys more\nindependence from voice.\nIn the ﬂamenco jargon, styles are called palos. Criteria adopted to deﬁne\nﬂamenco palos are rhythmic patterns, chord progressions, lyrics, poetic struc-\nture, and geographical origin. In ﬂamenco, geographical variation is important\nto classify cantes as often they are associated to a particular region where they\nwere originated or where they are performed with gusto. Rhythm or compás is\na unique feature of ﬂamenco. Rhythmic patterns based on 12-beat cycles are\n2http://wikipedia.org\n3http://www.oxfordmusiconline.com/\n4http://musicbrainz.org\n4\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nFigure 1: Selected data sources\nmainly used. Those patterns can be classed as follows: binary patterns, such as\ntangos or tientos; ternary patterns, which are the most common ones, such as\nfandangos or bulerías; mixed patterns, where ternary and binary patterns al-\nternate, such as guajira; free-form, where there is no a clear underlying rhythm,\nsuch as tonás. For further information on fundamental aspects of ﬂamenco mu-\nsic, see the book Fernández (2004). For a comprehensive study of styles, musical\nforms and history of ﬂamenco the reader is referred to the books of Blas Vega\n& Ríos Ruiz (1988), Navarro & Ropero (1995), and Gamboa (2005), and the\nreferences therein.\n2.1.2\nData acquisition\nOur aim is to gather an important amount of information about musical entities\n(e.g. artists, recordings), including textual descriptions and available metadata.\nA schema of the selected data sources is shown in Figure 1. We started by\nlooking at Wikipedia. Each Wikipedia article may have a set of associated cat-\negories. Categories are intended to group together pages on similar subjects\nand are structured in a taxonomical way. To ﬁnd Wikipedia articles related to\nﬂamenco music, we ﬁrst looked for ﬂamenco categories. The taxonomy of cate-\ngories can be explored by querying DBpedia, a knowledge base with structured\ncontent extracted from Wikipedia. We queried the Spanish version of DBpe-\ndia5 for categories related to ﬂamenco. We obtained 17 diﬀerent categories (e.g.,\ncantaores de ﬂamenco, guitarristas de ﬂamenco).\nWe gathered all DBpedia resources related to at least one of these categories.\nWe obtained a total number of 438 resources in Spanish, of which 281 were also\nin English. Each DBpedia resource is associated with a Wikipedia article. Text\nand HTML code were then extracted from Wikipedia articles in English and\nSpanish. Next, we classiﬁed the extracted articles according to the role of the\nbiography subject (i.e., cantaor, guitarist, and bailaor). For this purpose, we\n5http://es.dbpedia.org\n5\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nexploited classiﬁcation information provided by DBpedia (DBpedia types and\nWikipedia categories). At the end, from all gathered resources, we only kept\nthose related to artists and palos, totaling 291 artists and 56 palos.\nAs the amount of information present in Wikipedia related to ﬂamenco music\nis somewhat scarce, we decided to expand our knowledge base with information\nfrom two diﬀerent websites. First, Andalucia.org, the touristic web from the An-\ndalusia Government6. It contains 422 artist biographies in English and Spanish,\nand the description of 76 palos also in both languages. Second, a website called\nEl arte de vivir el ﬂamenco7, which includes 749 artist biographies among can-\ntaores, bailaores and guitarists.\nWe used MusicBrainz to ﬁll our knowledge base with information about ﬂa-\nmenco album releases and recordings. For every artist mapped to MusicBrainz,\nall content related to releases and recordings was gathered. Thus, 814 releases\nand 9,942 recordings were collected.\nThe information gathered from MusicBrainz is a small part of the actual ﬂa-\nmenco discography. Therefore, to complement it we used a ﬂamenco recordings\ndatabase gathered by Rafael Infante and available at CICA website8 (Comput-\ning and Scientiﬁc Center of Andalusia). This database has information about\nreleases from the early time of recordings until present time, counting 2,099\nreleases and 4,136 songs. For every song entry, a cantaor name is provided,\nand most of the times also guitarist and palo, which is an important piece of\ninformation to deﬁne ﬂamenco recordings.\nFinally, we supplied our knowledge base with information related to An-\ndalusian towns and provinces. We gathered this information from the oﬃcial\ndatabase SIMA9 (Multi-territorial System of Information of Andalusia).\n2.1.3\nEntity resolution\nEntity resolution is the problem of extracting, matching and resolving entity\nmentions in structured and unstructured data (Getoor, 2012). There are sev-\neral approaches to tackle the entity resolution problem. For the scope of this\nresearch, we selected a pair-wise classiﬁcation approach based on string similar-\nity between entity labels.\nThe ﬁrst issue after gathering the data is to decide whether two entities\nfrom diﬀerent sources are referring to the same one. Therefore, given two sets\nof entities A and B, the objective is to deﬁne an injective and non-surjective\nmapping function f between A and B that decides whether an entity a ∈A is\nthe same as an entity b ∈B. To do that, a string similarity metric sim(a, b)\nbased on the Ratcliﬀ-Obershelp algorithm (Ratcliﬀ& Metzener, 1988) has been\napplied. It measures the similarity between two entity labels and outputs a\nvalue between 0 and 1. We consider that a and b are the same entity if their\nsimilarity is bigger than a parameter θ. If there are two entities b, c ∈B that\n6http://andalucia.org\n7http://www.elartedevivirelflamenco.com/\n8http://flun.cica.es/index.php/grabaciones\n9http://www.juntadeandalucia.es/institutodeestadisticaycartografia/sima\n6\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nFigure 2: F-measure for diﬀerent values of θ\nsatisfy that sim(a, b) ≥θ and sim(a, c) ≥θ, we consider only the mapping\nwith the highest score.\nTo determine the value of θ, we tested the method\nwith several θ values over an annotated dataset of entity pairs. To create this\ndataset, the 291 artists gathered from Wikipedia were manually mapped to the\n422 artists gathered from Andalucia.org, obtaining a total amount of 120 pair\nmatches. As it is shown in Figure 2 the best F-measure (0,97) was obtained\nwith θ = 0.9. Finally, we applied the described method with θ = 0.9 to all\ngathered entities from the three data sources. Thanks to the entity resolution\nprocess, we reduced the initial set of 1,462 artists and 132 palos to a set of 1,174\nartists and 76 palos.\nOnce we had our artist entities resolved, we began to gather their related\ndiscography. First, we tried to ﬁnd out the MusicBrainz ID of the gathered\nartists. Depending on the information about the entity, two diﬀerent processes\nwere applied. First, we leveraged mapping information between Wikipedia and\nMusicBrainz present in Wikidata10 (Vrandečić & Krötzsch, 2014). Wikidata is\na free linked database, which acts as a structured data storage of Wikipedia.\nFor those artists without this mapping information, we queried the MusicBrainz\nAPI, and then applied our entity resolution method to the obtained results.\nFinally, to integrate the discography database of CICA into our knowledge\nbase, we applied the entity resolution method to the ﬁelds cantaor, guitarist\nand palo of each recording entry in the database. From the set of 202 cantaores\nand 157 guitarist names present in the recording entries of the database, a total\nnumber of 78 cantaores and 44 guitarists were mapped to our knowledge base.\nThe number of mapped artists was low due to diﬀerences between the way of\nlabeling an artist. An artist name may be written by using one or two of her\nsurnames, or by using her nickname. In the case of palos, there were 162 diﬀerent\npalos in the database, 54 of which were mapped with the 76 of our knowledge\nbase. These 54 palos correspond to an 80% of palo assignments present in the\nrecording entries.\n2.1.4\nFlaBase\nFlaBase (Flamenco Knowledge Base) is the acronym of the resulting knowledge\nbase of ﬂamenco music. It contains online editorial, biographical and musicolog-\n10https://www.wikidata.org\n7\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nFigure 3: Songs by palo\nical information related to ﬂamenco music. FlaBase is stored in JSON format,\nand it is freely available for download11. FlaBase contains information about\n1,174 artists, 76 palos (ﬂamenco genres), 2,913 albums, 14,078 tracks, and 771\nAndalusian locations. In Figure 3 it is shown that the most representative pa-\nlos in ﬂamenco music are represented in our knowledge base, with a higher\npredominance of fandangos.\n2.2\nThe Renaissance corpus\nRenaissance is a period in history that starts around 1400 with the end of the\nmedieval era, and closes around 1600, with the beginning of the Baroque period.\nRenaissance music refers to music written in Europe during this period.\nIn this work we experimented with two datasets of biographies about Re-\nnaissance composers, one gathered from Wikipedia, and another from The New\nGrove(Sadie, 2001), available through Oxford Music Online.\n2.2.1\nThe Wikipedia corpus\nIn Wikipedia there is an important number of articles related to Renaissance\nmusic, most of them biographies of composers. For this research, we compiled\nthe biographies of all composers that are linked in the Wikipedia page: List of\nRenaissance composers 12. In this page, composers are classiﬁed by school. We\ncollected biographies of composers from the ﬁve most representative schools:\nSpanish, German, English, Franco-Flemish, and Italian. A total number of 543\nbiographies were gathered. In addition to the biography texts, HTML links to\nother Wikipedia pages present in texts were also stored.\n11http://mtg.upf.edu/download/datasets/flabase\n12https://en.wikipedia.org/wiki/List_of_Renaissance_composers\n8\nS. Oramas et al.\nNLP for Music Knowledge Discovery\n2.2.2\nThe Grove corpus\nThe Grove Dictionary of Music and Musicians (Grove, 1878) is an encyclopedic\ndictionary, and one of the largest reference works in Western music. It was ﬁrst\npublished in four volumes in the last quarter of the XIX century by George\nGrove. In 1980 a new version called The New Grove (Sadie, 2001) was released\nwith 20 volumes, where there are 22,500 articles and 16,500 biographies. The\ncomplete text of the second edition of The New Grove is available in machine-\nreadable format on the online service Oxford Music Online as Grove Music\nOnline. From this set of biographies, we gathered all of them classiﬁed as Early\nRenaissance and Late Renaissance. A total number of 1710 biographies were\ncollected.\n2.3\nThe albums reviews corpus\nIn this section, we put forward an integration procedure for enriching with\nmusic-related information a large dataset of Amazon customer reviews McAuley\net al. (2015), with semantic metadata obtained from MusicBrainz. The initial\ndataset of Amazon customer reviews provides millions of review texts together\nwith additional information such as overall rating (between 0 to 5), date of\npublication, or creator id. Each review is associated to a product and, for each\nproduct, additional metadata is also provided, namely, Amazon product id, list\nof similar products, price, sell rank, and genre categories.\nFrom this initial\ndataset, we selected the subset of products categorized as CDs & Vinyls, which\nalso fulﬁll the following criteria. First, considering that the Amazon taxonomy\nof music genres contains 27 labels in the ﬁrst hierarchy level, and about 500 in\ntotal, we obtain a music-relevant subset and select 16 of the 27 which really de-\nﬁne a music style and discard for instance region categories (e.g., World Music)\nand other categories speciﬁcally non-related to a music style (e.g., Soundtrack,\nMiscellaneous, Special Interest), function-oriented categories (Karaoke, Holiday\n& Wedding), or categories whose albums might also be found under other cat-\negories (e.g., Opera & Classical Vocal, Broadway & Vocalists). We compiled\nalbums belonging only to one of the 16 selected categories, i.e., no multi-label.\nNote that the original dataset contains not only reviews about CDs and Vinyls,\nbut also about music DVDs and VHSs. Since these are not strictly speaking\nmusic audio products, we ﬁlter out those products also classiﬁed as \"Movies &\nTV\". Finally, since products classiﬁed as Classical and Pop are substantially\nmore frequent in the original dataset, we compensate this unbalance by limiting\nthe number of albums of any genre to 10,000.\nAfter this preprocessing, the\ndataset amounts to a total of 65,566 albums and 263,525 customer reviews. A\nbreakdown of the number of albums per genre is provided in Table 1. The ﬁnal\ndataset is called the Multimodal Album Reviews Dataset (MARD) and is freely\navailable for download13.\nHaving performed genre ﬁltering, we enrich the dataset by extracting artist\nnames and record labels from the Amazon product page. We pivot over this\n13https://www.upf.edu/web/mtg/mard\n9\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nGenre\nAmazon\nMusicBrainz\nAlternative Rock\n2,674\n1,696\nReggae\n509\n260\nClassical\n10,000\n2,197\nR&B\n2,114\n2,950\nCountry\n2,771\n1,032\nJazz\n6,890\n2,990\nMetal\n1,785\n1,294\nPop\n10,000\n4,422\nNew Age\n2,656\n638\nDance & Electronic\n5,106\n899\nRap & Hip-Hop\n1,679\n768\nLatin Music\n7,924\n3,237\nRock\n7,315\n4,100\nGospel\n900\n274\nBlues\n1,158\n448\nFolk\n2,085\n848\nTotal\n66,566\n28,053\nTable 1: Number of albums by genre with information from the diﬀerent sources\nin the albums reviews dataset.\ninformation to query the MusicBrainz search API to gather additional metadata\nsuch as release id, ﬁrst release date, song titles and song ids. Mapping with Mu-\nsicBrainz is performed using the same methodology described in Section 2.1.3,\nfollowing a pair-wise entity resolution approach based on string similarity with\na threshold value of θ = 0.85. We successfully mapped 28,053 albums to Mu-\nsicBrainz.\n3\nText-mining\nText-mining is the process of deriving high-quality information from text. This\nhigh-quality information is typically derived through the devising of patterns\nand trends using statistical analysis over text. Many text-mining techniques\nare based on the analysis of frequencies of the words present in the set of stud-\nied documents. In what follows, we illustrate the potential of this technique\nwith a simple application to the analysis of word frequencies in our corpus of\nRenaissance artist’s biographies.\n3.1\nRenaissance music schools\nThe computational analysis of artist biographies may reveal interesting insights\nfrom the data that can be useful to musicologists. Using the Renaissance artist’s\nbiographies gathered from Wikipedia (see Section 2.2.1), we applied a shallow\nanalysis of the words used in the articles. We computed the frequencies of all\n10\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nwords present in the articles of every school. From the obtained frequencies we\nplot a word cloud for each school, where more frequent words are represented\nwith bigger fonts.\nIn Figure 4, the word clouds of the diﬀerent schools are\nshown. We observe very clear insights from the images at ﬁrst sight. We see,\nfor instance, how madrigal is very important in the Italian, chanson in the\nFrench, and motet in the Franco-Flemish school. We also see the importance of\nthe Church in the Spanish school, or the relevance of organ music in the German\nschool. Although these observations may seem obvious to a musicologist, they\nare extracted directly from the data without human intervention. This approach\ncan be applied to text corpora the researcher might not be familiar with, helping\nher in easily discovering some trends directly from the data.\n(a) Spanish\n(b) Italian\n(c) English\n(d) Franco-Flemish\n(e) French\n(f) German\nFigure 4: Word clouds by school from Wikipedia biographies.\n11\nS. Oramas et al.\nNLP for Music Knowledge Discovery\n4\nInformation Extraction\nInformation extraction is the task of automatically extracting structured infor-\nmation from unstructured or semi-structured text sources. It is a widely studied\ntopic within the NLP research community (Cowie & Lehnert, 1996). A major\nstep towards understanding language is the extraction of meaningful terms (en-\ntities) from text as well as relationships between those entities. This statement\ninvolves two diﬀerent tasks. First, the identiﬁcation and categorization of entity\nmentions. This task is called named entity recognition (NER). However, when\nthis task involves a latter step of disambiguation of entities against a knowledge\nbase it is called named entity disambiguation or entity linking (EL). The second\ntask consists of the identiﬁcation of relevant semantic relations or attributes\nassociated to these entities.\n4.1\nEntity linking\nThe advent of large knowledge repositories and collaborative resources has con-\ntributed to the emergence of entity linking, i.e., the task of discovering mentions\nof entities in text and link them to a suitable knowledge repository (Moro et al.,\n2014). It encompasses similar subtasks such as named entity disambiguation\n(Bunescu & Pasca, 2006), which is precisely linking mentions of entities to a\nknowledge base, or wikiﬁcation (Mihalcea & Csomai, 2007), speciﬁcally using\nWikipedia as knowledge base.\nEntity linking is typically divided in two steps, namely, the identiﬁcation\nof a text span from the text as an entity candidate, and the disambiguation\nof this entity with respect to a knowledge base. This disambiguation step can\nbe directly applied to the surface form of the identiﬁed text span, or to the\noutput of a NER system previously applied. The biggest diﬀerence here is that\nthe NER system not only identiﬁes the text span, but also provides a category\nthat classify the identiﬁed candidate. We propose a method that employs a\ncombination of both approaches, depending on the category of the entity. For\nNER, we used the Stanford NER system (Finkel et al., 2005), implemented in\nthe library Stanford Core NLP14 and trained on English and Spanish texts. For\ndisambiguation we simply looked for exact string matches between entity labels\nin the knowledge base and identiﬁed text spans.\n4.2\nStudying the ﬂamenco corpus\n4.2.1\nLinking entities in the ﬂamenco corpus\nAs the gathered ﬂamenco texts are mostly written in Spanish, we needed an\nentity linking system that deals with Spanish texts. Although there are many\nentity linking tools available, state-of-the-art systems are well-tuned for English\ntexts, but may not perform as well in languages other than English, and even\nless with music related texts (Oramas, Espinosa-Anke, Sordo, et al., 2016a). In\n14http://nlp.stanford.edu/software/corenlp.shtml\n12\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nApproach\nPrecision\nRecall\nF-measure\n1) no NER\n0.829\n0.694\n0.756\n2) NER to PERS & LOC\n0.739\n0.347\n0.472\n3) NER to LOC\n0.892\n0.674\n0.767\nTable 2: Precision, Recall and F-measure of entity linking approaches.\naddition, we wanted to have a system that uses our own knowledge base for dis-\nambiguation. Therefore, we developed our own system, which is able to detect\nand disambiguate three categories of entities: Person, Palo and Location. Three\ndiﬀerent approaches for the selection of annotation candidates were deﬁned by\napplying NER only on a subset of the categories of entities: only using text\nspans (no NER) for disambiguation; disambiguating Location and Person enti-\nties from the NER output, and Palo from text spans; and only disambiguating\nLocation entities from the NER output, and Person and Palo directly from text\nspans.\nTo determine which approach performs better, three artist biographies were\nmanually annotated, having a total number of 49 annotated entities. Results\non the diﬀerent approaches are shown in Table 2. We observe that applying\nNER to entities of the Person category worsens performance signiﬁcantly, as\nrecall suddenly decreases by half. After manually analyzing false negatives, we\nobserved that this is caused because many artist names have deﬁnite articles\nbetween name and surname (e.g., de, del), and this is not recognized correctly\nby the NER system. In addition, many artists have a nickname that is not\ninterpreted as a Person entity by the NER system. The best approach is the\nthird one (NER to LOC), where NER output is used only for Locations, which\nis slightly better than the ﬁrst one (no NER) in terms of precision. This is due\nto the fact that many artists have a town name as a surname or as part of his\nor her nickname. Therefore, applying entity linking directly to text spans is\nmisclassifying Person entities as Location entities. Thus, by adding a previous\nstep of NER to Location entities we have increased the overall performance, as\nit can be seen on the F-measure values.\n4.2.2\nExtracting biographical data\nWhile the created knowledge base of ﬂamenco does already encode relevant\nculture and music-speciﬁc information, a notable portion of the data collected\ncurrently remains unexploited due to its unstructured nature. Consequently,\nto enhance the amount of structured data, a process of information extraction\nis carried out. We focus on extracting two speciﬁc pieces of information from\nthe artist biographies: birth year and birth place, as they can be relevant for\nanthropological studies. We observed that this information is often in the ﬁrst\nsentences of the biographies, and always near the word nació (Spanish trans-\nlation of \"was born\"). Therefore, to extract this information, we look for this\nword in the ﬁrst 250 characters of every biographical text. If it is found, we\n13\nS. Oramas et al.\nNLP for Music Knowledge Discovery\n(a) Artists by province of birth\n(b) Artists by decade of birth\nFigure 5: FlaBase distributions.\napply our entity linking method to this piece of text. If a Location entity is\nfound near the word \"nació\", we assume that this entity is the place of birth\nof the biography subject. In addition, by using regular expressions, we look for\nthe presence of a year expression in the context of the Location entity. If it is\nfound, we assume it as the year of birth. If more than one year is found, we\nselect the one with the smaller value.\nTo evaluate our approach, we tested the extraction of birth places in all\ntexts coming from the web Andalucia.org (442 artists). We manually annotated\nthe province of provenance of these 442 artists for building ground truth data.\nAfter the application of the extraction process on the annotated test set, we\nobtained a precision value of 0.922 and a recall of 0.648. Therefore, we may\nargue that our method is extracting biographic information with high precision\nand quite reasonable recall.\nWe ﬁnally applied the extraction process to all\nartist entities with biographical texts. Thus, 743 birth places and 879 birth\nyears were extracted.\nUsing the information extracted, we computed the distribution of diﬀerent\nitems present in FlaBase. Data shown in Figures 5a and 5b was obtained thanks\nto the information extraction process applied. We can observe in Figure 5a that\nmost ﬂamenco artists are from the Andalusian provinces of Seville and Cadiz.\nFinally, in Figure 5b we observe a higher number of artists in the data were\nborn from the 30’s to the 80’s of the 20th century.\n4.3\nStudying the Renaissance period\nTo study the Renaissance period, we applied a process of information extraction\nsimilar to the one described above for the ﬂamenco corpus. Thus, we extracted\nbiographical data from the artist biographies in the Grove corpus. We observed\nin this corpus that at the beginning of every biography there is a sentence be-\ntween parentheses with information about the place and date of birth and death.\nTherefore, we automatically extracted this information using the same ad-hoc\nentity linking system and regular expressions used to extract information from\nthe ﬂamenco corpus. Using the extracted data, we ﬁrst plotted the histograms\nof the distributions of birth and death dates (Figures 6a and 6b. As observed\n14\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nCity\nBirths\nDeaths\nDiﬀerence\nFlorence\n25\n26\n+4%\nBrescia\n18\n5\n-72%\nParma\n15\n10\n-33%\nNuremberg\n15\n17\n+13%\nBologna\n15\n13\n-13%\nTable 3: Top cities by number of births, extracted from the Grove dataset.\nCity\nBirths\nDeaths\nDiﬀerence\nRome\n9\n59\n+555%\nLondon\n7\n39\n+457%\nParis\n6\n32\n+433%\nVenice\n11\n29\n+164%\nFlorence\n25\n26\n+4%\nTable 4: Top cities by number of deaths, extracted from the Grove dataset.\nin Figures 6a and 6b, most Renaissance composers were born in the ﬁrst half\nof the XVI century, and died at the beginning of the XVII century. This image\ngives as a simple overview of the activity in the period.\n(a) Births\n(b) Deaths\nFigure 6: Distribution of birth and death dates.\nUsing the extracted places of birth and death, we also computed the dif-\nference between cities in number of births and deaths. We observe in Table 3\nthat Brescia and Parma are cities where many relevant composers were born,\nbut few died. This perhaps implies a good educational environment in music,\nbut less career opportunities for those composers. By contrast, we observe in\nTable 4 how big cities like Rome, London, Paris, or Venice are attractors of\ntalent, with much larger number of deaths than births. Florence in contrast,\ntypically considered as the cradle of the Renaissance, has a similar number of\nbirths and deaths.\n15\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nCity\nMedian year\nNuremberg\n1563\nParis\n1569\nVenice\n1576\nRome\n1594\nFlorence\n1597\nLondon\n1610\nTable 5: Median of the distribution of deaths by city.\nFinally, we computed the median of the distribution of death years by city\nof those with larger number of deaths. This data may be useful to observe when\na city was in the middle of his success as an attractor of musical talent. In\nTable 5, we observe how the gravity center of Renaissance music moves from\nNuremberg and Paris to Venice, Florence, and Rome, and ﬁnally to London.\nAgain, this result may be very illustrative as a ﬁrst impression of this musical\nperiod.\n5\nKnowledge graph construction\nWe assume that an entity mention inside an artist biography signals a semantic\nrelation between the entity that constitutes the main theme of the biography\n(subject entity) and the mentioned entity. Based on this assumption, we build a\nsemantic graph by applying the following steps. First, each artist in the corpus\nis added to the graph as a node. Second, entity linking is applied to artist’s\nbiographical texts. For every linked entity identiﬁed in the biography, a new\nnode is created in the graph (only if it was not previously created). Next, an\nedge is added, connecting the subject entity with the linked entity found in its\nbiography. This way, a directed graph connecting the entities of the text corpus\nis obtained.\nThis graph may have multiple applications. It may be exploited to compute\nsimilarity measures between artists, as explored in Oramas, Sordo, et al. (2015),\nor it may provide a data structure well suited to the implementation of graphical\nnavigational systems throughout the collection of documents, as explored in\nOramas et al. (2014).\nIn this work, we explore a diﬀerent application: the\nmeasurement artist relevance.\n5.1\nArtists relevance\nEntities identiﬁed in a text by an entity linking system may be seen as hy-\nperlinks that connects one text to another. Thus, algorithms to measure the\nrelevance of nodes in a network of hyperlinks can be applied to our semantic\ngraph (Bellomi & Bonato, 2005). Hence, a knowledge graph constructed with\nthe proposed methodology represents a network of hyperlinks that connect the\ndiﬀerent documents in the corpus. In order to measure artist relevance in our\n16\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nconstructed graph, we applied the PageRank (Brin & Page, 1998) and HITS\n(Kleinberg, 1999) algorithms.\nPageRank outputs a measure of relevance for\neach node, and HITS gives two diﬀerent results: authority and hubness. We\nonly take into consideration authority from HITS algorithm because it has been\nproven to be the most eﬀective of both values as a metric of relevancy (Bellomi\n& Bonato, 2005).\n5.1.1\nFlamenco artists\nFollowing the proposed methodology for the creation of a knowledge graph, we\ncreated a graph of ﬂamenco artists after its application to the corpus of artist\nbiographies gathered in FlaBase. We applied the entity linking system described\nin Section 4.1 and then constructed the graph. In this case, we also added other\nattributes present in FlaBase to the graph, such as the extracted attributes and\nthe recordings associated to each artist. Once the graph was built, we applied\nthe PageRank and HITS algorithms and built an ordered list with the top-10\nentities of the diﬀerent artist categories (cantaor, guitarist and bailaor) for each\nof the algorithms.\nFor evaluation purposes, we asked a reputed ﬂamenco expert to build a list\nof top-10 artists for each category according to his knowledge and the available\nbibliography. The concept of artist relevance is somehow subjective and there\nis no uniﬁed or consensual criterion for ﬂamenco experts about who the most\nrelevant artists of all time are. Despite that, there is a high level of agreement\namong them on certain artists that should be on such a hypothetical list, based\non their inﬂuence in the evolution of the genre. Thus, after consulting several\ndocumented sources and other ﬂamenco experts, our expert provided us with\nthis list of consensual top-10 artists by category and we considered it as ground\ntruth.\nWe deﬁne precision as the number of identiﬁed artists in the resulting list\nthat are also present in the ground truth list divided by the length of the list.\nWe evaluated the output of the two algorithms by calculating precision over the\nentire list (top-10), and over the ﬁrst ﬁve elements (top-5) (see Table 6). We can\nobserve that PageRank results show the greatest agreement with the ﬂamenco\nexperts list. High values of precision, especially for the top-5 list, indicates that\nthe information in the knowledge graph is highly complete and accurate, and\nthe proposed methodology adequate to compute relevance of artists. In Table 7\nthe top-5 artists in each category obtained with the PageRank algorithm are\nshown. It is clear that this approach tend to favor ancient artists that have\nmore probabilities of have been mentioned in other biographies. Therefore, we\nunderstand in this case artist relevance as a measure directly tied to the inﬂuence\nof the artist in the evolution of the genre.\n5.1.2\nRenaissance artists\nWe followed two diﬀerent strategies for knowledge graph construction for the\ntwo datasets of Renaissance artist biographies. For the Wikipedia corpus, we\n17\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nTop-5\nTop-10\nPageRank\n0.933\n0.633\nHITS Authority\n0.6\n0.4\nTable 6: Precision values of artist relevance ranking.\nCantaor\nGuitarist\nBailaor\nAntonio Mairena\nPaco de Lucía\nAntonio Ruiz Soler\nManolo Caracol\nRamón Montoya\nRosario\nLa Niña de los Peines\nNiño Ricardo\nAntonio Gades\nAntonio Chacón\nManolo Sanlúcar\nMario Maya\nCamarón de la Isla\nSabicas\nCarmen Amaya\nManuel Torre\nTomatito\nPilar López\nJosé Mercé\nVicente Amigo\nLa Argentinita\nEnrique Morente\nGerardo Núñez\nLola Flores\nPepe Marchena\nPaco Cepero\nPastora Imperio\nManuel Vallejo\nPepe Habichuela\nJosé Antonio\nTable 7: PageRank Top-10 artists by category.\ntook advantage of the links already present in the Wikipedia pages instead of\napplying entity linking. We connected the biography main theme entity with all\nthe entities linked in the biography text. There are many entities linked in the\nbiographies that do not correspond to Renaissance composers (e.g., countries,\nevents, kings). Therefore, we created a graph composed only of Renaissance\ncomposers and another with all the entities found in the biographies. Figure 7\nshows the diﬀerence between the two graphs.\nFollowing the same methodology described in Section 5.1, we computed the\nrelevance ranking of the composers in the 2 graphs created from the Wikipedia\ncorpus using the PageRank algorithm. We observe in Table 8 the most relevant\ncomposer of each school obtained from the 2 Wikipedia graphs, the one using\nonly links between Renaissance composers (internal connections) and the\none using links to any entity (all connections). From a musicological per-\nspective, we observe that the results using only internal connections have\nSchool\nInternal connections\nAll connections\nSpanish\nFrancisco Guerrero\nJuan de la Encina\nGerman\nHans Leo Hessler\nMartin Luther\nEnglish\nThomas Morley\nHenry VIII\nFranco-Flemish\nJosquin des Prez\nJosquin des Prez\nItalian\nPalestrina\nMonteverdi\nTable 8: Relevance ranking of composers by school and graph creation approach\nusing the Wikipedia dataset.\n18\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nFigure 7: Knowledge graph construction approaches\nRanking\nInternal connections\nAll connections\n#1\nJosquin des Prez\nHenry VIII\n#2\nPalestrina\nMartin Luther\n#3\nOrlande de Lassus\nHenry V\n#4\nAdrian Willaert\nMonteverdi\nTable 9: Relevance ranking of all composers by graph creation approach using\nthe Wikipedia dataset.\nmore sense than those obtained using all connections. For example, Henry\nVIII appears as the most prominent entity of the English school when using all\nconnections. Henry VIII, in addition to the king of England, was a composer\nof the Renaissance era. However, his popularity is mainly due to his role as a\nking rather than as a composer. Using internal connections only we obtain\nThomas Morley as the most prominent composer of the English school, who is\nreally a cornerstone of this school. The same happens in the German school\nwith Martin Luther, who is popular for other aspects diﬀerent from music. In\nthe Italian school we observe a slightly diﬀerent situation. Claudio Monteverdi\nappears as the most prominent composer using all connections. He is ac-\ntually one of the most prominent composers of the history of music, however,\nalthough he started his career in the Renaissance era, he is mostly considered as\na Baroque composer. Palestrina, who was obtained using only internal con-\nnections, is also a very prominent composer in the history of music, but he is a\nprototypical composer of the Renaissance. We can infer from these results that\nthe use of only inner connections helps the approach to obtain results that are\n19\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nRanking\nInternal connections\n#1\nPalestrina\n#2\nAlessandro Damasceni Peretti di Montalto\n#3\nPetrarch\n#4\nClaudin de Sermisy\n#5\nLuca Marenzio\n#6\nPierre Sandrin\n#7\nJaques Arcadelt\n#8\nJacob Obrecht\nTable 10: Relevance ranking of all composers using the Grove dataset.\nmore musicologically meaningful. In Table 9 we observe the top-4 composers\nfrom both graphs independently of the music school. We notice here the same\ntendency in the results.\nFor the Grove corpus, we followed the same strategy described for the con-\nstruction of the ﬂamenco knowledge graph. We applied entity linking to the\nbiographies, and then connected each biography subject with the entities men-\ntioned in its biography.\nWe employed a similar ad-hoc approach for entity\nlinking as the one described in Section 4.1.\nWe computed the ranking list of the most relevant composers applying the\nPageRank algorithm over this graph. As shown in Table 10, composers obtained\nin this list are all very relevant musicians of the Renaissance period. However,\nthere are other types of artists and relevant people in the list, similarly to the\nresults obtained with the Wikipedia graph with all connections. This implies\nthe need of a ﬁltering process of the selected entities. This result conﬁrms the\nﬁndings shown in Section 5.1.1, which demonstrate the utility of the proposed\napproach to compute artist relevance ranking from unstructured texts by using\nentity linking.\n6\nSentiment analysis\nSentiment analysis is the task to systematically identify, extract, quantify, and\nstudy aﬀective states and subjective information in text. Among the diﬀerent\nsubtasks of sentiment analysis, we focus in this work on aspect-based sentiment\nanalysis. This technique provides speciﬁc sentiment scores for diﬀerent aspects\npresent in the text, e.g.\nalbum cover, guitar, voice or lyrics.\nThese scores\nrepresent how much the user likes or dislikes speciﬁc attributes expressed in\ntext.\n6.1\nAspect-based sentiment analysis\nFollowing the work of Dong et al. (2013, 2014) we use a combination of shallow\nNLP, opinion mining, and sentiment analysis to extract opinionated features\n20\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nMusic Reviews\nAspect Extraction\nSentiment Analysis\nbi-\ngrams\nnouns\nthresholding / filtering\nShallow NLP (POS \ntagging)\nsentiment \nterms\nOpinion Pattern \nMining\nSentiment \nMatching\nSentiment \nAssignment\n\u0002ь, \u0002э, . . .\nopinion \npatterns\nJJ_FEATURE\n\u0013$, \u0002%, \u0014$%, (+, −, =), . . .\nM1\nMn\nMi →{R1, . . . , Rn}\nRi\nFigure 8: Overview of the opinion mining and sentiment analysis framework.\nfrom reviews. For all reviews Ri of each album, we mine bi-grams and single-\nnoun aspects (also called review features; see Hu & Liu (2004)). We consider\nbi-grams that conform to a noun followed by a noun (e.g., chorus arrangement)\nor an adjective followed by a noun (e.g., original sound), and excluded bi-grams\nwhose adjective is a sentiment word (e.g., excellent, terrible). Separately, single-\nnoun aspects are validated by eliminating nouns that are rarely associated with\nsentiment words in reviews, since such nouns are unlikely to refer to item aspects.\nWe refer to each of these extracted aspects Aj as review aspects.\nFor a review aspect Aj we determine if there are any sentiment words in\nthe sentence containing Aj. If not, Aj is marked neutral; otherwise, we iden-\ntify the sentiment word wmin with the minimum word-distance to Aj. Next,\nwe determine the part-of-speech tags for wmin, Ai and any words that occur\nbetween wmin and Ai. We assign a sentiment score between -1 and 1 to Aj\nbased on the sentiment of wmin, subject to whether the corresponding sentence\ncontains any negation terms within 4 words of wmin. If there are no negation\nterms, then the sentiment assigned to Aj is that of the sentiment word in the\nsentiment lexicon; otherwise, this sentiment is reversed. Our sentiment lexicon\nis derived from SentiWordNet (Esuli & Sebastiani, 2006) and is not speciﬁcally\ntuned for music reviews. An overview of the process is shown in Figure 8. The\nend result of sentiment analysis is that we determine a sentiment score Sij for\neach aspect Aj in review Ri. A sample annotated review is shown in Figure 9.\nFinally, the sentiment score of a review Ri is calculated as the average of the\nsentiment score Sij of every aspect Aj in Ri.\n6.2\nDiachronic study of music criticism\nWe applied the proposed aspect-based sentiment analysis framework to the cor-\npus of album customer reviews gathered from Amazon (see Section 2.3), obtain-\ning speciﬁc sentiment scores for diﬀerent aspects present in the text, e.g., album\ncover, guitar, voice or lyrics. In Figure 10 we observe that the sentiment scores\nfollow a Gaussian distribution, with a median of 0.21, and remarkable picks at\n21\nS. Oramas et al.\nNLP for Music Knowledge Discovery\n“Very\nmelodic\ngreat\nguitar\nriffs\nbut\nthe\nvocals\nare\nshrill”\nS\nA\nA\nA\nS\n+ve\n+ve\n-ve\nFigure 9: A sentence from a sample review annotated with opinion and aspect\npairs.\nFigure 10: Distribution of sentiment scores\n0 and 0.5.\nIn addition to the sentiment computed, this corpus includes music metadata\nsuch as genre, review rating, review publication date and album release date.\nWe beneﬁt from this substantial amount of information at our disposal for per-\nforming a diachronic analysis of music criticism. Speciﬁcally, we combine the\nmetadata retrieved for each review with their associated sentiment information,\nand generate visualizations to help us investigate any potential trends in di-\nachronic music appreciation and criticism. Based on this evidence, and since\nmusic evokes emotions through mechanisms that are not unique to music (Juslin\n& Västfjäll, 2008), we may go as far as using musical information as means for\na better understanding of global aﬀairs. Previous studies argue that national\nconﬁdence may be expressed in any form of art, including music (Moïsi, 2010),\nand in fact, there is strong evidence suggesting that our emotional reactions to\nmusic have important and far-reaching implications for our beliefs, goals and\nactions, as members of social and cultural groups (Alcorta et al., 2008).\nTo investigate this matter, we carried out a study of the evolution of mu-\nsic criticism from two diﬀerent temporal standpoints. Speciﬁcally, we consider\nwhen the review was written and, in addition, when the album was ﬁrst pub-\nlished. We deﬁne the sentiment score of a review as the average score of all\naspects in the review. Since we have sentiment information available for each\nreview, we ﬁrst computed an average sentiment score for each year of review\n22\nS. Oramas et al.\nNLP for Music Knowledge Discovery\npublication (between 2000 and 2014). In this way, we may detect any signiﬁcant\nﬂuctuation in the evolution of aﬀective language during the 21st century. Then,\nwe also calculated an average sentiment score by year of album publication. The\naﬀective information is complemented with the averages of the Amazon rating\nscores.\nIn what follows, we show visualizations for sentiment scores and correlation\nwith ratings given by Amazon users, according to these two diﬀerent temporal\ndimensions. Although arriving to musicological conclusions is out of the scope of\nthis paper, we provide food for thought and present the readers with hypotheses\nthat may explain some of the facts revealed by these data-driven trends.\n6.2.1\nEvolution by review publication year\nWe applied sentiment and rating average calculations to the whole dataset,\ngrouping album reviews by year of publication of the review. Figure 11a shows\nthe average of the sentiment scores of all the reviews published in a speciﬁc\nyear, whilst Figure 11b shows average review ratings per year. At ﬁrst sight,\nwe do not observe any correlation between the trends illustrated in the ﬁgures.\nHowever, the sentiment curve (Figure 11a ) shows a remarkable peak in 2008,\na slightly lower one in 2013, and a low between 2003 and 2007, and also be-\ntween 2009 and 2012. Figure 11e shows the kernel density estimation of the\ndistribution of reviews by year of the 16 genres. The shapes of these curves\nsuggest that the 2008 peak in the sentiment score is not related to the number\nof reviews published that year. The peak persists if we construct the graphs\nwith the average sentiment associated with the most repeated aspects in text\n(Figure 11d). It is not trivial to give a proper explanation of this variations on\nthe average sentiment. We speculate that these curve ﬂuctuations may suggest\nsome inﬂuence of economical or geopolitical circumstances in the language used\nin the reviews, such as the 2008 election of Barack Obama as president of the\nUS. As stated by the political scientist Dominique Moïsi in Moïsi (2010):\nIn November 2008, at least for a time, hope prevailed over fear.\nThe\nwall of racial prejudice fell as surely as the wall of oppression had fallen\nin Berlin twenty years earlier [...] Yet the emotional dimension of this\nelection and the sense of pride it created in many Americans must not be\nunderestimated.\nIf we calculate the sentiment evolution curve for the diﬀerent genres (see Fig-\nure 11c), we observe that 2008 constitutes an all-time-high for almost all genres.\nIt is remarkable that genres traditionally related to more diverse communities\nsuch as Jazz and Latin Music experience such an increase, whilst other genres\nsuch as Country do not.\nAnother factor that might be related to the positiveness in use of language is\nthe economical situation. After several years of continuous economic growth, in\n2007 a global economic crisis started15, whose consequences were visible in the\n15https://research.stlouisfed.org\n23\nS. Oramas et al.\nNLP for Music Knowledge Discovery\n(a) Sentiment\n(b) Rating\n(c) Sentiment by genre\n(d) Sentiment by aspect\n(e) Kernel density est.\n(f) USA GDP trend\nFigure 11: Sentiment (a, c, and d) and rating (b) averages by review publication\nyear; Kernel density estimation of the distribution of reviews by year (e); GDP\ntrend in USA from 2000 to 2014 (f)\nsociety after 2008 (see Figure 11f). In any case, further study of the diﬀerent\nimplied variables is necessary to reinforce any of these hypotheses.\n6.2.2\nEvolution by album publication year\nIn this case, we study the evolution of the polarity of language by grouping\nreviews according to the album publication date. This date was gathered from\nMusicBrainz, meaning that this study is conducted on the 42,1% of the dataset\nthat was successfully mapped. We compared again the evolution of the average\nsentiment polarity (Figure 12a) with the evolution of the average rating (Fig-\n24\nS. Oramas et al.\nNLP for Music Knowledge Discovery\n(a) Sentiment\n(b) Rating\n(c) Sentiment by genre\nFigure 12: Sentiment (a), rating (b), and sentiment by genres (c) averages by\nalbum publication year.\nure 12b). Contrary to the results observed by review publication year, here we\nobserve a strong correlation between ratings and sentiment polarity. To cor-\nroborate that, we computed ﬁrst a smoothed version of the average graphs, by\napplying 1-D convolution (see line in red in Figures 12a and 12b). Then we\ncomputed Pearson’s correlation between smoothed curves, obtaining a correla-\ntion r = 0.75, and a p-value p ≪0.001. This means that in fact there is a strong\ncorrelation between the polarity identiﬁed by the sentiment analysis framework\nin the review texts, and the rating scores provided by the users. This correlation\nreinforces the conclusions that may be drawn from the sentiment analysis data.\nTo further dig into the utility of this polarity measure for studying genre\nevolution, we also computed the smoothed curve of the average sentiment by\ngenre, and illustrate it with two idiosyncratic genres, namely Pop and Reggae\n(see Figure 12c. We observe in the case of Reggae that there is a time period\nwhere reviews have a substantial use of a more positive language between the\nsecond half of the 70s and the ﬁrst half of the 80s, an epoch which is often called\nthe golden age of Reggae (Alleyne & Dunbar, 2012). This might be related to\nthe publication of Bob Marley albums, one of the most inﬂuential artists in this\ngenre, and the worldwide spread popularity of reggae music. In the case of Pop,\nwe observe a more constant sentiment average. However, in the 60s and the\nbeginning of 70s there are higher values, probably consequence by the release of\nalbums by The Beatles and other iconic pop bands. These results show that the\n25\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nuse of sentiment analysis on music reviews over certain timelines may be useful\nto study genre evolution and identify inﬂuential events.\nFinally, we observe a growing tendency for sentiment and rating average\nover albums published in the last years of the study. Are we experiencing a\nnew golden age of music or is this due to an increase of the number of reviewers\nincentivized by 3rd party services (Gibbs, 2016)? Again, data-driven analysis\nhas provided us with meaningful insights as well as novel hypotheses that open\nup vibrating avenues for further studies.\n7\nConclusions\nWe have presented diﬀerent methodologies to process large corpora of music-\nrelated documents from a musicological perspective, enabling data-driven anal-\nysis, which can be further used for complementing expert knowledge. These\nmethodologies have been evaluated on three diﬀerent use cases: Flamenco mu-\nsic (with the creation, population, and analysis of a ﬂamenco knowledge base);\nthe Renaissance period (by processing and studying a corpus of composers bi-\nographies); and the evolution of music criticism (with a cross-genre diachronic\nstudy using as target data online music reviews).\nFirst, diﬀerent challenges and techniques for gathering and combining large\ntext corpora are presented and applied to compile the diﬀerent datasets used\nthroughout the paper. Then, a methodology for the analysis and visualization\nof word frequencies has been presented, showing some of the most important as-\npects of the diﬀerent music schools in Renaissance Music. Next, an information\nextraction pipeline is presented where entities identiﬁed in text are connected to\na knowledge base throughout an ad-hoc entity linking system. Then, a method\nfor extracting biographical information from artist biographies is described, and\napplied to enrich a ﬂamenco knowledge base and to study the Renaissance pe-\nriod. The analysis of extracted biographical data revealed migratory tendencies\nof composers and the oscillation of the gravitational center of the music activity\namong diﬀerent European cities within the Renaissance period. A methodol-\nogy to build knowledge graphs is described next and evaluated in the task of\ncomputing artist relevance rankings. Experimental results show high correla-\ntion between the automatically obtained ranking of artists and the opinion of\nﬂamenco experts. The application on the Renaissance corpus revealed also that\nthe use of only inner connections helps the approach to obtain results that are\nmore musicologically meaningful. Finally, an aspect-based sentiment analysis\nmethod is described. This methodology is then used to perform a diachronic\nstudy of the sentiment polarity expressed in customer reviews from two diﬀer-\nent standpoints. First, an analysis by year of review publication suggests that\ngeopolitical events or macro-economical circumstances may inﬂuence the way\npeople speak about music. Second, an analysis by year of album publication\nshows how sentiment analysis can be useful to study the evolution of music.\nThe main contribution of this work is a demonstration of the usefulness for\nmusicological research of applying systematic linguistic processing techniques on\n26\nS. Oramas et al.\nNLP for Music Knowledge Discovery\ntext collections about music. Although further work is necessary to elaborate\non the hypotheses or claims that may be derived from purely data-driven analy-\nses, these methodologies have shown their suitability in the quest of knowledge\ndiscovery from large amounts of documents, which may be highly useful for mu-\nsicologists and humanities researchers in general. In fact, one of the strongest\nclaims used in the Information Age is that Big Data can be used to reveal hid-\nden patterns and meaningful variables hidden among unstructured information,\nand indeed in this work we provide a myriad of conclusions drawn from intel-\nligent text processing, in the hopes that these may constitute the cornerstone\nof further musicological studies. Moreover, we envision that the combination\nof knowledge extracted from text with knowledge extracted from other data\nmodalities (e.g., audio signals or music scores) would be a further step in the\nconstruction of real-world music understanding systems.\n8\nAcknowledgments\nThis work was partially funded by the Spanish Ministry of Economy and Com-\npetitiveness under the Maria de Maeztu Units of Excellence Programme (MDM-\n2015-0502) and by the COFLA2 research project (Proyectos de Excelencia de\nla Junta de Andalucía, FEDER P12-TIC-1362).\nReferences\nAlcorta, C. S., Sosis, R., & Finkel, D. (2008). Ritual harmony: Toward an\nevolutionary theory of music.\nBehavioral and Brain Sciences, 31(5), 576.\ndoi: Doi10.1017/S0140525x08005311\nAlleyne, M. R., & Dunbar, S. (2012). The Encyclopedia of Reggae: The Golden\nAge of Roots Reggae. Sterling.\nBellomi, F., & Bonato, R. (2005). Network analysis for wikipedia. In Proceedings\nof wikimania 2005, the ﬁrst international wikimedia conference.\nBlas Vega, J., & Ríos Ruiz, M. (1988). Diccionario enciclopédico ilustrado del\nﬂamenco. Madrid: Cinterco.\nBrin, S., & Page, L. (1998). The Anatomy of a Large-Scale Hypertextual Web\nSearch Engine. Computer Networks, 30, 107–117. Retrieved from http://\ninfolab.stanford.edu/~backrub/google.html\nBunescu, R., & Pasca, M. (2006). Using Encyclopedic Knowledge for Named\nEntity Disambiguation. In Proceesings of the 11th conference of the euro-\npean chapter of the association for computational linguistics (eacl-06) (pp. 9–\n16). Retrieved from http://www.cs.utexas.edu/users/ai-lab/?bunescu:\neacl06\n27\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nCowie, J., & Lehnert, W. (1996). Information extraction. Communications of\nthe ACM , 39(1), 80–91.\nCrawford, T., Fields, B., Lewis, D., & Page, K. (2014). Explorations in linked\ndata practice for early music corpora. Digital Libraries 2014.\nDong, R., O’Mahony, M. P., & Smyth, B.\n(2014).\nFurther Experiments in\nOpinionated Product Recommendation. In Iccbr’14 (pp. 110–124). Retrieved\nfrom http://dx.doi.org/10.1007/978-3-319-11209-1{_}9 doi: 10.1007/\n978-3-319-11209-1_9\nDong, R., Schaal, M., O’Mahony, M. P., & Smyth, B. (2013). Topic Extraction\nfrom Online Reviews for Classiﬁcation and Recommendation. In (pp. 1310–\n1316).\nEsuli, A., & Sebastiani, F. (2006). Sentiwordnet: A publicly available lexical\nresource for opinion mining. In Proceedings of lrec (Vol. 6, pp. 417–422).\nFast, K. V., & Sedig, K.\n(2011, November).\nInteraction and the epistemic\npotential of digital libraries. International Journal on Digital Libraries, 11(3),\n169–207. Retrieved from http://link.springer.com/10.1007/s00799-011\n-0066-8 doi: 10.1007/s00799-011-0066-8\nFernández, L. (2004). Teoría musical del ﬂamenco. Madrid: Acordes Concert.\nFinkel, J. R., Grenager, T., & Manning, C. (2005). Incorporating Non-local\nInformation into Information Extraction Systems by Gibbs Sampling.\nIn\nProceedings of the 43nd Annual Meeting of the Association for Computational\nLinguistics (pp. 363–370).\nFujinaga, I., & Weiss, S. F.\n(2016).\nDigital prosopography for renaissance\nmusicians: Discovery of social and professional networks. NEH White Paper.\ndoi: http://dx.doi.org/10.17613/M6FW85\nGamboa, J. M. (2005). Una historia del ﬂamenco. Madrid: Espasa-Calpe.\nGetoor, L. (2012). Entity Resolution : Theory , Practice & Open Challenges.\nTutorial at AAAI-12, pages 2018–2019.\nGibbs,\nS.\n(2016,\nSep).\nIncentivised\nreviews\nare\nwarping\nama-\nzon’s\nproduct\nstar\nratings,\nreport\nsays.\nThe\nGuardian.\nRe-\ntrieved\nfrom\nhttps://www.theguardian.com/technology/2016/sep/20/\nincentivised-reviews-amazon-product-star-ratings\nGrove, G. (1878). A Dictionary of Music and Musicians.\nHu, M., & Liu, B. (2004). Mining Opinion Features in Customer Reviews. In\nAAAI’04 (pp. 755–760). Retrieved from http://dl.acm.org/citation.cfm\n?id=1597148.1597269\n28\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nJuslin, P. N., & Västfjäll, D. (2008). Emotional responses to music: the need to\nconsider underlying mechanisms. The Behavioral and brain sciences, 31(5),\n559–621. Retrieved from http://www.ncbi.nlm.nih.gov/pubmed/18826699\ndoi: 10.1017/S0140525X08005293\nKleinberg, J. M. (1999). Authoritative sources in a hyperlinked environment.\nJournal of the ACM (JACM), 46, 604–632. doi: 10.1145/324133.324140\nKnees, P., & Schedl, M.\n(2011).\nTowards Semantic Music Information Ex-\ntraction from the Web Using Rule Patterns and Supervised Learning. Work-\nshop on Music Recommendation and Discovery, colocated with ACM Rec-\nSys 2011, 18.\nRetrieved from http://ftp.informatik.rwth-aachen.de/\nPublications/CEUR-WS/Vol-793/womrad2011_complete.pdf#page=24\nMcAuley, J., Pandey, R., & Leskovec, J. (2015). Inferring Networks of Sub-\nstitutable and Complementary Products.\nIn Proceedings of the 21st acm\nsigkdd conference on knowledge discovery and data mining (kdd’15) (p. 12).\nRetrieved from http://arxiv.org/abs/1506.08839\ndoi: 10.1145/2783258\n.2783381\nMihalcea, R., & Csomai, A. (2007). Wikify!: linking documents to encyclopedic\nknowledge. In Proceedings of the sixteenth acm conference on conference on\ninformation and knowledge management (pp. 233–242).\nMoïsi, D. (2010). The Geopolitics of Emotion: How Cultures of Fear, Humil-\niation, and Hope are Reshaping the World. Anchor Books. Retrieved from\nhttp://lccn.loc.gov/2008044798\nMoro, A., Raganato, A., & Navigli, R. (2014). Entity Linking meets Word\nSense Disambiguation: a Uniﬁed Approach. Transactions of the Association\nfor Computational Linguistics (TACL), 2, 231–244.\nNavarro, J. L., & Ropero, M.\n(1995).\nHistoria del ﬂamenco.\nSevilla: Ed.\nTartessos.\nOramas, S. (2014). Harvesting and Structuring Social Data in Music Informa-\ntion Retrieval. Extended Semantic Web Conference (ESWC). Lecture Notes\nin Computer Science, 8465, 817–826.\nOramas, S., Espinosa-Anke, L., Lawlor, A., & Others. (2016). Exploring Cus-\ntomer Reviews for Music Genre Classiﬁcation and Evolutionary Studies. In\nProceedings of the 17th international society for music information retrieval\nconference (ismir 2016).\nOramas, S., Espinosa-Anke, L., Sordo, M., Saggion, H., & Serra, X. (2016a).\nELMD: An Automatically Generated Entity Linking Gold Standard Dataset\nin the Music Domain. In In proceedings of the 10th international conference\non language resources and evaluation, lrec 2016.\n29\nS. Oramas et al.\nNLP for Music Knowledge Discovery\nOramas, S., Espinosa-Anke, L., Sordo, M., Saggion, H., & Serra, X. (2016b).\nInformation extraction for knowledge base construction in the music do-\nmain.\nData and Knowledge Engineering, 106, 70–83.\nRetrieved from\nhttp://dx.doi.org/10.1016/j.datak.2016.06.001\ndoi: 10.1016/j.datak\n.2016.06.001\nOramas, S., Gómez, F., Gómez, E., & Mora, J. (2015). FlaBase: Towards the\nCreation of a Flamenco Music Knowledge Base. In Proceedings of the 16th\ninternational society for music information retrieval conference.\nOramas, S., Ostuni, V. C., Di Noia, T., Serra, X., & Di Sciascio, E. (2016).\nSound and Music Recommendation with Knowledge Graphs. ACM Transac-\ntions on Intelligent Systems and Technology (TIST), 8(2), 21.\nOramas, S., Sordo, M., Espinosa-Anke, L., & Serra, X. (2015). A Semantic-\nbased Approach for Artist Similarity. In Proceedings of 16th the international\nsociety for music information retrieval conference (ismir).\nOramas, S., Sordo, M., & Serra, X. (2014). Automatic Creation of Knowledge\nGraphs from Digital Musical Document Libraries. In Conference in interdis-\nciplinary musicology. Berlin.\nRatcliﬀ, J. W., & Metzener, D. (1988). Pattern matching: The Gestalt ap-\nproach. Dr. Dobb’s Journal, 13, 46–72.\nRose, S., & Tuppen, S. (2014). Prospects for a Big Data History of Music. In\nInternational workshop on digital libraries for musicology.\nSadie, S. (2001). The New Grove Dictionary of Music and Musicians, 2d ed.\n(Vol. 58). doi: 10.1353/not.2001.0195\nSordo, M., Serrà, J., & Serra, X. (2012). A Method for Extracting Semantic\nInformation from on-line Art Music Discussion Forums. In 2nd compmusic\nworkshop (pp. 55–60).\nSutcliﬀe, R., Crawford, T., Fox, C., Root, D. L., & Hovy, E. (2015). Relat-\ning natural language text to musical passages.\nIn Proceedings of the 16th\ninternational society for music information retrieval conference.\nTata, S., & Di Eugenio, B. (2010). Generating Fine-Grained Reviews of Songs\nfrom Album Reviews.\nIn Proceedings of the 48th annual meeting of the\nassociation for computational linguistics (pp. 1376–1385).\nRetrieved from\nhttp://www.aclweb.org/anthology/P10-1140\nVrandečić, D., & Krötzsch, M.\n(2014).\nWikidata:\nA Free Collaborative\nKnowledgebase. Commun. ACM , 57(10), 78–85. Retrieved from http://\ndoi.acm.org/10.1145/2629489 doi: 10.1145/2629489\n30\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2018-07-06",
  "updated": "2018-07-06"
}