{
  "id": "http://arxiv.org/abs/1809.02069v1",
  "title": "Deep learning for in vitro prediction of pharmaceutical formulations",
  "authors": [
    "Yilong Yang",
    "Zhuyifan Ye",
    "Yan Su",
    "Qianqian Zhao",
    "Xiaoshan Li",
    "Defang Ouyang"
  ],
  "abstract": "Current pharmaceutical formulation development still strongly relies on the\ntraditional trial-and-error approach by individual experiences of\npharmaceutical scientists, which is laborious, time-consuming and costly.\nRecently, deep learning has been widely applied in many challenging domains\nbecause of its important capability of automatic feature extraction. The aim of\nthis research is to use deep learning to predict pharmaceutical formulations.\nIn this paper, two different types of dosage forms were chosen as model\nsystems. Evaluation criteria suitable for pharmaceutics were applied to\nassessing the performance of the models. Moreover, an automatic dataset\nselection algorithm was developed for selecting the representative data as\nvalidation and test datasets. Six machine learning methods were compared with\ndeep learning. The result shows the accuracies of both two deep neural networks\nwere above 80% and higher than other machine learning models, which showed good\nprediction in pharmaceutical formulations. In summary, deep learning with the\nautomatic data splitting algorithm and the evaluation criteria suitable for\npharmaceutical formulation data was firstly developed for the prediction of\npharmaceutical formulations. The cross-disciplinary integration of\npharmaceutics and artificial intelligence may shift the paradigm of\npharmaceutical researches from experience-dependent studies to data-driven\nmethodologies.",
  "text": "Deep learning for in vitro prediction of pharmaceutical formulations \nYilong Yang1,2, Zhuyifan Ye1, Yan Su1, Qianqian Zhao1, Xiaoshan Li2, Defang Ouyang1* \n1State Key Laboratory of Quality Research in Chinese Medicine, Institute of Chinese Medical Sciences \n(ICMS), University of Macau, Macau, China \n2Department of Computer and Information Science, Faculty of Science and Technology, University of \nMacau, Macau, China \nNote: Yilong Yang and Zhuyifan Ye made equal contribution to the manuscript. \nCorresponding author: Defang Ouyang, email: defangouyang@umac.mo; telephone: 853-88224514. \n \nAbstract \nCurrent pharmaceutical formulation development still strongly relies on the traditional trial-and-error \napproach by individual experiences of pharmaceutical scientists, which is laborious, time-consuming and \ncostly. Recently, deep learning has been widely applied in many challenging domains because of its \nimportant capability of automatic feature extraction. The aim of this research is to use deep learning to \npredict pharmaceutical formulations. In this paper, two different types of dosage forms were chosen as \nmodel systems. Evaluation criteria suitable for pharmaceutics were applied to assessing the performance \nof the models. Moreover, an automatic dataset selection algorithm was developed for selecting the \nrepresentative data as validation and test datasets. Six machine learning methods were compared with \ndeep learning. The result shows the accuracies of both two deep neural networks were above 80% and \nhigher than other machine learning models, which showed good prediction in pharmaceutical \nformulations. In summary, deep learning with the automatic data splitting algorithm and the evaluation \ncriteria suitable for pharmaceutical formulation data was firstly developed for the prediction of \npharmaceutical formulations. The cross-disciplinary integration of pharmaceutics and artificial \nintelligence may shift the paradigm of pharmaceutical researches from experience-dependent studies to \ndata-driven methodologies. \n[Keywords] pharmaceutical formulation; deep learning; small data; automatic dataset selection \nalgorithm; oral fast disintegrating films; oral sustained release matrix tablets. \n \n \n1. Introduction \nThe current pharmaceutical industry faces the great pressure of reduced healthcare costs and less \nnumber of new active pharmaceutical ingredients (APIs). The pharmaceutical industry should employ \nmore efficient and systematic ways in both drug discovery and development processes.1 In drug \ndiscovery area, scientists now widely use high-throughput screening, combinatorial chemistry, and \ncomputer-aided drug design to accelerate drug discovery and development.2 However, nowadays, \npharmaceutical formulation development still strongly relies on the traditional trial-and-error approach \nby individual experiences of pharmaceutical scientists, which is laborious, time-consuming and cost-\nexpensive. Moreover, it is difficult to achieve the optimum formulations by the trial-and-error studies in \nthe laboratory. Simplification of formulation development becomes essential to formulation scientists. \nThus, it is necessary to develop an efficient and systematic method for formulation development to keep \npace with the requirements of the pharmaceutical industry.3  \nMachine learning is one of the most exciting research areas in recent years. Machine learning can make \ndata-driven predictions with existed experimental data, which provides a great opportunity for efficient \nformulation development.4-9 A well-designed machine learning method can greatly speed the \ndevelopment, optimize formulations, save the cost, keep products consistency, and accumulate and \npreserve the specific knowledge and expertise from the experts in a well-defined domain.4 Table 1 \nsummarizes recent progress of machine learning in formulation design. Expert systems (ESs) and artificial \nneural networks (ANNs) were two useful tools for the formulation development. 4-6, 8, 9 An ES is an \nintelligent program with the ability to accumulate and preserve the knowledge and experiences of the \nexperts in a specific area (e.g., pharmaceutical formulations).10 However, it is difficult to extract the \nvague experiences of pharmaceutical experts into the rules of ESs, and then to accurately predict the \nperformance of a formulation. ANN was the most popular machine learning tool in pharmaceutical \nformulation prediction. ANN simulates the structure and functions of biological neural networks.5 ANN is \nable to solve the problems that are hard to be solved by standard expert systems.5 However, ANNs still \nneed strong expert knowledge to design feature extractors in the prediction process. In addition, the \nformulation prediction accuracy by ANNs is relatively low due to the limited experimental data.  \n \n \n \nTable 1 Recent progress of machine learning in formulation design \nMachine learning techniques \nFormulation \nReference \nHybrid expert system with ANNs \nHard gelatin capsule formulations \n11 \nExpert system (SeDeM Diagram) \nOrally disintegrating tablets \n12, 13 \nExpert system with ANNs \nOsmotic pump tablets \n5, 14 \nOntology-based expert system \nImmediate Release Tablets \n15 \nME_expert 2.0 \nMicroemulsions formulations \n6 \nFuzzy logic-based expert system \nFreeze-dried formulations \n16 \nCubist and Random Forest \nCyclodextrin formulations \n17 \n \nDeep learning as an automatic general-purpose learning procedure has been widely adopted in many \ndomains of science, business, and government.18 Unlike other machine learning techniques with the \nrequirement of domain expertise to design feature extractors, deep learning can automatically transform \nlow-level representation to more abstract level.19 Moreover, deep learning is more sensitive to irrelevant \nand particular minute variations, which make deep learning methods reach higher accuracy rather than \nother machine learning methods.20 Deep convolutional networks inspired from visual neuroscience \nusually achieve good results for processing images, video, speech, and audio.21, 22 Recurrent neural \nnetworks containing history information of the sequence have brought about the breakthrough in \nsequential data, such as text and speech.23, 24 Pharmaceutical formulation data include formulation \ncompositions and manufacturing process, which are neither image data nor sequential data. Therefore, \nthe full-connected deep feed-forward network is a good choice for the prediction of pharmaceutical \nformulations. The recent study showed that deep neural networks (DNNs) made better performance \nthan ANNs with one hidden layer in oral disintegrating tablet prediction.25 The Maximum Dissimilarity \nalgorithm with the small group filter and representative initial set selection (MD-FIS) selected the \nrepresentative validation set from the small and imbalanced oral disintegrating tablet data. However, \nmore comparisons of deep learning with other machine learning methods for formulation prediction are \nstill lacked. \nIn the past five years there are increasing applications of deep learning in pharmaceutical researches.26-29 \nThe first study of deep learning in pharmaceutical research in 2013 was to compare deep learning with \nother machine learning approaches by predicting the water solubility of drugs.30 The results showed that \ndeep learning had better performance than other approaches. After that, more pharmaceutical \napplications of deep learning were reported. For example, a deep convolution network was developed to \npredict the epoxidation reactivity of molecules to reduce the drug toxicity.31 Deep learning was also \napplied for the prediction of drug-induced liver injury with good performance.32 Another study also \nshowed that deep learning performed better in toxicity prediction than other computational methods \n(naive Bayes, support vector machines, and random forests) in 2016 Tox21 Data Challenge. Deep \nlearning was also used in drug discovery.33-35 DNNs were able to make better predictions than other \nmachine learning approaches on quantitative structure activity relationships (QSAR) data sets.33 \nMoreover, multitask deep learning and one-shot learning approaches were used in low data drug \ndiscovery, which had better performance than single-task learning.34, 35 In addition, applying deep \nlearning to mine the increasing datasets in drug discovery not only enables us to learn from the past but \nto predict future drug repurposing.36, 37 Recently, the performance of five machine learning models and \nfour DNNs with 2, 3, 4, 5 hidden layers were evaluated on 8 datasets.38 Further analysis was carried out \nby using the ranked normalized scores including seven classic measurements of model performance. The \nfinal results of the scores ranked by metric and by dataset indicated that the DNNs with five and four \nhidden layers made better performance than other machine learning approaches. Nearly all reports in \nrecent 5 years suggested that deep learning had more benefits in predictive performance than other \nmachine learning methods. \nIn this paper, deep learning was applied to pharmaceutical formulation prediction by constructing \nregression models. One of the main difficulties in formulation prediction is the small dataset with \nimbalanced input space due to the limited experimental data. For better performance, the data splitting \nalgorithm and the evaluation criteria suitable for pharmaceutical formulation data were introduced. The \nDNNs were trained on the data of two types of pharmaceutical dosage forms, including oral fast \ndisintegrating films (OFDF) and oral sustained release matrix tablets (SRMT). Comparisons of deep \nlearning with other six machine learning techniques were carried out. Compared with other machine \nlearning methods, deep learning can find out the intricate correlation between pharmaceutical \nformulations and in vitro characteristics, which shows wide prospects for the application of deep \nlearning in pharmaceutical formulation prediction. \n \n2. Methods \n2.1. Pharmaceutical Data \nThe pharmaceutical dataset includes 131 formulations of OFDF and 145 formulations of SRMT. The \nexperimental data were extracted from Web of Science. Three different searching terms of oral fast-\ndissolving films, oral disintegrating films and orodispersible films were used for search literatures about \nthe development of OFDF formulations. The searching strategy of Hydroxypropyl methyl cellulose (HPMC) \nbased sustained release matrix tablet formulations was “HPMC” or \"Hydroxypropyl methylcellulose\" or \n“hydroxypropylmethylcellulose” or \"hydroxypropylmethyl cellulose\" or “hypromellose” and “tablet” or \n“tablets”. The formulation data contain types and contents of both drugs and excipients, process \nparameters and in vitro characteristics of dosage forms. The characteristics of the two dosage forms \nwere chosen as the prediction targets in this research, including disintegration time for OFDF and \ncumulative dissolution profiles (2, 4, 6 and 8 hours) for SRMT.  \nThe molecular descriptors were used for representing the properties of APIs. All drugs’ name were \ndescribed with the nine molecular descriptors, including molecular weight, XLogP3, hydrogen bond \ndonor count, hydrogen bond acceptor count, rotatable bond count, topological polar surface area, heavy \natom count, complexity and logS. The excipient types were encoded to different numbers. The process \nparameters include weight, thickness, tensile strength, elongation, folding endurance, actual drug \ncontent of OFDF and granulation process, diameter, hardness of SRMT. \n2.2. Data Splitting Strategy \nThree-dataset (training/validation/test datasets) splitting strategy was used in this paper. The training \nset is for training models, and the validation set is for tuning hyper-parameters to find the best model. \nThe accuracy of the test set shows the prediction ability on unknown data. This strategy is widely \nadopted in machine learning. For each dosage form, the pharmaceutical data were split into three \nsubsets, both the validation set and the test set include 20 formulations, the rest of the data were used \nto train the models. \n2.3. Hyperparameters of Machine Learning Methods \nSix machine learning methods were introduced to construct regression models to compare with DNNs, \nincluding multiple linear regression (MLR), partial least squared regression (PLSR), support vector \nmachine (SVM), ANNs, random forest (RF) and k-nearest neighbors (k-NN). These regression models \nwere trained using the scikit-learn package.39 For OFDF, in PLSR, the number of components was set to 8. \nIn ANNs, the networks contained 1 hidden layer with 80 hidden nodes. In RF, the maximum depth of the \ntree was set to 3. In k-NN, the number of neighbors was set to 5. For SRMT, 4 models were trained \nsimultaneously for 4 time points (2, 4, 6 and 8 hours) by using each machine learning method. The 4 \nmodels were developed using the same hyperparameters. In PLSR, the number of components was set \nto 10. In ANNs, the networks contained 1 hidden layer with 60 hidden nodes. In RF, the maximum depth \nof the tree was set to 5. In k-NN, the number of neighbors was set to 3. \n2.4. Hyperparameters of Deep Neural Networks \nDeepLearning4j machine learning framework (https://deeplearning4j.org/) was used to train the deep neural \nnetworks. For OFDF, a feed-forward neural network with 10 layers and 900 epochs was adopted. This \nnetwork contained 50 hidden nodes on each layer. For SRMT, a feed-forward neural network with 9 \nlayers and 2600 epochs was adopted. This network contained 30 hidden nodes on each layer. All \nnetworks chose tanh as the activation function except the last layer with sigmoid activation function. \nLearning rate was 0.01. Batch gradient descent with the 0.8 momentum was used for training these \nnetworks. \n2.5. Evaluation Criteria \nIn machine learning, correlation coefficient and coefficient of determination are usually adopted as \nevaluation metrics for regression problems. Correlation coefficient indicates the linear relationship \nbetween two variables. The coefficient of determination shows the correlation between the predicted \nvalues and the real values. However, the correlation coefficient and the coefficient of determination \ncannot well evaluate the performance of the pharmaceutical formulation prediction models. In \npharmaceutics the good models for predicting drug dissolution profiles should have less than 10% error \n40 Thus, specific criteria suitable for pharmaceutics should be introduced to evaluate the model \nperformance.  \nFollowing the FDA (the U.S. Food and Drug Administration) recommendation using the similarity factor f2 \nto evaluate the similarity of drug dissolution profiles,40 the similarity factor f2 was introduced to evaluate \nthe performance of the models for predicting the cumulative drug release curves. If the f2 is greater than \nor equal to 50, it is considered a successful prediction. The accuracy of the cumulative drug release curve \nprediction is the percentage of the successful predictions in all predictions:  \n \n𝑎𝑐𝑐𝑢𝑟𝑎𝑐𝑦&'() = 𝑁𝑢𝑚𝑏𝑒𝑟(𝑓1 ≥50)\n𝐴𝑙𝑙𝑃𝑟𝑒𝑑𝑖𝑐𝑡𝑖𝑜𝑛𝑠 \n \nEuropean Pharmacopoeia stipulates that orodispersible tablets are the tablets that could disperse within \n3min (180s). In our dataset, the disintegration time of OFDF ranges from 0 to 100s. Usually, the sucessful \nprediction is that the error between the predicated time and the experiment time is not higher than 10s. \nThe accuracy of the disintegration time prediction is the percentage of the successful predictions in all \npredictions:  \n \n𝑎𝑐𝑐𝑢𝑟𝑎𝑐𝑦'? = 𝑁𝑢𝑚𝑏𝑒𝑟𝑓@ −𝑓≤10\n𝐴𝑙𝑙𝑃𝑟𝑒𝑑𝑖𝑐𝑡𝑖𝑜𝑛𝑠\n \n \nWhere, 𝑓@ is the predicted value, 𝑓 is the experimental value.  \n \n3. Results and Discussion \nDeep learning is a type of representation learning with multiple levels of transform modules, which \ncontains more parameters than other learning algorithms and requires more data for training. However, \none of the main difficulties in pharmaceutical formulation prediction is the small dataset with \nimbalanced input space due to the limited experimental data. Each dosage form has only around 140 \nformulations. There are 13 APIs in the OFDF dataset, 29 APIs in the SRMT dataset. But near half of the \nAPIs include less than four formulations. Therefore, selecting representative datasets for training and \ntest is very important for the formulation prediction. In our research, the specific evaluation criteria \nwere introduced and several data splitting methods were investigated. Moreover, deep learning was \ncompared with other machine learning techniques for the formulation prediction. \n3.1. Random Data Splitting \n30% data were randomly selected as the validation set, remaining data as the training set. This \nprocedure was repeated 1000 times. However, entirely different accuracy results were obtained, the \nmaximum variation of accuracy was more than 40%, and the average accuracy was less than 60%. In the \nwhole dataset, near half of the APIs include less than four formulations. Therefore, random data splitting \nalgorithm has near 50% probability to select these APIs with less formulations, which may make \nprediction accuracy quite low and high variation. In short, the random selection algorithm is not suitable \nfor our research and a new approach need to be developed to select the representative data.   \n3.2. Manual Data Splitting  \nIn the manual dataset selection, formulation experts picked up 20 representative data as the validation \nset for each dosage form. All prediction accuracies on both the training set and the validation set were \ngreater than 90%. However, the manual selection method requires domain knowledge of experts, which \nis not suitable for large datasets and may have the variation from different experts. Therefore, a \nselection algorithm should be developed to select the validation set automatically.   \n3.3. Maximum Dissimilarity for Data Splitting  \nPrevious research showed rational selection algorithm can generate better statistical results for the \nvalidation set than random selection.41 Another study indicated that the maximum dissimilarity \nalgorithm was able to select representative test data of compounds from chemical databases.42 The \noriginal maximum dissimilarity algorithm was published in Caret library of R language.43 In our research, \nthe maximum dissimilarity algorithm was also used to select the validation set. But the test result \nshowed that the maximum dissimilarity algorithm didn’t work well on our data, because the accuracies \nof the validation set were only 83.46% for OFDF and 78.85% for SRMT. After analyzing the splitting result, \nit was found that the maximum dissimilarity algorithm preferred to select the data from a) the \nformulations in small API groups, b) boundary formulations, and c) formulations with extraordinary \nvalues. The possible reason is that the small API group data, the boundary data or the abnormal data \nhave bigger dissimilar values than other data. Moreover, the maximum dissimilarity algorithm adopts the \nrandomly generated initial set to compute the dissimilarity degree, which is still highly various and not \nrobust due to the small dataset. Therefore, the original maximum dissimilarity algorithm should be \nimproved to select the representative formulation data. \n3.4. MD-FIS Algorithm for Data Splitting  \nA new algorithm in R language was developed for selecting the best representative data to validate the \nmodels. Figure 1 shows the improved Maximum Dissimilarity algorithm with the small group filter and \nrepresentative initial set selection (MD-FIS). The MD-FIS algorithm contains 3 steps. In Step 1, the data \ngo through a filter to get rid of the small API group data. In Step 2, the MD-FIS algorithm randomly \ngenerates 10000 initial datasets, computes the similarity values between the initial datasets and the \nremaining datasets, and chooses the initial set with the highest similarity value as the final initial set. In \nstep 3, the final initial set and the remaining data set are used as the input to the dissimilarity algorithm \nwith new cost function. Different from the original cost function, new cost function not only includes the \ndistances (originalDistance) between the candidate data and the initial set, but also contains the \ndistances (subMeanDistance) between the candidate data and the remaining data in the same API group. \nThe new cost function is:  \ncost = originalDistance − 𝛼∗subMeanDistance \nWhere, 𝛼 can control the proportion of subMeanDistance, the maximum dissimilarity algorithm selects \nthe data with the maximum cost. The new cost function will prevent the selection of the boundary data. \nThe result was much better than that of the original maximum dissimilarity algorithm. The prediction \naccuracies were 95.57% for OFDF and 82.02% for SRMT on the validation set.  \n \nFigure 1 The workflow of MD-FIS algorithm \n3.5. Comparison of Deep Learning and Conventional Machine Learning Methods \n \nTable 2 Results of the conventional machine learning models and the deep neural network on the OFDF \ntraining, validation and test sets \nMachine \nlearning \ntechniques \nTraining Set \nValidation Set \nTest Set \nAccuracy \n(%) \nRMSE \nMAE \nAccuracy \n(%) \nRMSE \nMAE \nAccuracy \n(%) \nRMSE \nMAE \nMLR \n90.11 \n0.0671  \n0.0508 \n60.00 \n0.1311  0.0999 \n65.00 \n0.1778  0.1183 \nPLSR \n76.92 \n0.0917  \n0.0705 \n70.00 \n0.1136  0.0835 \n70.00 \n0.0970  0.0705 \nSVM \n79.12 \n0.1136  \n0.0711 \n70.00 \n0.1308  0.0959 \n75.00 \n0.1039  0.0795 \nANN \n74.73 \n0.1140  \n0.0809 \n70.00 \n0.1105  0.0846 \n70.00 \n0.0959  0.0772 \nRF \n84.62 \n0.0775  \n0.0567 \n80.00 \n0.0917  0.0721 \n70.00 \n0.1068  0.0774 \nk-NN \n80.22 \n0.0975  \n0.0649 \n75.00 \n0.1025  0.0727 \n75.00 \n0.0877  0.0608 \nDNN \n97.80 \n0.0420 \n0.0307 \n80.00 \n0.0842 \n0.0705 \n80.00 \n0.0714 \n0.0565 \n \nTable 3 Results of the conventional machine learning models and the deep neural network on the SRMT \ntraining, validation, and test sets \nMachine \nlearning \ntechniques \nTraining Set \nValidation Set \nTest Set \nAccuracy \n(%) \nRMSE \nMAE \nAccuracy \n(%) \nRMSE \nMAE \nAccuracy \n(%) \nRMSE \nMAE \nMLR \n52.38 \n0.1356  0.1031 \n35.00 \n0.1212  \n0.1042 \n25.00 \n0.2182  0.1685 \nPLSR \n55.24 \n0.1446  0.1066 \n55.00 \n0.1175  \n0.0961 \n45.00 \n0.1609  0.1203 \nSVM \n60.95 \n0.1568  0.1013 \n50.00 \n0.1170  \n0.0960 \n45.00 \n0.1559  0.1147 \nANN \n57.14 \n0.1330  0.0998 \n50.00 \n0.1389  \n0.1137 \n50.00 \n0.1497  0.1124 \nRF \n76.19 \n0.0975  0.0692 \n55.00 \n0.1308  \n0.1045 \n55.00 \n0.1170  0.0908 \nk-NN \n64.76 \n0.1229  0.0825 \n45.00 \n0.1526  \n0.1264 \n40.00 \n0.1565  0.1306 \nDNN \n99.05 \n0.0335 \n0.0237 \n80.00 \n0.0967 \n0.0660 \n80.00 \n0.0902 \n0.0673 \n \n \n \nIn this study, the models of MLR, PLSR, SVM, ANNs, RF, k-NN and deep learning were developed on the \nformulation data. Here, three datasets were split by using the MD-FIS algorithm twice without the need \nof personal expertise. In the prediction of SRMT, 4 models were built for the 4 time points (2, 4, 6 and 8 \nhours) by using each of the machine learning methods. The final results of accuracies, root mean squared \nerrors (RMSE) and mean absolute errors (MAE) were shown in Table 2 and Table 3. In the prediction of \nOFDF, for all the models based on the linear or nonlinear conventional machine learning methods, the \naccuracies only reach around 70% on the OFDF validation and test sets. As to the MLR model, the \naccuracies are relatively low than other conventional machine learning models on the OFDF validation \nand test sets. In the prediction of SRMT, the conventional machine learning models made predictions \nwith the accuracies ranging from 25% to 55% on the SRMT validation and test sets, which are far from \nthe satisfied prediction for the formulation development. In summary, all these six conventional machine \nlearning methods could not achieve enough performance for the OFDF and SRMT formulation prediction. \nHere, the training, validation and test sets for training the DNNs are the same as the datasets used for \ntraining the previous machine learning models. A multi-label model was built for the 4 time points (2, 4, \n6 and 8 hours) using deep learning techniques. As shown in Table 2&3, all prediction accuracies of the \ndeep neural networks were over 80%, which could satisfy the requirements of the formulation \nprediction. In both OFDF and SRMT predictions, deep learning got the highest accuracies on the training, \nvalidation and test sets. Deep learning surpassed other conventional machine learning methods because \ndeep learning including multiple hidden layers could transform the low level representation to higher \nlevel features without artificial feature engineering. In SRMT prediction, huge performance \nimprovements of deep learning were found than other machine learning methods. The result indicates \nthat deep learning can greatly improve the model accuracy in multi-label formulation prediction, \nbecause deep learning can leverage the shared information among the multiple tasks. Figure 2 shows the \nexperimental and the deep learning predicted disintegration time of the formulations in the OFDF test \nset. Table 4 lists the f2 values between the experimental and the deep learning predicted cumulative \ndrug released curves of the formulations in the SRMT test set. From these figures and tables, it is quite \nclear that the prediction performance of deep learning is satisfied.  \n \n \nFigure 2 Comparing the experimental and the deep learning predicted disintegration time of the \nformulations in the OFDF test set \n \nTable 4 f2 values between the experimental and the deep learning predicted cumulative drug released \ncurves of the formulations in the SRMT test set \nFormulation \nf2 values \nFormulation \nf2 values \n1 \n77.42 \n11 \n65.72 \n2 \n63.35 \n12 \n90.05 \n3 \n64.84 \n13 \n57.05 \n4 \n67.21 \n14 \n41.91 \n5 \n59.75 \n15 \n55.06 \n6 \n50.85 \n16 \n65.84 \n7 \n77.77 \n17 \n51.08 \n8 \n30.39 \n18 \n49.57 \n9 \n44.56 \n19 \n64.42 \n10 \n74.47 \n20 \n59.35 \n \nFigure 3, 4, 5 and 6 show the relationship between the experimental and the deep learning predicted \nresults on the OFDF and SRMT training, validation and test sets. It could be seen from these figures that \nthe experimental and the deep learning predicted values are very closed. \n0\n20\n40\n60\n80\n100\n1\n2\n3\n4\n5\n6\n7\n8\n9 10 11 12 13 14 15 16 17 18 19 20\nDisintegration time (s)\nFormulation\nExperimental values \nPredicted values\n \n \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nPredicted values (s)\nExperimental values (s)\nTraining set\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nPredicted values (s)\nExperimental values (s)\nValidation set\n \nFigure 3 Relationship between the experimental and the deep learning predicted values of the \ndisintegration time on the OFDF training, validation and test sets. The dotted line indicates experimental \nvalues ± 10s. \n \n \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nPredicted values (s)\nExperimental values (s)\nTest set\nFigure 4 Relationship between the experimental and the deep learning predicted values of the \ncumulative drug release percentages at 2h, 4h, 6h, 8h on the SRMT training set. A is for the values at 2h, \nB is for the values at 4h, C is for the values at 6h, D is for the values at 8h. \n \n \n \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\nA \nB \nC \nD \nFigure 5 Relationship between the experimental and the deep learning predicted values of the \ncumulative drug release percentages at 2h, 4h, 6h, 8h on the SRMT validation set. A is for the values at \n2h, B is for the values at 4h, C is for the values at 6h, D is for the values at 8h. \n \n \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\nA \nB \nC \nD \nFigure 6 Relationship between the experimental and the deep learning predicted values of the \ncumulative drug release percentages at 2h, 4h, 6h, 8h on the SRMT test set. A is for the values at 2h, B is \nfor the values at 4h, C is for the values at 6h, D is for the values at 8h. \n \n \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\n0 10 20 30 40 50 60 70 80 90 100\nPredicted values (%)\nExperimental values (%)\nA \nB \nC \nD \nMultiple linear regression attempts to learn a linear combination of input features to predict the output. \nMultiple linear regression is simple and easy to model. The weights and biases of multiple linear \nregression could be directly calculated by using the least squares method. Multiple linear regression \nhave better interpretability than other nonlinear machine learning models because the weights could \nindicate the importance of the input features in the prediction. However, multiple linear regression and \npartial least squared regression could only could only fit the linear function mapping, while obviously the \nrelationship between the formulation and the key in vitro characteristics is complex and non-linear. \nRandom forest is an ensemble learning method. Ensemble learning methods combining multiple base \nlearners could obtain better generalization ability of models than a single base learner. Random forest \nusually shows better performance than other ensemble learning models in many learning tasks. In \nrandom forest, the diversity of the base learners is not only from the sample disturbance but also from \nthe attribute disturbance, which makes the difference between the base learners increase and the \ngeneralization ability be further improved. Support vector machine maps the sample from the original \nspace to the higher dimensional feature space, therefore, the sample can be divided in the higher \ndimensional feature space. However, the conventional machine learning methods highly rely on the \nfeature extractors designed by the subjective expert experiences. \nFurthermore, the representative abilities of artificial neural networks enhance with the increase of the \nhidden layers and hidden nodes. The larger the model capacity, the more complex function the model \ncan achieve. Therefore, deep learning containing more hidden layers could make multiple abstractions \nand feature extractions, which makes deep learning be able to accomplish more complex tasks to higher \naccuracy than the shallow artificial neural networks. \n3.6. Deep Learning in Formulation Prediction \nOne main difficulty of formulation prediction is the lack of reliable and standard formulation data. The \nlong experimental cycle and high cost of formulation development results in the small data set in this \narea. Moreover, current formulation researches focus on small amount of model drugs, which lead to \nhighly imbalanced data space and further rise the difficulty of formulation prediction for other drugs. \nThis fundamental issue was reported in previous research, in which the data sets are too small or too \nnoisy.30 To solve the issue, 10-fold cross validation was used for assessing the performance of the \nalgorithm, which the R2 value only reached 0.67 or 0.69.30, 44 The prediction is even weaker in smaller \ndata set because the small data set easily results in overfitting and poor generalizations.30 Previous \nsuggestion was to increase the amount of data set 30, but there are very limited formulation data due to \nthe experimental limitation. Euclidean distance was used to estimate the domain of applicability of the \ntrained model.30 Another study indicated that maximum dissimilarity algorithm was able to select \nrepresentative testing data of compounds from chemical databases.42 However, both methods were \ngood for the drug molecules, not for highly complexity formulation data. Deep learning with usual data \nselection algorithms and evaluation criteria is difficult to well predict with the small amount of \nformulation data with imbalanced input space. Therefore, MD-FIS algorithm is suitable for splitting \nformulation data with small sample size and imbalanced input space. In addition, two common \nevaluation metrics for regression problems (e.g. the correlation coefficient and coefficient of \ndetermination) cannot reflect the performance of pharmaceutical prediction models. Specific criteria \nneed to be introduced for evaluating the model performance. \nCurrently there are only two deep learning researches in formulation prediction.25, 44 In Zawbaa’s \nresearch, 68 poly-lactide-co-glycolide formulations were used. Input vector contains 320 features and \n745 release data at specific time points. At the beginning, the feature selection models were developed \nto minimize the input variables.44After that, seven machine learning approaches were compared, such as \ncubist, RF, ANNs, multivariate adaptive regression spline, classification and regression tree, and hybrid \nsystems of fuzzy logic and evolutionary computations. The final results showed RF had the best \nperformance with 0.692 coefficient of determination. Moreover, the prediction of the model was only \nsuitable for 2/3 formulations and the rest 1/3 formulations had high error. The dissolution profiles of 4 \nproteins among total 14 proteins were strongly not recommended by the final model. Formulation \ndevelopment contains high dimensional factors, such as drug diversity, excipient types, drug/excipient \nratios, dosage forms, manufacturing processes and multiple characteristics, which lead to the high \ncomplexity data. Actually, deep learning can automatically learn high level features from data without \nexplicitly providing feature selection model. Combining feature extractors with deep learning model is \nunnecessary and inappropriate. Therefore, this research still needs significant improvement on \nmethodology for formulation prediction. Recently deep learning with MD-FIS was applied for \nformulation prediction of oral fast disintegrating tablets.25 The results showed that the prediction of \ndeep learning was better than that of ANN because deep learning could extract the features \nautomatically without designing feature extractors. In addition, there are some researches about \nmachine learning methods in formulation design, as summarized in Table 1. For example, an expert \nsystem was constructed to predict formulations of oral disintegrating tablets with 15 input parameters.12, \n13 Zhi-hong Zhang et al. built an expert system with ANN for the formulation development of oral \nosmotic pump controlled release tablets. 5, 14 QSAR models were developed to predict the binding \naffinity of β-cyclodextrin and sulfobutylether-β-cyclodextrin complexation. However, these results \nindicated that the conventional machine learning methods need feature extraction before the prediction \nmodels and didn’t showed good prediction performance.  \n \n4. Conclusion \nIn this paper, deep learning models were successfully developed to predict pharmaceutical formulations \non small data. The good generalization performance of the models was demonstrated by the external \ndatasets. The proposed models could effectively predict the key characteristics in regression problems \nthan the models trained by other machine learning methods, because deep learning can find out the \ncomplex correlation in the data. Quality by design (QbD) is one concept that the idea of the \npharmaceutical development should be paid attention throughout the drug development process. \nMachine learning methods could not only help to predict the in vivo and in vitro characteristics based on \nthe formulation and process data, but also assist in the pharmaceutical experiment design and help to \ncontrol the product quality in the whole product cycle. Deep learning shows a broad prospect in the \nimplementation of QbD. We expect deep learning could significantly shorten the drug product \ndevelopment timeline and decrease the material usage. Furthermore, the cross-disciplinary integration \nof pharmaceutics and artificial intelligence may shift the paradigm of pharmaceutical researches from \nexperience-dependent studies to data-driven methodologies. In the future, our laboratory would \ninvestigate other machine learning methods (e.g. transfer learning) for formulation prediction to achieve \nbetter performance. \n \nAcknowledgments \nCurrent research is financially supported by the University of Macau Research Grant (MYRG2016-00038-\nICMS-QRCM, MYRG2016-00040-ICMS-QRCM and MYRG2017-00141-FST), Macau Science and Technology \nDevelopment Fund (FDCT) (Grant No. 103/2015/A3) and the National Natural Science Foundation of \nChina (Grant No. 61562011). \n \n \nReferences \n1 \nZhang W, Zhao Q, Deng J, Hu Y, Wang Y, Ouyang D. Big data analysis of global advances in \npharmaceutics and drug delivery 1980–2014. Drug Discov Today 2017;22:1201-8. \n2 \nSeddon G, Lounnas V, McGuire R, Van Den Bergh T, Bywater RP, Oliveira L, et al. Drug design for \never, from hype to hope. J. Comput-Aided Mol Des 2012;26:137-50. \n3 \nOuyang D, Smith SC. Computational pharmaceutics: Application of molecular modeling in drug \ndelivery. Computational pharmaceutics: Application of molecular modeling in drug delivery. \nwiley; 2015, p. 1-303. \n4 \nRowe RC, Roberts RJ. Artificial intelligence in pharmaceutical product formulation: Knowledge-\nbased and expert systems. Pharm Sci Technol Today 1998;1:153-9. \n5 \nZhang ZH, Pan WS. Expert system for the development and formulation of push-pull osmotic \npump tablets containing poorly water-soluble drugs. In: Formulation tools for pharmaceutical \ndevelopment. Elsevier Ltd; 2013, p. 73-108. \n6 \nMendyk A, Szlȩk J, Jachowicz R. Me_expert 2.0: A heuristic decision support system for \nmicroemulsions formulation development. In: Formulation tools for pharmaceutical \ndevelopment. Elsevier Ltd; 2013, p. 39-71. \n7 \nHan X, Jiang H, Han L, Xiong X, He Y, Fu C, et al. A novel quantified bitterness evaluation model \nfor traditional chinese herbs based on an animal ethology principle. Acta pharmaceutica sinica B \n2018;8:209-17. \n8 \nWang Z, He Z, Zhang L, Zhang H, Zhang M, Wen X, et al. Optimization of a doxycycline \nhydroxypropyl-β-cyclodextrin inclusion complex based on computational modeling. Acta \nPharmaceutica Sinica B 2013;3:130-9. \n9 \nXu W-J, Li N, Gao C-k. Preparation of controlled porosity osmotic pump tablets for salvianolic \nacid and optimization of the formulation using an artificial neural network method. Acta \nPharmaceutica Sinica B 2011;1:64-70. \n10 \nSuñé Neģre JM, Roiģ Carreras M, García RF, Montoya EG, Lozano PP, Aģuilar JE, et al. Sedem \ndiagram: An expert system for preformation, characterization and optimization of tablets \nobtained by direct compression. In: Formulation tools for pharmaceutical development. Elsevier \nLtd; 2013, p. 109-35. \n11 \nWilson WI, Peng Y, Augsburger LL. Generalization of a prototype intelligent hybrid system for \nhard gelatin capsule formulation development. AAPS PharmSciTech [electronic resource]. \n2005;6:E449-57. \n12 \nAguilar-Díaz JE, García-Montoya E, Suñe-Negre JM, Pérez-Lozano P, Miñarro M, Ticó JR. \nPredicting orally disintegrating tablets formulations of ibuprophen tablets: An application of the \nnew sedem-odt expert system. Eur J Pharm Biopharm 2012;80:638-48. \n13 \nAguilar JE, Montoya EG, Lozano PP, Negre JMS, Carmona MM, Grau JRT. New sedem-odt expert \nsystem: An expert system for formulation of orodispersible tablets obtained by direct \ncompression. In: Formulation tools for pharmaceutical development. Elsevier Ltd; 2013, p. 137-\n54. \n14 \nZhang ZH, Dong HY, Peng B, Liu HF, Li CL, Liang M, et al. Design of an expert system for the \ndevelopment and formulation of push-pull osmotic pump tablets containing poorly water-\nsoluble drugs. Int J Pharm 2011;410:41-7. \n15 \nChalortham N, Ruangrajitpakorn T, Supnithi T, Leesawat P. Oxpirt: Ontology-based expert system \nfor production of a generic immediate release tablet. In: Formulation tools for pharmaceutical \ndevelopment. Elsevier Ltd; 2013, p. 203-28. \n16 \nTrnka H, Wu JX, Van De Weert M, Grohganz H, Rantanen J. Fuzzy logic-based expert system for \nevaluating cake quality of freeze-dried formulations. J Pharm Sci 2013;102:4364-74. \n17 \nMerzlikine A, Abramov YA, Kowsz SJ, Thomas VH, Mano T. Development of machine learning \nmodels of β-cyclodextrin and sulfobutylether-β-cyclodextrin complexation free energies. Int J \nPharm 2011;418:207-16. \n18 \nBengio Y, Courville A, Vincent P. Representation learning: A review and new perspectives. IEEE \nTrans Pattern Anal Mach Intell 2013;35:1798-828. \n19 \nLecun Y, Bengio Y, Hinton G. Deep learning. Nature 2015;521:436-44. \n20 \nSchmidhuber J. Deep learning in neural networks: An overview. Neural Netw 2015;61:85-117. \n21 \nKrizhevsky A, Sutskever I, Hinton GE. p 1097-105. \n22 \nHinton G, Deng L, Yu D, Dahl G, Mohamed AR, Jaitly N, et al. Deep neural networks for acoustic \nmodeling in speech recognition: The shared views of four research groups. IEEE Signal Process \nMag 2012;29:82-97. \n23 \nBengio Y, Simard P, Frasconi P. Learning long-term dependencies with gradient descent is \ndifficult. IEEE Trans. Neural Networks 1994;5:157-66. \n24 \nSutskever I, Vinyals O, Le QV. In: Ghahramani Z, Weinberger KQ, Cortes C, Lawrence ND,Welling \nM, Editors. (Neural information processing systems foundation, January ed), p. 3104-12. \n25 \nHan R, Yang Y, Li X, Ouyang D. Predicting oral disintegrating tablet formulations by neural \nnetwork techniques. Asian Journal of Pharmaceutical Sciences 2018. \n26 \nEkins S. The next era: Deep learning in pharmaceutical research. Pharm. Res. 2016;33:2594-603. \n27 \nMamoshina P, Vieira A, Putin E, Zhavoronkov A. Applications of deep learning in biomedicine. \nMol Pharm 2016;13:1445-54. \n28 \nBaskin II, Winkler D, Tetko IV. A renaissance of neural networks in drug discovery. Expert Opin. \nDrug Discov 2016;11:785-95. \n29 \nGawehn E, Hiss JA, Schneider G. Deep learning in drug discovery. Mol Inform 2016;35:3-14. \n30 \nLusci A, Pollastri G, Baldi P. Deep architectures and deep learning in chemoinformatics: The \nprediction of aqueous solubility for drug-like molecules. J Chem Inf Model 2013;53:1563-75. \n31 \nHughes TB, Miller GP, Swamidass SJ. Modeling epoxidation of drug-like molecules with a deep \nmachine learning network. ACS Cent Sci 2015;1:168-80. \n32 \nXu Y, Dai Z, Chen F, Gao S, Pei J, Lai L. Deep learning for drug-induced liver injury. J Chem Inf \nModel 2015;55:2085-93. \n33 \nMa J, Sheridan RP, Liaw A, Dahl GE, Svetnik V. Deep neural nets as a method for quantitative \nstructure-activity relationships. J Chem Inf Model 2015;55:263-74. \n34 \nRamsundar B, Liu B, Wu Z, Verras A, Tudor M, Sheridan RP, et al. Is multitask deep learning \npractical for pharma? J Chem Inf Model 2017;57:2068-76. \n35 \nAltae-Tran H, Ramsundar B, Pappu AS, Pande V. Low data drug discovery with one-shot learning. \nACS Cent Sci 2017;3:283-93. \n36 \nAliper A, Plis S, Artemov A, Ulloa A, Mamoshina P, Zhavoronkov A. Deep learning applications for \npredicting pharmacological properties of drugs and drug repurposing using transcriptomic data. \nMol Pharm 2016;13:2524-30. \n37 \nVanhaelen Q, Mamoshina P, Aliper AM, Artemov A, Lezhnina K, Ozerov I, et al. Design of efficient \ncomputational workflows for in silico drug repurposing. Drug Discov Today 2017;22:210-22. \n38 \nKorotcov A, Tkachenko V, Russo DP, Ekins S. Comparison of deep learning with multiple machine \nlearning methods and metrics using diverse drug discovery data sets. Mol Pharm 2017;14:4462-\n75. \n39 \nPedregosa F, Varoquaux G, Gramfort A, Michel V, Thirion B, Grisel O, et al. Scikit-learn: Machine \nlearning in python. J Mach Learn Res 2011;12:2825-30. \n40 \nShah VP, Tsong Y, Sathe P, Liu JP. In vitro dissolution profile comparison- statistics and analysis of \nthe similarity factor, f2. Pharm Res 1998;15:889-96. \n41 \nMartin TM, Harten P, Young DM, Muratov EN, Golbraikh A, Zhu H, et al. Does rational selection \nof training and test sets improve the outcome of qsar modeling? J Chem Inf Model \n2012;52:2570-8. \n42 \nSnarey M, Terrett NK, Willett P, Wilton DJ. Comparison of algorithms for dissimilarity-based \ncompound selection. J Mol Graph Model 1997;15:372-85. \n43 \nWillett P. Dissimilarity-based algorithms for selecting structurally diverse sets of compounds. J \nComput Biol 1999;6:447-57. \n44 \nZawbaa HM, Szlȩk J, Grosan C, Jachowicz R, Mendyk A. Computational intelligence modeling of \nthe macromolecules release from plga microspheres-focus on feature selection. PLoS One \n2016;11. \n \n",
  "categories": [
    "cs.LG",
    "stat.ML"
  ],
  "published": "2018-09-06",
  "updated": "2018-09-06"
}