{
  "id": "http://arxiv.org/abs/1812.06292v2",
  "title": "A short review on Applications of Deep learning for Cyber security",
  "authors": [
    "Mohammed Harun Babu R",
    "Vinayakumar R",
    "Soman KP"
  ],
  "abstract": "Deep learning is an advanced model of traditional machine learning. This has\nthe capability to extract optimal feature representation from raw input\nsamples. This has been applied towards various use cases in cyber security such\nas intrusion detection, malware classification, android malware detection, spam\nand phishing detection and binary analysis. This paper outlines the survey of\nall the works related to deep learning based solutions for various cyber\nsecurity use cases. Keywords: Deep learning, intrusion detection, malware\ndetection, Android malware detection, spam & phishing detection, traffic\nanalysis, binary analysis.",
  "text": "A short review on Applications of Deep learning for Cyber security  \nMohammed Harun Babu R, Vinayakumar R, Soman KP  \nCenter for Computational Engineering and Networking (CEN), Amrita School of \nEngineering, Coimbatore, Amrita Vishwa Vidyapeetham, India \nEmail: vinayakumarr77@gmail,com \nAbstract  \nDeep learning is an advanced model of traditional machine learning. This has the \ncapability to extract optimal feature representation from raw input samples. This \nhas been applied towards various use cases in cyber security such as intrusion \ndetection, malware classification, android malware detection, spam and phishing \ndetection and binary analysis. This paper outlines the survey of all the works \nrelated to deep learning based solutions for various cyber security use cases. \nKeywords: Deep learning, intrusion detection, malware detection, Android \nmalware detection, spam & phishing detection, traffic analysis, binary analysis. \n1 Introduction \nCyber security involves protective key data and devices from cyber threats. It’s a \nvital part of corporations that collect and maintain large databases of client data, \nsocial platforms wherever personal information were submitted and also the \ngovernment organizations wherever secret, political and defense information \ncomes into measure. It helps in protecting against vulnerable attacks that possess \nthreat to special data, might or not across numerous applications, networks and \ndevices. With the quantity of individuals accessing the information online which is \nincreasing daily and also the threats to the data are increasing, with the cost of on-\nline crimes calculable in billions. Cyber security is that the set of technologies and \nprocesses designed to shield computers, networks, programs, and data from attack, \nunauthorized access, change, or destruction. These systems are composed of \nnetwork security and host security systems, every of those has a minimum firewall, \nantivirus computer code, associated an intrusion detection system (IDS). This \nsurvey summarizes the importance of cyber security using Deep learning \ntechniques (DL). Deep learning technique is been employed by researchers in \nrecent days. Deep learning may be used along side the prevailing automation ways \nlike rule and heuristics based mostly and machine learning techniques. This study \nhelps is understand the advantage of deep learning algorithms to classify and \ncorrelate malicious activities that perceived from the varied sources like DNS, \nemail, URLs etc. Not like ancient machine learning approaches, deep learning \nalgorithms don’t follow any feature engineering and have illustration ways. They \nwill extract best options by themselves. Still, further domain level options got to \noutline for deep learning ways in information science tasks. The cyber security \nevents thought-about during this study are enclosed by texts. To convert text to real \nvalued vectors, numerous linguistic communication process and text mining ways \nare incorporated along with deep learning. \n2 Shared tasks \nIn recent days, to enhance the system performance, shared task is organized as part \nof the conferences. In this shared task initially the train data set will be distributed \namong the participants and the train model will be evaluated on the test data set. \nThis is most familiar in NLP domain recently shared task on identifying phishing \nemail has been organized by [46] . The details of the submitted runs are available \nin [47]. Followed by shared task on detecting malicious domain organized by [48] \nas part of SSCC’18 and ICACCI’18. These two shared tasks allowed participants \nto share their approach through working notes or system description paper. Yearly \nthere is one more shared task conducted by CDMC. But they don’t have an option \nto submit system description papers. But this year (2018) they are giving an option \nto submit system description papers (CDMC 2018). \nOne significant issue was that the most of the publically available data sets are \nvery old and each data set has their own limitations. To overcome such issues a \nbrief study made to understand the need of Security domain, datasets and key \nfeature of data sciences is discussed in [1] for problems employing the data science \ntowards cyber security. \n3. Use-cases in cyber security \n3.1. Intrusion detection \nAn intrusion detection system (IDS) has been developed that’s capable of detection \nevery kind of network attacks within the environments. IDS detect malicious \nnetwork activities by analyzing the collected packets, alarms to computer user, and \nblocks attack connections from attacks [2]. It additionally connects with the \nfirewall as an elementary technology for network security. The characteristics of \nnetwork is been assessed into Host based intrusion detection (HIDS) which \ninvolves in putting package and monitors internal packets of the system. To \nperform intrusion detection HIDS gathers data from its system calls, OS audit \ntrails, application logs, etc. Network based intrusion detection which detects the \nmalicious activity in network traffic. Generally, intrusion detection algorithms unit \nclassified into 2 methods: misuse detection (Signature based) and anomaly \ndetection. Signature based IDS: It is a technique looks a series of bytes or sequence \nwith malicious network and helps in track down the detail log of the system which \ncause false alarm. Anomaly based IDS: It helps in identifying the anomalies and \nindicates serious and rare events overt the system and rectifies the unusual traffic \npattern in a network. To resolve the disadvantage of these two detection method \nHybrid IDS has been proposed which combines the complexity of anomaly and \nissue detection system and gets with new framework. Now-a-days, self-learning \nsystem becomes one of the prominent methods. Machine learning is one of the \npowerful concepts. Most of the ML solutions resulted in achieving the high false \npositive rate and high machine computation. This is due to most of machine \nlearning techniques comes with the learning patterns among small-scale, low-level \nfeature patterns of traditional and attack connections records. Most notably \nmachine learning comes with deep learning which will be outlined as a better \nmodel of machine learning algorithms. These will help in learning the \nrepresentation techniques with high advanced hierarchic sequence. In [3] proposed \na model for novel deep learning approach in NIDS operation over networks, with \ncombination of deep and shallow learning methods. This helps in analysis of \nnetwork traffic over non symmetric deep auto encoder technique (NDAE). In [4], \n[5], [6] a brief study explains that Long short term memory(LSTM), Recurrent \nneural network(RNN), Convolution neural network(CNN) performs well in IDS \nsystems when compared to other machine learning algorithms. CNN with n-gram \ntechnique is briefly discussed along with hybrid network such as CNN, CNN-\nrecurrent \nneural \nnetwork \n(CNN-RNN), \nCNN-long \nshort-term \nmemory \n(CNNLSTM) and CNN-gated recurrent unit (GRU).These techniques helps in \nidentification of good and bad network ID in network connections. CNN has the \ncapacity to gain high level feature representation from low level feature sets during \nextraction process is disused in [4]. Following with [5], [7] system call modeling \nbased approach with ensemble method is proposed using LSTM algorithm for \nanomaly based IDS system. System call modeling helps in capture of semantic \nmeaning of every call and relation over the network. Ensemble methods focus on \nfalse alarm rate which fits IDS design. This is a compact method, which helps in \nstorage of parameters in a small space. This method is considered as fast and \nefficient approach in sequential matrix application. Application of deep neural \nnetworks is leveraged for intrusion detection by [52]. Recently, [54] discussed the \nvarious security issues in autonomous vehicles. \n3.2. Malware detection \nMalwares are programs which disrupts the data, files in the system which reduces \nthe vulnerability and performance. In some cases it will lead to total corruption of \nsystem or a server [8]. These are easily passed through various environments using \nunauthorized software tools. There is existing some works in which deep learning \nhas become one of the prominent methods in malware analysis [9]. In [10] binary \nand multiclassifier techniques are used for classification which gives better result \nwhen processed with rectified linear unit activation functions and dropout over the \nhidden networks. In [8], [11] deep learning approach applied with four layer \nnetwork design is discussed. To get modest computation feature text extraction \ntechniques such as Byte/Entropy Histogram Features, PE Import Features, String \n2D histogram features; PE Metadata Features can be used. A brief discussion is \nmade to show how to prevent overfitting and how backpropagation method helps \nin speeding up the learning process over the network. In [12], [9] echo state \nnetworks (ESNs) and recurrent neural networks (RNNs) helps in extracting full \ninformation by random temporal projection technique. Max pooling is used for \nnon-linear sampling of data and logistic regression for final classification of data. \nIn [13], discussed an advances malware technique known as Ransomware. It is a \nkind of crypto viral extortion which helps encrypt the files and gather information \nwithout other knowledge. In [14], [13] deep learning algorithm LSTM is been \napplied on API calls by binary sequence classification method. In [51] evaluated \nthe performance of classical machine learning classifiers and deep neural networks \non malware detection. \n3.3. Android malware detection \nAndroid device has becoming a popular nowadays among peoples. Malware \ndetection becomes a big challenge in android platform. Deep learning along with \nNLP comes with a great breakthrough in this area [15], [16] Droid detector is a \nGoogle app helps in collect malware data. The collected data is processed for both \nstatic and dynamic analysis for feature extraction and it is characterized by DBN \nbased approach. In [17] comes up with semantic information extraction from \nsystem call sequence method using NLP which helps in construction of deep \nlearning model. LSTM model is constructed with effective number of hidden \nlayers to achieve better result. Time cost function is used for classification by \nimplementing different framework like Tensorflow [49] to speed up the process. \nThis model is been compared with n-gram model which is considered as superior \ndetection method in android malware. Hyper parametric tuning is been done in \nLSTM network, LSTM-RNN network topology explains how the architecture \nhelps in get better result [18].[19], [20]. The effectiveness of the API call sequence \nis been studied, To perform this CNN is been approached by discussing the \ntraining size and sequence length which gives better indication in false and \nnegative positive. \n3.4. Detection and categorization of domain names generated by Domain \nname generation algorithms (DGAs) \nDomain \nfluxing \nmalwares \nare \npossessed \nthrough \ndomain \ngeneration \nalgorithm(DGA).These malwares encodes through domain or IP address by \nblocking the network from further communication to server and the host [21]. The \ndetailed study on DNS log collection and deep learning for detecting malicious \ndomain names in large scale is discussed in [22], [65]. In [23] explains DNS logs \nin side LAN environment which use deep learning algorithms for detection of \nmalicious domain names and compared with the traditional machine learning \nalgorithm. They claimed that the deep learning algorithms performed well in \ncomparison to the traditional machine learning algorithms and moreover these \nalgorithms remain as robust in an adversarial environment. In [24] describes a \ndetail study on statistical feature approach on DGA systems by splitting the \nfeatures into domain length, domain level using n-gram technique. In this approach \nHidden markov model (HMM) is been used for classification. These traditional \ntechniques are very slow and poor in the performance of false and true positives \n[25], [26]. [27] Deep learning technique helps in discrimination of DGA domains \nfrom non DGA domains. In [28] focused mainly on Character based method using \nneural networks such as RNN, CNN and Hybrid CNN. In RNN Endgame model is \nused which improves the model performance by adding dropout to overcome \ndropout during training phase along with embedding technique. To get a better \npredictive accuracy CMU model is implemented along with Bidirectional RNN \n[29]. The NYU and Invincea models are discussed with CNN and hybrid \narchitecture of CNN is explained along with MIT model. All this models consists \nof multiple layers and are termed as most extensive architectures. In [30], [31] \nLSTM network comes up with an advantage of featureless extraction of raw \ndomain names as an input is also discussed. In [50] proposed a unique framework \nwhich correlated the data’s of DNS, URL and Email to increase malicious \nactivities detection rate.  \n3.5. Spam and phishing detection \nThe study shows that the spam email is the act of sending undesirable information \nor mass information in a substantial amount to some email accounts. It is a part of \nelectronic spam including almost indistinguishable messages sent to different \nbeneficiaries by email. Along with phishing other cyber-crime technique scams \nother personal information such as passwords, credit card details, bank accounts \netc. These problems are rectified using deep leaning techniques with Natural \nlanguage processing (NLP). In [32] represented the phishing techniques over mail \nusing unbalanced dataset. Mainly in this various techniques such as term \nfrequency-inverse \ndocument \nfrequency \n(TF-IDF), \nNonnegative \nMatrix \nFactorization (NMF), bag of words are discussed for feature extraction and also \nalgorithms such as Random forest(RF), logistic regression, k-nearest neighbor, \nMulti nominal navies Bayes are used. In which LR and MLB comes with high \nmetric performance. In [33] neural network approach is discussed by applying \npearl script for feature extraction which helps to get dataset in a vector format. A \ncomparative study is done on the extracted dataset using Traditional machine \nlearning algorithms in which Decision tree (DT), and neural network approach \nperformed well. In [34] discussed about the NLP feature extraction techniques \nusing methods such as character level embedding and word embedding. A \ncomparative study is made among Support vector machine (SVM) using character \nlevel and CNN using both character and word embedding techniques. In which \nCNN using word embedding gives a better result. In [35] showed a new LSTM \napproach in which dataset are considered as a hierarchical email architecture by \nconsidering it as sentences and words. Bidirectional LSTM is used for both cases \nwhich helps in compute the weight and estimates the phishing probability over the \ndata during the network computation. In [36] neural network is used for \nclassification of URL phishing it consists of three layer linear network which \nmakes the topology very light and compact. Malicious threat over URL’s is been \nanalyzed by character sequence. Embedding technique is used with RNN and \nhybrid CNN networks which helps in studying how to develop a shelter for web \npage content analysis from malicious URL’s with faster web page response. In [53] \nthe application of CNN is leverage for image spam detection. In [55] discussed the \napplication of CNN and CNN-LSTM for phishing URL detection and compared \nwith bi-gram text representation. Recently, a shared task on phishing email \ndetection was organized as part of CODASPY’18 conference and the detailed \ninformation is discussed in [56-64]. \n3.6. Traffic Analysis \nIn [37] the density and the volume of internet traffic is been increasing day by day. \nIdentification of data flow through the network is considered as a major problem in \ntraffic analysis. In [38] discuss traditional method using Artificial neural network \nand deep learning methods and result shows that in feature learning, unknown \nprotocol identification this approach very well but it could give better adaptation in \nnon-automation method in traditional method. Deep packet framework for \nextracting features automatically form network traffic using Deep learning method \nis proposed in [17] these packets help in handle sophisticated task like multi \nchallenging, traffics etc. In [39], [40] proposed an architecture for Shallow and \ndeep network for secure shell protocol. In [41] which RNN network helps to \nclassify and model the tunnel SSH by modeling the time series feature to identify \nstatistical information of the traffic flow. \n3.7. Binary Analysis \nBinary analysis is a powerful security analysis tool which looks into binary codes \nand finds the vulnerability issues with uncertainty deploying in free and open \nsoftware. Static analysis can understand the pattern of the code to find \nvulnerabilities. Now-a-days automated analysis method is combined with deep \nlearning method which has overcome the pattern based limitations [42]. In [43] \ndiscussed about that different problems faced in binary analysis and how it can be \nsolved using neural networks. Many benchmark approaches are analyzed with \nRNN, LSTM and GRU networks. To rectify Gradient descent over the hidden \nlayers, optimization is done with rmsprop method. This is also been discussed with \nbackground behind all networks with time function, error analysis, function \nidentification and limitation of network. In [44] also came with RNN network but \nin this work so many experiments are performed on machine code snippets. These \nsnippets are performed on LLVM and MIPS binaries data using tokenization \nscheme. These helps in extraction of higher level structure from lower level binary \nstructure. In [45] presents a new system EKLAVYA which helps in recovering \nfunction type signatures from disassembled binary codes using RNN network. \nArgument recovery module on RNN is implemented using techniques like saliency \nmapping and sanitization. This system helps in learn calling conventions and \nidioms with high level accuracy parameter. In [42] discussed deep learning method \non assembly codes which help to analysis the software weakness. In this Text-\nCNN is been analyzed using Instruction2vec and word2vec which has given high \naccuracy in classification of text data.  \n4. Conclusion \nDeep learning is a prominent algorithm employed in several cyber security areas. \nConsidering several traditional methods and machine learning methods deep \nlearning algorithms considered as a robust way to solve problems. From this study \nit is clear that most of the deep learning algorithms comes up with better accuracy \nrate, which will be helpful in building an real time application for analyzing \nmalicious activities over network. \nReferences \n[1] R. Verma, Security analytics: Adapting data science for security challenges, in: \nProceedings of the Fourth ACM International Workshop on Security and Privacy \nAnalytics, ACM, 2018, pp. 40–41. \n[2] R. Vinayakumar, K. Soman, P. Poornachandran, Evaluating effectiveness of \nshallow and deep networks to intrusion detection system, in: Advances in \nComputing, Communications and Informatics (ICACCI), 2017 International \nConference on, IEEE, 2017, pp. 1282–1289. \n[3] N. Shone, T. N. Ngoc, V. D. Phai, Q. Shi, A deep learning approach to network \nintrusion detection, IEEE Transactions on Emerging Topics in Computational \nIntelligence 2 (1) (2018) 41–50. \n \n[4] R. Vinayakumar, K. Soman, P. Poornachandran, Applying convolutional neural \nnetwork for network intrusion detection, in: Advances in Computing, \nCommunications and Informatics (ICACCI), 2017 International Conference on, \nIEEE, 2017, pp. 1222–1228. \n[5] G. Kim, H. Yi, J. Lee, Y. Paek, S. Yoon, Lstm-based systemcall language \nmodeling and robust ensemble method for designing host-based intrusion detection \nsystems, arXiv preprint arXiv:1611.01726. \n[6] R. C. Staudemeyer, C. W. Omlin, Evaluating performance of long short-term \nmemory recurrent neural networks on intrusion detection data, in: Proceedings of \nthe South African Institute for Computer Scientists and Information Technologists \nConference, ACM, 2013, pp. 218–224. \n[7] R. Vinayakumar, K. Soman, P. Poornachandran, Long shortterm memory based \noperation log anomaly detection, in: Advances in Computing, Communications \nand Informatics (ICACCI), 2017 International Conference on, IEEE, 2017, pp. \n236–242. \n[8] J. Saxe, K. Berlin, Deep neural network based malware detection using two \ndimensional binary program features, in: Malicious and Unwanted Software \n(MALWARE), 2015 10th International Conference on, IEEE, 2015, pp. 11–20. \n[9] G. E. Dahl, J. W. Stokes, L. Deng, D. Yu, Large-scale malware classification \nusing random projections and neural networks, in: Acoustics, Speech and Signal \nProcessing (ICASSP), 2013 IEEE International Conference on, IEEE, 2013, pp. \n3422–3426. \n[10] W. Huang, J. W. Stokes, Mtnet: a multi-task neural network for dynamic \nmalware classification, in: International Conference on Detection of Intrusions and \nMalware, and Vulnerability Assessment, Springer, 2016, pp. 399–418. \n[11] R. Rahul, T. Anjali, V. K. Menon, K. Soman, Deep learning for network flow \nanalysis and malware classification, in: International Symposium on Security in \nComputing and Communication, Springer, 2017, pp. 226–235. \n[12] R. Pascanu, J. W. Stokes, H. Sanossian, M. Marinescu, A. Thomas, Malware \nclassification with recurrent networks, in: Acoustics, Speech and Signal Processing \n(ICASSP), 2015 IEEE International Conference on, IEEE, 2015, pp. 1916–1920. \n[13] R. Vinayakumar, K. Soman, K. S. Velan, S. Ganorkar, Evaluating shallow and \ndeep networks for ransomware detection and classification, in: Advances in \nComputing, Communications and Informatics (ICACCI), 2017 International \nConference on, IEEE, 2017, pp. 259–265. \n[14] S. Maniath, A. Ashok, P. Poornachandran, V. Sujadevi, A. P. Sankar, S. Jan, \nDeep learning lstm based ransomware detection, in: Control, Automation & Power \nEngineering (RDCAPE), 2017 Recent Developments in, IEEE, 2017, pp. 442–446. \n[15] R. Vinayakumar, K. Soman, P. Poornachandran, Deep android malware \ndetection and classification, in: Advances in Computing, Communications and \nInformatics (ICACCI), 2017 International Conference on, IEEE, 2017, pp. 1677–\n1683. \n[16] Z. Yuan, Y. Lu, Y. Xue, Droiddetector: android malware characterization and \ndetection using deep learning, Tsinghua Science and Technology 21 (1) (2016) \n114–123. \n[17] X. Xiao, S. Zhang, F. Mercaldo, G. Hu, A. K. Sangaiah, Android malware \ndetection based on system call sequences and lstm, Multimedia Tools and \nApplications (2017) 1–21. \n[18] R. Vinayakumar, K. Soman, P. Poornachandran, S. Sachin Kumar, Detecting \nandroid malware using long short-term memory (lstm), Journal of Intelligent & \nFuzzy Systems 34 (3) (2018) 1277–1288. \n[19] R. Nix, J. Zhang, Classification of android apps and malware using deep \nneural networks, in: Neural Networks (IJCNN), 2017 International Joint \nConference on, IEEE, 2017, pp. 1871–1878. \n[20] M. Yousefi-Azar, V. Varadharajan, L. Hamey, U. Tupakula, Autoencoder-\nbased feature learning for cyber security applications, in: Neural Networks \n(IJCNN), 2017 International Joint Conference on, IEEE, 2017, pp. 3854–3861. \n \n[21] R. Vinayakumar, K. Soman, P. Poornachandran, S. Sachin Kumar, Evaluating \ndeep learning approaches to characterize and classify the dgas at scale, Journal of \nIntelligent & Fuzzy Systems 34 (3) (2018) 1265–1276. \n[22] R. Vinayakumar, P. Poornachandran, K. Soman, Scalable framework for \ncyber threat situational awareness based on domain name systems data analysis, in: \nBig Data in Engineering Applications, Springer, 2018, pp. 113–142. \n[23] R. Vinayakumar, K. Soman, P. Poornachandran, Detecting malicious domain \nnames using deep learning approaches at scale, Journal of Intelligent & Fuzzy \nSystems 34 (3) (2018) 1355–1367. \n[24] M. Antonakakis, R. Perdisci, Y. Nadji, N. Vasiloglou, S. AbuNimeh, W. Lee, \nD. Dagon, From throw-away traffic to bots: Detecting the rise of dga-based \nmalware., in: USENIX security symposium, Vol. 12, 2012. \n[25] T. Barabosch, A. Wichmann, F. Leder, E. Gerhards-Padilla, Automatic \nextraction of domain name generation algorithms from current malware, in: Proc. \nNATO Symposium IST-111 on Information Assurance and Cyber Defense, \nKoblenz, Germany, 2012. \n[26] B. Yu, D. L. Gray, J. Pan, M. De Cock, A. C. Nascimento, Inline dga \ndetection with deep networks, in: 2017 IEEE International Conference on Data \nMining Workshops (ICDMW), IEEE, 2017, pp. 683–692. \n[27] F. Zeng, S. Chang, X. Wan, Classification for dga-based malicious domain \nnames with deep learning architectures, International Journal of Intelligent \nInformation Systems 6 (6) (2017) 67. \n[28] B. Yu, J. Pan, J. Hu, A. Nascimento, M. De Cock, Character level based \ndetection of dga domain names. \n[29] P. Lison, V. Mavroeidis, Automatic detection of malware generated domains \nwith recurrent neural models, arXiv preprint arXiv:1709.07102. \n[30] J. Woodbridge, H. S. Anderson, A. Ahuja, D. Grant, Predicting domain \ngeneration algorithms with long short-term memory networks, arXiv preprint \narXiv:1611.00791. \n[31] B. Athiwaratkun, J. W. Stokes, Malware classification with lstm and gru \nlanguage models and a character-level cnn, in: Acoustics, Speech and Signal \nProcessing (ICASSP), 2017 IEEE International Conference on, IEEE, 2017, pp. \n2482–2486. \n[32] http://www2.cs.uh.edu/ rmverma/anti-phishing-pilot.pdf. \n[33] N. Zhang, Y. Yuan, Phishing detection using neural network, CS229 lecture \nnotes. \n[34] C. Lennan, B. Naber, J. Reher, L. Weber, End-to-end spam classification with \nneural networks. \n[35] R. Vinayakumar, K. Soman, P. Poornachandran, Evaluating deep learning \napproaches to characterize and classify malicious url’s, Journal of Intelligent & \nFuzzy Systems 34 (3) (2018) 1333–1343. \n[36] K. Shima, D. Miyamoto, H. Abe, T. Ishihara, K. Okada, Y. Sekiya, H. Asai, \nY. Doi, Classification of url bitstreams using bag of bytes. \n[37] D. Smit, K. Millar, C. Page, A. Cheng, H.-G. Chew, C.-C. Lim, Looking \ndeeper: Using deep learning to identify internet communications traffic, Macquarie \nMatrix: Special edition, ACUR 1 (2017) 1318–1323. \n[38] Z. Wang, The applications of deep learning on traffic identification, BlackHat \nUSA. \n[39] R. Vinayakumar, K. Soman, P. Poornachandran, Evaluating shallow and deep \nnetworks for secure shell (ssh) traffic analysis, in: Advances in Computing, \nCommunications and Informatics (ICACCI), 2017 International Conference on, \nIEEE, 2017, pp. 266–274. \n[40] R. Vinayakumar, K. Soman, P. Poornachandran, Secure shell (ssh) traffic \nanalysis with flow based features using shallow and deep networks, in: Advances \nin Computing, Communications and Informatics (ICACCI), 2017 International \nConference on, IEEE, 2017, pp. 2026–2032. \n[41] R. Vinayakumar, K. Soman, P. Poornachandran, Applying deep learning \napproaches for network traffic prediction, in: Advances in Computing, \nCommunications and Informatics (ICACCI) 2017 International Conference on, \nIEEE, 2017, pp. 2353–2358. \n[42] Y. J. Lee, S.-H. Choi, C. Kim, S.-H. Lim, K.-W. Park, Learning binary code \nwith deep learning to detect software weakness. \n[43] E. C. R. Shin, D. Song, R. Moazzezi, Recognizing functions in binaries with \nneural networks., in: USENIX Security Symposium, 2015, pp. 611–626. \n[44] D. S. Katz, J. Ruchti, E. Schulte, Using recurrent neural networks for \ndecompilation, in: 2018 IEEE 25th International Conference on Software Analysis, \nEvolution and Reengineering (SANER), IEEE, 2018, pp. 346–356. \n[45] Z. L. Chua, S. Shen, P. Saxena, Z. Liang, Neural nets can learn function type \nsignatures from binaries, in: Proceedings of the 26th USENIX Conference on \nSecurity Symposium, Security, Vol. 17, 2017. \n[46] https://dasavisha.github.io/IWSPA-sharedtask/ \n[47] http://www2.cs.uh.edu/rmverma/anti-phishing-pilot.pdf \n[48] http://nlp.amrita.edu/DMD2018 \n[49] Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., ... & Kudlur, \nM. (2016, November). Tensorflow: a system for large-scale machine learning. In \nOSDI (Vol. 16, pp. 265-283). \n[50] Vinayakumar, R., Soman, K. P., Poornachandran, P., Mohan, V. S., & Kumar, \nA. D. (2019). ScaleNet: Scalable and Hybrid Framework for Cyber Threat \nSituational Awareness Based on DNS, URL, and Email Data Analysis. Journal of \nCyber Security and Mobility, 8(2), 189-240. \n[51] Vinayakumar, R., & Soman, K. P. (2018). DeepMalNet: Evaluating shallow \nand deep networks for static PE malware detection. ICT Express. \n[52] Rahul, V. K., Vinayakumar, R., Soman, K. P., & Poornachandran, P. (2018, \nJuly). Evaluating Shallow and Deep Neural Networks for Network Intrusion \nDetection Systems in Cyber Security. In 2018 9th International Conference on \nComputing, Communication and Networking Technologies (ICCCNT) (pp. 1-6). \nIEEE. \n[53] Kumar, A. D., & KP, S. (2018). DeepImageSpam: Deep Learning based \nImage Spam Detection. arXiv preprint arXiv:1810.03977. \n[54] Kumar, A. D., Chebrolu, K. N. R., & KP, S. (2018). A Brief Survey on \nAutonomous Vehicle Possible Attacks, Exploits and Vulnerabilities. arXiv preprint \narXiv:1810.04144. \n[55] Vazhayil, A., Vinayakumar, R., & Soman, K. P. (2018, July). Comparative \nStudy of the Detection of Malicious URLs Using Shallow and Deep Networks. In \n2018 9th International Conference on Computing, Communication and Networking \nTechnologies (ICCCNT) (pp. 1-6). IEEE. \n[56] Barathi Ganesh HB and Vinayakumar R and Soman KP and Anand Kumar M, \nDistributed representation using target classes: Bag of tricks for security and \nprivacy analytics amrita-nlp@iwspa 2018, pp. 11–16. URL http://ceur-ws.org/Vol-\n2124/#paper_10 \n[57] Vinayakumar R and Barathi Ganesh HB and Anand Kumar M and Soman Kp, \nDeepanti-phishnet: Applying deep neural networks for phishing email detection \ncen-aisecurity@iwspa-2018, \npp. \n40–50. \nURL \nhttp://ceur-ws.org/Vol-\n2124/#paper_9 \n[58] Vysakh S Mohan and Naveen J R and Vinayakumar R and Soman KP, A.r.e.s \n: Automatic rogue email spotter crypt coyotes, pp. 58–64. URL http://ceur-\nws.org/Vol-2124/#paper_13 \n[59] Anu Vazhayil and Harikrishnan NB and Vinayakumar R and Soman KP, Ped-\nml: Phishing email detection using classical machine learning techniques \ncensec@amrita, pp. 70–77. \nURL http://ceur-ws.org/Vol-2124/#paper_11 \n[60] Nidhin A Unnithan and Harikrishnan NB and Vinayakumar R and Soman KP, \nDetecting phishing e-mail using machine learning techniques cen-securenlp, pp. \n51–57. URL http://ceur-ws.org/Vol-2124/#paper_17 \n[61] Nidhin A Unnithan and Harikrishnan NB and Akarsh S and Vinayakumar R \nand Soman KP, Machine learning based phishing e-mail detection security-\ncen@amrita, pp. 65–69. URL http://ceur-ws.org/Vol-2124/#paper_12 \n[62] Hiransha M and Nidhin A Unnithan and Vinayakumar R and Soman KP, \nDeep learning based phishing e-mail detection cen-deepspam, pp. 17–21. URL \nhttp://ceur-ws.org/Vol-2124/#paper_16 \n[63] Harikrishnan NB and Vinayakumar R and Soman KP, A machine learning \napproach towards phishing email detection cen-security@iwspa 2018, pp. 22–29. \nURL http://ceur-ws.org/Vol-2124/#paper_7 \n[64] Ayman El Aassal and Luis Moraes and Shahryar Baki and Avisha Das and \nRakesh Verma, Anti-phishing pilot at acm iwspa 2018 evaluating performance \nwith new metrics for unbalanced datasets, pp. 2–10. URL http://ceur-ws.org/Vol-\n2124/#anti-phishing-pilot \n[65] Vinayakumar, R., Soman, K. P., Poornachandran, P., & Menon, P. A deep-\ndive on Machine learning for Cybersecurity use cases. Machine Learning for \nComputer and Cyber Security: Principle, Algorithms, and Practices. CRC Press, \nUSA. \n",
  "categories": [
    "cs.CR",
    "cs.AI",
    "cs.LG"
  ],
  "published": "2018-12-15",
  "updated": "2019-01-30"
}