{
  "id": "http://arxiv.org/abs/1908.01699v1",
  "title": "Thoth: Improved Rapid Serial Visual Presentation using Natural Language Processing",
  "authors": [
    "David Awad"
  ],
  "abstract": "Thoth is a tool designed to combine many different types of speed reading\ntechnology. The largest insight is using natural language parsing for more\noptimal rapid serial visual presentation and more effective reading\ninformation.",
  "text": "Improved Rapid Serial Visual Presentation using \nNatural Language Processing \nDavid Awad \nGeorgia Institute of Technology \ndavidawad@gatech.edu \nAbstract—​Thoth is a tool designed to combine many different\n \n  \n \n \n \n \n \n \ntypes of speed reading technology. It’s largest insight is using\n \n \n \n \n \n \n \n \n \n \nnatural language parsing for more optimal rapid serial visual\n \n \n \n \n \n \n \n \n \npresentation and more effective reading information.  \n \n1​ INTRODUCTION \nThere has been a lot of work in the fields of cognitive neuroscience and\n \n \n \n \n \n \n \n \n \n \n \n \n \n \npsychology on speed reading. The primary focus of a lot of this kind of research\n \n \n \n \n \n \n \n  \n \n \n \n \n \n \ngenerally has been to determine what the capabilities are of people to read faster.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThere is a lot of content to read out there. It can be thought of in a general sense\n   \n \n \n \n \n \n \n  \n \n \n \n \n  \n \n \nthat there is high, medium, and low fidelity content. Generally we are not so\n \n \n \n \n \n \n \n \n \n \n \n \n \n \ninterested in speed reading Hemingway. However we are often interested in\n \n \n \n \n \n \n \n \n \n \n \nspeed reading, or skimming, large documents that contain a lot of information\n \n \n \n \n \n \n \n  \n \n \n \nwe don’t need, and only some information we do.  \nWe don’t always need to get a complete understanding that has all the details\n \n \n \n \n \n  \n \n \n \n \n \n \n \nwhen reading a document. Sometimes just “thumbing through” a document is\n \n  \n \n \n \n \n  \n  \nenough to get a general understanding.  \n \n1.1 Some background on Reading  \nWhen reading documents in general we’re actually doing something that’s quite\n \n \n \n \n \n \n \n \n \n \n \nnew for humanity. The notion of written language itself is a very recent\n \n \n \n \n \n \n \n \n \n \n \n \n \ndevelopment in human history. The first writing was found in Ancient\n \n \n \n \n \n \n \n \n \n \n \nMesopotamia, Sumeria and Egypt, with the majority of the oldest samples\n \n \n \n \n \n \n \n \n \n \n \noriginating around 3100 B.C. (Schmandt-Besserat, 1986) Not a lot of evolution\n \n \n \n \n \n \n  \n \n \n \nhappens in 5000 years. It may not come as a surprise that when we read, what\n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \nwe’re actually using are visual facilities that ​are not evolutionarily optimal for\n \n \n \n \n \n \n \n \n \n \n \n \n1 \nthis process. Dehaene and Cohen concluded the eye did not evolve for reading.\n \n \n \n \n \n \n \n \n \n \n \n \n \n(Dehaene & Cohen, 2011) \nThe eyes are pretty good at the process of reading, but what they’re doing isn’t\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nexactly what we think of when we normally discuss reading. Our brains actually\n \n \n \n \n \n \n \n \n \n \n \n \n \nsees (and chunks) words we already know as a single picture instead of reading\n \n \n \n \n \n \n \n  \n \n \n \n \n \nat the granularity of ​individual ​letters like we would for a new word we might not\n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \nknow as well like lugubrious, licentiousness, or hagiography . (Gelzer et. al,\n \n \n \n \n \n \n \n \n \n \n \n1\n2015).  \nNeurons in a small area of the brain retain what the whole word looks like using\n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \nwhat could be called a visual dictionary. This area is called the visual word form\n \n \n \n  \n \n \n \n  \n \n \n \n \n \narea (VWFA) and it resides in the left side of the visual cortex. There’s another\n \n \n  \n \n \n \n \n \n \n \n \n \n \n \npart of the visual cortex on the other side of the visual cortex that recognizes\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nfaces.  \n \n1.2 Supporting Research on Reading in the Modern World  \nStudents today are reading content digitally.—​Students today read much less on\n \n \n \n \n \n \n \n \n \n \n \ntraditional sources such as paper, and much more on electronic sources such as\n \n \n \n \n \n \n \n \n \n \n \n \n \ncomputers, tablets, and cell phones (Cartelli, 2012).  \n \nThe visual medium when simplified can make reading easier—​Using tools like\n \n \n \n \n \n \n \n \n \n \n \ntachistoscopes , researchers Mark D. Jackson and James L. McClelland were able\n \n \n \n \n \n \n \n \n \n \n \n2\nto find that you could effectively measure participants ability to read quickly.\n \n \n \n \n \n \n \n \n \n \n \n \nThey found that faster readers were better able to process the information they\n \n \n \n \n \n \n \n \n \n \n \n \n \nwere seeing more quickly. They also found that if the encoding of visual\n \n \n \n \n \n \n \n \n \n \n \n \n \ninformation was more efficient, that more of that “processing time” could be put\n \n \n \n \n \n \n \n \n \n \n \n \n \n1 Other candidate words to make my point here were words like nikhedonia, alysm, and\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nshivviness.  \n2 A tachistoscope is a device that displays an image for a specific amount of time. It can\n \n \n   \n \n \n \n \n \n  \n \n \n \n  \n \nbe used to increase recognition speed, to show something too fast to be consciously\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nrecognized, or to test which elements of an image are memorable. \n \n \n2 \nto understanding the content and not interpreting the medium. (Jackson,\n \n \n \n \n \n \n \n \n \n \nMcClelland, 1975) \n \nLine Lengths and Screens impacts on reading—​Lines ​with a length of 55 cpl\n \n \n \n \n \n \n \n  \n \n \n \n \n(characters per line) were found to support effective speed and comprehension.\n \n \n \n \n \n \n \n \n \n \n \n(Dyson, et. al, 2001). They also found that fast readers spend less time between\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nmoving from one line to the next. They also found that users were not reading\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nthe lines while scrolling, resulting in some wasted time.  \nThey also found “a definition of effective reading therefore needs to differentiate\n \n \n \n \n \n \n \n \n \n \n \n \nbetween faster reading and more accurate recall of what is read.” (Dyson, et. al,\n \n \n \n \n \n \n \n \n  \n \n \n \n \n2001). The most ​important lesson from their research was that “Both very short\n \n \n \n \n \n \n \n \n \n \n \n \n \nand very long line lengths can slow down reading through disrupting the normal\n \n \n \n \n \n \n \n \n \n \n \n \n \npattern of eye movements.”  \n \n“By reading almost twice as fast as normal we increase the volume\n \n \n \n \n \n \n \n \n \n \n \n \nof material we get through on screen but acquire a less complete\n \n \n \n \n \n \n \n \n  \n \n \naccount of a document. Faster readers reading at their normal\n \n  \n \n \n \n \n \n \n \nspeed, can recall more than slower readers” (Dyson, et. al, 2001) \n  \nPrint Size can improve reading speed.—​Another study found that in general\n \n \n \n \n \n \n \n \n \n \n \nslower non-dyslexic readers required larger print size to support their maximum\n \n \n \n \n \n \n \n \n \n \n \nreading speed. (O'Brien, 2005) \n \nPaper is better for comprehension.—​Reading on paper is better than reading on\n \n \n \n \n \n \n \n \n \n \n \n \nscreen in terms of reading comprehension. (Yiren, et. al, 2018) Another study on\n \n \n \n \n \n \n \n \n \n \n \n \n \nNorwegian school districts found that we should expect a significant impact on\n \n \n \n \n \n \n \n  \n \n \n \nreading performance. (Mangen, 2013). Scrolling specifically seems to really\n \n \n \n \n \n \n \n \n \nimpede reading performance. \n \n3 \nPaper and Digital offer similar speeds.—​Reading on paper is not significantly\n \n \n \n \n \n \n \n \n \n \n \ndifferent from reading on screen in terms of reading speed. (Yiren, et. al, 2018) \n1.3 RSVP Tools  \nThere are tools that have been created to attempt to make it easier to solve\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \ndifferent aspects of the reading process and make it faster for users. The most\n \n \n \n \n \n \n \n  \n \n \n \n \n \ncommon class of these tools are called RSVP, or Rapid Serial Visual Presentation.\n \n \n \n \n \n \n \n \n \n \n \n \n \nThese RSVP tools generally iterate through a corpus given by the user, and\n \n \n \n \n \n  \n \n \n \n \n \n \ndisplays each word, one at a time, through a focused textbox.  \n \nFigure 1.​ Words are displayed through a speed reading device. Source: Rayner, K. ​sagepub.com \nFrom a technical perspective simply displaying the text alone is not particularly\n  \n \n \n \n \n \n \n  \n \n \ncomplex, and there have been many tools that simply display words quickly. It’s\n \n \n \n \n \n \n \n \n \n \n \n \n \npossible to download one of these tools and set the reading speed to 700 words\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nper minute (700 wpm) and each word will be displayed for exactly the same\n \n \n \n \n \n \n \n \n \n \n \n \n \n \namount of time (roughly 11.6 words per second). This may work for very simple\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nsamples of text however just like with normal reading, new words can change\n \n \n \n \n \n \n \n \n \n \n \n \n \nthe meaning of a sentence, and unfamiliar words require more time for the brain\n \n \n  \n \n \n \n \n \n \n \n \n \n \nto process and internalize than less familiar words. In addition words of different\n \n \n \n \n \n \n \n \n \n \n \n \n \nlengths and complexities have to be dealt with differently. All of this is to say\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nthat a lot of conventional tooling around this hasn’t made many serious attempts\n  \n \n \n \n \n \n \n \n \n \n \n \nto be more ​intelligent​ about the problem.  \n4 \nWords in a sentence are not equivalent in meaning, nor are they equivalent\n \n  \n \n \n \n \n \n \n \n \n \n \nlength or difficulty to read. Showing words for the same amounts of time is a\n \n \n \n \n \n \n \n \n \n \n \n \n \n  \npoor way to go about the problem.  \n \n2 RELATED WORK \nSimple versions of this concept have been built in the form of tools such as\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAccelerator​. They are not very technically impressive. They simply display the\n \n \n \n \n \n \n \n \n \n \n \nwords faster and one by one.  \nThere are many other applications that simply run similar (if not the exact same)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \ntechnology such as ​Reedy​, ​Readsy , and ​Outread​. The most popular RSVP\n \n \n \n \n \n \n \n \n \n \n \n3\napplication by far is Spritz, which seems to be the biggest mover in this space.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSpritz does a similar thing to the rest of the pack but has built a good user\n \n  \n \n \n \n \n \n \n \n \n \n \n  \n \n \nexperience around the reading tool itself.  \nThe biggest issue with a lot of these tools is that they’re closed source technology.\n \n \n \n  \n \n \n \n  \n \n \n \n \n \nAnd it’s rare that these businesses actually take off as people usually don’t pay\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nfor them.  \nZethos is an open source version of Spritz that’s free and available to anyone. It is\n  \n \n \n \n \n \n \n \n \n \n \n \n   \none of the few open source tools for speed reading available today, and perhaps\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nthe most usable. It’s not very well built, but works well for small demonstrations\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nand has gotten some very crucial parts of the user experience right. .  \nThe only other application worth mentioning here is ​Beeline​. This company is\n \n \n \n \n \n \n \n \n \n \n \n \nnot using RSVP technology. What they do is illustrate a color gradient along with\n \n \n \n \n \n \n  \n  \n \n \n \n \nthe paragraph text to solve some of the issues with associating words across line\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nbreaks in a large chunk of text. It leverages the fact that visually the colors of the\n \n  \n \n \n \n  \n \n \n \n \n \n \n \n \n \ntext does impact the association and enables easier reading, especially when\n \n \n \n \n \n \n \n \n \n \n \nreading on something like a ​subway car​. It works surprisingly well and is worth\n \n \n \n  \n \n  \n \n \n \n  \n \nbeing aware of. \n \nThoth is the first project of it’s kind to re-approach the question of RSVP by using\n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nmachine intelligence instead of the original set-number of milliseconds per word\n \n \n \n \n \n \n \n \n \n \n \n3 The authors felt it important to note these are real public-facing product names.  \n5 \napproach. This work sets the stage for applying machine intelligence to the field\n \n \n \n \n \n \n \n \n \n \n \n \n \nof RSVP speed reading tools. This is not a novel project in terms of breaking new\n \n \n \n \n \n  \n  \n \n \n \n \n \n \n \ntechnical ground; but Thoth is a natural step in a larger narrative of artificial\n \n \n \n \n  \n \n \n  \n \n \n \n \nintelligence and natural language processing capabilities being used to improve\n \n \n \n \n \n \n \n \n \n \nand disrupt previous methods of doing things. By being open source from the\n \n \n \n \n \n \n \n \n \n \n \n \n \nbeginning; the stage is set for this work to be improved on and extended by the\n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \ncommunity.  \nIt’s already been shown that speed reading tools can be more effective in a lot of\n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \ndifferent situations just by determining the optimal recognition point to more\n \n \n \n \n \n \n \n \n \n \n \nquickly recognize new words through the eyes as images. Where improvement\n \n \n \n \n \n \n \n \n \n \n \ncan be made is by using a speed reading tool that can show you the familiar\n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \nwords, or “images”, at the faster speed and slowing down at the times where\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nmore time needs to be spent for the reader to be able to follow along. This allows\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \na user to get more comprehension while still vastly increasing their reading\n \n \n \n \n \n \n \n \n \n \n \n \nspeed. \n \n3 SOLUTION \nThoth is an open source speed reading tool that implements an RSVP speed\n \n \n \n \n \n \n \n \n \n \n \n \n \nreader. The biggest differentiators for Thoth are that it’s open source, it’s ease of\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nuse compared to other alternatives, and it’s flexibility. Not only does it combine\n \n \n \n \n \n \n \n \n \n \n  \n \nthe features of other speed reading tools that exist, it uses natural language\n \n \n \n \n \n \n \n \n \n \n \n \n \nprocessing and artificial intelligence to interpret the difficulty of the text it’s\n \n \n \n \n \n \n \n \n \n \n \n \nbeing given and customizes it’s presentation based on this to the reader.  \n \n6 \n \nFigure 2. ​A screenshot of the thoth landing page when paused. Source: ​thoth-reader​. \nWhen text or a PDF files is entered into Thoth it parses the text content it\n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \nreceives, and allows the user to apply a color gradient to the text body as well as\n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \nparse out each word and match a display time to each word. It applies various\n \n \n \n \n \n  \n \n \n \n \n  \n \n \nmeasurements of the text in order to determine an estimate of the age of the\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nreader that would be required in order to easily understand the text sample\n \n \n \n \n \n \n \n \n \n \n \n \n \ngiven. What’s even better is the user can specify their age and the speed will be\n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \nadjusted for a younger or older reader to be able to move at a more appropriate\n \n  \n \n \n \n \n \n \n \n \n \n  \n \n \nspeed.  \n \n4 METHODOLOGY  \nThoth as a tool is somewhat similar to most speed readers as far as basic\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nfunctionality. It allows you to input some text and it displays it for you. Where it\n  \n \n \n \n \n \n \n  \n  \n \n \n  \nmakes innovations on previous work is around the display time. Thoth uses a\n \n \n \n \n \n \n \n \n \n \n \n  \nfew measurements with some different tools to understand more about the text it\n \n \n \n \n \n \n \n \n \n \n \n  \nwas given.  \nIt uses measures such as the ​Automated Readability Index​, the ​Dale–Chall\n \n \n \n \n \n \n \n \n \n \n \nreadability formula​, the ​Flesch–Kincaid readability tests​, ​SMOG (Simple Measure\n \n \n \n \n \n \n \n \n \nof Gobbledygook), ​Gunning Fog​, ​Spache​, and ​Coleman Liau​. With these\n \n \n \n \n \n \n \n \n \n \n7 \nmeasurements it can gauge the grade level and age. It also uses Dale–Chall to\n  \n \n \n \n \n \n \n  \n \n \n \n \ndetermine how familiar a word is to a user.  \nGiven that the top 1000 words comprise 80% of the english language it makes\n \n \n \n \n \n \n \n \n \n \n \n  \n \nsense that our brains would be able to quickly recognize those words and need\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nsome more time to recognize other words, Thoth adjusts the display timings to\n \n \n \n \n \n \n \n \n \n \n \n \n \nreflect that for each individual word.  \n \n5 RESULTS \nThe results have been clear. The tool is freely available to the public and is the\n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \nonly RSVP tool ever created to attempt to use natural language parsing and\n \n \n \n \n \n \n \n \n \n \n \n \n \nenglish language knowledge to better prepare content for rapid presentation.  \n \n6 LIMITATIONS \nIt is entirely possible that there are better metrics than Dale–Chall to determine\n \n \n \n \n \n \n \n \n \n \n \n \n \nwhat words are not “familiar” to the average reader and warrant more time. The\n \n \n \n \n \n \n \n \n \n \n \n \n \n \ntool has the ability to use other dictionaries such as Spache or Flesch-Kincaid. In\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nterms of the usefulness of the tool it doesn’t ​seem to make a significant different\n \n \n \n \n \n \n  \n \n \n \n  \n \n \nwhich dictionary is used, as all of them tend to result in a lot of the same words\n \n  \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \nbeing displayed longer. Dale–Chall turned out to be the most effective for the\n \n \n \n \n \n \n \n \n \n \n \n \n \nauthor.  \n \n7 CONCLUSION  \nThoth is far and away a more usable speed reader than the existing alternatives.\n  \n \n \n  \n \n \n \n \n \n \n \n \nWith an emphasis on convenience using PDF file parsing and smarter per-word\n \n \n \n \n \n \n \n \n \n \n \n \nprocessing, it is much easier for a user to access and load content into it. Thoth\n  \n \n \n \n  \n \n \n \n \n \n \n \n \n \nhas enabled users to read through medium and low fidelity content faster on\n \n \n \n \n \n \n \n \n \n \n \n \n \naverage while retaining more context and comprehension than they otherwise\n \n \n \n \n \n \n \n \n \n \nwould have with similar RSVP tools.  \n \n8 \n8 FUTURE WORK  \n8.1 Tunable Parameters \nThoth uses fixed assumptions about how much longer to display a word that is\n \n \n \n \n \n \n \n \n \n  \n \n  \n“unfamiliar”. There are gradations of complexity in words and it is possible we\n \n \n \n \n \n \n \n \n   \n \n \nare losing time by simply scaling the display time of each unfamiliar word by ​1.5​. \n \n8.2 Other Dictionaries \nThere is more than one dictionary put out by researchers that claims to easily\n \n \n \n \n \n \n \n \n \n \n \n \n \n \ndefine the most familiar and most common words. Dale–Chall is only one of\n \n \n \n \n \n \n \n \n \n \n \n \n \nthose dictionaries that worked nicely for Thoth’s use case. There are many others\n \n \n \n \n \n \n \n \n \n \n \n \n \nand there is work to be done on which potentially is ​most​ effective.  \n \n8.3 User Research \nAs with many other studies that have appeared in the literature before this, it’s\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nquite possible that we could run a study with some potential users, compare\n \n \n \n \n \n  \n \n \n \n \n \n \nThoth users, with Spritz users, and normal readers and observe how their\n \n \n \n \n \n \n \n \n \n \n \n \ninformation compares afterwards.  \n \n8.4 Speed Writing \nThe original intent with Thoth was to enable users to more quickly read through\n \n \n \n \n \n \n \n \n \n \n \n \n \n \ntext that they wanted to get a general understanding of. The equivalent of a\n \n \n \n \n \n  \n \n \n \n \n \n  \n“thumbing through” of the text. One of the next pieces of the project was to\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nattack the problem from the other end. Since there is a dichotomy of ​familiar and\n \n \n \n \n \n \n \n \n   \n \n \n \n \nunfamiliar words within the literature; it stands to reason that you could\n \n \n \n \n \n \n \n \n \n \n \n \nimplement features for speed ​writing ​rather than just reading.  \nTo put it simply, if you imagine a thesaurus as a mapping of semantically similar\n \n  \n  \n \n  \n \n  \n \n \n \n \nwords; If you could substitute out difficult words for simpler or familiar words\n \n \n \n \n \n \n \n \n \n \n \n \n \nthat have the same meaning but are ​faster​ for the mind to recognize.  \nThat is to say, using natural language processing to explore computationally\n \n \n \n \n \n \n \n \n \n \n \nreducing the english language complexity of text samples given to the speed\n \n \n \n \n \n \n \n \n \n \n \n \n9 \nreader for the brain could make it even faster for a user to read the text. There are\n \n \n \n \n \n  \n \n \n  \n \n \n \n \n \n \n \nsome ethical arguments to be made about editing the text on behalf of the user,\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nbut this could potentially be a very helpful and effective feature.  \n \n9 REFERENCES \n1.\nhttps://www.k12reader.com/what-is-reading-comprehension/ \n2.\nRayner, K., Schotter, E. R., Masson, M. E. J., Potter, M. C., & Treiman, R.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(2016). So Much to Read, So Little Time: How Do We Read, and Can\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nSpeed Reading Help? Psychological Science in the Public Interest, 17(1),\n \n \n \n \n \n \n \n \n \n \n4–34. ​https://doi.org/10.1177/1529100615623267 \n3.\nJack M. Fletcher (2006) Measuring Reading Comprehension, Scientific\n \n \n \n \n \n \n \n \nStudies of Reading, 10:3, 323-330, DOI: 10.1207/s1532799xssr1003_7 \n4.\nAlexander, P. A., & Jetton, T. L. (2000). Learning from text: A\n \n \n \n \n \n \n \n \n \n \n \n \nmultidimensional and developmental perspective. In M. L. Kamil, P. B.\n \n \n \n \n \n \n \n \n \n \nMosenthal, P. D. Pearson, & R. Barr (Eds.), Handbook of reading research\n \n \n \n \n \n \n \n \n \n \n \n \n(Vol., 3, pp. 285–310). Mahwah, NJ: Erlbaum \n5.\nBrown, J. I., Fischo, V. V., & Hanna, G. S. (1993). Nelson-Denny Reading\n  \n \n \n \n \n \n \n \n \n \n \n \nTest. Chicago: Riverside. Cook, T. D., & Campbell, D. A. (1979).\n \n \n \n \n \n \n \n \n \n \n \nQuasi-experimental design: Design and analysis issues. Chicago: Rand\n \n \n \n \n \n \n \n \nMcNally \n6.\nFoorman, B. R., Francis, D. J., Davidson, K. C., Harm, M. W., & Griffin, J.\n \n \n \n \n \n \n \n \n \n \n \n  \n  \n(2004). Variability in text features in six grade 1 basal reading programs.\n \n \n \n \n \n \n \n  \n \n \n \nScientific Studies of Reading, 8, 167–197. \n7.\nWoodcock,\nR.\nW.,\nMcGrew,\nK.\nS.,\n&\nMather,\nN.\n(2001).\n \n \n \n \n \n \n \n \n \n \nWoodcock–Johnson III Tests of Achievement. Itasca, IL: Riverside. \n8.\nAllington R. L., “Fluency, The Neglected Reading Goal.” ​The Reading\n \n \n \n \n \n \n \n \n \n \nTeacher ​36: 556-551 \n9.\nAnderson, R. C., & Ortony, A. (1975). On putting apples into bottles – a\n \n \n \n \n \n \n \n \n \n \n \n   \nproblem of polysemy. Cognitive Psychology, 7, 167–180. \n10. Dehaene, S., Pegado, F., Braga, L. W.; Ventura, P., Nunes F. G., Jobert, A.,\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDehaene-Lambertz, G., Kolinsky, R., Morais, J ; Cohen, L., Dehaene, S,\n \n \n \n \n   \n \n \n \n \nHow Learning to Read Changes the Cortical Networks for Vision and\n \n \n \n \n \n \n \n \n \n \n \nLanguage. Science (New York, N.Y.), December 3, 2010, Vol.330(6009),\n \n \n \n \n \n \n \n \n \npp.1359-1364. \n10 \n11. Deheane, S. (2009). ​Reading in the Brain: The Science and Evolution of a\n \n \n \n \n \n \n \n \n \n \n \n  \nHuman Invention​. New York: Viking Adult, Penguin Publishing. \n12. Morrison & Rayner, (1981). ​Saccade size in reading depends upon character\n \n \n \n \n \n \n \n \n \n \n \nspaces\nand\nnot\nvisual\nangle​.\nRetrieved\nMay\n23,\n2019,\nfrom\n \n \n \n \n \n \n \n \n \n \nhttps://link-springer-com.prx.library.gatech.edu/content/pdf/10.3758%2F\nBF03206156.pdf  \n13. Unknown, (2019). ​What is the amplitude of a wave? Retrieved May 23, 2019,\n \n \n  \n \n   \n \n \n \n \n \nfrom ​http://cse.ssl.berkeley.edu/light/measure_amp.html \n14. Rayner, K., Inhoff, A. W., Morrison, R. E., Slowiaczek, M. L., & Bertera, J.\n \n \n \n \n \n \n \n \n \n \n  \n  \nH. (1981). Masking of foveal and parafoveal vision during eye fixations in\n \n \n \n \n \n \n \n \n \n \n \n \nreading. Journal of Experimental Psychology: Human Perception and\n \n \n \n \n \n \n \n \nPerformance,\n7(1),\n167–179.\n \n \n \nhttps://doi-org.prx.library.gatech.edu/10.1037/0096-1523.7.1.167 \n15. Unknown, (2019). ​Who is the Fastest Reader in the World? Retrieved May 23,\n \n \n  \n \n \n \n \n \n \n \n \n \n2019,\nfrom\n \n \nhttps://www.toptenreviews.com/software/articles/who-is-the-fastest-read\ner-in-the-world/ \n16. Jackson, M. D., McClelland, J. L. (30 July 1975). ​Sensory and Cognitive\n \n \n \n \n \n \n \n \n \n \n \n \nDeterminants of Reading Speed​. Retrieved May 23, 2019. \n17. Dyson, Mary C, and Mark Haselgrove. “The Influence of Reading Speed\n \n \n \n \n \n \n \n \n \n \n \nand\nLine Length on the Effectiveness of Reading from Screen.”\n \n \n \n \n \n \n \n \n \n \nInternational Journal of Human-Computer Studies​, vol. 54, no. 4, 2001, pp.\n \n \n \n \n \n \n \n \n \n \n \n585–612., doi:10.1006/ijhc.2001.0458. \n18. American\nOptometric\nAssociation,\nRetrieved\nMay\n23, 2019, from\n \n \n \n \n \n \n \n \nhttps://www.aoa.org/patients-and-public/resources-for-teachers/how-you\nr-eyes-work \n19. William C. Shiel Jr., (December 12 2018). ​Definition of Optic Nerve​.\n \n \n \n \n \n \n \n \n \n \n \nhttps://www.medicinenet.com/script/main/art.asp?articlekey=4653 \n20. Unknown, (2019). ​Protecting Sight​. Sightsavers. Retrieved May 23, 2019,\n \n \n \n \n \n \n \n \n \nfrom ​https://www.sightsavers.org/protecting-sight/the-eyes/ \n21. O'Brien, B., Mansfield, J., & Legge, G. (2005). The effect of print size on\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nreading speed in dyslexia. Journal of Research in Reading, 28(3), 332-349. \n22. V E Palchikov, D Y Zolotarev, K V Danilenko & A A Putilov (1997) Effects\n  \n   \n   \n    \n \n \n \nof the Seasons and of Bright Light Administered at Different Times of\n \n \n \n \n \n \n \n \n \n \n \n \nDay on Sleep EEG and Mood in Patients with Seasonal Affective\n \n \n \n \n \n \n \n \n \n \n \nDisorder,\nBiological\nRhythm\nResearch,\n28:2,\n166-184,\nDOI:\n \n \n \n \n \n \n \n10.1076/brhm.28.2.166.12994 \n11 \n23. Kong, Seo, & Zhai. (2018). Comparison of reading performance on screen\n \n \n \n \n \n \n \n \n \n \n \nand on paper: A meta-analysis. Computers & Education, 123, 138-149. \n24. Cartelli, A., ​Current trends and future practices for digital literacy and\n \n \n \n \n \n \n \n \n \n \n \ncompetence​. Hershey, PA : IGI Global.  \n25. Tarasov, Sergeev, & Filimonov. (2015). Legibility of Textbooks: A\n \n \n \n \n \n \n \n \n \nLiterature Review. Procedia - Social and Behavioral Sciences, 174,\n \n \n \n \n \n \n \n \n \n1300-1308. \n26. Mangen, Anne, Walgermo, Bente R., & Bronnick, Kolbjorn. (2013).\n \n \n \n \n \n \n \n \n \nReading Linear Texts on Paper versus Computer Screen: Effects on\n \n \n \n \n \n \n \n \n \n \nReading Comprehension. International Journal of Educational Research,\n \n \n \n \n \n \n \n58(C), 61-68. \n27. Dehaene, S., Pegado, F., Braga, L. W.; Ventura, P., Nunes F. G., Jobert, A.,\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nDehaene-Lambertz, G., Kolinsky, R., Morais, J ; Cohen, L., Dehaene, S,\n \n \n \n \n   \n \n \n \n \nHow Learning to Read Changes the Cortical Networks for Vision and\n \n \n \n \n \n \n \n \n \n \n \nLanguage. Science (New York, N.Y.), December 3, 2010, Vol.330(6009),\n \n \n \n \n \n \n \n \n \npp.1359-1364. \n28. Tulving, E. (2002). Episodic Memory: From Mind to Brain. Annual\n \n \n \n \n \n \n \n \n \n \nReview of Psychology., 53(1), 1-25. \n29. Neath, I., Surprenant, A. M. In Taflinger M. (Ed.), Human memory (2nd\n \n \n \n \n \n \n \n \n \n \n \n \ned.), 2003. Canada: Vicki Knight \n30. Unknown, (2017). ​Memory Loss and Gains of Older Adults​. Sentab.\n \n \n \n \n \n \n \n \n \n \nRetrieved\nMay\n29,\n2019,\nfrom\n \n \n \n \n \nhttps://s3-eu-west-1.amazonaws.com/www-documents/Memory+in+older\n+age_v2.pdf \n31. Nai Ding, Lucia Melloni, Hang Zhang, Xing Tian, & David Poeppel.\n \n \n \n \n \n \n \n \n \n \n \n(2015). Cortical tracking of hierarchical linguistic structures in connected\n \n \n \n \n \n \n \n \n \nspeech. Nature Neuroscience, 19(1), 158-15864. \n32. Nelson, M., El Karoui, I., Giber, K., Yang, X., Cohen, L., Koopman, H., . . .\n \n \n \n \n \n \n \n \n \n \n \n \n    \nDehaene, S. (2017). Neurophysiological dynamics of phrase-structure\n \n \n \n \n \n \n \nbuilding during sentence processing. Proceedings of the National\n \n \n \n \n \n \n \n \nAcademy\nof\nSciences\nof\nthe\nUnited\nStates\nof\nAmerica, 114(18),\n \n \n \n \n \n \n \n \n \n \nE3669-E3678. \n33. Bird, S., Klein, E. and Loper, E., (2019) ​Natural Language Processing with\n \n \n \n \n \n \n \n \n \n \n \n \nPython​,\nRetrieved\nMay\n30,\n2019,\nfrom\n \n \n \n \n \n \nhttps://www.nltk.org/book/ch08.html \n12 \n34. Humphrey, N., & Weiskrantz, L. (1969). Size Constancy in Monkeys with\n \n \n \n \n \n \n \n \n \n \n \nInferotemporal Lesions. Quarterly Journal of Experimental Psychology,\n \n \n \n \n \n \n \n21(3), 225-238. \n35. Deheane, S. (2009). ​Reading in the Brain: The Science and Evolution of a\n \n \n \n \n \n \n \n \n \n \n \n  \nHuman Invention​. New York: Viking Adult, Penguin Publishing. \n36. Smith; Kosslyn (2007). Cognitive Psychology: Mind and Brain. New\n \n \n \n \n \n \n \n \n \nJersey: Prentice Hall. pp. 21, 194–199, 349. \n37. Frankland, S. M., Greene, J. D., (2015), ​Structured meaning in superior\n \n \n \n \n \n \n \n \n \n \n \ntemporal cortex, ​Proceedings of the National Academy of Sciences Sep\n \n \n \n \n \n \n \n \n \n \n2015, 112 (37) 11732-11737; DOI: 10.1073/pnas.1421236112 \n38. Foster, J. (2002). THE OXFORD HANDBOOK OF MEMORY. Brain,\n \n \n \n \n \n \n \n \n \n125(2), 439-441. \n39. Oakley, B., A Mind for Numbers: How to Excel at Math and Science\n \n \n \n \n \n \n \n \n \n \n \n \n \n(Even If You Flunked Algebra). New York: Penguin-Random House,\n \n \n \n \n \n \n \n \n \n2014. \n40. Oakley, B. (2015). Learning How We Learn: In an unlikely confluence,\n \n \n \n \n \n \n \n \n \n \n \nbioengineers are finding fertile ground in research and teaching about\n \n \n \n \n \n \n \n \n \n \nlearning. IEEE Pulse, 6(2), 37-41. \n41. Miller, G., & Kintsch, Walter. (1994). The Magical Number Seven, Plus or\n \n \n \n \n \n \n \n \n \n \n \n \nMinus Two: Some Limits on Our Capacity for Processing Information.\n \n \n \n \n \n \n \n \n \n \nPsychological Review, 101(2), 343-352. \n42. Schmandt-Besserat, D. (1986). The Origins of Writing: An Archaeologist's\n \n \n \n \n \n \n \n \n \nPerspective. Written Communication, 3(1), 31-45. \n43. The brain-targeted teaching model for 21st-century schools. (2012).\n \n \n \n \n \n \n \n \nReference and Research Book News, 27(2), Reference and Research Book\n \n \n \n \n \n \n \n \n \n \nNews, Vol.27(2). \n44. Dehaene, & Cohen. (2011). The unique role of the visual word form area\n \n \n \n \n \n \n \n \n \n \n \n \n \nin reading. Trends in Cognitive Sciences, 15(6), 254-262. \n45. Glezer, L., Kim, J., Rule, J., Jiang, X., & Riesenhuber, M. (2015). Adding\n \n \n \n \n \n \n \n \n \n \n \n \n \nwords to the brain's visual dictionary: Novel word learning selectively\n \n \n \n \n \n \n \n \n \n \nsharpens orthographic representations in the VWFA. The Journal of\n \n \n \n \n \n \n \n \n \nNeuroscience : The Official Journal of the Society for Neuroscience,\n  \n \n \n \n \n \n \n \n \n35(12), 4965-4972. \n13 \n46. Johnson, R., & Eisler, M. (2012). The importance of the first and last letter\n \n \n \n \n \n \n \n \n \n \n \n \n \n \nin words during sentence reading. Acta Psychologica., 141(3), 336-351. \n47. McElree,\nB.\n(2000).\nSentence\ncomprehension\nis\nmediated\nby\n \n \n \n \n \n \n \n \ncontent-addressable\nmemory structures. Journal of Psycholinguistic\n \n \n \n \n \n \nResearch., 29(2), 111-123. \n48. Kincaid, J.P., Fishburne, R.P., Rogers, R.L., & Chissom, B.S. (1975).\n \n \n \n \n \n \n \n \n \n \nDerivation of new readability formulas (automated readability index, fog\n \n \n \n \n \n \n \n \n \ncount, and flesch reading ease formula) for Navy enlisted personnel.\n \n \n \n \n \n \n \n \n \n \nResearch Branch Report 8–75. Chief of Naval Technical Training: Naval\n \n \n \n \n \n \n \n \n \n \nAir Station Memphis. \n49. Kincaid, J., & Delionbach, L. (1973). Validation of the Automated\n \n \n \n \n \n \n \n \n \n \nReadability Index: A Follow-Up. Human Factors: The Journal of Human\n \n \n \n \n \n \n \n \n \n \nFactors and Ergonomics Society, 15(1), 17-20. \n50. Dale, E., & Chall, J. (1948). A Formula for Predicting Readability.\n \n \n \n \n \n \n \n \n \n \n \nEducational Research Bulletin, 27(1), 11-28. \n51. Flesch, R. (1948). A new readability yardstick. Journal of Applied\n \n \n \n \n \n \n \n \n \n \nPsychology, 32(3), 221-233. \n52. Hedman, A. (2008). Using the SMOG Formula to Revise a Health-Related\n \n \n \n \n \n \n \n \n  \n \nDocument. American Journal of Health Education, 39(1), 61-64. \n53. Spache, G. (1953). A New Readability Formula for Primary-Grade\n \n \n \n \n \n \n \n \n \nReading Materials. The Elementary School Journal, 53(7), 410-413. \n54. Coleman, M., & Liau, T. (1975). A computer readability formula designed\n \n \n \n \n \n  \n \n \n \n \nfor machine scoring. Journal of Applied Psychology, 60(2), 283-284. \n \n10 APPENDIX \n \nLatest Version :  \nThe latest version of the source code as well as each of the branches for the\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nmilestones are freely available on ​GitHub.com​.  \n14 \nOnline Hosted Version :  \nThe latest stable version is freely available and running on ​Heroku​. You can visit\n \n \n \n  \n \n \n \n \n \n \n \n \n \nit in a browser here: ​https://thoth-reader.herokuapp.com​. \n  \nSupporting Open Source Libraries :  \nThere were numerous javascript libraries that turned out to be really valuable for\n \n \n \n \n \n \n \n \n \n \n \n \n \nspeeding up my development of Thoth.  \n-\nCompromise js from MIT  \n-\nThe set of linguistic javascript modules from ​github/words \n \n \n \n15 \n",
  "categories": [
    "cs.CL",
    "cs.HC"
  ],
  "published": "2019-08-05",
  "updated": "2019-08-05"
}