{
  "id": "http://arxiv.org/abs/1909.05359v1",
  "title": "From Textual Information Sources to Linked Data in the Agatha Project",
  "authors": [
    "Paulo Quaresma",
    "Vitor Beires Nogueira",
    "Kashyap Raiyani",
    "Roy Bayot",
    "Teresa Gonçalves"
  ],
  "abstract": "Automatic reasoning about textual information is a challenging task in modern\nNatural Language Processing (NLP) systems. In this work we describe our\nproposal for representing and reasoning about Portuguese documents by means of\nLinked Data like ontologies and thesauri. Our approach resorts to a specialized\npipeline of natural language processing (part-of-speech tagger, named entity\nrecognition, semantic role labeling) to populate an ontology for the domain of\ncriminal investigations. The provided architecture and ontology are language\nindependent. Although some of the NLP modules are language dependent, they can\nbe built using adequate AI methodologies.",
  "text": "From Textual Information Sources to Linked Data in the\nAgatha Project\nPaulo Quaresma[0000−0002−5086−059X ], Vitor Beires Nogueira[0000−0002−0793−0003],\nKashyap Raiyani[0000−0002−6166−2038], Roy Bayot[0000−0002−1290−0239], and Teresa\nGonçalves[0000−0002−1323−0249]\nUniversidade de Évora, Portugal\nLISP - Laboratory of Informatics, Systems and Parallelism\n{pq,vbn,kshyp,rkbayot,tcg}@uevora.pt\nAbstract. Automatic reasoning about textual information is a challenging task\nin modern Natural Language Processing (NLP) systems. In this work we de-\nscribe our proposal for representing and reasoning about Portuguese docu-\nments by means of Linked Data like ontologies and thesauri. Our approach re-\nsorts to a specialized pipeline of natural language processing (part-of-speech\ntagger, named entity recognition, semantic role labeling) to populate an ontol-\nogy for the domain of criminal investigations. The provided architecture and\nontology are language independent. Although some of the NLP modules are\nlanguage dependent, they can be built using adequate AI methodologies.\nKeywords: Linked Data, Ontology, Natural Language Processing, Events.\n1\nIntroduction\nThe automatic identiﬁcation, extraction and representation of the information con-\nveyed in texts is a key task nowadays. In fact, this research topic is increasing its rele-\nvance with the exponential growth of social networks and the need to have tools that\nare able to automatically process them [11].\nSome of the domains where it is more important to be able to perform this kind of\naction are the juridical and legal ones. Effectively, it is crucial to have the capability\nto analyse open access text sources, like social nets (Twitter and Facebook, for in-\nstance), blogs, online newspapers, and to be able to extract the relevant information\nand represent it in a knowledge base, allowing posterior inferences and reasoning.\nIn the context of this work, we will present results of the R&D project Agatha1,\nwhere we developed a pipeline of processes that analyses texts (in Portuguese, Span-\nish, or English) and is able to populate a specialized ontology [17] (related to criminal\nlaw) for the representation of events, depicted in such texts. Events are represented\nby objects having associated actions, agents, elements, places and time. After having\npopulated the event ontology, we have an automatic process linking the identiﬁed\nentities to external referents, creating, this way, a linked data knowledge base.\n1 http://www.agatha-osi.com/en/\narXiv:1909.05359v1  [cs.CL]  3 Sep 2019\n2\nP. Quaresma et al.\nIt is important to point out that, having the text information represented in an\nontology allows us to perform complex queries and inferences, which can detect pat-\nterns of typical criminal actions.\nAnother axe of innovation in this research is the development, for the Portuguese\nlanguage, of a pipeline of Natural Language Processing (NLP) processes, that allows\nus to fully process sentences and represent their content in an ontology. Although\nthere are several tools for the processing of the Portuguese language, the combina-\ntion of all these steps in a integrated tool is a new contribution.\nMoreover, we have already explored other related research path, namely author\nproﬁling [19], aggression identiﬁcation [18] and hate-speech detection [21] over so-\ncial media, plus statute law retrieval and entailment for Japanese [22].\nThe remainder of this paper is organized as follows: Section 2 describes our pro-\nposed architecture together with the Portuguese modules for its computational pro-\ncessing. Section 3 discusses different design options and Section 4 provides our con-\nclusions together with some pointers for future work.\n2\nFramework for Processing Portuguese Text\nThe framework for processing Portuguese texts is depicted in Fig. 1, which illustrates\nhow relevant pieces of information are extracted from the text. Namely, input ﬁles\n(Portuguese texts) go through a series of modules: part-of-speech tagging, named\nentity recognition, dependency parsing, semantic role labeling, subject-verb-object\ntriple extraction, and lexicon matching.\nThe main goal of all the modules except lexicon matching is to identify events\ngiven in the text. These events are then used to populate an ontology.\nThe lexicon matching, on the other hand, was created to link words that are found\nin the text source with the data available not only on Eurovoc [2] thesaurus but also\non the EU’s terminology database IATE [6] (see Section 2.7 for details).\nMost of these modules are deeply related and are detailed in the subsequent sub-\nsections.\n2.1\nPart-Of-Speech Tagging\nPart-of-speech tagging happens after language detection. It labels each word with a\ntag that indicates its syntactic role in the sentence. For instance, a word could be a\nnoun, verb, adjective or adverb (or other syntactic tag). We used Freeling [14] library\nto provide the tags. This library resorts to a Hidden Markov Model as described by\nBrants [12]. The end result is a tag for each word as described by the EAGLES tagset 2.\n2.2\nNamed Entity Recognition\nWe use the named entity recognition module after part-of-speech tagging. This mod-\nule labels each part of the sentence into different categories such as \"PERSON\",\n2 https://talp-upc.gitbook.io/freeling-4-0-user-manual/tagsets/tagset-pt\nFrom Textual Information Sources to Linked Data in the Agatha Project\n3\nFig. 1. System Overview.\n\"LOCATION\", or \"ORGANIZATION\". We also used Freeling to label the named en-\ntities and the details of the algorithm are shown in the paper by Carreras et al [15].\nAside from the three aforementioned categories, we also extracted \"DATE/TIME\"\nand \"CURRENCY\" values by looking at the part-of-speech tags: date/time words\nhave a tag of \"W\", while currencies have \"Zm\".\n2.3\nDependency Parsing\nDependency parsing involves tagging a word based on different features to indicate\nif it is dependent on another word. The Freeling library also has dependency pars-\ning models for Portuguese. Since we wanted to build a SRL (Semantic Role Labeling)\nmodule on top of the dependency parser and the current released version of Freeling\ndoes not have an SRL module for Portuguese, we trained a different Portuguese de-\npendency parsing model that was compatible (in terms of used tags) with the avail-\nable annotated.\nWe used the dataset from System-T [8], which has SRL tags, as well as, the other\npreceding tags. It was necessary to do some pre-processing and tag mapping in order\nto make it viable to train a Portuguese model.\n4\nP. Quaresma et al.\nWe made 589 tag conversions over 14 different categories. The breakdown of\ntag conversions per category is given by table 1. These rules can be further seen in\nthe corresponding Github repository [1]. The modiﬁed training and development\ndatasets are also available on another Github repository [10] for further research and\ncomparison purposes.\nTable 1. Training and Development - Tag Set Details.\nCategory Number of Tags\nNOUN\n20\nVERB\n101\nPROPN\n39\nPRON\n121\nADJ\n70\nDET\n62\nAUX\n149\nADP\n3\nNUM\n1\nPUNCT\n18\nCCONJ\n1\nSCONJ\n1\nINTJ\n1\nADV\n2\n2.4\nSemantic Role Labeling\nWe execute the SRL (Semantic Role Labeling) module after obtaining the word de-\npendencies. This module aims at giving a semantic role to a syntactic constituent of\na sentence. The semantic role is always in relation to a verb and these roles could ei-\nther be an actor, object, time, or location, which are then tagged as A0, A1, AM-TMP,\nAM-LOC, respectively. We trained a model for this module on top of the dependency\nparser described in the previous subsection using the modiﬁed dataset from System-\nT. The module also needs co-reference resolution to work and, to achieve this, we\nadapted the Spanish co-reference modules for Portuguese, changing the words that\nare equivalent (in total, we changed 253 words).\n2.5\nSVO Extraction\nFrom the yield of the SRL (Semantic Role Labeling) module, our framework can dis-\ntinguish actors, actions, places, time and objects from the sentences. Utilizing this\nextracted data, we can distinguish subject-verb-object (SVO) triples using the SVO\nextraction algorithm [20]. The algorithm ﬁnds, for each sentence, the verb and the\ntuples related to that verb using Semantic Role Labeling (subsection 2.4). After the\nextraction of SVOs from texts, they are inserted into a speciﬁc event ontology (see\nsection 2.7 for the creation of a knowledge base).\nFrom Textual Information Sources to Linked Data in the Agatha Project\n5\n2.6\nLexicon Matching\nThe sole purpose of this module is to ﬁnd important terms and/or concepts from\nthe extracted text. To do this, we use Euvovoc [2], a multilingual thesaurus that was\ndeveloped for and by the European Union. The Euvovoc has 21 ﬁelds and each ﬁeld\nis further divided into a variable number of micro-thesauri. Here, due to the applica-\ntion of this work in the Agatha project (mentioned in Section 1), we use the terms of\nthe criminal law [3] micro-thesaurus. Further, we classiﬁed each term of the criminal\nlaw micro-thesaurus into four categories namely, actor, event, place and object. The\nterm classiﬁcation can be seen in Table 2.\nTable 2. Eurovoc Criminal Law - Term Classiﬁcation.\nClassiﬁcation # Terms\nActor\n9\nEvent\n133\nPlace\n22\nObject\n3\nAfter the classiﬁcation of these terms, we implemented two different matching\nalgorithms between the extracted words and the criminal law micro-thesaurus terms.\nThe ﬁrst is an exact string match wherein lowercase equivalents of the words of the\ninput sentences are matched exactly with lower case equivalents of the predeﬁned\nterms. The second matching algorithm uses Levenshtein distance [7], allowing some\nnear-matches that are close enough to the target term.\n2.7\nLinked Data: Ontology, Thesaurus and Terminology\nIn the computer science ﬁeld, an ontology can be deﬁned has:\n– a formal speciﬁcation of a conceptualization;\n– shared vocabulary and taxonomy which models a domain with the deﬁnition of\nobjects and/or concepts and their properties and relations;\n– the representation of entities, ideas, and events, along with their properties and\nrelations, according to a system of categories.\nA knowledge base is one kind of repository typically used to store answers to\nquestions or solutions to problems enabling rapid search, retrieval, and reuse, either\nby an ontology or directly by those requesting support. For a more detailed descrip-\ntion of ontologies and knowledge bases, see for instance [16].\nFor designing the ontology adequate for our goals, we referred to the Simple\nEvent Model (SEM) [23] as a baseline model. A pictorial representation of this on-\ntology is given in Figure 2\nConsidering the criminal law domain case study, we made a few changes to the\noriginal SEM ontology. The entities of the model are:\n6\nP. Quaresma et al.\nFig. 2. The Simple Event Model [23]\n– Actor: person involved with event\n– Place: location of the event\n– Time: time of the event\n– Object: that actor act upon\n– Organization: organization involved with event\n– Currency: money involved with event\nThe proposed ontology was designed in such a manner that it can incorporate\ninformation extracted from multiple documents. In this context, suppose that the\nsource of documents is a police department, where each document is under the\nhood of a particular case/crime; furthermore, a single case can have documents from\nmultiple languages. Now, considering case 1 has 100 documents and case 2 has 100\ndocuments then there is not only a connection among the documents of a single case\nbut rather among all the cases with all the combined 200 documents. In this way, the\nproposed method is able to produce a detailed and well-connected knowledge base.\nFigure 3 shows the proposed ontology, which, in our evaluation procedure, was\npopulated with 3121 events entries from 51 documents.\nProtege [9] tool was used for creating the ontology and GraphDB [5] for populat-\ning & querying the data. GraphDB is an enterprise-ready Semantic Graph Database,\ncompliant with W3C Standards. Semantic Graph Databases (also called RDF triple-\nstores) provide the core infrastructure for solutions where modeling agility, data in-\ntegration, relationship exploration, and cross-enterprise data publishing and con-\nsumption are important. GraphDB has a SPARQL (SQL-like query language) inter-\nface for RDF graph databases with the following types:\n– SELECT: returns tabular results\n– CONSTRUCT: creates a new RDF graph based on query results\n– ASK: returns \"YES\", if the query has a solution, otherwise \"NO\"\nFrom Textual Information Sources to Linked Data in the Agatha Project\n7\nFig. 3. Ontology Diagram.\n– DESCRIBE: returns RDF data about a resource. This is useful when the RDF data\nstructure in the data source is not known\n– INSERT: inserts triples into a graph\n– DELETE: deletes triples from a graph\nFurthermore, we have extended the ontology [4] to connect the extracted terms\nwith Eurovoc criminal law (discussed in subsection 2.6) and IATE [6] terms. IATE\n(Interactive Terminology for Europe) is the EU’s general terminology database and\nits aim is to provide a web-based infrastructure for all EU terminology resources,\nenhancing the availability and standardization of the information. The extended on-\ntology has a number of sub-classes for Actor, Event, Object and Place classes detailed\nin Table 3.\n3\nDiscussion\nWe have deﬁned a major design principle for our architecture: it should be modular\nand not rely on human made rules allowing, as much as possible, its independence\nfrom a speciﬁc language. In this way, its potential application to another language\nwould be easier, simply by changing the modules or the models of speciﬁc modules.\nIn fact, we have explored the use of already existing modules and adopted and inte-\ngrated several of these tools into our pipeline.\nIt is important to point out that, as far as we know, there is no integrated architec-\nture supporting the full processing pipeline for the Portuguese language. We evalu-\nated several systems like Rembrandt [13] or LinguaKit: the former only has the initial\nsteps of our proposal (until NER) and the later performed worse than our system.\nThis framework, developed within the context of the Agatha project (described in\nSection 1) has the full processing pipeline for Portuguese texts: it receives sentences\n8\nP. Quaresma et al.\nTable 3. Extended Ontology [4] - Sub-Classes.\nClass\nNo. of\nSub-Classes\nTerms\nActor\n6\nVictim,Inmate,Prisoner,Hostage,Hijacker,Accomplice\nEvent\n64\nSlavery,Trade,Tax,Evasion,Spooﬁng,Slander,Shady,\nViolence,Sexual,Scam,Repentance,Rehabilitation,\nRefoulement,Rape,Punishment,Ponzi,Piracy,Aggression,\nPhishing,Trafﬁcking,Pardon,Harassment,Mobbing,\nMisdemeanour,Libel,Trading,Imprisonment,\nRestraint,Theft,Arrest,Homicide,Hit-and-run,Hijacking,\nForgery,Forfeiture,Fraud,Fight,Falsiﬁcation,Extradition,\nExpulsion,Elimination,Offence,Drug,Detention,\nDeprivation,Deportation,Defamation,Penalty,Negligence,\nExecution,Counterfeit,Corruption,Conﬁscation,\nConditional,Con,Order,Complicity,Campaign,\nBully,Breach,Banish,Aggravate,Crime,Abduction\nObject\n3\nFine,Invoice,Bill\nPlace\n11\nFacility,Institution,Center,Conﬁnement,Reformatory\nPenitentiary,Penal,Prison,Jail,Isolation,Banco\nas input and outputs ontological information: a) ﬁrst performs all NLP typical tasks\nuntil semantic role labelling; b) then, it extracts subject-verb-object triples; c) and,\nthen, it performs ontology matching procedures. As a ﬁnal result, the obtained out-\nput is inserted into a specialized ontology.\nWe are aware that each of the architecture modules can, and should, be improved\nbut our main goal was the creation of a full working text processing pipeline for the\nPortuguese language.\n4\nConclusions and Future Work\nBesides the end–to–end NLP pipeline for the Portuguese language, the other main\ncontributions of this work can be summarize as follows:\n– Development of an ontology for the criminal law domain;\n– Alignment of the Eurovoc thesaurus and IATE terminology with the ontology cre-\nated;\n– Representation of the extracted events from texts in the linked knowledge base\ndeﬁned.\nThe obtained results support our claim that the proposed system can be used as\na base tool for information extraction for the Portuguese language. Being composed\nby several modules, each of them with a high level of complexity, it is certain that our\napproach can be improved and an overall better performance can be achieved.\nFrom Textual Information Sources to Linked Data in the Agatha Project\n9\nAs future work we intend, not only to continue improving the individual modules,\nbut also plan to extend this work to the:\n– automatic creation of event timelines;\n– incorporation in the knowledge base of information obtained from videos or pic-\ntures describing scenes relevant to criminal investigations.\nAcknowledgments\nThe authors would like to thank COMPETE 2020, PORTUGAL 2020 Program, the Eu-\nropean Union, and ALENTEJO 2020 for supporting this research as part of Agatha\nProject SI & IDT number 18022 (Intelligent analysis system of open of sources infor-\nmation for surveillance/crime control). The authors would also like to thank LISP -\nLaboratory of Informatics, Systems and Parallelism.\nReferences\n1. Automated\nevent\nextraction\nmodel\nfor\nmultiple\nlinked\nportuguese\ndocuments,\nhttps://github.com/kraiyani/Automated-Event-Extraction-Model-for-\nMultiple-Linked-Portuguese-Documents/blob/master/Universal_to_eagle_\ntagset.xlsx, [Available online: accessed on 06 05 2019]\n2. Eu\nvocabularies,\nhttps://publications.europa.eu/en/web/eu-vocabularies,\n[Available online: accessed on 06 05 2019]\n3. Eu vocabularies, thesauri, 1216 criminal law, https://publications.europa.eu/\nen/web/eu-vocabularies/th-concept-scheme/-/resource/eurovoc/100180?\ntarget=Browse, [Available online: accessed on 06 05 2019]\n4. Extended\nontology,\nhttp://owlgred.lumii.lv/online_visualization/e9fh#,\n[Available online: accessed on 25 06 2019]\n5. Graphdb, http://graphdb.ontotext.com/, [Available online: accessed on 06 05 2019]\n6. Iate (interactive terminology for europe), https://iate.europa.eu/home, [Available\nonline: accessed on 06 05 2019]\n7. Levenshtein\ndistance, https://en.wikipedia.org/wiki/Levenshtein_distance,\n[Available online: accessed on 06 05 2019]\n8. Portuguese\nuniversal\npropositions,\nhttps://github.com/System-T/\nUniversalPropositions/tree/master/UP_Portuguese-Bosque, [Available online:\naccessed on 06 05 2019]\n9. Protege, https://protege.stanford.edu/, [Available online: accessed on 06 05 2019]\n10. Training and development dataset for automated event extraction model for multiple\nlinked portuguese documents, https://github.com/kraiyani/Automated-Event-\nExtraction-Model-for-Multiple-Linked-Portuguese-Documents, [Available on-\nline: accessed on 06 05 2019]\n11. Amato, F., Moscato, V., Picariello, A., Sperlì, G.: Extreme events management us-\ning multimedia social networks. Future Generation Comp. Syst. 94, 444–452 (2019).\nhttps://doi.org/10.1016/j.future.2018.11.035,\nhttps://doi.org/10.1016/j.future.\n2018.11.035\n12. Brants, T.: Tnt: a statistical part-of-speech tagger. In: Proceedings of the sixth conference\non Applied natural language processing. pp. 224–231. Association for Computational Lin-\nguistics (2000)\n10\nP. Quaresma et al.\n13. Cardoso, N.: Rembrandt - a named-entity recognition framework. In: Proceedings of the\nEighth International Conference on Language Resources and Evaluation (LREC-2012).\npp. 1240–1243. European Language Resources Association (ELRA), Istanbul, Turkey (May\n2012), http://www.lrec-conf.org/proceedings/lrec2012/pdf/409_Paper.pdf\n14. Carreras, X., Chao, I., Padró, L., Padro, M.: Freeling: An open-source suite of language ana-\nlyzers. Proceedings of the 4th International Conference on Language Resources and Eval-\nuation (LREC’04) (01 2004)\n15. Carreras, X., Màrquez, L., Padró, L.: A simple named entity extractor using adaboost. In:\nProceedings of the seventh conference on Natural language learning at HLT-NAACL 2003\n(2003)\n16. Guarino, N., Giaretta, P.: Ontologies and knowledge bases: Towards a terminological clar-\niﬁcation. In: Towards very Large Knowledge bases: Knowledge Building and Knowledge\nsharing. pp. 25–32. IOS Press (1995)\n17. Guarino, N., Oberle, D., Staab, S.: What Is an Ontology?, pp. 1–17 (05 2009)\n18. Raiyani, K., Gonçalves, T., Quaresma, P., Nogueira, V.B.: Fully connected neural network\nwith advance preprocessor to identify aggression over facebook and twitter. In: Proceed-\nings of the First Workshop on Trolling, Aggression and Cyberbullying (TRAC-2018). pp. 28–\n41. Association for Computational Linguistics (2018), http://aclweb.org/anthology/\nW18-4404\n19. Raiyani, K., Gonçalves, T., Quaresma, P., Nogueira, V.B.: Multi-language neural network\nmodel with advance preprocessor for gender classiﬁcation over social media: Notebook\nfor pan at clef 2018. In: Working Notes of CLEF 2018 - Conference and Labs of the Eval-\nuation Forum, Avignon, France, September 10-14, 2018. (2018), http://ceur-ws.org/\nVol-2125/paper_105.pdf\n20. Raiyani, K., Gonçalves, T., Quaresma, P., Nogueira, V.B.: Automated event extraction model\nfor linked portuguese documents. In: Proceedings of Text2Story — Second Workshop\non Narrative Extraction From Texts co-located with 41th European Conference on In-\nformation Retrieval (ECIR 2019) Cologne, Germany, April 14th (2019), http://ceur-\nws.org/Vol-2342/paper2.pdf\n21. Raiyani, K., Gonçalves, T., Quaresma, P., Nogueira, V.B.: Vista.ue at semeval-2019 task 5:\nSingle multilingual hate speech detection model. In: Proceedings of the 13th International\nWorkshop on Semantic Evaluation (SemEval-2019). pp. 520–524. Association for Compu-\ntational Linguistics (2019)\n22. Raiyani, K., Quaresma, P.: Keyword & machine learning based japanese statute law re-\ntrieval and entailment task at coliee-2019. In: Proceedings of Competition on Legal Infor-\nmation Retrieval and Entailment Workshop (COLIEE 2019) in association with the 17th\nInternational Conference on Artiﬁcial Intelligence and Law 2019 (ICAIL 2019). Easychair\n(2019)\n23. Van Hage, W.R., Malaisé, V., Segers, R., Hollink, L., Schreiber, G.: Design and use of the\nsimple event model (sem). Web Semantics: Science, Services and Agents on the World\nWide Web 9(2), 128–136 (2011)\n",
  "categories": [
    "cs.CL",
    "cs.AI"
  ],
  "published": "2019-09-03",
  "updated": "2019-09-03"
}