{
  "id": "http://arxiv.org/abs/2003.07399v2",
  "title": "Unsupervised machine learning of quantum phase transitions using diffusion maps",
  "authors": [
    "Alexander Lidiak",
    "Zhexuan Gong"
  ],
  "abstract": "Experimental quantum simulators have become large and complex enough that\ndiscovering new physics from the huge amount of measurement data can be quite\nchallenging, especially when little theoretical understanding of the simulated\nmodel is available. Unsupervised machine learning methods are particularly\npromising in overcoming this challenge. For the specific task of learning\nquantum phase transitions, unsupervised machine learning methods have primarily\nbeen developed for phase transitions characterized by simple order parameters,\ntypically linear in the measured observables. However, such methods often fail\nfor more complicated phase transitions, such as those involving incommensurate\nphases, valence-bond solids, topological order, and many-body localization. We\nshow that the diffusion map method, which performs nonlinear dimensionality\nreduction and spectral clustering of the measurement data, has significant\npotential for learning such complex phase transitions unsupervised. This method\nworks for measurements of local observables in a single basis and is thus\nreadily applicable to many experimental quantum simulators as a versatile tool\nfor learning various quantum phases and phase transitions.",
  "text": "Unsupervised machine learning of quantum phase transitions using diffusion maps\nAlexander Lidiak1, ∗and Zhexuan Gong1, 2, †\n1Department of Physics, Colorado School of Mines, Golden, Colorado 80401, USA\n2National Institute of Standards and Technology, Boulder, Colorado 80305, USA\n(Dated: December 8, 2020)\nExperimental quantum simulators have become large and complex enough that discovering new physics from\nthe huge amount of measurement data can be quite challenging, especially when little theoretical understand-\ning of the simulated model is available. Unsupervised machine learning methods are particularly promising in\novercoming this challenge. For the speciﬁc task of learning quantum phase transitions, unsupervised machine\nlearning methods have primarily been developed for phase transitions characterized by simple order parameters,\ntypically linear in the measured observables. However, such methods often fail for more complicated phase\ntransitions, such as those involving incommensurate phases, valence-bond solids, topological order, and many-\nbody localization. We show that the diffusion map method, which performs nonlinear dimensionality reduction\nand spectral clustering of the measurement data, has signiﬁcant potential for learning such complex phase tran-\nsitions unsupervised. This method may work for measurements of local observables in a single basis and is thus\nreadily applicable to many experimental quantum simulators as a versatile tool for learning various quantum\nphases and phase transitions.\nWith the recent demonstration of quantum supremacy\n[1], the need for understanding well-controlled experimen-\ntal quantum systems that cannot be simulated efﬁciently on\na classical computer is growing rapidly. However, experimen-\ntal data sets generated by measurements on post quantum-\nsupremacy devices can be too large and complex for tradi-\ntional data analysis tools to extract useful features from. This\nin particular poses a major challenge in using quantum simula-\ntors to make new discoveries at the frontier of quantum many-\nbody physics, where existing theoretical understanding is of-\nten lacking [2]. A promising method to address this challenge\nis unsupervised machine learning, which can extract impor-\ntant features from data with little to no a priori understanding\nof the data [3–14].\nWhile machine learning has become a standard toolbox for\ndata analysis in many areas of physics, including high-energy,\nastrophysics [5], and condensed-matter physics [15], the use\nof unsupervised machine learning in experimental quantum\nsimulators, in particular for studying quantum phases and\nphase transitions, is so far lacking. For example, the stan-\ndard approach to demonstrate a quantum phase transition in\nquantum simulation is to extract some feature from the mea-\nsurement data related to an “order parameter” [16–18]. How-\never, for the discovery of a new quantum phase or phase tran-\nsition, it is often unclear what feature or order parameter one\nshould extract from the data. For a simple symmetry break-\ning phase transition, one can usually ﬁnd an order param-\neter that is linear in the measured observables.\nIn such a\nscenario, a common unsupervised machine learning method\nknown as principal component analysis (PCA) can be applied\n[9, 19, 20], which performs a linear projection of the sam-\nple data onto a lower dimensional subspace for feature ex-\ntraction. But for quantum systems with phases whose order\nparameters are complex, nonlinear functions of local observ-\nables [5], where machine learning could be particularly useful\nin discovering new physics, PCA will fail. Example systems\ninclude valence-bond solids [21], quantum spin liquids [22],\ntopologically ordered matter [23], and many-body localized\n(MBL) systems [24]. A number of nonlinear dimensional-\nity reduction methods in machine learning can be applied for\nthese systems, such as kernel PCA [25], auto-encoders [19],\nself-organizing maps [26], and diffusion maps [27]. The suc-\ncess so far is however limited, with a notable exception that\nthe diffusion map method has recently been used to identify\ncertain topological phases unsupervised [27], which has long\nbeen regarded as challenging.\nIn this work, we show that the diffusion map is in fact a\nrather versatile method that can identify a variety of complex\nquantum phases. It is also computationally efﬁcient and works\nfor data easily obtained by quantum simulation experiments,\nsuch as the measurement of all spins in a single direction [28].\nThis is in contrast to many machine learning approaches [3,\n7, 29–32] that require the entanglement spectrum of quantum\nstates, which is difﬁcult to obtain experimentally.\nThe main idea of the diffusion map is to reveal the struc-\nture of the measurement samples in conﬁguration space and\nperform automatic clustering of the samples with a tunable\ncluster radius [33]. Major changes in the conﬁgurations of\nquantum states can be revealed as a result, suggesting the on-\nset of a phase transition. As examples, we will show how\ndiffusion maps can correctly identify incommensurate phases,\nvalence-bond solid phases, and many-body localized phases,\nall of which are difﬁcult to learn using traditional data analysis\non expectation values, variances, and two-point correlations\nof local observables, or simple unsupervised machine learn-\ning methods such as PCA and k-means clustering [34]. Note\nthat our primary goal is to learn phases of quantum matter\nfrom experimental data with minimal theoretical understand-\ning. For precisely locating phase transition points, supervised\nlearning methods can be applied afterwards [3, 7, 29, 30].\nGeneral picture.— We will ﬁrst introduce the diffusion map\nmethod and describe a general picture of how it can identify\ndifferent quantum phases. In the following, the diffusion map\nis always applied to a collection of measurement samples.\narXiv:2003.07399v2  [quant-ph]  4 Dec 2020\n2\nWithout loss of generality, we assume each sample is from\na measurement of N quantum spins in some direction. Each\nmeasurement sample thus contains N numbers, denoted by an\nN-dimensional vector Xi (i = 1, 2, · · · , M). We obtain M\nsuch samples by preparing and measuring the same state M\ntimes, a routine practice in quantum simulation experiments\n[28]. One can also obtain these measurement samples compu-\ntationally using either direct sampling if exact diagonalization\nis used [35], or Monte Carlo sampling if a variational ansatz\nis used [36–39].\nThe diffusion map sets a ﬁctitious diffusion process among\nthe samples based on their distances. First, a distance met-\nric needs to be deﬁned. Here, we use the normalized Eu-\nclidean distance between two samples i and j, deﬁned as\nd2\nij ≡\n1\nN\nPN\nk=1(Xik −Xjk)2, where Xik is the kth element\nof the sample vector Xi, and N ∼N is a normalization con-\nstant that ensures dij ∈[0, 1]. Next, a kernel function is used\nto associate a transition probability between samples based\non their distances. A common choice is the Gaussian kernel:\nKij = e−d2\nij/(2ϵ), where the hyperparameter ϵ controls how\nfast the transition probability decays with distance. Finally we\nintroduce Pij = Kij/(P\nk Kik) as the normalized probability\nof the diffusion process from samples i to j.\nSince the transition probability between any two samples is\nnonzero for a ﬁnite ϵ, the above-mentioned diffusion process\nis ergodic in the long time limit. This means the largest eigen-\nvalue of the P matrix is always exactly 1 [27, 33]. If there\nare clusters of samples in which the samples have at most\nr spins in different conﬁgurations, then up to a time scale\nτ = er/Nϵ, the diffusion process will be largely restricted\nwithin each cluster. The number of such clusters will corre-\nspond to eigenvalues of P that are larger than 1 −δ where\nδ ∼1/τ [33]. Thus by choosing ϵ ∼r/(N ln τ), we can\nﬁnd the number of clusters of a particular size. For the exam-\nples we shall discuss, we keep the diffusion time τ ﬁxed by\nchoosing δ = 10−2.5 (the exact value does not matter).\nSchematically shown in Fig. 1, when ϵ ≲1/(N ln τ), each\ndifferent sample will be identiﬁed as one cluster, and the num-\nber of clusters in this regime is simply given by the number of\nunique measurement samples. For a generic quantum many-\nbody state that contains non-negligible weights of exponen-\ntially many basis states, almost all measurement samples are\ndifferent from each other. However, for a many-body local-\nized quantum system, the number of unique samples can be\nsigniﬁcantly smaller than the number of samples. Thus a dif-\nfusion map with such a small ϵ should be able to distinguish\nan ergodic many-body state from a localized many-body state.\nOn the other hand, when ϵ ∼1/ ln τ, only samples with\n∼N spins in different conﬁgurations will belong to differ-\nent clusters. If multiple clusters of samples are identiﬁed in\nthis regime, one can expect a discrete spontaneous symmetry\nbreaking in the measurement direction of the spins, with the\norder of the symmetry group equal to the number of clusters.\nBetween the small and large ϵ regimes, we can tune ϵ to reveal\nthe number of clusters with variable sizes (note that changing\nϵ requires no additional experimental data). As shown be-\nGaussian envelope (cluster)\nmeasurement sample\nconnecting overlap =\ncluster\n# of Clusters\n# of unique\nsamples\nvaries in\ndifferent\nquantum\nphases\ndiscrete symmetry\ngroup order\n1 cluster\nFigure 1. Schematic of how the diffusion map reveals the number of\nclusters formed by the measurement samples in conﬁguration space.\nThe hyperparameter ϵ determines the size of the clusters by control-\nling the width of the Gaussian envelope in the kernel function. The\nqualitative pictures for the small [ϵ ≲1/(N ln τ)], intermediate, and\nlarge [ϵ ∼1/ ln τ] ϵ regimes are shown. For sufﬁciently large ϵ, the\nnumber of clusters becomes one.\nlow, the intermediate ϵ regime (1/(N ln τ) ≲ϵ ≲1/ ln τ)\nis the key to learning a variety of complex quantum phases\nthat cannot be identiﬁed using linear dimensionality reduc-\ntion methods such as PCA. We emphasize that the diffusion\nmap is computationally efﬁcient for the number of samples\n(102 −103) in a typical quantum simulation experiment [28],\nand we can compute diffusion maps with different system pa-\nrameters or hyper-parameters in parallel.\nLearning incommensurate phases.— To demonstrate the\npower of diffusion maps with a tunable ϵ in learning com-\nplex quantum phases, we start with a Zn transverse-ﬁeld Ising\nmodel (TFIM) (also known as the chiral clock model [40])\nwith n = 3. This model can be simulated using Rydberg\natoms experimentally [41, 42] and has a nontrivial incom-\nmensurate phase between the usual ferromagnetic and para-\nmagnetic phases of the TFIM. The Hamiltonian of the model\nreads H1 = −f PN\nj=1 τjeiθ−(1−f) PN−1\nj=1 σjσ†\nj+1eiθ+h.c.,\nwhere σ =\n\u0012 1\n0\n0\n0 ei2π/3\n0\n0\n0\ne−i2π/3\n\u0013\nand τ =\n\u0010 0 0 1\n1 0 0\n0 1 0\n\u0011\nare the Z3\nspin operators. Without chirality (θ = 0), the ground state\nof H1 undergoes a simple ferromagnetic (FM) to paramag-\nnetic (PM) phase transition when increasing f from 0 to 1.\nFor θ > 0, an incommensurate (IC) phase appears for inter-\nmediate values of f, where spin correlations ⟨σiσj⟩decay as\na power law. The ferromagnetic phase can be easily identi-\nﬁed using the average of {⟨σj⟩} which is nonzero in the FM\nphase. However, such an order parameter cannot tell the PM\nphase from the IC phase, as both phases have vanishing FM\norder. Therefore we ﬁnd that PCA (as well as two-point cor-\nrelations) cannot identify the IC phase and its boundary [34].\nThe incommensurate phase and its boundary can be nu-\nmerically identiﬁed using entanglement entropy [43, 44], a\nquantity hard to measure in large experimental systems [45].\nHere we show that using just the measurement samples of the\nspin operators {σj}, the diffusion map is able to produce a\nphase diagram in an unsupervised manner that well matches\nthe one obtained using entanglement entropy. Using an inter-\n3\nmediate value of ϵ, the number of clusters identiﬁed by the\ndiffusion map identiﬁes all three phases of the Z3 TFIM, as\nshown in Fig. 2(a). This result can be understood as follows:\n(1) Deep in the PM phase the measurement samples are ap-\nproximately drawn from a uniform probability distribution of\nevery possible spin conﬁguration. As a result, two different\nsamples will have on average N/2 spins in different conﬁg-\nurations. Since in practice the number of samples is often\nmuch smaller than the number of spin conﬁgurations, each\nsample will be treated as a separate cluster if ϵ ≪1/ ln τ.\nThe number of clusters will thus be close to the number of\nsamples. (2) Deep in the FM phase, the ground state under-\ngoes spontaneous symmetry breaking, resulting in one of the\n3 FM states, each being ordered in a different direction. The\nsamples drawn from each of the 3 FM ordered states should\nhave small distances between each other while the samples\ndrawn from different FM ordered states have very large dis-\ntances. With 1/(N ln τ) ≪ϵ ≪1/ ln τ, the number of clus-\nters identiﬁed will be close to 3. (3) The samples drawn from\nthe IC phase should have a rather diverse set of distances and\nthe number of clusters identiﬁed by the diffusion map should\nvary strongly depending on the parameters of the Hamilto-\nnian. Note that no ﬁne tuning of ϵ is needed to learn the in-\ncommensurate phase. In addition, we have shown in the sup-\nplementary material [34] that one can identify all three phases\nequally well if the samples are drawn from measurements of\nthe τ operators instead.\nThe diffusion map also allows unsupervised learning of the\norder of the discrete symmetry group underlying a symmetry\nbreaking phase transition. For a large enough ϵ (∼1/ ln τ),\nsamples in the PM and IC phases will be identiﬁed as a single\ncluster while samples in the FM phase are cleanly sorted into 3\nclusters as a result of the Z3 spontaneous symmetry breaking\n[see Fig. 2(b)]. Contrast this to the k-means clustering algo-\nrithm used frequently in unsupervised machine learning [46],\nwhere the number of clusters has to be guessed or predicted\nusing a priori knowledge of the data.\nLearning valence-bond solid phase transitions.— Valence-\nbond solids (VBS) are important in condensed matter physics\nand quantum information as they are closely related to quan-\ntum spin liquids [22], symmetry protected topological order\n[47, 48], tensor network states [37], and cluster states for\nquantum computing [49]. Because VBS cannot be identiﬁed\nusing an order parameter linear in spin operators, this is an-\nother scenario where unsupervised learning methods such as\nPCA will fail while diffusion maps are useful. As a speciﬁc\nexample, we consider a spin-1/2 chain with nearest-neighbor\nand next-nearest-neighbor antiferromagnetic Heisenberg in-\nteractions [50], commonly known as the J1-J2 model, with\nthe Hamiltonian H2 = PN\nj=1(J1Sj ·Sj+1+J2Sj ·Sj+2). For\nsimplicity we set J1 = 1 below. This is a paradigmatic model\nexhibiting VBS order, where the ground state at J2 = 0.5\nis exactly solvable and made of two degenerate VBS (dimer)\nstates, corresponding to two different ways of pairing neigh-\nboring spins into spin-1/2 singlets (one with Si + Si+1 = 0\nfor odd i and the other for even i). At around J2 ≈0.3 [51],\n(a)\nPM\nIC\nFM\n(b)\nFigure 2.\nThe ground-state phase diagram of the chiral Z3 TFIM\n(see H1) found by the diffusion map method. The measurement sam-\nples are obtained from the ground-state found using exact diagonal-\nization with N = 12 spins. 500 samples are used for each value of\nf and θ. (a) ϵ = 0.015, an intermediate value that reveals all three\nphases and their boundaries (see [34] and [44] for similar phase dia-\ngrams obtained using entanglement entropy). (b) ϵ = 0.075, a large\nvalue that causes both the samples in the PM and IC phases to be\ngrouped into one cluster, while in the FM phase three clusters are\nalways identiﬁed.\nthe system is expected to undergo a phase transition from the\nLuttinger liquid to the VBS phase.\nAs expected, we ﬁnd no signatures of the VBS phase tran-\nsition and no special behavior at J2 = 0.5 using PCA and\nk-means clustering [34]. With diffusion maps, as shown in\nFig. 3(a), we can easily identify the exactly solvable point of\nJ2 = 0.5, where the ground state has spontaneous transla-\ntional symmetry breaking even for a ﬁnite system size. To bet-\nter see the phase transition at J2 ≈0.3, we add a small sym-\nmetry breaking perturbation of the form H′ = g PN\nj=1[1 −\n(−1)j]SjSj+1 that breaks the Z2 translational symmetry of\nH2 for the small system size our calculation is limited to.\nAs shown in Fig. 3(b), we see a large dip in the number of\nclusters starting around J2 ≈0.3 for an intermediate ϵ value.\nThis is because when the VBS phase transition occurs, sym-\nmetry breaking in the ground states picks one of the dimer\nconﬁgurations, while away from the phase transition point,\nboth dimer conﬁgurations coexist. The probabilities of ﬁnd-\ning two samples with a small distance from each other is much\nlower if the two samples are from different dimer conﬁgura-\ntions than from a single dimer conﬁguration. Thus the number\nof clusters identiﬁed by the diffusion map drops when transla-\ntional symmetry breaking takes place. This argument can be\nmade mathematically precise for the exact degeneracy point\nof J2 = 0.5, where ﬁnite-size effects are irrelevant [34]. We\nexpect a similar picture for general VBS phase transitions.\nLearning many-body localization.— A 1D quantum system\nwith tunable disorder can exhibit a dynamical phase transi-\ntion from a thermal, ergodic phase to a many-body localized\n(MBL) phase [24]. There is no simple order parameter to de-\ntect the MBL phase transition. Theoretically, one can use the\ninverse participation ratio, level statistics, or entanglement en-\ntropy to detect a MBL phase transition [52]. However, these\nquantities are difﬁcult to obtain experimentally. A more prac-\ntical way to detect MBL is to use quench dynamics. For ex-\nample, one can measure local observables after a long-time\n4\n(a)\n(b)\nFigure 3. (a) The number of clusters found by diffusion maps when\napplied to the measurement samples of the J1-J2 model (see H2) as\na function of ϵ. 1000 samples are used for each value of J2 (J1 = 1),\nobtained from exact diagonalization of H2 with N = 24 spins. (b)\nAn intermediate ϵ (ϵ = 0.02) is chosen to show that the number of\nclusters drops at the onset of the valence-bond phase transition with\nor without a symmetry breaking perturbation. The error bar shows\nthe standard error of the mean from 90 repeated sampling processes.\nevolution from some initial, simple-to-prepare product state.\nHere we show that the diffusion map method can learn the\nthermal-to-MBL phase transition using the measurement sam-\nples obtained in quench dynamics experiments unsupervised.\nThis is different from existing machine learning studies of\nMBL that require supervised learning [29, 30].\nAs an example, we study a paradigmatic model exhibiting\nthe thermal-MBL phase transition, i.e. the spin-1/2 Heisen-\nberg model with a random ﬁeld [29, 52], with the Hamiltonian\nH3 = PN\ni=1 JSi · Si+1 + hiSz\ni . Here hi ∈(−h, h) is a ran-\ndom number drawn from a uniform distribution and h denotes\nthe disorder strength. It has been found numerically that the\nthermal-MBL phase transition takes place at the critical disor-\nder strength hc ≊3.5 ± 1.0 with J = 1. We perform quench\ndynamics using an initial state with ⟨Sz\ni ⟩= (−1)i\n2\nand mea-\nsure all Sz\ni (i = 1, 2, · · · , N) after a long time (t = 104/J).\nAs mentioned before, since the number of unique samples\ndecreases with increasing disorder strength, we see that the\ndiffusion map with a small ϵ can already indicate the onset\nof MBL [Fig. 4(a)]. But we can learn more about where the\nthermal-MBL phase transition occurs by using an intermedi-\nate value of ϵ. As shown in Fig. 4, the number of clusters\nidentiﬁed by the diffusion map is actually peaked near hc for\na range of intermediate values of ϵ. Intuitively, this is because\ndeep in the thermal phase, the samples are scattered across\nconﬁguration space with similar distances between each other.\nThey are unlikely to form many small clusters. On the other\nhand, deep in the localized phase the samples are already\nclustered around the initial state, and the number of clusters\nshould also be small. However, near thermal-MBL phase tran-\nsitions, the samples form a number of scattered, small clusters\nin conﬁguration space due to the competition of disorder and\nergodicity. As a result, we expect to see the most clusters\nnear the phase transition with intermediate ϵ. We have also\nobserved this behavior for other spin models exhibiting MBL\n[34], suggesting that diffusion maps are widely applicable in\nlearning MBL. Note that for learning MBL, we need to use\na different kernel in the diffusion map to accommodate for\n0.016\n(b)\n0\n(a)\nFigure 4. Number of clusters learned by diffusion maps on the mea-\nsurement samples of the long-time dynamical state of H3, averaged\nover 50 disorder realizations. 500 samples are obtained for N = 16\nspins using exact diagonalization. (a) A small ϵ value (blue curve)\nleads to the number of samples decreasing rapidly with increased dis-\norder, while the peak of the number of clusters with an intermediate\nϵ value (red curve) reveals the approximate location of the thermal-\nto-MBL phase transition. The error bars show the standard error of\nthe mean calculated over 50 different disorder realizations and 50 re-\npeated sampling processes. (b) There exists a range of intermediate\nϵ values where the number of clusters peaks near the critical disorder\nstrength.\nthe large disparity in the densities of measurement samples\nin conﬁguration space between the thermal and MBL phases.\nMore precisely, we use Kij/(P\nk Kik\nP\nk Kkj) in place of\nKij [34]. This kernel normalization is a standard practice\nwhen applying diffusion maps to data with large variations\nin density [33]. We emphasize that this modiﬁed kernel is not\nﬁne tuned and can learn the aforementioned incommensurate\nand VBS phase transitions equally well.\nConclusion and Outlook.— We have shown that the diffu-\nsion map is a general and versatile method for unsupervised\nlearning of various complex quantum phase transitions. Com-\npared to traditional data analysis methods, diffusion maps use\nthe full statistics of the measurement samples which contains\ninformation of spin correlations at all orders, and thus offers\nmore knowledge of the measured quantum states without de-\nmanding more data. Because a quantum phase transition is al-\nways accompanied by abrupt changes in correlations of local\nobservables at certain orders, if an appropriate local measure-\nment basis is used (which can often be guessed using knowl-\nedge of the experimental Hamiltonian), the diffusion map\nmethod has a high chance of revealing the underlying quan-\ntum phase transition from the measurement data. The limi-\ntations of diffusion maps in learning quantum phases, how-\never, are far from clear. For example, here we mainly focus\non the number of clusters identiﬁed by the ﬁctitious diffusion\nprocess, but the diffusion map often involves a mapping of\nthe samples to the low-dimensional subspace spanned by the\nleading eigenvectors of the P matrix. Such a mapping could\nreveal more information regarding the geometry or topology\nof the samples in conﬁguration space, which may be partic-\nularly useful in learning certain topological phases [27] or\nsymmetry-protected topological phases. In addition, typical\ndiffusion maps use Euclidean distance and Gaussian kernels,\nbut some exotic phases of matter may require the use of very\ndifferent distance metrics or kernel functions to be learned.\n5\nFurthermore, can we learn more with diffusion maps if we\nuse samples obtained by measurements in more than one lo-\ncal basisThis may be particularly useful if the studied system\ncontains multiple phases of distinct nature, or for distinguish-\ning classical and quantum phase transitions. And ﬁnally, how\nwill other nonlinear dimensionality reduction methods widely\nused in machine learning, such as t-SNE [53] and DBSCAN\n[54] compare to the performance of diffusion maps when ap-\nplied to quantum phase detection?\nWe thank Lincoln Carr, Eliot Kapit, Cecilia Diniz Behn,\nand Bo Wu for enlightening discussions related to this work,\nand the HPC center at Colorado School of Mines for provid-\ning computational resources needed in carrying out this work.\nAL and ZXG acknowledge funding support from the NSF\nRAISE-TAQS program under Grant No. CCF-1839232.\n∗alidiak@mines.edu\n† gong@mines.edu\n[1] F. Arute, K. Arya, R. Babbush, et al., Nature 574, 505 (2019).\n[2] T. H. Johnson, S. R. Clark, and D. Jaksch, EPJ Quantum Tech-\nnology 1, 10 (2014).\n[3] E. P. Van Nieuwenburg, Y. H. Liu, and S. D. Huber, Nature\nPhysics 13, 435 (2017).\n[4] G. Torlai and R. G. Melko, Physical Review B 94, 165134\n(2016).\n[5] G. Carleo, I. Cirac, K. Cranmer, L. Daudet, M. Schuld,\nN. Tishby, L. Vogt-Maranto, and L. Zdeborov´a, Reviews of\nModern Physics 91, 045002 (2019).\n[6] P. Broecker, J. Carrasquilla, R. G. Melko, and S. Trebst, Scien-\ntiﬁc Reports 7, 1 (2017).\n[7] J. Carrasquilla and R. G. Melko, Nature Physics 13, 431 (2017).\n[8] P. Broecker, F. F. Assaad, and S. Trebst, arXiv:1707.00663\n(2017).\n[9] L. Wang, Physical Review B 94, 195105 (2016).\n[10] K. Ch’Ng, J. Carrasquilla, R. G. Melko, and E. Khatami, Phys-\nical Review X 7, 031038 (2017).\n[11] R. T. D’Agnolo and A. Wulzer, Physical Review D 99, 015014\n(2019).\n[12] E. Greplova, A. Valenti, G. Boschung, F. Sch¨afer, N. L¨orch,\nand S. Huber, Unsupervised identiﬁcation of topological order\nusing predictive models, arXiv:1910.10124 (2019).\n[13] G. Torlai, B. Timar, E. P. van Nieuwenburg, H. Levine, A. Om-\nran, A. Keesling, H. Bernien, M. Greiner, V. Vuleti´c, M. D.\nLukin, et al., Physical review letters 123, 230504 (2019).\n[14] G. Torlai, G. Mazzola, J. Carrasquilla, M. Troyer, R. Melko,\nand G. Carleo, Nature Physics 14, 447 (2018).\n[15] Y. Zhang, A. Mesaros, K. Fujita, S. D. Edkins, M. H. Hamidian,\nK. Ch’ng, H. Eisaki, S. Uchida, J. C. S. Davis, E. Khatami, and\net al., Nature 570, 484 (2019).\n[16] I. Bloch, J. Dalibard, and S. Nascimb`ene, Nature Physics 8, 267\n(2012).\n[17] R. Islam, E. Edwards, K. Kim, S. Korenblit, C. Noh,\nH. Carmichael, G.-D. Lin, L.-M. Duan, C.-C. Joseph Wang,\nJ. Freericks, and C. Monroe, Nature Communications 2, 377\n(2011).\n[18] J. Zhang, G. Pagano, P. W. Hess, A. Kyprianidis, P. Becker,\nH. Kaplan, A. V. Gorshkov, Z.-X. Gong, and C. Monroe, Nature\n551, 601 (2017).\n[19] W. Hu, R. R. Singh, and R. T. Scalettar, Physical Review E 95,\n062122 (2017).\n[20] C. Wang and H. Zhai, Physical Review B 96, 144432 (2017).\n[21] M. E. Zhitomirsky and K. Ueda, Physical Review B 54, 9007\n(1996).\n[22] L. Balents, Nature 464, 199 (2010).\n[23] X.-G. Wen, Reviews of Modern Physics 89, 041004 (2017).\n[24] R. Nandkishore and D. A. Huse, Annual Review of Condensed\nMatter Physics 6, 15 (2015).\n[25] C. Wang and H. Zhai, Frontiers of Physics 13, 130507 (2018).\n[26] A. A. Shirinyan, V. K. Kozin, J. Hellsvik, M. Pereiro, O. Eriks-\nson, and D. Yudin, Phys. Rev. B 99, 041108(R) (2019).\n[27] J. F. Rodriguez-Nieva and M. S. Scheurer, Nature Physics 15,\n790 (2019).\n[28] C. Monroe, W. Campbell, L.-M. Duan, Z.-X. Gong, A. Gor-\nshkov, P. Hess, R. Islam, K. Kim, G. Pagano, P. Richerme, et al.,\narXiv preprint arXiv:1912.07845 (2019).\n[29] F. Schindler, N. Regnault, and T. Neupert, Physical Review B\n95, 245134 (2017).\n[30] Y.-T. Hsu, X. Li, D.-L. Deng, and S. Das Sarma, Physical Re-\nview Letters 121, 245701 (2018).\n[31] J. Venderley, V. Khemani, and E.-A. Kim, Physical Review Let-\nters 120, 257204 (2018).\n[32] M. Matty, Y. Zhang, Z. Papi´c, and E.-A. Kim, Physical Review\nB 100, 155141 (2019).\n[33] R. R. Coifman and S. Lafon, Applied and Computational Har-\nmonic Analysis 21, 5 (2006).\n[34] See the Supplemental Material [url] for additional details and\nresults on how diffusion maps learn the aforementioned quan-\ntum phase transitions, which includes references [55, 56].\n[35] For exact diagonalization, we can obtain the ground or dynam-\nical state as |ψ⟩= P\nSk ψ(Sk)|Sk⟩, where |Sk⟩is a basis state\nfor the particular measurement and k is a linearized index. We\nthen pick a random number 0 < x < 1 and if it falls in the win-\ndow between P\ni<k |ψ(Si)|2 and P\ni<k+1 |ψ(Si)|2 for some\nvalue of k, then the basis state |Sk⟩will be sampled.\n[36] U. Schollw¨ock, Annals of Physics 326, 96 (2011).\n[37] R. Or´us, Annals of Physics 349, 117 (2014).\n[38] G. Carleo and M. Troyer, Science 355, 602 (2017).\n[39] D.-L. Deng, X. Li, and S. D. Sarma, Physical Review X 7,\n021021 (2017).\n[40] P. Fendley, Journal of Statistical Mechanics: Theory and Exper-\niment 2012, 0 (2012).\n[41] H. Bernien, S. Schwartz, A. Keesling, H. Levine, A. Omran,\nH. Pichler, S. Choi, A. S. Zibrov, M. Endres, M. Greiner,\nV. Vuleti´c, and M. D. Lukin, Nature 551, 579 (2017).\n[42] R. Samajdar, S. Choi, H. Pichler, M. D. Lukin, and S. Sachdev,\nPhysical Review A 98, 023614 (2018).\n[43] P. Calabrese and J. Cardy, Journal of Statistical Mechanics:\nTheory and Experiment 2004, P06002 (2004).\n[44] Y. Zhuang, H. J. Changlani, N. M. Tubman, and T. L. Hughes,\nPhysical Review B 92, 035154 (2015).\n[45] R. Islam, R. Ma, P. M. Preiss, M. Eric Tai, A. Lukin, M. Rispoli,\nand M. Greiner, Nature 528, 77 (2015).\n[46] S. Lloyd, IEEE Transactions on Information Theory 28, 129\n(1982).\n[47] I. Afﬂeck, T. Kennedy, E. H. Lieb, and H. Tasaki, Physical Re-\nview Letters 59, 799 (1987).\n[48] X. Chen, Z.-C. Gu, Z.-X. Liu, and X.-G. Wen, Physical Review\nB 87, 155114 (2013).\n[49] F. Verstraete and J. I. Cirac, Physical Review A 70, 060302(R)\n(2004).\n[50] C. K. Majumdar and D. K. Ghosh, Journal of Mathematical\nPhysics 10, 1388 (1969).\n6\n[51] T. Tonegawa and I. Harada, Journal of the Physical Society of\nJapan 56, 2153 (1987).\n[52] A. Pal and D. A. Huse, Physical Review B 82, 174411 (2010).\n[53] L. van der Maaten and G. Hinton, Journal of Machine Learning\nResearch 9, 2579 (2008).\n[54] M. Ester, H.-P. Kriegel, J. Sander, and X. Xu, in Proceedings of\nthe Second International Conference on Knowledge Discovery\nand Data Mining, KDD’96 (AAAI Press, 1996) p. 226–231.\n[55] T. Hikihara, M. Kaburagi, and H. Kawamura, Physical Review\nB 63, 174430 (2001).\n[56] J. A. Kj¨all, J. H. Bardarson, and F. Pollmann, Physical Review\nLetters 113, 107204 (2014).\nSupplementary Material for “Unsupervised machine learning of quantum phase transitions using\ndiffusion maps”\nAlexander Lidiak1, ∗and Zhexuan Gong1, 2, †\n1Department of Physics, Colorado School of Mines, Golden, Colorado 80401, USA\n2National Institute of Standard and Technology, Boulder, Colorado 80305, USA\nIn this supplementary material, we will show additional supporting results for how diffusion maps can learn incommensurate\nphases (section I), valence-bond solid phases (section II), and many-body localization (section III).\nI.\nLEARNING INCOMMENSURATE PHASES\nIn this section, we ﬁrst show that traditional data analysis methods in quantum simulation that focus on the expectation value,\nvariance, or two-point correlations of local observables will not identify the incommensurate phase associated with H1 (see main\ntext). As seen from Fig. 1, expectation values and variances of the σ operators (averaged spatially) do not identify any phases.\nThis is because the samples are obtained from the exact ground state of H1 at a ﬁnite system size, thus spontaneous symmetry\nbreaking does not happen. The two-point correlations of the σ operators between the edge spin and the central spin is capable\nof revealing the ferromagnetic phase, but does not distinguish the incommensurate phase and the paramagnetic phase clearly.\nNext, we show that principle component analysis (PCA) together with k-means clustering is also unable to learn the incom-\nmensurate phase and its boundary. We perform PCA on the same collection of measurement samples used for the diffusion map\nin Fig 2 of the main text and extract the projection of the sample set onto the ﬁrst two principle components. We then apply a\nk-means clustering algorithm to associate each sample Xi with an index Li = 1, 2, · · · , k. In an attempt to identify all three\nphases within the samples, we manually set the number of clusters to k = 3 (note that the diffusion map does not require such a\npriori knowledge of the number of distinct phases in the data). We then average Li for samples belonging to a particular set of\nHamiltonian parameters (f, θ), and obtain a phase diagram using this averaged index [see Fig. 2(a)]. While we can identify the\nferromagnetic phase and its boundary, there is no clear identiﬁcation of the paramagnetic or incommensurate phases, similar to\nthe scenario with two-point correlations discussed above.\nWe have also used an auto-encoder included in MATLAB to perform nonlinear dimensionality reduction of the measurement\ndata in substitution of PCA. The auto-encoder trains an artiﬁcial neural network to retain as much information of the sample data\nas possible with two latent variables onto which we then encode each measurement sample (similar to projecting onto the ﬁrst\ntwo principle components obtained via PCA). Applying the same k-means clustering algorithm with k = 3 leads to the phase\ndiagram shown in Fig. 2(b), which again is unable to identify the incommensurate phase. This is because the incommensurate\nphase cannot be identiﬁed using a single linear or nonlinear function of the measured observables, as the spin conﬁgurations\nin this phase vary strongly with the system parameters (θ and f). The diffusion map method instead detects the change in the\ndistribution of the measurement samples in conﬁguration space which is often linked to a phase transition.\n(c)\n(b)\n(a)\nFIG. 1. The expectation value of P\ni σi/N from H1 (a), the variance of the same quantity (b), and the correlation between the middle and the\nend spins ⟨σ1σN/2⟩(c) as a function of f and θ. Same as Fig. 2 of the main text, N = 24 and 500 samples are used for each value of f and θ.\n∗alidiak@mines.edu\n† gong@mines.edu\narXiv:2003.07399v2  [quant-ph]  4 Dec 2020\n2\n0\n/6\n/3\n0\n0.5\n1\n1.6\n1.8\n2\n2.2\n2.4\n2.6\n2.8\n(a)\n0\n/6\n/3\n0\n0.5\n1\n1.2\n1.4\n1.6\n1.8\n2\n2.2\n(b)\nFIG. 2. Phase diagrams generated by PCA (a) and auto-encoder (b) applied on the same measurement samples used in Fig. 2 of the main\ntext. The color represents the index attached by a k = 3 k-means clustering algorithm on the projected/compressed measurement sample data,\naveraged over all measurement samples of the ground state of a particular Hamiltonian.\nThe diffusion map method can also be applied to measurement samples of the τ operators in H1. As shown in Fig. 3(a), we see\nthat the number of clusters identiﬁed by the diffusion map can also reveal all three phases and their boundaries. This is because\nif we obtain samples for the τ operator, then the paramagnetic phase will have the least number of clusters (approaching 1 deep\nin the paramagnetic phase), the ferromagnetic phase will have the most number of clusters and the incommensurate phase will\nhave an intermediate number of clusters (as it is quasi long-ranged in the τ operator). The phase diagram is thus nearly identical\nto Fig. 2(a) of the main text with the color map ﬂipped, the main difference being that the discrete Z3 symmetry is identiﬁed in\nFig. 2 of the main text but not here, which is expected as the symmetry applies to the σ operators only.\nFinally, we show in Fig. 3(b) a phase diagram of H1 obtained using the half-chain entanglement entropy for the same system\nsize and parameter range studied (similar to Ref. [1]). One can see that the location and sharpness of the phase boundaries\nlearned by the diffusion map method is comparable to that using the entanglement entropy.\n(a)\n(b)\nFIG. 3. (a) Ground-state phase diagram of H1 (see main text) obtained by (a) performing diffusion maps with ϵ = 0.025, δ = 10−2.5 on 500\nmeasurement samples of the τ operators, and (b) calculating the half-system entanglement entropy.\nII.\nLEARNING VALENCE-BOND SOLID PHASES\nIn this section, we will ﬁrst show that for the J1-J2 model discussed in the main text (H2), PCA and k-means clustering cannot\ndetect the formation of valence-bond solids (VBS) or the spontaneous symmetry breaking at J2 = 0.5. We ﬁrst perform PCA on\nthe same measurement samples used in Fig. 3 of the main text. As shown in Fig. 4(a), the efﬁcacy of dimensionality reduction\n3\nis poor in this case, with many principle components contributing signiﬁcantly to the variance of the data. Moreover, the ﬁrst\nprinciple component only identiﬁes an anti-ferromagnetic order, which is irrelevant for the VBS phase transition [Fig. 4(b)].\nKeeping the ﬁrst two principle components, we apply a k-means clustering algorithm with k = 2 and plot the average index\nas a function of J2 [Fig. 4(c)]. There is no clear signature of a phase transition happening at J2 ≈0.3 and no indication of\nthe spontaneous translational symmetry breaking at J2 = 0.5. We have also used an auto-encoder in place of PCA and ﬁnd it\nperforms no better.\nOn the other hand, we show in Fig. 4(d) that the VBS phase transition can be identiﬁed using a complex order parameter\nknown as the dimer correlation (see Eq. (1) and Ref. [2]). For the ﬁnite system size (N = 24) studied here, the dimer correlation\ncannot locate the phase transition point exactly, and we ﬁnd that the sharpness of the phase transition indicated by the dimer\ncorrelation is comparable to that obtained by the diffusion map method (see Fig. 3(b) of the main text).\nCx\ndim(r) = 1\nS4 ⟨Sx\nl0−r\n2 Sx\nl0−r\n2 +1(Sx\nl0+ r\n2 Sx\nl0+ r\n2 +1 −Sx\nl0+ r\n2 +1Sx\nl0+ r\n2 +2)⟩\n(1)\nFIG. 4. (a) Principle values of PCA applied to the same measurement data used in Fig. 3 of the main text. (b) Coefﬁcients of the ﬁrst principle\ncomponent as a linear combination of each spin’s magnetization, which indicates that the ﬁrst principle component is an anti-ferromagnetic\norder parameter. (c) The average index assigned by k-means clustering with k = 2 to the measurement samples projected onto the ﬁrst two\nprinciple components, as a function of J2. (d) The dimer correlation Cx\ndim(r) given by Eq. (1) as a function of J2 calculated using the exact\nground state of H2. Here we set l0 = 13 and r = 11, consistent with the choice in Ref. [2]\n.\nNext, we will explain in detail the sharp drop in the number of clusters at J2 = 0.5 identiﬁed by the diffusion map with an\nintermediate value of ϵ. First, we point out that at J2 = 0.5, we only obtain one of the two degenerate dimer states (one with\nSi + Si+1 = 0 for all odd i and the other for all even i) as the ground state numerically, which is also expected in an actual\nexperiment due to spontaneous symmetry breaking. A small deviation from J2 = 0.5 will lift the degeneracy of the two dimer\nstates and the ground state becomes approximately a superposition of the two dimer states, which we will call the ‘combined\ndimer state’ below. Thus to see why the number of clusters identiﬁed by diffusion maps suddenly drops at J2 = 0.5, we can\ncompare the results of the diffusion map on a single dimer state with that of the combined dimer state. This comparison is shown\nin Fig. 5 and is very similar to how the J2 = 0.5 curve compares to the J2 close to 0.5 curves in Fig. 3(a) of the main text.\nTo understand why the number of clusters for the single dimer state decreases much more rapidly than the combined dimer\nstate, let us start from the following analysis: if we get two random measurement samples from the combined dimer state, then\n4\n0.01\n0.0125\n0.016\n0.02\n0.025\n0.032\n1\n200\n400\n600\n800\n# of Clusters\nCombined Dimers\nSingle Dimer\n(a)\n0\n0.2\n0.4\n0.6\n0.8\n1\n1\n1.2\n1.4\n1.6\n1.8\n2\nL=24\nL=1000\n(b)\nFIG. 5. (a) The number of clusters identiﬁed by the diffusion map as a function of ϵ used on samples drawn from the single dimer state versus\nthe combined dimer state with N = 24. (b) The ratio Ps(k)/Pc(k) of the probability of ﬁnding two samples with a difference of k spins in\nthe single dimer state to that in the combined dimer state.\nthere is 1/2 probability that both samples are drawn from either one of the single dimer states (Case I), and 1/2 probability that\nthe two samples are drawn from two different single dimer states (Case II). The intuition is that the probability of ﬁnding two\nsamples that are close to each other is much smaller in Case II than in Case I. For example, in Case I, for a given ﬁrst sample, the\nchance of getting the second sample that has zero distance (i.e. identical) to the ﬁrst sample is always 1/2N/2. But in Case II,\nthe chance of getting a identical sample is 2/2N because there are two identical samples that can be obtained from both the even\nand odd dimer states (which are the two perfect antiferromagnetic states), and each only appears with a probability of 1/2N. As\na result, we can largely ignore the probability of ﬁnding two samples close to each other in case II. As we will show below, in the\nthermodynamic limit (N →∞), case II can be completely ignored except when we are considering two samples with exactly\nhalf of the spins in different directions. After ignoring case II, the probability of ﬁnding two samples with k spins different for\nthe combined dimer state, denoted by Pc(k), is only half that of the single dimer state, denoted by Ps(k), in the large N limit.\nThe above analysis can be made precise mathematically. We ﬁnd that Ps(k) =\n\u0000 N\n2\nk\n2\n\u0001\n/2\nN\n2 and Pc(k) = [2\nN\n2 −1\u0000 N\n2\nk\n2\n\u0001\n+\n\u0000N\nk\n\u0001\n]/2N.\nWe have plotted the ratio Ps(k)/Pc(k) in Fig. 5(b) for N = 24 and N = 1000. In the N →∞limit, one can show analytically\nthat Ps(k)/Pc(k) = 2 for k ̸= N/2 and Ps(k)/Pc(k) = 2/(1 +\n√\n2) ≈0.83 for k = N/2. Note that both Ps(k) and Pc(k) are\nsymmetric around k = N/2.\nBecause the probability of ﬁnding samples for most distances in the single dimer state is two (or close to two for ﬁnite N)\ntimes larger than that in the combined dimer state, the number of clusters for the single dimer state will decrease with the cluster\nradius (proportional to ϵ) at twice the rate of that for the combined dimer state. This twice as fast decay is what we observe in\nFig. 5(a) as well as Fig. 3 of the main text which exhibits similar physics.\nIII.\nLEARNING MANY-BODY LOCALIZATION\nWe will ﬁrst explain why we use a different kernel in the diffusion map for learning many-body localization. In the many-body\nlocalized phase, the measurement samples will be clustered around the point of the initial state, while in the thermal phase, the\nmeasurement samples will be scattered across the conﬁguration space. This leads to a large variation in the density of samples\nin conﬁguration space, and the original Gaussian kernel (see main text) results in the number of clusters always decaying with\nincreasing disorder strength for all values of ϵ. This obscures the physical picture in that when the system goes from the thermal\nto the MBL phase, samples of the long-time dynamical states will start to form many small clusters due to the interplay of\nergodicity and localization. To address this issue, we adopt a different kernel in the diffusion map that is widely used in data\nscience on data sets with high density variations [3], corresponding to an extra normalization of the Gaussian kernel (see the\nα = 1 case in Refs. [3, 4], i.e. we will use K′\nij = Kij/(P\nk Kik\nP\nk Kkj) as the kernel in the place of Kij). This extra\nnormalization performed on Kij eliminates the sample density dependence of the diffusion map when extracting the structure\nof the samples in conﬁguration space [3]. In the context of the thermal-to-MBL phase transition, we see that if the samples\nare drawn from a disordered state (high h in H3), then most of the samples are close to each other, with only a small amount\nof samples far away from the rest. Using the kernel given by K′\nij, the transition probabilities between samples that are closely\n5\npacked (far apart) will be reduced (increased), effectively evening out the density of samples in the conﬁguration space. We\nnote that for models without a big variation in sample density (e.g. those generated from the J1-J2 and chiral clock models we\nstudied), using either Kij or K′\nij makes little difference.\nSecond, we show how diffusion maps can learn the many-body localization phase transition of a different model than the one\nstudied in the main text. This model is a disordered spin-1/2 transverse ﬁeld Ising chain with next-nearest neighbor interaction,\nwith Hamiltonian:\nH4 = −\nN−1\nX\ni=1\nJiσz\ni σz\ni+1 + J2\nN−2\nX\ni=1\nσz\ni σz\ni+2 + h\nN\nX\ni=1\nσx\ni .\n(2)\nHere the nearest neighbor Ising couplings are disordered as Ji = J + δJi with δJi drawn from a uniform random distribution\n[−δJ, δJ]. According to Ref. [5], this Hamiltonian undergoes a thermal to MBL phase transition near δJc = 3.81 ± 0.04\n(depending also on the energy density of the initial state) when J = 1 and h\n2 = J2 = 0.3. In Fig. 6(a), we show the number\nof clusters of the diffusion map applied to the measurement samples of {σz\ni } drawn from the long-time dynamical state of an\ninitial antiferromagnetic spin state as a function of ϵ. We ﬁnd that for intermediate values of ϵ, the number of clusters shows a\npeak around δJc [Fig. 6(b)]. This provides further evidence that diffusion maps are able to provide signatures of thermal to MBL\nphase transitions in general.\n0.01\n0.016\n0.025\n0.04\n0.06\n0.1\n1\n3.2\n10\n32\n100\n# of Clusters\n0\n2\n4\n6\n8\n10\n(a)\n2\n4\n6\n8\n10\n2\n3\n4\n5\n(b)\nFIG. 6. Number of clusters learned by diffusion maps on the measurement samples of the long-time dynamical state of Eq. (2), averaged over\n50 disorder realizations. 500 samples are obtained for N = 12 spins using exact diagonalization. (a) The number of clusters as a function of\nϵ. (b) For an intermediate value of ϵ (ϵ = 0.029), the number of clusters is peaked around the critical disorder strength δJc = 3.81.\n[1] Y. Zhuang, H. J. Changlani, N. M. Tubman, and T. L. Hughes, Physical Review B 92, 035154 (2015).\n[2] T. Hikihara, M. Kaburagi, and H. Kawamura, Physical Review B 63, 174430 (2001).\n[3] R. R. Coifman and S. Lafon, Applied and Computational Harmonic Analysis 21, 5 (2006).\n[4] J. F. Rodriguez-Nieva and M. S. Scheurer, Nature Physics 15, 790 (2019).\n[5] J. A. Kj¨all, J. H. Bardarson, and F. Pollmann, Physical Review Letters 113, 107204 (2014).\n",
  "categories": [
    "quant-ph",
    "cond-mat.stat-mech",
    "stat.ML"
  ],
  "published": "2020-03-16",
  "updated": "2020-12-04"
}