{
  "id": "http://arxiv.org/abs/2011.12631v3",
  "title": "A Panoramic Survey of Natural Language Processing in the Arab World",
  "authors": [
    "Kareem Darwish",
    "Nizar Habash",
    "Mourad Abbas",
    "Hend Al-Khalifa",
    "Huseein T. Al-Natsheh",
    "Samhaa R. El-Beltagy",
    "Houda Bouamor",
    "Karim Bouzoubaa",
    "Violetta Cavalli-Sforza",
    "Wassim El-Hajj",
    "Mustafa Jarrar",
    "Hamdy Mubarak"
  ],
  "abstract": "The term natural language refers to any system of symbolic communication\n(spoken, signed or written) without intentional human planning and design. This\ndistinguishes natural languages such as Arabic and Japanese from artificially\nconstructed languages such as Esperanto or Python. Natural language processing\n(NLP) is the sub-field of artificial intelligence (AI) focused on modeling\nnatural languages to build applications such as speech recognition and\nsynthesis, machine translation, optical character recognition (OCR), sentiment\nanalysis (SA), question answering, dialogue systems, etc. NLP is a highly\ninterdisciplinary field with connections to computer science, linguistics,\ncognitive science, psychology, mathematics and others. Some of the earliest AI\napplications were in NLP (e.g., machine translation); and the last decade\n(2010-2020) in particular has witnessed an incredible increase in quality,\nmatched with a rise in public awareness, use, and expectations of what may have\nseemed like science fiction in the past. NLP researchers pride themselves on\ndeveloping language independent models and tools that can be applied to all\nhuman languages, e.g. machine translation systems can be built for a variety of\nlanguages using the same basic mechanisms and models. However, the reality is\nthat some languages do get more attention (e.g., English and Chinese) than\nothers (e.g., Hindi and Swahili). Arabic, the primary language of the Arab\nworld and the religious language of millions of non-Arab Muslims is somewhere\nin the middle of this continuum. Though Arabic NLP has many challenges, it has\nseen many successes and developments. Next we discuss Arabic's main challenges\nas a necessary background, and we present a brief history of Arabic NLP. We\nthen survey a number of its research areas, and close with a critical\ndiscussion of the future of Arabic NLP.",
  "text": "arXiv:2011.12631v3  [cs.CL]  27 Sep 2021\nA Panoramic Survey of\nNatural Language Processing in the Arab World\nKareem Darwish, Nizar Habash,\nMourad Abbas, Hend Al-Khalifa, Huseein T. Al-Natsheh,\nSamhaa R. El-Beltagy, Houda Bouamor, Karim Bouzoubaa,\nVioletta Cavalli-Sforza, Wassim El-Hajj,\nMustafa Jarrar, and Hamdy Mubarak\nOctober 2020\n1\nNatural Language and its Processing\nThe term natural language refers to any system of symbolic communication\n(spoken, signed or written) that has evolved naturally in humans without in-\ntentional human planning and design.\nThis distinguishes natural languages\nsuch as Arabic and Japanese from artiﬁcially constructed languages such as\nEsperanto or Python. Natural language processing (NLP), also called compu-\ntational linguistics or human language technologies, is the sub-ﬁeld of artiﬁcial\nintelligence (AI) focused on modeling natural languages to build applications\nsuch as speech recognition and synthesis, machine translation, optical character\nrecognition (OCR), sentiment analysis (SA), question answering, dialogue sys-\ntems, etc. NLP is a highly interdisciplinary ﬁeld with connections to computer\nscience, linguistics, cognitive science, psychology, mathematics and others.\nSome of the earliest AI applications were in NLP (e.g., machine transla-\ntion); and the last decade (2010-2020) in particular has witnessed an incredible\nincrease in quality, matched with a rise in public awareness, use, and expecta-\ntions of what may have seemed like science ﬁction in the past. NLP researchers\npride themselves on developing language independent models and tools that\ncan be applied to all human languages, e.g. machine translation systems can be\nbuilt for a variety of languages using the same basic mechanisms and models.\nHowever, the reality is that some languages do get more attention (e.g., En-\nglish and Chinese) than others (e.g., Hindi and Swahili). Arabic, the primary\nlanguage of the Arab world and the religious language of millions of non-Arab\nMuslims is somewhere in the middle of this continuum. Though Arabic NLP\nhas many challenges, it has seen many successes and developments.\nNext we discuss Arabic’s main challenges as a necessary background, and we\npresent a brief history of Arabic NLP. We then survey a number of its research\nareas, and close with a critical discussion of the future of Arabic NLP.\n1\n2\nArabic and its Challenges\nArabic today poses a number of modeling challenges for NLP: morphological\nrichness, orthographic ambiguity, dialectal variations, orthographic noise, and\nresource poverty. We do not include issues of right-to-left Arabic typography,\nwhich is an eﬀectively solved problem (although not universally implemented).\nMorphological Richness\nArabic words have numerous forms resulting from\na rich inﬂectional system that includes features for gender, number, person,\naspect, mood, case, and a number of attachable clitics. As a result, it is not\nuncommon to ﬁnd single Arabic words that translate into ﬁve-word English\nsentences: A\u000bî\u000b\tEñ \f\fPY\u000bJ\n \u000b\u000bð wa+sa+ya-drus-uuna+ha ‘and they will study it’. This\nchallenge leads to a higher number of unique vocabulary types compared to\nEnglish, which is challenging for machine learning models.\nOrthographic Ambiguity\nThe Arabic script uses optional diacritical marks\nto represent short vowels and other phonological information that is important\nto distinguish words from each other. These marks are almost never used out-\nside of religious texts and children’s literature, which leads to a high degree of\nambiguity. Educated Arabs do not usually have a problem with reading undi-\nacritized Arabic, but it is a challenge for Arabic learners and computers. This\nout-of-context ambiguity in Standard Arabic leads to a staggering 12 analyses\nper word on average: e.g. the readings of the word \u0010I\u001c.\u0010J» ktbt (no diacritics)\nincludes \f\u0010I\u0015\u001c.\u000b\u0010J\u000b» katabtu ‘I wrote’, \u0015\u0010I\u000b\u001c.\u000b\u0010J\u000b» katabat ‘she wrote’, and the quite seman-\ntically distant \u0010I\u000b\u001c.\u0010J\u000b\n\u000b» ka+tibat ‘such as Tibet’.\nDialectal Variation\nArabic is also not a single language but rather a fam-\nily of historically linked varieties, among which Standard Arabic is the oﬃcial\nlanguage of governance, education and the media, while the other varieties, so-\ncalled dialects, are the languages of daily use in spoken, and increasingly written,\nform. Arab children grow up learning their native dialects, such as Egyptian,\nLevantine, Gulf, or Moroccan Arabic, which have their own grammars and lex-\nicons that diﬀer from each other and from Standard Arabic. For example, the\nword for ‘car’ is \u0010èPAJ\n sayyaara in Standard Arabic, \u0010éJ\nK.Q« arabiyya in Egyptian\nArabic, \u0010éJ.ëQ» karhba in Tunisian Arabic, and Q\u0010KñÓ motar in Gulf Arabic. The\ndiﬀerences can be signiﬁcant to the point that using Standard Arabic tools on\ndialectal Arabic leads to quite sub-optimal performance. For instance, [119]\nreport that using a state-of-the-art tool for MSA morphological disambiguation\non Gulf Arabic returns POS tag and lemma accuracy at about 72% and 64%\nrespectively, compared to the performance on MSA, which is 96% for both [156].\nOrthographic Inconsistency\nStandard and dialectal Arabic are both writ-\nten with a high degree of spelling inconsistency, especially on social media: A\n2\nthird of all words in MSA comments online have spelling errors [201]; and di-\nalectal Arabic has no oﬃcial spelling standards, although there are eﬀorts to\ndevelop such standards computationally, such as the work on CODA, or Con-\nventional Orthography for Dialectal Arabic [95]. Furthermore, Arabic can be\nencountered online written in other scripts, most notably, a romanization called\nArabizi that attempts to capture the phonology of the words [57].\nResource Poverty\nData is the bottleneck of NLP: this is true for rule-based\napproaches that need lexicons and carefully created rules; and for Machine\nLearning (ML) approaches that need corpora and annotated corpora. Although\nArabic unannotated text corpora are quite plentiful, Arabic morphological an-\nalyzers and lexicons as well as annotated and parallel data in non-news genre\nand in dialects are limited.\nNone of the above-mentioned issues are unique to Arabic - e.g. Turkish and\nFinnish are morphologically rich; Hebrew is orthographically ambiguous; and\nmany languages have dialectal variants. However, the combination and degree\nof these phenomena in Arabic creates a particularly challenging situation for\nNLP research and development. For more information on Arabic computational\nprocessing challenges, see [87, 102].\n3\nA Brief History of NLP in the Arab World\nHistorically, Arabic NLP can be said to have gone through three waves. The\nﬁrst wave was in the early 1980’s with the introduction of Microsoft MS-DOS\n3.3 with Arabic language support. In 1985 the ﬁrst Arabic morphological ana-\nlyzer was developed by Sakhr. Most of the research in that period focused on\nmorphological analysis of Arabic text and using rule-based approaches. Sakhr\nhas also continued leading research and development in Arabic computational\nlinguistics by developing the ﬁrst syntactic and semantic analyzer in 1992 and\nArabic optical character recognition in 1995. Sakhr also produced many com-\nmercial products and solutions including Arabic to English machine translation,\nArabic text-to-speech (TTS), and an Arabic search engine. This period almost\nexclusively focused on Standard Arabic with a few exceptions related to work\non speech recognition [89].\nThe second wave was during the years 2000-2010. Arabic NLP gained in-\ncreasing importance in the Western world especially after September 11. The\nUSA funded large projects for companies and research centers to develop NLP\ntools for Arabic and its dialects including: machine translation, speech synthesis\nand recognition, information retrieval and extraction, text to speech, and named\nentity recognition [87, 102, 152]. Most of the systems developed in that period\nused machine learning, which was on the rise in the ﬁeld of NLP as a whole. In\nprinciple, ML required far less linguistic knowledge than rule-based approaches,\nand was fast and more accurate. However it needed a lot of data, some of which\nwas not easy to collect, e.g. dialectal Arabic to English parallel texts. Arabic’s\nrich morphology exacerbated the data dependence further. So, this period saw\n3\nsome successful instances of hybrid systems that combine rule-based morpholog-\nical analyzers with ML disambiguation which relied on the then newly created\nPenn Arabic Treebank (PATB) [98, 128]. The leading universities, companies\nand consortia at the time were: Columbia University, University of Maryland,\nIBM, BBN, SRI, the Linguistic Data Consortium (LDC), and European Lan-\nguage Resources Association (ELRA).\nThe third wave started in 2010, when the research focus on Arabic NLP\ncame back to the Arab world. This period witnessed a proliferation of Arab\nresearchers and graduate students interested in Arabic NLP and an increase in\npublications in top conferences from the Arab world. Active universities include\nNew York University Abu Dhabi (NYUAD), American University in Beirut\n(AUB), Carnegie Mellon University in Qatar (CMUQ), King Saud University\n(KSU), Birzeit University (BZU), Cairo University, etc. Active research centers\ninclude Qatar Computing Research Institute (QCRI), King Abdulaziz City for\nScience and Technology (KACST), etc. It should be noted that there are many\nactively contributing researchers in smaller groups across the Arab world. This\nperiod also overlapped with two major independent developments: one is the\nrise of deep learning and neural models and the other is the rise of social media.\nThe ﬁrst development aﬀected the direction of research pushing it further into\nthe ML space; and the second led to the increase in social media data, which\nintroduced many new challenge at a larger scale: more dialects and more noise.\nThis period also witnessed a welcome increase in Arabic language resources and\nprocessing tools, and a heightened awareness of the importance of AI for the\nfuture of the region – e.g.\nthe UAE now has a ministry for AI speciﬁcally.\nFinally, new young and ambitious companies such as Mawdoo3 are competing\nfor a growing market and expectations in the Arab world. It’s important to note\nthat throughout the diﬀerent waves, researchers of diﬀerent backgrounds (Arab\nand non-Arab) contributed and continue to contribute to the developments in\nthe Arabic NLP.\n4\nArabic Tools and Resources\nWe organize this section on Arabic tools and resources into two parts: ﬁrst,\nwe discuss enabling technologies which are the basic resources and utilities that\nare not user-facing products; and, second, we discuss a number of advanced\nuser-targeting applications.\n4.1\nArabic Enabling Resources and Technologies\n4.1.1\nCorpora and Lexical Resources\nResource construction is a lengthy and costly task that requires signiﬁcant team-\nwork among linguists, lexicographers, and publishers over an extended period\nof time.\n4\nCorpora\nNLP relies heavily on the existence of corpora for developing and\nevaluating its models, and the performance of NLP applications directly depends\non the quality of these corpora. Historically, Al-Khalil ibn Ahmad Al-Farahidi,\nwas among the ﬁrst to assemble a large collection of texts in the 8th century\n[197]. Textual corpora are classiﬁed at a high level as annotated and unanno-\ntated corpora.\nAnnotated corpora are naturally a subset of unannotated corpora that have\nbeen enriched with additional information such as contextual morphological\nanalyses, lemmas, diacritizations, part-of-speech tags, syntactic analyses, dialect\nIDs, named entities, sentiment, and even parallel translations. The more infor-\nmation, the costlier the process is to create such corpora. For Arabic, the main\ncollections of annotated corpora were created in its second wave, mostly outside\nthe Arab world. the most notable annotated resource is the LDC’s Penn Ara-\nbic Treebank (PATB) [128], which provides a relatively large MSA corpus that\nis morphologically analyzed, segmented, lemmatized, tagged with ﬁne-grained\nparts of speech, diacritized, and parsed. PATB has enabled much of the Ara-\nbic NLP research since its creation. The Prague Arabic Dependency Treebank\n(PADT) was the ﬁrst dependency representation treebank for Arabic [188]. The\nColumbia Arabic Treebank (CATiB) was an eﬀort to develop a simpliﬁed depen-\ndency representation with a faster annotation scheme for MSA [99, 193]. The\nUniversity of Leeds’ Quranic Arabic Corpus is a beautifully constructed tree-\nbank that uses traditional morpho-syntactic analyses of the Holy Quran [72, 73].\nWith the rising interest in dialectal data, there have been many eﬀorts to collect\nand annotate dialectal data [18, 24, 47, 48, 69, 76, 89, 164, 169, 186]. The LDC\nwas ﬁrst to create a Levantine and an Egyptian Arabic Treebanks [129].\nIn the Arab world, the eﬀorts are relatively limited in terms of creating\nannotated corpora. Examples include BZU’s Curras, the Palestinian Arabic an-\nnotated corpus [117], NYUAD’s Gumar, the Emirati Arabic annotated corpus\n[120], and Al-Mus’haf Quranic Arabic corpus [209], which is based on the Quran\nand includes morpho-syntactic annotations such as stems, stem patterns, and\nroots. Another annotation eﬀort with a focus on MSA spelling and grammar\ncorrection is the Qatar Arabic Language Bank (QALB), which was developed\nbetween Columbia and CMUQ [201]. Other specialized annotated corpora de-\nveloped in the Arab world include NYUAD’s parallel gender corpus with sen-\ntences in masculine and feminine for anti-gender bias research, the Arab-Acquis\ncorpus pairing Arabic with all of Europe’s languages for a portion of European\nparliamentary proceedings, and the MADAR corpus of parallel dialects created\nin collaboration with CMUQ.\nIn contrast to annotated corpora, there are many unannotated datasets.\nMost large data sets also started outside the Arab world, e.g., the Agence\nFrance Press document collection, which is heavily used for Arabic informa-\ntion retrieval evaluation, the LDC’s Arabic Gigaword [155], Arabic Wikipedia,\nand the ArTenTen corpus [36]. Important collections in the Arab World in-\nclude: the International Corpus of Arabic (Bibliotheca Alexandrina); Shamela,\n5\na large-scale corpus (1B words) covering the past 14 centuries of Arabic1; the\nTashkeela corpus containing 75M fully vocalized words (National Computer Sci-\nence Engineering School in Algeria) [210]; NYUAD’s Gumar Gulf Arabic corpus\ncontaining over 100M words of internet novels [119]; and Abu El-Khair corpus\n(Umm Al-Qura University, KSA) [78]. The success of word embedding models\n[137, 157] trained on unannotated data and resulting in improved performance\nfor NLP tasks with little or no feature engineering have led to many contribu-\ntions in Arabic NLP [19, 88, 189]. The more recent appearance of contextualized\nembeddings trained on unannotated data, such as BERT [67], is creating promis-\ning possibilities for improving many Arabic NLP tasks. At the time of writing\nthis article, a handful of contextualized embedding models are known to sup-\nport Arabic including Multilingual BERT [68], Arabic BERT [166], AraBERT\n(AUB) [35], GigaBert (Ohio State U.) [125], Marbert (U. of British Columbia)\n[8], and QARiB (QCRI).\nLexical Resources\nWe can distinguish three types of lexical resources (aka,\nlexicons, dictionaries and databases): (a) morphological resources that encode\nall inﬂected forms of words, (b) lexical resources that are lemma based, such as\nmachine readable monolingual and multilingual dictionaries, and (c) semantic\nresources that link lemmas to each other, such as wordnets and ontologies. These\nresources are useful for a variety of NLP tasks.\nSome of the earliest publicly available Arabic lexical resources were created\noutside of the Arab world in the second wave mentioned earlier. The Buckwalter\nArabic Morphological Analyzer (BAMA), with its extended version called Stan-\ndard Arabic Morphological Analyzer (SAMA), both available from the LDC,\nprovided one of the ﬁrst stem databases with tags and morphological solutions,\nand are used in a number of tools. Elixir-FM is a functional morphology an-\nalyzer developed in Charles University in Czech Republic [187]. The DIINAR\n[71] Arabic morphological database is a full form resource developed in France.\nThe Tharwa lemma-based lexicon was developed at Columbia University and\nincluded 70k entries in Egyptian Arabic, MSA and English; and later extended\nwith Levantine Arabic [70]. Arabic WordNet is a semantic lexicon consisting of\nabout 11k synsets with subset and superset relationships between concepts and\nlinked to a number of other languages through the Global Wordnet eﬀort. This\neﬀort was done by a number of American and European universities [82]. And\nthe Arabic VerbNet [140] classiﬁes verbs that have the same syntactic descrip-\ntions and argument structure (U. of Konstanz, Germany).\nSome of the eﬀorts in the Arab world led to multiple notable resources.\nAl-Khalil morphological analyzer is a large morphological database for Arabic\ndeveloped by researchers in Morocco and Qatar [50] Calima Star is an exten-\nsion of the BAMA/SAMA family done at NYUAD and is part of the CAMeL\nTools toolkit [151, 195]. BZU developed a large Arabic lexicographic database\nconstructed from 150 lexicons that are diacritized and standardized [115]. The\nMADAR project (NYUAD and CMUQ) includes a lexicon with 47k lemma\n1https://shamela.ws/\n6\nentries covering 25 city dialects in Parallel [48]. Other lexicons have been de-\nveloped for Algerian [9], Tunisian [176], and Morrocan [191]. Finally, in terms\nof semantic lexical resources, the BZU Arabic Ontology [114] is a formal Arabic\nwordnet with more than 20k concepts that was built with ontological analysis in\nmind and is linked to the Arabic Lexicographic Database, Wikidata, and other\nresources [116].\nMore Arabic resources can be found in known international repositories\n(namely ELRA/ELDA, LDC, and CLARIN) or directly from their authors’\nwebsites [87, 102, 198]. Unfortunately, many are not interoperable, have been\nbuilt using diﬀerent tools and assumptions, released under propriety licenses,\nand a few are comprehensive. Serious, well-planned, and well-coordinated in-\nvestment in resources will be instrumental for the future of Arabic NLP.\n4.1.2\nMorphological Processing\nGiven the challenges of Arabic morphological richness and ambiguity, morpho-\nlogical processing has received a lot of attention. The task of morphological\nanalysis refers to the generation of all possible readings of a particular undia-\ncritized word out of context. Morphological disambiguation is about identifying\nthe correct in-context reading. This broad deﬁnition allows us to think of word-\nlevel tasks such as Part-of-Speech (POS) tagging, stemming, diacritization and\ntokenization as sub-types of morphological disambiguation that focus on speciﬁc\naspects of ambiguity.\nMost work on Arabic morphological analysis and disambiguation is on MSA;\nhowever there is a growing number of eﬀorts on dialectal Arabic [64, 123, 156,\n174, 204]. There are a number of commonly used morphological analyzers for\nStandard and dialectal Arabic (Egyptian and Gulf), e.g., BAMA, SAMA, Elixir-\nFM, Al-Khalil, Calima Egyptian, and CAlima Star [50, 51, 91, 96, 121, 187].\nSome of the morphological disambiguation systems disambiguate the analyses\nthat are produced by a morphological analyzer using PATB as a training corpus,\ne.g., MADAMIRA (initially developed at Columbia U.), and other variants of\nit from NYUAD [122, 151, 156, 205]. Farasa (from QCRI) uses independent\nmodels for tokenization [1] and POS tagging [63].\n4.1.3\nSyntactic Processing\nSyntactic parsing is the process of generating a parse tree representation for\na sentence that indicates the relationship among its words.\nFor example, a\nsyntactic parse of the sentence \u000bYK\nYm.Ì'@ \u000bH. A\u000b\u0010JºË@ \fI. ËA \u000b¢Ë@\n\u000b\r@\u000bQ\u0010¯ ‘[lit.] read the-student\nthe-book the-new; the student read the new book’ would indicate that the ad-\njective the-new modiﬁes the noun the-book, which itself is the direct object of\nthe verb read.\nThere are many syntactic representations. Most commonly used in Arabic\nare the PATB constituency representation [128], the CATiB dependency repre-\nsentation [99], and the Universal Dependency (UD) representation [194]. All of\nthese were developed outside of the Arab world. The UD representation is an\n7\ninternational eﬀort, where NYUAD is the representative of the Arab world on\nArabic.\nThe most popular syntactic parsers for Arabic are: Stanford, Farasa (QCRI),\nand CamelParser (NYUAD). Stanford is a statistical parser from the Stanford\nNatural Language Processing Group that can parse English, German, Arabic\nand Chinese. For Arabic, it uses a probabilistic context free grammar that was\ndeveloped based on PATB [92]. Updated versions of the parser use a shift-reduce\nalgorithm [212] and neural transition-based dependency parsing [54]. Farasa is\nan Arabic NLP toolkit that provides syntactic constituency and dependency\nparsing [211]. CamelParser is a dependency parser trained on CATiB treebank\nusing MaltParser [148], a language-independent and data-driven dependency\nparser [183]. A discussion and survey of some of the Arabic parsing work is\npresented in [102].\n4.1.4\nNamed Entity Recognition\nNamed Entity recognition (NER) is the task of identifying one or more con-\nsecutive words in text that refer to objects that exist in the real-world (named\nentities), such as organizations, persons, locations, brands, products, foods, etc.\nNER is essential for extracting structured data from an unstructured text, re-\nlationship extraction, ontology population, classiﬁcation, machine translation,\nquestion answering, and other applications. Among the challenges facing Arabic\nNER compared to English NER is the lack of letter casing which strongly helps\nEnglish NER and the high degree of ambiguity, including especially confusable\nproper names and adjectives, e.g. Õç'\nQ» kariym can be the name ‘Kareem’ or the\nadjective ‘generous’.\nArabic NER approaches include the use of hand-crafted heuristics, machine\nlearning, and hybrids of both with heavy reliance on gazetteers [44, 55, 177].\nRecent approaches exploited cross-lingual links between Arabic and English\nknowledge bases to expand Arabic gazetteers and to carry over capitalization\nfrom English to Arabic [55]. Much of the earlier work on Arabic NER focused\non formal text, typically written in MSA. However, applying models trained on\nMSA text to social media (mostly dialectal) text has led to unsatisfactory results\n[59].\nRecent contextualized embeddings and other deep learning approaches\nsuch as sequence to sequence models and convolutional neural networks have led\nto improved results for Arabic NER [28, 118, 126, 151]. It is expected that the\nuse of contextualized embeddings trained on larger corpora of varying Arabic\ndialects, coupled with the use of deep learning models is likely to contribute\npositively to Arabic NER. As with other utilities, early research was done outside\nof the Arab world, but more work is now happening in the Arab world.\nA\nextensive list of Arabic NER challenges and solutions can be found in [177].\n4.1.5\nDialect Identiﬁcation\nDialect identiﬁcation (DID) is the task of automatically identifying the dialect\nof a particular segment of speech or text of any size (i.e., word, sentence, or\n8\ndocument). This task has been attracting increasing attention in NLP for a\nnumber of language varieties [207]. DID has been shown to be important for\nseveral NLP tasks where prior knowledge about the dialect of an input text\ncan be helpful, such as machine translation [172], sentiment analysis [23], and\nauthor proﬁling [164].\nEarly Arabic multi-dialectal data sets and models focused on the regional\nlevel [45, 47, 66, 81, 93, 136, 203]. The Multi Arabic Dialects Application and\nResources (MADAR) project aimed to create a ﬁner grained dialectal corpus\nand lexicon [48]. The data was used for dialectal identiﬁcation at the city level\n[150, 170] of 25 Arab cities, and was used in a shared task for DID [49]. The main\nissue with that data is that it was commissioned and not naturally occurring.\nConcurrently, larger Twitter-based datasets covering 10-21 countries were also\nintroduced [3, 4, 144, 199]. The Nuanced Arabic Dialect Identiﬁcation (NADI)\nShared Task [7] followed earlier pioneering works by providing country-level\ndialect data for 21 Arab countries, and introduced a province-level identiﬁcation\ntask aiming at exploring a total of 100 provinces across these countries. Also\nhere, earlier eﬀorts started in the west, most notably work in Johns Hopkins\nUniversity [202], but more work is happening now in the Arab world (NYUAD\nand QCRI) [3, 49].\n4.1.6\nInfrastructure\nTo aid the development of NLP systems, a number of multi-lingual infrastructure\ntoolkits have been developed, e.g., GATE2, Stanford CoreNLP3 and UIMA4.\nTheir philosophy is to gather and develop several NLP tools within a single\nand homogeneous structure that is ﬂexible, extensible and modular. They oﬀer\nresearchers easy access to several tools through command-line interfaces (CLIs)\nand application programming interfaces (APIs), thus eliminating the need to\ndevelop them from scratch every time. While Arabic NLP has made signiﬁcant\nprogress with the development of several enabling tools, such as POS taggers,\nmorphological analyzers, text classiﬁers, and syntactic parsers, there is a lim-\nited number of homogeneous and ﬂexible Arabic infrastructure toolkits that\ngather these components. MADAMIRA [156] is a Java-based system providing\nsolutions to fundamental NLP tasks for Standard and Egyptian Arabic. These\ntasks include diacritization, lemmatization, morphological analysis and disam-\nbiguation, POS tagging, stemming, glossing, (conﬁgurable) tokenization, base-\nphrase chunking and NER.5 MADAMIRA’s signature approach is to address\nmultiple morphology related tasks together in one fell swoop producing deep\nlinguistic representations. Farasa6 is a collection of Java libraries and CLIs for\nMSA. These include separate tools for diacritization [58, 143], segmentation [1],\nlemmatization [141], POS tagging [63], parsing [211], and NER [56]. SAFAR7 is\n2https://gate.ac.uk\n3https://stanfordnlp.github.io/CoreNLP/\n4https://uima.apache.org/d/uimaj-current/\n5https://camel.abudhabi.nyu.edu/madamira/\n6http://qatsdemo.cloudapp.net/farasa/\n7http://arabic.emi.ac.ma/safar/\n9\na Java-based framework bringing together all layers of Arabic NLP: resources,\npre-processing, morphology, syntax, and semantics. CAMeL Tools [151] is a\nrecently developed collection of open-source tools, developed in Python, that\nsupports both MSA and Arabic dialects.8 It currently provides APIs and CLIs\nfor pre-processing, morphological modeling, dialect identiﬁcation, NER, and\nsentiment analysis. Other notable eﬀorts include AraNLP [32], ArabiTools,9\nand Adawat.10\nA feature comparison of some Arabic infrastructures can be\nfound in [151] while a detailed survey and a software engineering comparative\nstudy can be found in [113]. Whatever the speciﬁc choice a researcher might\nmake, the trend to use infrastructures more extensively will signiﬁcantly save\ntime and change the way Arabic applications are designed and developed.\n4.2\nArabic NLP Applications\n4.2.1\nMachine Translation\nMachine Translation (MT) is one of the earliest and most worked on areas in\nNLP. The task is to map input text in a source language such as English to\nan output text in a target language such as Arabic. Early MT research was\nheavily rule-based [94, 109, 111, 159, 179]; however now it is almost completely\ncorpus-based using a range of statistical and deep learning models, depending\non resource availability.\nFor MSA, parallel data in the news domain is plentiful.11 There are other\nlarge Arabic parallel collections under the OPUS project [196] and as part of\nthe UN corpus [158]. Other specialized corpora include the Arab-Acquis corpus\npairing with European languages (NYUAD) [101] and the AMARA educational\ndomain parallel corpus (QCRI) [2]. Dialectal parallel data are harder to come\nby and most are commissioned translations [47, 48, 85, 136, 208].\nThere are many other eﬀorts in Statistical MT (SMT) from and to Arabic\n[52, 79, 83, 100, 104, 108, 147, 192]. Recently, Deep Neural Networks have been\nadopted for Arabic Machine Translation as in [15, 29, 33, 90, 154]. While most\nresearched MT systems for Arabic target English, there have been eﬀorts on\nMT for Arabic and other languages, e.g., Chinese [97], Russian [206], Japanese\n[112], and all of the European Union languages [101].\nMT for Arabic dialects is more diﬃcult due to limited resources, but there\nare noteworthy eﬀorts exploiting similarities between MSA and dialects in uni-\nversities and research group around the world [167, 168, 173, 175, 178]. Finally,\nthere is a notable eﬀort on Arabic sign-language translation at King Fahd Uni-\nversity of Petroleum and Minerals [127].\nFor recent surveys of Arabic MT,\nsee [34]. Despite all these contributions, much research work is still needed to\nimprove the performance of Machine translation for Arabic.\n8https://github.com/CAMeL-Lab\n9https://www.arabitools.com/\n10http://adawat.sourceforge.net/\n11Linguistic\nData\nConsortium\n(LDC)\nresources:\nLDC2004T18,\nLDC2004T14,\nand\nLDC2007T08.\n10\n4.2.2\nPedagogical Applications\nPedagogical applications (PA) focus on building tools to develop or model four\nmajor skills: reading, writing, listening, and speaking. Arabic PA research has\nsolely focused on MSA. PA systems can be distinguished in terms of their target\nlearners as ﬁrst language (L1) or second (foreign) language (L2) systems. This\ndistinction can be problematic since, for Arabs, learning to read MSA is some-\nwhat akin to reading a foreign tongue due to its lexical and syntactic divergence\nfrom native dialects.\nWe focus our Arabic PA discussion on (a) computer-\nassisted language learning (CALL) systems, (b) readability assessment, and (c)\nresource-building eﬀorts.\nCALL systems utilize NLP enabling technologies to assist language learn-\ners. There has been a number of eﬀorts in Arabic CALL exploring a range of\nresources and techniques. Examples include the use of Arabic grammar and\nlinguistic analysis rules to help learners identify and correct a variety of errors\n[180, 181]; and multi-agent tutoring systems that simulate the instructor, the\nstudent, the learning strategy, and include a log book to monitor progress, and a\nlearning interface [133, 134]. Another approach focuses on enriching the reading\nexperience with concordances, text-to-speech (TTS), morpho-syntactic analysis,\nand auto-generated quiz questions [130].\nReadability Assessment is the task of automatic identiﬁcation of a text’s\nreadability, i.e., its ability to be read and understood by its reader employing\nan acceptable amount of time and eﬀort. There has been a range of approaches\nfor Arabic L1 and L2 readability. On one end, we ﬁnd formulas using language-\nindependent variables such as text length, average word length, and average\nsentence length, number of syllables in words, the relative rarity or absence of\ndialectal alternatives, and the presence of less common letters [53, 77]. Others\nintegrate Arabic morphological, lexical and syntactic features with supervised\nmachine learning approaches [16, 22, 165].\nAlthough some progress has been made for both L1 and L2 PA, the dearth\nof resources compared with English remains the bottleneck for future progress.\nResource-building eﬀorts have focused on L1 readers with particular emphasis\non grade school curricula [12, 16, 22]. There is a push to inform the enhance-\nment of curricula using pedagogical tools and to compare curricula across Arab\ncountries [21, 103]. The L2 PAs are even more limited with limited corpora\n[130] with disproportionate focus on beginners.12 There is a deﬁnite need for\naugmenting these corpora in a reasoned way, taking into consideration diﬀerent\ntext features and learners, both young and old, beeﬁng up the sparsely pop-\nulated levels with authentic material, and exploiting technologies such as text\nsimpliﬁcation and text error analysis and correction. Learner corpora, which as\nthe name suggests are produced by learners of Arabic can inform the creation of\ntools and corpora [26, 163, 200]. A recent eﬀort developed a large-scale Arabic\nreadability lexicon compatible with an existing morphological analysis system\n[17].\n12https://learning.aljazeera.net/en\n11\n4.2.3\nInformation Retrieval and Question Answering\nWith the increasing volume of Arabic content, information retrieval (aka search)\nhas become a necessity for many domains such as medical records, digital li-\nbraries, web content, and news. The main research interests have focused on\nretrieval of formal language, mostly in the news domain, with ad hoc retrieval\n[149], OCR document retrieval [60, 65], and cross-language retrieval [80]. The\nliterature on other aspects of retrieval continues to be sparse or non-existent,\nthough some of these aspects have been investigated by industry. Others as-\npects of Arabic retrieval that have received some attention include document\nimage retrieval [131], speech search [153], social media [62, 107] and web search\n[105, 190], and ﬁltering [61, 132]. However, eﬀorts on diﬀerent aspects of Arabic\nretrieval continue to be deﬁcient and severely lacking behind eﬀorts in other lan-\nguages. Examples of unexplored problems include searching Wikipedia, which\ncontains semi-structured content, religious text [135], which often contain semi-\nstructured data such chains of narrations, rulings, and commentaries, Arabic\nforums, which are very popular in the Arab world and constitute a signiﬁcant\nportion of the Arabic web, and poetry. To properly develop algorithms and\nmethods to retrieve such content, standard test sets and clear usage scenarios\nare required. We expect that recent improvements in contextual embeddings\ncan positively impact the eﬀectiveness of many retrieval tasks.\nAnother IR related problem is question answering, which comes in many\nﬂavors, the most common of which is attempting to identify a passage or a\nsentence that answers a question [106]. Performing such a task may employ\na large set of NLP tools such as parsing, NER, co-reference resolution, and\ntext semantic representation. There has been limited research on this problem\n[13, 161] and existing commercial solutions such as Ujeeb.com are rudimentary.\n4.2.4\nDialogue Systems\nAutomated dialog systems capable of sustaining a smooth and natural conver-\nsation with users have attracted considerable interest from both research and\nindustry in the past few years. This technology is changing how companies en-\ngage with their customers among many other applications. While commercial\ndialog systems by big multinational companies such as Amazon Alexa, Google\nHome, and Apple Siri support many languages, only Apple Siri supports Ara-\nbic with limited performance. There are some strong recent competitors in the\nArab world, particularly Arabot13 and Mawdoo3’s Salma.14\nWhile there is an important growing body of research on English language\ndialog systems, current NLP methods for Arabic language dialogue are mostly\nbased on handcrafted rule-based systems and methods that use feature engi-\nneering [27]. Among the earliest research eﬀorts on Arabic dialog applications\nis the Quran chatbot [184], where the conversation length is short since the\nsystem answers a user input with a single response. It uses a retrieval-based\n13https://arabot.io/\n14http://salma.ai/\n12\nmodel as the dataset is limited by the content of the Quran. A recent approach\nused deep learning techniques for text classiﬁcation and NER to build a natural\nlanguage understanding module – the core component of any dialogue system –\nfor the domain of home automation in Arabic [43]. A unique dialogue system\nfrom NYUAD explored bilingual interfaces where Arabic speech can be used as\ninput to an English bot that displays Arabic subtitles [10]. Other works have\nfocused on developing dialog systems for the case of Arabic dialects, e.g. the\npublicly available NYUAD Egyptian dialect chatbot Botta, and KSU’s Saudi\ndialect Information Technology focused chatbot Nabiha [14].\n4.2.5\nSentiment and Emotion Analysis\nSentiment analysis (SA), aka opinion mining, is the task of identifying the af-\nfective states and subjective information in a text. For example, an Egyptian\nArabic movie review such as !ø\n X \u0010é\tJË@ ÕÎJ\n\t¯ \ták@ ‘the best movie this year!’ is\nsaid to indicate a positive sentiment. SA is a very powerful tool for tracking\ncustomer satisfaction, carrying out competition analysis, and generally gauging\npublic opinion towards a speciﬁc issue, topic, or product. SA has attracted a lot\nof attention in the Arabic research community during the last decade, connected\nwith the availability of large volumes of opinionated and sentiment reﬂecting\ndata from Arabic social media. Early Arabic SA eﬀorts focused on the creation\nof needed resources such as sentiment lexicons, training datasets, and sentiment\ntreebanks [5, 38, 41, 74, 84, 86, 124, 139, 160, 171, 185], as well as shared task\nbenchmarks [138, 162]. Arabic SA solutions span a range of methods from the\nnow conventional use of rules and lexicons [6, 38, 75] to machine learning based\nmethods [11, 39, 41], as well as hybrid approaches employing morphological and\nsyntactic features [20]. Recently, ﬁne-tuning large pre-trained language models\nhas achieved improved Arabic SA results [8, 35]. Arabic emotion recognition\nis a closely related topic that has attracted some attention recently. It aims to\nidentify a variety of emotions in text such as anger, disgust, surprise, and joy\n[31, 40, 42, 110, 182]. Similar to how SA resources and models started matur-\ning, a lot of work still needs to be done in emotion recognition. Another related\nproblem is stance detection, which attempts to identify positions expressed on\na topic or towards an entity. Stances are often expressed using non-sentiment\nwords [46]. For a recent comprehensive survey on the status of Arabic SA and\nthe future directions, see [37].\n4.2.6\nContent Moderation on Social Media\nThe task of content moderation is about the enforcement of online outlets’ poli-\ncies against posting user comments that contain oﬀensive language, hate speech,\ncyber-bullying, and spam among other types of inappropriate or dangerous con-\ntent.15 Such content cannot be easily detected given the huge volume of posts,\ndialectal variations, creative spelling on social media, and the scarcity of avail-\nable data and detection tools. This area is relatively new for Arabic. One of\n15https://www.bbc.co.uk/usingthebbc/terms/what-are-the-rules-for-commenting/\n13\nthe more active areas has to do with the detection of oﬀensive language, which\ncovers targeted attacks, vulgar and pornographic language, and hate speech.\nInitial work was performed on comments from a news site and limited num-\nbers of tweets [145] and YouTube comments [25]. Some works focused on adult\ncontent [30] and others on hate speech. Recent benchmarking shared tasks in-\ncluded the automatic detection of such language in Twitter domain [146]. Work\non spam detection on Twitter is nascent and much work is required [142].\n5\nFuture Outlook\nArabic NLP has many challenges, but it has also seen many successes and de-\nvelopments over the last 40 years. We are optimistic by its continuously positive\nalbeit (sometimes) slow development trajectory. For the next decade or two,\nwe expect a large growth in the Arabic NLP market. This is consistent with\nthe global rising demands and expectations for language technologies and the\nincrease in NLP research and development in the Arab world. The growing\nnumber of researchers and developers working on NLP in the Arab world makes\nit a very fertile ground ready for major breakthroughs. To support this vision,\nwe believe it is time to have an association for Arabic language technologists\nthat brings together talent and resources, and sets standards for the Arabic\nNLP community. Such an organization can support NLP education in the Arab\nworld, serve as a hub for resources, and advocate for educators and researchers in\nchanging old-fashioned university policies regarding journal-focused evaluation,\nand encouraging collaborations within the Arab world by connecting academic,\nindustry, and governmental stakeholders. We also recommend more open source\ntools and public data are made available to create a basic development frame-\nwork that lowers the threshold for joining the community, thus attracting more\ntalent that will form the base of the next generation of Arabic NLP researchers,\ndevelopers, and entrepreneurs.\nReferences\n[1] Abdelali, A., Darwish, K., Durrani, N., and Mubarak, H. Farasa:\nA Fast and Furious Segmenter for Arabic. In Proceedings of the Confer-\nence of the North American Chapter of the Association for Computational\nLinguistics (NAACL) (San Diego, California, 2016), pp. 11–16.\n[2] Abdelali, A., Guzman, F., Sajjad, H., and Vogel, S. The AMARA\nCorpus: Building parallel language resources for the educational domain.\nIn Proceedings of the Language Resources and Evaluation Conference\n(LREC) (Reykjavik, Iceland, 2014).\n[3] Abdelali, A., Mubarak, H., Samih, Y., Hassan, S., and Dar-\nwish, K.\nArabic dialect identiﬁcation in the wild.\narXiv preprint\narXiv:2005.06557 (2020).\n14\n[4] Abdul-Mageed, M., Alhuzali, H., and Elaraby, M.\nYou tweet\nwhat you speak: A city-level dataset of Arabic dialects. In Proceedings of\nthe Language Resources and Evaluation Conference (LREC) (Miyazaki,\nJapan, 2018).\n[5] Abdul-Mageed, M., and Diab, M. Toward Building a Large-Scale\nArabic Sentiment Lexicon. In Proceedings of the 6th International Global\nWordNet Conference (Matuse, Japan, 2012), pp. 18–22.\n[6] Abdul-Mageed, M., and Diab, M.\nSANA: A large scale multi-\ngenre, multi-dialect lexicon for Arabic subjectivity and sentiment analy-\nsis. In Proceedings of the Language Resources and Evaluation Conference\n(LREC) (Reykjavik, Iceland, 2014), pp. 1162–1169.\n[7] Abdul-Mageed, M., Zhang, C., Bouamor, H., and Habash, N.\nNADI 2020: The First Nuanced Arabic Dialect Identiﬁcation Shared Task.\nIn Proceedings of the Fifth Arabic Natural Language Processing Workshop\n(WANLP 2020) (Barcelona, Spain, 2020).\n[8] Abdul-Mageed, M., Zhang, C., Elmadany, A., and Ungar, L.\nToward micro-dialect identiﬁcation in diaglossic and code-switched envi-\nronments, 2020.\n[9] Abidi, K., and Sma¨ıli, K. An automatic learning of an algerian dialect\nlexicon by using multilingual word embeddings.\nIn 11th edition of the\nLanguage Resources and Evaluation Conference, LREC 2018 (2018).\n[10] Abu Ali, D., Ahmad, M., Al Hassan, H., Dozsa, P., Hu, M.,\nVarias, J., and Habash, N. A bilingual interactive human avatar di-\nalogue system.\nIn Proceedings of the 19th Annual SIGdial Meeting on\nDiscourse and Dialogue (Melbourne, Australia, July 2018), Association\nfor Computational Linguistics, pp. 241–244.\n[11] Abu Farha, I., and Magdy, W. Mazajak: An online Arabic sentiment\nanalyser. In Proceedings of the Fourth Arabic Natural Language Processing\nWorkshop (Florence, Italy, Aug. 2019), Association for Computational\nLinguistics, pp. 192–198.\n[12] Al-Ajlan, A. A., Al-Khalifa, H. S., and Al-Salman, A. S. To-\nwards the development of an automatic readability measurements for Ara-\nbic language. In 2008 Third International Conference on Digital Informa-\ntion Management (2008), pp. 506–511.\n[13] Al-Bataineh, H., Farhan, W., Mustafa, A., Seelawi, H., and T.\nAl-Natsheh, H. Deep contextualized pairwise semantic similarity for\nArabic language questions. In 2019 IEEE 31st International Conference\non Tools with Artiﬁcial Intelligence (ICTAI) (2019), pp. 1586–1591.\n15\n[14] Al-Ghadhban, D., and Al-Twairesh, N. Nabiha: An Arabic dialect\nchatbot. International Journal of Advanced Computer Science and Appli-\ncations 11, 3 (2020).\n[15] Al-Ibrahim, R., and Duwairi, R. M. Neural machine translation from\njordanian dialect to modern standard Arabic. In 2020 11th International\nConference on Information and Communication Systems (ICICS) (2020),\nIEEE, pp. 173–178.\n[16] Al-Khalifa, H., and Al-Ajlan, A. A. Automatic readability measure-\nments of the Arabic text: An exploratory study. ARABIAN JOURNAL\nFOR SCIENCE AND ENGINEERING 35, 2 (2010), 103–124.\n[17] Al Khalil, M., Habash, N., and Jiang, Z. A large-scale leveled read-\nability lexicon for Standard Arabic. In Proceedings of the 12th Language\nResources and Evaluation Conference (Marseille, France, May 2020), Eu-\nropean Language Resources Association, pp. 3053–3062.\n[18] Al-Sabbagh, R., and Girju, R. YADAC: Yet another Dialectal Arabic\nCorpus. In Proceedings of the Eighth International Conference on Lan-\nguage Resources and Evaluation (LREC-2012) (2012), pp. 2882–2889.\n[19] Al Sallab, A., Hajj, H., Badaro, G., Baly, R., El-Hajj, W., and\nShaban, K. Deep learning models for sentiment analysis in Arabic. In\nProceedings of the second workshop on Arabic natural language processing\n(2015), pp. 9–17.\n[20] Al-Smadi, M., Al-Ayyoub, M., Jararweh, Y., and Qawasmeh, O.\nEnhancing aspect-based sentiment analysis of Arabic hotels’ reviews using\nmorphological, syntactic and semantic features. Information Processing\n& Management 56, 2 (2019), 308–319.\n[21] Al-Sulaiti, L., Abbas, N., Brierley, C., Atwell, E., and Al-\nghamdi, A. Compilation of an Arabic children’s corpus. In Proceedings\nof the Tenth International Conference on Language Resources and Eval-\nuation (LREC’16) (Portoroˇz, Slovenia, May 2016), European Language\nResources Association (ELRA), pp. 1808–1812.\n[22] Al Tamimi, A.-K., Jaradat, M., AlJarrah, N., and Ghanem, S.\nAari: automatic Arabic readability index. International Arab Journal of\nInformation Technology (IAJIT) 11, 4 (2014), 370–378.\n[23] Al-Twairesh, N., Al-Khalifa, H., and AlSalman, A. AraSenTi:\nLarge-Scale Twitter-Speciﬁc Arabic Sentiment Lexicons. In Proceedings of\nthe 54th Annual Meeting of the Association for Computational Linguistics\n(Berlin, Germany, 2016).\n[24] Al-Twairesh, N., Al-Matham, R., Madi, N., Almugren, N., Al-\nAljmi, A.-H., Alshalan, S., Alshalan, R., Alrumayyan, N.,\n16\nAl-Manea, S., Bawazeer, S., Al-Mutlaq, N., Almanea, N.,\nHuwaymil, W. B., Alqusair, D., Alotaibi, R., Al-Senaydi, S.,\nand Alfutamani, A. SUAR: Towards building a corpus for the Saudi\ndialect. In Proceedings of the International Conference on Arabic Com-\nputational Linguistics (ACLing) (2018).\n[25] Alakrot, A., Murray, L., and Nikolov, N. S. Towards accurate de-\ntection of oﬀensive language in online communication in Arabic. Procedia\ncomputer science 142 (2018), 315–320.\n[26] Alfaifi, A., Atwell, E., and Ibraheem, H. Arabic learner corpus\n(alc) v2 : A new written and spoken corpus of Arabic learners, 2014.\n[27] AlHumoud, S., Al Wazrah, A., and Aldamegh, W. Arabic chat-\nbots: A survey. INTERNATIONAL JOURNAL OF ADVANCED COM-\nPUTER SCIENCE AND APPLICATIONS 9, 8 (2018), 535–541.\n[28] Ali, M., Tan, G., and Hussain, A.\nBoosting Arabic named-entity\nrecognition with multi-attention layer.\nIEEE Access 7 (2019), 46575–\n46582.\n[29] Almahairi, A., Cho, K., Habash, N., and Courville, A.\nFirst\nResult on Arabic Neural Machine Translation. arXiv e-prints (June 2016),\narXiv:1606.02680.\n[30] Alshehri, A., Nagoudi, E. M. B., Alhuzali, H., and Abdul-\nMageed, M. Think before your click: Data and models for adult content\nin Arabic twitter. In The 2nd Text Analytics for Cybersecurity and Online\nSafety Workshop (TA-COS-2018) (2018).\n[31] Alswaidan, N., and Menai, M. E. B. Hybrid feature model for emo-\ntion recognition in Arabic text. IEEE Access 8 (2020), 37843–37854.\n[32] Althobaiti, M., Kruschwitz, U., and Poesio, M. Aranlp: A java-\nbased library for the processing of Arabic text. In Lrec (2014).\n[33] Ameur, M. S. H., Guessoum, A., and Meziane, F. Improving Arabic\nneural machine translation via n-best list re-ranking. Mach. Transl. 33, 4\n(2019), 279–314.\n[34] Ameur, M. S. H., Meziane, F., and Guessoum, A. Arabic machine\ntranslation: A survey of the latest trends and challenges. Computer Sci-\nence Review 38 (2020), 100305.\n[35] Antoun, W., Baly, F., and Hajj, H.\nArabert:\nTransformer-\nbased model for Arabic language understanding.\narXiv preprint\narXiv:2003.00104 (2020).\n17\n[36] Arts, T., Belinkov, Y., Habash, N., Kilgarriff, A., and Su-\nchomel, V.\nartenten: Arabic corpus and word sketches.\nJournal of\nKing Saud University-Computer and Information Sciences 26, 4 (2014),\n357–371.\n[37] Badaro, G., Baly, R., Hajj, H., El-Hajj, W., Shaban, K. B.,\nHabash, N., Al-Sallab, A., and Hamdi, A. A survey of opinion min-\ning in Arabic: a comprehensive system perspective covering challenges\nand advances in tools, resources, models, applications, and visualizations.\nACM Transactions on Asian and Low-Resource Language Information\nProcessing (TALLIP) 18, 3 (2019), 1–52.\n[38] Badaro, G., Baly, R., Hajj, H., Habash, N., and El-Hajj, W. A\nlarge scale Arabic sentiment lexicon for Arabic opinion mining. In Proceed-\nings of the Workshop for Arabic Natural Language Processing (WANLP)\n(Doha, Qatar, 2014), pp. 165–173.\n[39] Badaro, G., El Jundi, O., Khaddaj, A., Maarouf, A., Kain, R.,\nHajj, H., and El-Hajj, W. EMA at SemEval-2018 task 1: Emotion\nmining for Arabic. In Proceedings of The 12th International Workshop on\nSemantic Evaluation (New Orleans, Louisiana, June 2018), Association\nfor Computational Linguistics, pp. 236–244.\n[40] Badaro, G., Jundi, H., Hajj, H., El-Hajj, W., and Habash, N.\nArsel: A large scale Arabic sentiment and emotion lexicon. In OSACT 3:\nThe 3rd Workshop on Open-Source Arabic Corpora and Processing Tools\n(2018), p. 26.\n[41] Baly, R., Hajj, H., Habash, N., Shaban, K. B., and El-Hajj,\nW. A sentiment treebank and morphologically enriched recursive deep\nmodels for eﬀective sentiment analysis in Arabic. ACM Transactions on\nAsian and Low-Resource Language Information Processing (TALLIP) 16,\n4 (2017), 1–21.\n[42] Baly, R., Khaddaj, A., Hajj, H., El-Hajj, W., and Shaban, K. B.\nArsentd-lev: A multi-topic corpus for target-based sentiment analysis in\nArabic levantine tweets. arXiv preprint arXiv:1906.01830 (2019).\n[43] Bashir, A. M., Hassan, A., Rosman, B., Duma, D., and Ahmed, M.\nImplementation of a neural natural language understanding component for\nArabic dialogue systems. Procedia computer science 142 (2018), 222–229.\n[44] Benajiba, Y., Diab, M., and Rosso, P. Arabic Named Entity Recog-\nnition using Optimized Feature Sets. In Proceedings of the Conference on\nEmpirical Methods in Natural Language Processing (EMNLP) (Honolulu,\nHawaii, 2008), pp. 284–293.\n[45] Biadsy, F., and Hirschberg, J. Using Prosody and Phonotactics in\nArabic Dialect Identiﬁcation.\nIn Proceedings of the Conference of the\n18\nInternational Speech Communication Association (Interspeech) (Brighton,\nUK, 2009).\n[46] Borge-Holthoefer, J., Magdy, W., Darwish, K., and Weber,\nI. Content and network dynamics behind egyptian political polarization\non twitter.\nIn Proceedings of the 18th ACM Conference on Computer\nSupported Cooperative Work & Social Computing (2015), pp. 700–711.\n[47] Bouamor, H., Habash, N., and Oflazer, K. A multidialectal parallel\ncorpus of Arabic. In Proceedings of the Language Resources and Evaluation\nConference (LREC) (Reykjavik, Iceland, 2014).\n[48] Bouamor, H., Habash, N., Salameh, M., Zaghouani, W., Ram-\nbow, O., Abdulrahim, D., Obeid, O., Khalifa, S., Eryani, F.,\nErdmann, A., and Oflazer, K. The MADAR Arabic Dialect Corpus\nand Lexicon. In Proceedings of the Language Resources and Evaluation\nConference (LREC) (Miyazaki, Japan, 2018).\n[49] Bouamor, H., Hassan, S., and Habash, N. The MADAR shared task\non Arabic ﬁne-grained dialect identiﬁcation. In Proceedings of the Fourth\nArabic Natural Language Processing Workshop (2019), pp. 199–207.\n[50] Boudchiche, M., Mazroui, A., Bebah, M. O. A. O., Lakhouaja,\nA., and Boudlal, A. AlKhalil Morpho Sys 2: A robust Arabic morpho-\nsyntactic analyzer. Journal of King Saud University - Computer and In-\nformation Sciences 29, 2 (2017), 141–146.\n[51] Buckwalter, T. Buckwalter Arabic morphological analyzer version 1.0.\nLinguistic Data Consortium (LDC) catalog number LDC2002L49, ISBN\n1-58563-257-0, 2002.\n[52] Carpuat, M., Marton, Y., and Habash, N. Improving Arabic-to-\nenglish statistical machine translation by reordering post-verbal subjects\nfor alignment. In Proceedings of the ACL 2010 Conference Short Papers\n(2010), pp. 178–183.\n[53] Cavalli-Sforza, V., Saddiki, H., and Nassiri, N. Arabic readabil-\nity research: Current state and future directions. Arabic Computational\nLinguistics (WASJ) 142 (2018), 38—-49.\n[54] Chen, D., and Manning, C. D. A fast and accurate dependency parser\nusing neural networks. In Proceedings of the 2014 conference on empirical\nmethods in natural language processing (EMNLP) (2014), pp. 740–750.\n[55] Darwish, K.\nNamed entity recognition using cross-lingual resources:\nArabic as an example.\nIn Proceedings of the 51st Annual Meeting of\nthe Association for Computational Linguistics (Volume 1: Long Papers)\n(2013), pp. 1558–1567.\n19\n[56] Darwish, K.\nNamed entity recognition using cross-lingual resources:\nArabic as an example. In Proceedings of the 51st Annual Meeting of the\nAssociation for Computational Linguistics (2013), pp. 1558–1567.\n[57] Darwish, K. Arabizi Detection and Conversion to Arabic. In Proceed-\nings of the Workshop for Arabic Natural Language Processing (WANLP)\n(Doha, Qatar, 2014), pp. 217–224.\n[58] Darwish, K., Abdelali, A., Mubarak, H., and Eldesouki, M. Ara-\nbic diacritic recovery using a feature-rich bilstm model. arXiv preprint\narXiv:2002.01207 (2020).\n[59] Darwish, K., and Gao, W. Simple eﬀective microblog named entity\nrecognition: Arabic as an example. In LREC (2014), pp. 2513–2517.\n[60] Darwish, K., and Magdy, W. Error correction vs. query garbling for\narabic ocr document retrieval. ACM Transactions on Information Systems\n(TOIS) 26, 1 (2007), 5–es.\n[61] Darwish, K., and Magdy, W. Arabic information retrieval. Founda-\ntions and Trends in Information Retrieval 7, 4 (2014), 239–342.\n[62] Darwish, K., Magdy, W., and Mourad, A. Language processing for\nArabic microblog retrieval. In Proceedings of the 21st ACM international\nconference on Information and knowledge management (2012), pp. 2427–\n2430.\n[63] Darwish, K., Mubarak, H., Abdelali, A., and Eldesouki, M. Ara-\nbic pos tagging: Don’t abandon feature engineering just yet. In Proceed-\nings of the Third Arabic Natural Language Processing Workshop (2017),\npp. 130–137.\n[64] Darwish, K., Mubarak, H., Abdelali, A., Eldesouki, M., Samih,\nY., Alharbi, R., Attia, M., Magdy, W., and Kallmeyer, L. Multi-\ndialect Arabic pos tagging: A CRF approach. In Proceedings of the Lan-\nguage Resources and Evaluation Conference (LREC) (Miyazaki, Japan,\n2018).\n[65] Darwish, K., and Oard, D. W. Term selection for searching printed\narabic.\nIn Proceedings of the 25th annual international ACM SIGIR\nconference on Research and development in information retrieval (2002),\npp. 261–268.\n[66] Darwish, K., Sajjad, H., and Mubarak, H. Veriﬁably Eﬀective Ara-\nbic Dialect Identiﬁcation. In Proceedings of the 2014 Conference on Em-\npirical Methods in Natural Language Processing (EMNLP) (Doha, Qatar,\n2014).\n20\n[67] Devlin, J., Chang, M.-W., Lee, K., and Toutanova, K. Bert: Pre-\ntraining of deep bidirectional transformers for language understanding,\n2018.\n[68] Devlin, J., Chang, M.-W., Lee, K., and Toutanova, K. BERT:\nPre-training of deep bidirectional transformers for language understand-\ning. In Proceedings of the 2019 Conference of the North American Chapter\nof the Association for Computational Linguistics: Human Language Tech-\nnologies, Volume 1 (Long and Short Papers) (Minneapolis, Minnesota,\nJune 2019), Association for Computational Linguistics, pp. 4171–4186.\n[69] Diab, M., Habash, N., Rambow, O., Altantawy, M., and Bena-\njiba, Y. COLABA: Arabic dialect annotation and processing. In LREC\nworkshop on Semitic language processing (2010), pp. 66–74.\n[70] Diab, M. T., Al-Badrashiny, M., Aminian, M., Attia, M., El-\nfardy, H., Habash, N., Hawwari, A., Salloum, W., Dasigi, P.,\nand Eskander, R. Tharwa: A Large Scale Dialectal Arabic-Standard\nArabic-English Lexicon. In Proceedings of the Language Resources and\nEvaluation Conference (LREC) (Reykjavik, Iceland, 2014), pp. 3782–\n3789.\n[71] Dichy, J., and Hassoun, M. The dinar. 1 (dictionnaire informatis´e\nde l’arabe, version 1) arabic lexical resource, an outline of contents and\nmethodology. The ELRA news letter 10, 2 (2005).\n[72] Dukes, K., and Buckwalter, T. A Dependency Treebank of the Quran\nusing Traditional Arabic Grammar. In Proceedings of the Conference on\nInformatics and Systems (INFOS) (Cairo, Egypt, 2010).\n[73] Dukes, K., and Habash, N. Morphological Annotation of Quranic Ara-\nbic. In Proceedings of the Language Resources and Evaluation Conference\n(LREC) (Valetta, Malta, 2010).\n[74] El-Beltagy, S. R.\nNileULex: A Phrase and Word Level Sentiment\nLexicon for Egyptian and Modern Standard Arabic. In Proceedings of\nLREC 2016 (Portoroˇz, Slovenia, 2016).\n[75] El-Beltagy, S. R., and Ali, A. Open Issues in the Sentiment Analysis\nof Arabic Social Media : A Case Study. In Proceedings of 9th the Interna-\ntional Conference on Innovations and Information Technology (IIT2013)\n(Al Ain, UAE, 2013).\n[76] El-Haj, M. Habibi - a multi dialect multi national Arabic song lyrics\ncorpus. In Proceedings of the 12th Language Resources and Evaluation\nConference (Marseille, France, May 2020), European Language Resources\nAssociation, pp. 1318–1326.\n21\n[77] El-Haj, M., and Rayson, P. OSMAN – a novel Arabic readability\nmetric. In Proceedings of the Tenth International Conference on Language\nResources and Evaluation (LREC’16) (Portoroˇz, Slovenia, May 2016), Eu-\nropean Language Resources Association (ELRA), pp. 250–255.\n[78] El-Khair, I. A.\n1.5 billion words Arabic corpus.\narXiv preprint\narXiv:1611.04033 (2016).\n[79] El Kholy, A., and Habash, N. Orthographic and morphological pro-\ncessing for English-Arabic statistical machine translation. In Proceedings\nof Traitement Automatique des Langues Naturelles (TALN) (Montr´eal,\nCanada, 2010). Montr´eal, Canada.\n[80] Elayeb, B., and Bounhas, I. Arabic cross-language information re-\ntrieval: a review. ACM Transactions on Asian and Low-Resource Lan-\nguage Information Processing (TALLIP) 15, 3 (2016), 1–44.\n[81] Elfardy, H., Al-Badrashiny, M., and Diab, M. Aida: Identifying\ncode switching in informal Arabic text. In Proceedings of the Conference\non Empirical Methods in Natural Language Processing (EMNLP) (Doha,\nQatar, 2014), pp. 94–101.\n[82] Elkateb, S., Black, W., Vossen, P., Farwell, D., Rodr´ıguez,\nH., Pease, A., and Alkhalifa, M. Arabic wordnet and the challenges\nof Arabic. In Proceedings of Arabic NLP/MT Conference, London, UK\n(2006), pp. 665–670.\n[83] Elming, J., and Habash, N. Syntactic reordering for english-Arabic\nphrase-based machine translation.\nIn Proceedings of the EACL 2009\nWorkshop on Computational Approaches to Semitic Languages (2009),\npp. 69–77.\n[84] ElSahar, H., and El-Beltagy, S. R. Building Large Arabic Multi-\ndomain Resources for Sentiment Analysis.\nIn Proceedings of CICLing\n2015, Volume 9042 of the series Lecture Notes in Computer Science\n(2015), Springer Verlag, pp. 23–34.\n[85] Erdmann, A., Habash, N., Taji, D., and Bouamor, H. Low Re-\nsourced Machine Translation via Morpho-syntactic Modeling: The Case\nof Dialectal Arabic. In Proceedings of the Machine Translation Summit\n(MT Summit) (2017).\n[86] Eskander, R., and Rambow, O. SLSA: A Sentiment Lexicon for Stan-\ndard Arabic. In Proceedings of the 2015 Conference on Empirical Methods\nin Natural Language Processing (2015), pp. 2545–2550.\n[87] Farghaly, A., and Shaalan, K. Arabic natural language processing:\nChallenges and solutions. ACM Transactions on Asian Language Infor-\nmation Processing (TALIP) 8, 4 (2009), 1–22.\n22\n[88] Farha, I. A., and Magdy, W. Mazajak: An online Arabic sentiment\nanalyser. In Proceedings of the Fourth Arabic Natural Language Processing\nWorkshop (2019), pp. 192–198.\n[89] Gadalla, H., Kilany, H., Arram, H., Yacoub, A., El-Habashi,\nA., Shalaby, A., Karins, K., Rowson, E., MacIntyre, R., Kings-\nbury, P., Graff, D., and McLemore, C.\nCALLHOME Egyptian\nArabic transcripts LDC97T19. Web Download. Philadelphia: Linguistic\nData Consortium, 1997.\n[90] Gashaw, I., and Shashirekha, H. L. Amharic-Arabic neural machine\ntranslation, 2019.\n[91] Graff, D., Maamouri, M., Bouziri, B., Krouna, S., Kulick, S.,\nand Buckwalter, T. Standard Arabic Morphological Analyzer (SAMA)\nVersion 3.1, 2009. Linguistic Data Consortium LDC2009E73.\n[92] Green, S., and Manning, C. D. Better Arabic Parsing: Baselines,\nEvaluations, and Analysis. In Proceedings of the International Conference\non Computational Linguistics (COLING) (Beijing, China, 2010), pp. 394–\n402.\n[93] Guellil, I., and Azouaou, F. Arabic Dialect Identiﬁcation with an\nUnsupervised Learning (Based on a Lexicon). Application Case: ALGE-\nRIAN Dialect. In 2016 IEEE International Conference on Computational\nScience and Engineering (CSE) and IEEE Intl Conference on Embedded\nand Ubiquitous Computing (EUC) and 15th Intl Symposium on Distributed\nComputing and Applications for Business Engineering (DCABES) (2016),\npp. 724–731.\n[94] Guessoum, A., and Zantout, R. A methodology for a semi-automatic\nevaluation of the lexicons of machine translation systems. Machine trans-\nlation 16, 2 (2001), 127–149.\n[95] Habash, N., Eryani, F., Khalifa, S., Rambow, O., Abdulrahim,\nD., Erdmann, A., Faraj, R., Zaghouani, W., Bouamor, H., Zal-\nmout, N., Hassan, S., shargi, F. A., Alkhereyf, S., Abdulka-\nreem, B., Eskander, R., Salameh, M., and Saddiki, H. Uniﬁed\nguidelines and resources for Arabic dialect orthography. In Proceedings of\nthe Language Resources and Evaluation Conference (LREC) (Miyazaki,\nJapan, 2018).\n[96] Habash, N., Eskander, R., and Hawwari, A. A Morphological An-\nalyzer for Egyptian Arabic. In Proceedings of the Workshop of the Special\nInterest Group on Computational Morphology and Phonology (SIGMOR-\nPHON) (Montr´eal, Canada, 2012), pp. 1–9.\n[97] Habash, N., and Hu, J. Improving Arabic-chinese statistical machine\ntranslation using english as pivot language. In Proceedings of the Fourth\nWorkshop on Statistical Machine Translation (2009), pp. 173–181.\n23\n[98] Habash, N., and Rambow, O. Arabic tokenization, part-of-speech tag-\nging and morphological disambiguation in one fell swoop. In Proceedings\nof the Conference of the Association for Computational Linguistics (ACL)\n(Ann Arbor, Michigan, 2005), pp. 573–580.\n[99] Habash, N., and Roth, R. CATiB: The Columbia Arabic Treebank. In\nProceedings of the Joint Conference of the Association for Computational\nLinguistics and the International Joint Conference on Natural Language\nProcessing (ACL-IJCNLP) (Suntec, Singapore, 2009), pp. 221–224.\n[100] Habash, N., and Sadat, F.\nArabic Preprocessing Schemes for Sta-\ntistical Machine Translation.\nIn Proceedings of the Conference of the\nNorth American Chapter of the Association for Computational Linguistics\n(NAACL) (New York City, NY, 2006), pp. 49–52.\n[101] Habash, N., Zalmout, N., Taji, D., Hoang, H., and Alzate, M.\nA parallel corpus for evaluating machine translation between Arabic and\neuropean languages. In Proceedings of the Conference of the European\nChapter of the Association for Computational Linguistics (EACL) (Va-\nlencia, Spain, 2017), p. 235.\n[102] Habash, N. Y. Introduction to Arabic natural language processing, vol. 3.\nMorgan & Claypool Publishers, 2010.\n[103] Hamdy Mubarak, Shimaa Amer, A. A., and Darwish, K. Arabic\ncurriculum analysis. In The 28th International Conference on Computa-\ntional Linguistics (COLING’2020) (2020).\n[104] Hasan, S., El Isbihani, A., and Ney, H. Creating a large-scale Arabic\nto french statistical machinetranslation system. In LREC (2006), pp. 855–\n858.\n[105] Hasanain, M., Barkallah, Y., Suwaileh, R., Kutlu, M., and El-\nsayed, T. Artest: The ﬁrst test collection for arabic web search with\nrelevance rationales. In Proceedings of the 43rd International ACM SI-\nGIR Conference on Research and Development in Information Retrieval\n(2020), pp. 2017–2020.\n[106] Hasanain, M., Elsayed, T., and Magdy, W. Identiﬁcation of answer-\nseeking questions in arabic microblogs. In Proceedings of the 23rd ACM\nInternational Conference on Conference on Information and Knowledge\nManagement (2014), pp. 1839–1842.\n[107] Hasanain, M., Suwaileh, R., Elsayed, T., Kutlu, M., and\nAlmerekhi, H. Evetar: building a large-scale multi-task test collection\nover arabic tweets. Information Retrieval Journal 21, 4 (2018), 307–336.\n[108] Hatem, A., and Nassar, A. Modiﬁed dijstra-like search algorithm for\nenglish to Arabic machine translation system. Proceedings EAMT 2008\n(2008), 12th.\n24\n[109] Hatem, A., and Omar, N.\nSyntactic reordering for Arabic-english\nphrase-based machine translation.\nIn Database theory and application,\nbio-science and bio-technology. Springer, 2010, pp. 198–206.\n[110] Hifny, Y., and Ali, A.\nEﬃcient Arabic emotion recognition using\ndeep neural networks. In ICASSP 2019-2019 IEEE International Confer-\nence on Acoustics, Speech and Signal Processing (ICASSP) (2019), IEEE,\npp. 6710–6714.\n[111] Ibrahim-Sakre, M. M. A Fast and Expert Machine Translation System\nInvolving Arabic Language. PhD thesis, Cranﬁeld Institute of Technology,\nU.K., 1991.\n[112] Inoue, G., Habash, N., Matsumoto, Y., and Aoyama, H. A parallel\ncorpus of Arabic-Japanese news articles. In Proceedings of the Language\nResources and Evaluation Conference (LREC) (Miyazaki, Japan, 2018).\n[113] Jaafar, Y., and Bouzoubaa, K.\nA survey and comparative study\nof Arabic nlp architectures. In Intelligent Natural Language Processing:\nTrends and Applications. Springer, 2018, pp. 585–610.\n[114] Jarrar, M. The Arabic ontology - an Arabic wordnet with ontologically\nclean content. Applied Ontology Journal (forthcoming).\n[115] Jarrar, M., and Amayreh, H. An Arabic-multilingual database with\na lexicographic search engine. In The 24th International Conference on\nApplications of Natural Language to Information Systems (NLDB 2019)\n(June 2019), vol. 11608 of LNCS, Springer, pp. 234–246.\n[116] Jarrar, M., Amayreh, H., and McCrae, J. P. Representing Arabic\nlexicons in lemon - a preliminary study. In The 2nd Conference on Lan-\nguage, Data and Knowledge (LDK 2019) (May 2019), vol. 2402, CEUR,\npp. 29–33.\n[117] Jarrar, M., Habash, N., Alrimawi, F., Akra, D., and Zalmout,\nN. Curras: an annotated corpus for the Palestinian Arabic dialect. Lan-\nguage Resources and Evaluation (2016), 1–31.\n[118] Khalifa, M., and Shaalan, K.\nCharacter convolutions for Arabic\nnamed entity recognition with long short-term memory networks. Comput.\nSpeech Lang. 58 (2019), 335–346.\n[119] Khalifa, S., Habash, N., Abdulrahim, D., and Hassan, S. A Large\nScale Corpus of Gulf Arabic. In Proceedings of the Language Resources\nand Evaluation Conference (LREC) (Portoroˇz, Slovenia, 2016).\n[120] Khalifa, S., Habash, N., Eryani, F., Obeid, O., Abdulrahim, D.,\nand Kaabi, M. A. A morphologically annotated corpus of emirati Ara-\nbic. In Proceedings of the Language Resources and Evaluation Conference\n(LREC) (Miyazaki, Japan, 2018).\n25\n[121] Khalifa, S., Hassan, S., and Habash, N. A Morphological Analyzer\nfor Gulf Arabic Verbs. In Proceedings of the Workshop for Arabic Natural\nLanguage Processing (WANLP) (Valencia, Spain, 2017).\n[122] Khalifa, S., Zalmout, N., and Habash, N. Yamama: Yet another\nmulti-dialect Arabic morphological analyzer.\nIn Proceedings of the In-\nternational Conference on Computational Linguistics (COLING) (Osaka,\nJapan, 2016), pp. 223–227.\n[123] Khalifa, S., Zalmout, N., and Habash, N. Morphological analysis\nand disambiguation for Gulf Arabic: The interplay between resources and\nmethods. In Proceedings of the 12th Language Resources and Evaluation\nConference (Marseille, France, May 2020), European Language Resources\nAssociation, pp. 3895–3904.\n[124] Khalil, T., Halaby, A., Hammad, M. H., and El-Beltagy, S. R.\nWhich conﬁguration works best? An experimental study on Supervised\nArabic Twitter Sentiment Analysis. In Proceedings of the First Confer-\nence on Arabic Computational Liguistics (ACLing 2015), co-located with\nCICLing 2015 (Cairo, Egypt, 2015), pp. 86–93.\n[125] Lan, W., Chen, Y., Xu, W., and Ritter, A. Gigabert: Zero-shot\ntransfer learning from english to Arabic, 2020.\n[126] Liu, L., Shang, J., and Han, J.\nArabic named entity recognition:\nWhat works and what’s next. In Proceedings of the Fourth Arabic Natural\nLanguage Processing Workshop (Florence, Italy, Aug. 2019), Association\nfor Computational Linguistics, pp. 60–67.\n[127] Luqman, H., and Mahmoud, S. A. Automatic translation of Arabic\ntext-to-Arabic sign language. Universal Access in the Information Society\n18, 4 (2019), 939–951.\n[128] Maamouri, M., Bies, A., Buckwalter, T., and Mekki, W. The\nPenn Arabic Treebank: Building a Large-Scale Annotated Arabic Cor-\npus. In Proceedings of the International Conference on Arabic Language\nResources and Tools (Cairo, Egypt, 2004), pp. 102–109.\n[129] Maamouri, M., Bies, A., Kulick, S., Ciul, M., Habash, N., and\nEskander, R. Developing an Egyptian Arabic Treebank: Impact of Di-\nalectal Morphology on Annotation and Tool Development. In Proceedings\nof the Language Resources and Evaluation Conference (LREC) (Reyk-\njavik, Iceland, 2014).\n[130] Maamouri, M., Zaghouani, W., Cavalli-Sforza, V., Graff, D.,\nand Ciul, M. Developing aret: an nlp-based educational tool set for\nArabic reading enhancement. In Proceedings of the Seventh Workshop on\nBuilding Educational Applications Using NLP (2012), pp. 127–135.\n26\n[131] Magdy, W., Darwish, K., and El-Saban, M.\nEﬃcient language-\nindependent retrieval of printed documents without ocr.\nIn Interna-\ntional Symposium on String Processing and Information Retrieval (2009),\nSpringer, pp. 334–343.\n[132] Magdy, W., and Elsayed, T. Unsupervised adaptive microblog ﬁlter-\ning for broad dynamic topics. Information Processing & Management 52,\n4 (2016), 513–528.\n[133] Mahmoud, M. H. A multiagents based intelligent tutoring system for\nteaching Arabic grammar. International Journal of Education and Learn-\ning Systems 3 (2018).\n[134] Mahmoud, M. H., and El-Hamayed, S. H. A. An intelligent tutoring\nsystem for teaching the grammar of the Arabic language.\nJournal of\nElectrical Systems and Information Technology 3, 2 (2016), 282–294.\n[135] Malhas, R., and Elsayed, T. Ayatec: Building a reusable verse-based\ntest collection for arabic question answering on the holy qur’an. ACM\nTransactions on Asian and Low-Resource Language Information Process-\ning (TALLIP) 19, 6 (2020), 1–21.\n[136] Meftouh, K., Harrat, S., Jamoussi, S., Abbas, M., and Smaili,\nK. Machine translation experiments on padic: A parallel Arabic dialect\ncorpus. In Proceedings of the Paciﬁc Asia Conference on Language, In-\nformation and Computation (2015).\n[137] Mikolov, T., Corrado, G., Chen, K., and Dean, J. word2vec-v1.\nProceedings of the International Conference on Learning Representations\n(ICLR 2013) (2013), 1–12.\n[138] Mohammad, S. M., Bravo-Marquez, F., Salameh, M., and Kir-\nitchenko, S. Semeval-2018 Task 1: Aﬀect in tweets. In Proceedings of\nInternational Workshop on Semantic Evaluation (SemEval-2018) (New\nOrleans, LA, USA, 2018).\n[139] Mourad, A., and Darwish, K. Subjectivity and Sentiment Analysis of\nModern Standard Arabic and Arabic Microblogs. Proceedings of the 4th\nWorkshop on Computational Approaches to Subjectivity, Sentiment and\nSocial Media Analysis, 3 (2013), 55–64.\n[140] Mousser, J. A large coverage verb lexicon for Arabic. PhD thesis, Uni-\nversity of Konstanz, Germany, 2013.\n[141] Mubarak, H. Build fast and accurate lemmatization for arabic. In Pro-\nceedings of the Eleventh International Conference on Language Resources\nand Evaluation (LREC 2018) (2018).\n27\n[142] Mubarak, H., Abdelali, A., Hassan, S., and Darwish, K. Spam\ndetection on Arabic twitter. In International Conference on Social Infor-\nmatics (2020), Springer, pp. 237–251.\n[143] Mubarak, H., Abdelali, A., Sajjad, H., Samih, Y., and Darwish,\nK. Highly eﬀective arabic diacritization using sequence to sequence model-\ning. In Proceedings of the 2019 Conference of the North American Chapter\nof the Association for Computational Linguistics: Human Language Tech-\nnologies, Volume 1 (Long and Short Papers) (2019), pp. 2390–2395.\n[144] Mubarak, H., and Darwish, K.\nUsing Twitter to collect a multi-\ndialectal corpus of Arabic. In Proceedings of the Workshop for Arabic\nNatural Language Processing (WANLP) (Doha, Qatar, 2014).\n[145] Mubarak, H., Darwish, K., and Magdy, W. Abusive language de-\ntection on Arabic social media. In Proceedings of the First Workshop on\nAbusive Language Online (2017), pp. 52–56.\n[146] Mubarak, H., Darwish, K., Magdy, W., Elsayed, T., and Al-\nKhalifa, H. Overview of OSACT4 Arabic oﬀensive language detection\nshared task. In Proceedings of the 4th Workshop on Open-Source Arabic\nCorpora and Processing Tools, with a Shared Task on Oﬀensive Language\nDetection (Marseille, France, May 2020), European Language Resource\nAssociation, pp. 48–52.\n[147] Nguyen, T., and Vogel, S.\nContext-based Arabic morphological\nanalysis for machine translation.\nIn CoNLL 2008: Proceedings of the\nTwelfth Conference on Computational Natural Language Learning (2008),\npp. 135–142.\n[148] Nivre, J., Hall, J., and Nilsson, J.\nMaltParser: A data-driven\nparser-generator for dependency parsing.\nIn Proceedings of the Lan-\nguage Resources and Evaluation Conference (LREC) (Genoa, Italy, 2006),\npp. 2216–2219.\n[149] Oard, D. W., and Gey, F. C. The trec 2002 arabic/english clir track.\nIn TREC (2002).\n[150] Obeid, O., Salameh, M., Bouamor, H., and Habash, N. ADIDA:\nAutomatic dialect identiﬁcation for Arabic. In Proceedings of the 2019\nConference of the North American Chapter of the Association for Com-\nputational Linguistics (Demonstrations) (Minneapolis, Minnesota, June\n2019).\n[151] Obeid, O., Zalmout, N., Khalifa, S., Taji, D., Oudah, M., Al-\nhafni, B., Inoue, G., Eryani, F., Erdmann, A., and Habash, N.\nCAMeL tools: An open source python toolkit for Arabic natural language\nprocessing. In Proceedings of the 12th Language Resources and Evaluation\nConference (Marseille, France, May 2020), European Language Resources\nAssociation, pp. 7022–7032.\n28\n[152] Olive, J., Christianson, C., and McCary, J. Handbook of natural\nlanguage processing and machine translation: DARPA global autonomous\nlanguage exploitation. Springer Science & Business Media, Verlag New\nYork, 2011.\n[153] Olive, J., Christianson, C., and McCary, J. Handbook of natural\nlanguage processing and machine translation: DARPA global autonomous\nlanguage exploitation. Springer Science & Business Media, 2011.\n[154] Oudah, M., Almahairi, A., and Habash, N. The impact of prepro-\ncessing on Arabic-English statistical and neural machine translation. In\nProceedings of Machine Translation Summit XVII Volume 1: Research\nTrack (Dublin, Ireland, Aug. 2019), European Association for Machine\nTranslation, pp. 214–221.\n[155] Parker, R., Graff, D., Chen, K., Kong, J., and Maeda, K. Arabic\nGigaword Fifth Edition. LDC catalog number No. LDC2011T11, ISBN\n1-58563-595-2, 2011.\n[156] Pasha, A., Al-Badrashiny, M., Diab, M. T., El Kholy, A., Es-\nkander, R., Habash, N., Pooleery, M., Rambow, O., and Roth,\nR. Madamira: A fast, comprehensive tool for morphological analysis and\ndisambiguation of Arabic. In Lrec (2014), vol. 14, pp. 1094–1101.\n[157] Pennington, J., Socher, R., and Manning, C. D. Glove: Global\nvectors for word representation. In Proceedings of the 2014 conference\non empirical methods in natural language processing (EMNLP) (2014),\npp. 1532–1543.\n[158] Rafalovitch, A., Dale, R., et al. United nations general assembly\nresolutions: A six-language parallel corpus. In Proceedings of the Ma-\nchine Translation Summit (MT Summit) (Ottawa, Canada, 2009), vol. 12,\npp. 292–299.\n[159] Rafea, A., Sabry, M., El-Ansary, R., and Samir, S. Al-mutargem:\na machine translator for middle east news. In Proceedings of the 3rd Inter-\nnational Conference and Exhibition on Multi-lingual Computing (1992).\n[160] Refaee, E., and Rieser, V. Subjectivity and Sentiment Analysis of\nArabic Twitter Feeds with Limited Resources. In Proceedings of the Work-\nshop on Free/Open-Source Arabic Corpora and Corpora Processing Tools\n(Reykjavik, Iceland, 2014), pp. 16–21.\n[161] Romeo, S., Da San Martino, G., Belinkov, Y., Barr´on-Cede˜no,\nA., Eldesouki, M., Darwish, K., Mubarak, H., Glass, J., and\nMoschitti, A. Language processing and learning models for community\nquestion answering in Arabic. Information Processing & Management 56,\n2 (2019), 274–290.\n29\n[162] Rosenthal, S., Farra, N., and Nakov, P.\nSemEval-2017 task 4:\nSentiment analysis in Twitter. In Proceedings of the 11th International\nWorkshop on Semantic Evaluation (Vancouver, Canada, August 2017),\nSemEval ’17, Association for Computational Linguistics.\n[163] Rytting, C. A., Rodrigues, P., Buckwalter, T., Novak, V.,\nBills, A., Silbert, N. H., and Madgavkar, M. ArCADE: An Arabic\ncorpus of auditory dictation errors. In Proceedings of the Ninth Workshop\non Innovative Use of NLP for Building Educational Applications (Balti-\nmore, Maryland, June 2014), Association for Computational Linguistics,\npp. 109–115.\n[164] Sadat, F., Kazemi, F., and Farzindar, A. Automatic Identiﬁcation\nof Arabic Language Varieties and Dialects in Social Media. In Proceedings\nof the Second Workshop on Natural Language Processing for Social Media\n(SocialNLP) (Dublin, Ireland, 2014).\n[165] Saddiki, H., Habash, N., Cavalli-Sforza, V., and Al Khalil, M.\nFeature optimization for predicting readability of Arabic L1 and L2. In\nProceedings of the 5th Workshop on Natural Language Processing Tech-\nniques for Educational Applications (Melbourne, Australia, July 2018),\nAssociation for Computational Linguistics, pp. 20–29.\n[166] Safaya, A., Abdullatif, M., and Yuret, D. Kuisail at semeval-2020\ntask 12: Bert-cnn for oﬀensive speech identiﬁcation in social media, 2020.\n[167] Sajjad, H., Darwish, K., and Belinkov, Y. Translating dialectal\nArabic to English. In Proceedings of the Conference of the Association for\nComputational Linguistics (ACL) (Soﬁa, Bulgaria, 2013), pp. 1–6.\n[168] Sajjad, H., Durrani, N., Guzman, F., Nakov, P., Abdelali, A.,\nVogel, S., Salloum, W., Kholy, A. E., and Habash, N. Egyp-\ntian Arabic to english statistical machine translation system for nist\nopenmt’2015. arXiv preprint arXiv:1606.05759 (2016).\n[169] Salama, A., Bouamor, H., Mohit, B., and Oflazer, K. YouDACC:\nthe Youtube Dialectal Arabic Comment Corpus. In Proceedings of the Lan-\nguage Resources and Evaluation Conference (LREC) (Reykjavik, Iceland,\n2014), pp. 1246–1251.\n[170] Salameh, M., Bouamor, H., and Habash, N.\nFine-grained Ara-\nbic dialect identiﬁcation. In Proceedings of the International Conference\non Computational Linguistics (COLING) (Santa Fe, New Mexico, USA,\n2018), pp. 1332–1344.\n[171] Salameh, M., Mohammad, S., and Kiritchenko, S. Sentiment after\nTranslation: A Case-Study on Arabic Social Media Posts. In Proceedings\nof the 2015 Conference of the North American Chapter of the Association\nfor Computational Linguistics: Human Language Technologies (Denver,\nColorado, 2015), Association for Computational Linguistics, pp. 767–777.\n30\n[172] Salloum, W., Elfardy, H., Alamir-Salloum, L., Habash, N., and\nDiab, M. Sentence Level Dialect Identiﬁcation for Machine Translation\nSystem Selection. In Proceedings of the 52nd Annual Meeting of the Asso-\nciation for Computational Linguistics (Baltimore, Maryland, USA, 2014).\n[173] Salloum, W., and Habash, N. Dialectal to Standard Arabic Para-\nphrasing to Improve Arabic-English Statistical Machine Translation. In\nProceedings of the First Workshop on Algorithms and Resources for Mod-\nelling of Dialects and Language Varieties (Edinburgh, Scotland, 2011),\npp. 10–21.\n[174] Samih, Y., Attia, M., Eldesouki, M., Abdelali, A., Mubarak, H.,\nKallmeyer, L., and Darwish, K. A neural architecture for dialectal\nArabic segmentation. In Proceedings of the Workshop for Arabic Natural\nLanguage Processing (WANLP) (Valencia, Spain, 2017), pp. 46–54.\n[175] Sawaf, H. Arabic dialect handling in hybrid machine translation. In\nProceedings of the Conference of the Association for Machine Translation\nin the Americas (AMTA) (Denver, Colorado, 2010).\n[176] Sghaier, M. A., and Zrigui, M. Tunisian dialect-modern standard\nArabic bilingual lexicon. In 2017 IEEE/ACS 14th International Confer-\nence on Computer Systems and Applications (AICCSA) (2017), IEEE,\npp. 973–979.\n[177] Shaalan, K. A survey of Arabic named entity recognition and classiﬁ-\ncation. Computational Linguistics 40 (2014), 469 – 510.\n[178] Shaalan, K., Bakr, H., and Ziedan, I. Transferring Egyptian col-\nloquial dialect into modern standard Arabic. In Proceedings of the Con-\nference on Recent Advances in Natural Language Processing (RANLP)\n(2007), pp. 525–529.\n[179] Shaalan, K., Rafea, A., Moneim, A. A., and Baraka, H. Machine\ntranslation of english noun phrases into Arabic. International Journal of\nComputer Processing of Oriental Languages 17, 02 (2004), 121–134.\n[180] Shaalan, K., and Talhami, H. Error analysis and handling in Arabic\nicall systems. In Artiﬁcial Intelligence and Applications (2006), Citeseer,\npp. 109–114.\n[181] Shaalan, K. F. An intelligent computer assisted language learning sys-\ntem for Arabic learners. Computer Assisted Language Learning 18, 1-2\n(2005), 81–109.\n[182] Shahin, I., Nassif, A. B., and Hamsa, S. Emotion recognition using\nhybrid gaussian mixture model and deep neural network. IEEE Access 7\n(2019), 26777–26787.\n31\n[183] Shahrour, A., Khalifa, S., Taji, D., and Habash, N. CamelParser:\nA system for Arabic syntactic analysis and morphological disambigua-\ntion. In Proceedings of the International Conference on Computational\nLinguistics (COLING) (2016), pp. 228–232.\n[184] Shawar, A., and Atwell, E. An Arabic chatbot giving answers from\nthe qur’an. In Proceedings of TALN04: XI Conference sur le Traitement\nAutomatique des Langues Naturelles (2004), vol. 2, ATALA, pp. 197–202.\n[185] Shoukry, A., and Rafea, A. A Hybrid Approach for Sentiment Classi-\nﬁcation of Egyptian Dialect Tweets. In First International Conference on\nArabic Computational Linguistics (ACLing) (Cairo, Egypt, 2015), pp. 78–\n85.\n[186] Sma¨ıli, K., Abbas, M., Meftouh, K., and Harrat, S.\nBuilding\nresources for Algerian Arabic dialects.\nIn Proceedings of the Confer-\nence of the International Speech Communication Association (Interspeech)\n(2014).\n[187] Smrˇz, O. ElixirFM — Implementation of Functional Arabic Morphology.\nIn Proceedings of the Workshop on Computational Approaches to Semitic\nLanguages (CASL) (Prague, Czech Republic, 2007), ACL, pp. 1–8.\n[188] Smrˇz, O., ˇSnaidauf, J., and Zem´anek, P. Prague Dependency Tree-\nbank for Arabic: Multi-Level Annotation of Arabic Corpus. In Proceed-\nings of the International Symposium on Processing of Arabic (Manouba,\nTunisia, 2002), pp. 147–155.\n[189] Soliman, A. B., Eissa, K., and El-Beltagy, S. R. AraVec: A set\nof Arabic Word Embedding Models for use in Arabic NLP. In Procedia\nComputer Science (2017).\n[190] Suwaileh, R., Kutlu, M., Fathima, N., Elsayed, T., and Lease,\nM. Arabicweb16: A new crawl for today’s arabic web. In Proceedings of\nthe 39th International ACM SIGIR conference on Research and Develop-\nment in Information Retrieval (2016), pp. 673–676.\n[191] Tachicart, R., Bouzoubaa, K., and Jaafar, H. Building a moroccan\ndialect electronic dictionary (mded). In 5th International Conference on\nArabic Language Processing (2014), pp. 216–221.\n[192] Tahir, G. R., Asghar, S., and Masood, N. Knowledge based ma-\nchine translation. In 2010 International Conference on Information and\nEmerging Technologies (2010), IEEE, pp. 1–5.\n[193] Taji, D., El Gizuli, J., and Habash, N.\nAn Arabic dependency\ntreebank in the travel domain. In Proceedings of the Workshop on Open-\nSource Arabic Corpora and Processing Tools (OSACT) (Miyazaki, Japan,\n2018).\n32\n[194] Taji, D., Habash, N., and Zeman, D.\nUniversal dependencies for\nArabic.\nIn Proceedings of the Workshop for Arabic Natural Language\nProcessing (WANLP) (Valencia, Spain, 2017).\n[195] Taji, D., Khalifa, S., Obeid, O., Eryani, F., and Habash, N. An\nArabic Morphological Analyzer and Generator with Copious Features. In\nProceedings of the Fifteenth Workshop on Computational Research in Pho-\nnetics, Phonology, and Morphology (SIGMORPHON) (2018), pp. 140–\n150.\n[196] Tiedemann, J. Parallel corpora for everyone. Baltic J. Modern Com-\nput.(BJMC) 4, 2 (2016).\n[197] Versteegh, K. Arabic language. Edinburgh University Press, 2014.\n[198] Zaghouani, W. Critical Survey of the Freely Available Arabic Corpora.\nIn Proceedings of the Workshop on Open-Source Arabic Corpora and Pro-\ncessing Tools (OSACT) (2014), pp. 1–8.\n[199] Zaghouani, W., and Charfi, A. ArapTweet: A Large Multi-Dialect\nTwitter Corpus for Gender, Age and Language Variety Identiﬁcation.\nIn Proceedings of the Language Resources and Evaluation Conference\n(LREC) (Miyazaki, Japan, 2018).\n[200] Zaghouani, W., Habash, N., Bouamor, H., Rozovskaya, A., Mo-\nhit, B., Heider, A., and Oflazer, K.\nCorrection annotation for\nnon-native Arabic texts: Guidelines and corpus. In Proceedings of the\nLinguistic Annotation Workshop (LAW) (2015), pp. 129–139.\n[201] Zaghouani, W., Mohit, B., Habash, N., Obeid, O., Tomeh, N.,\nRozovskaya, A., Farra, N., Alkuhlani, S., and Oflazer, K. Large\nScale Arabic Error Annotation: Guidelines and Framework. In Proceedings\nof the Language Resources and Evaluation Conference (LREC) (Reyk-\njavik, Iceland, 2014).\n[202] Zaidan, O., and Callison-Burch, C. Arabic dialect identiﬁcation.\nComputational Linguistics (2013).\n[203] Zaidan, O. F., and Callison-Burch, C.\nThe Arabic online com-\nmentary dataset: an annotated dataset of informal Arabic with high di-\nalectal content. In Proceedings of the 49th Annual Meeting of the Associa-\ntion for Computational Linguistics: Human Language Technologies: short\npapers-Volume 2, Organization = Association for Computational Linguis-\ntics (2011), pp. 37–41.\n[204] Zalmout, N., Erdmann, A., and Habash, N. Noise-robust morpho-\nlogical disambiguation for dialectal Arabic. In Proceedings of the Confer-\nence of the North American Chapter of the Association for Computational\nLinguistics (NAACL) (New Orleans, Louisiana, USA, 2018).\n33\n[205] Zalmout, N., and Habash, N. Don’t throw those morphological ana-\nlyzers away just yet: Neural morphological disambiguation for Arabic. In\nProceedings of the Conference on Empirical Methods in Natural Language\nProcessing (EMNLP) (Copenhagen, Denmark, 2017), pp. 704–713.\n[206] Zalmout, N., and Habash, N. Optimizing Tokenization Choice for Ma-\nchine Translation across Multiple Target Languages. The Prague Bulletin\nof Mathematical Linguistics 108 (2017), 257–270.\n[207] Zampieri, M., Malmasi, S., Nakov, P., Ali, A., Shon, S., Glass,\nJ., Scherrer, Y., Samardˇzi´c, T., Ljubeˇsi´c, N., Tiedemann, J.,\nvan der Lee, C., Grondelaers, S., Oostdijk, N., Speelman, D.,\nvan den Bosch, A., Kumar, R., Lahiri, B., and Jain, M. Language\nidentiﬁcation and morphosyntactic tagging: The second VarDial evalua-\ntion campaign. In Proceedings of the Fifth Workshop on NLP for Similar\nLanguages, Varieties and Dialects (VarDial 2018) (Santa Fe, New Mexico,\nUSA, Aug. 2018), Association for Computational Linguistics, pp. 1–17.\n[208] Zbib, R., Malchiodi, E., Devlin, J., Stallard, D., Matsoukas, S.,\nSchwartz, R., Makhoul, J., Zaidan, O. F., and Callison-Burch,\nC. Machine Translation of Arabic Dialects. In Proceedings of the Confer-\nence of the North American Chapter of the Association for Computational\nLinguistics (NAACL) (Montr´eal, Canada, 2012), pp. 49–59.\n[209] Zeroual, I., and Lakhouaja, A. A new quranic corpus rich in mor-\nphosyntactical information. International Journal of Speech Technology\n19, 2 (2016), 339–346.\n[210] Zerrouki, T., and Balla, A. Tashkeela: Novel corpus of Arabic vocal-\nized texts, data for auto-diacritization systems. Data in brief 11 (2017),\n147.\n[211] Zhang, Y., Li, C., Barzilay, R., and Darwish, K.\nRandomized\ngreedy inference for joint segmentation, pos tagging and dependency pars-\ning. In Proceedings of the 2015 Conference of the North American Chapter\nof the Association for Computational Linguistics: Human Language Tech-\nnologies (2015), pp. 42–52.\n[212] Zhu, M., Zhang, Y., Chen, W., Zhang, M., and Zhu, J.\nFast\nand accurate shift-reduce constituent parsing. In Proceedings of the 51st\nAnnual Meeting of the Association for Computational Linguistics (Volume\n1: Long Papers) (2013), pp. 434–443.\n34\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2020-11-25",
  "updated": "2021-09-27"
}