{
  "id": "http://arxiv.org/abs/2103.09567v1",
  "title": "Endangered Languages are not Low-Resourced!",
  "authors": [
    "Mika Hämäläinen"
  ],
  "abstract": "The term low-resourced has been tossed around in the field of natural\nlanguage processing to a degree that almost any language that is not English\ncan be called \"low-resourced\"; sometimes even just for the sake of making a\nmundane or mediocre paper appear more interesting and insightful. In a field\nwhere English is a synonym for language and low-resourced is a synonym for\nanything not English, calling endangered languages low-resourced is a bit of an\noverstatement. In this paper, I inspect the relation of the endangered with the\nlow-resourced from my own experiences.",
  "text": "Endangered Languages are not Low-Resourced!\nMika Hämäläinen[0000−0001−9315−1278]\nUniversity of Helsinki, Finland\nmika.hamalainen@helsinki.fi\nAbstract. The term low-resourced has been tossed around in the ﬁeld\nof natural language processing to a degree that almost any language that\nis not English can be called \"low-resourced\"; sometimes even just for the\nsake of making a mundane or mediocre paper appear more interesting\nand insightful. In a ﬁeld where English is a synonym for language and\nlow-resourced is a synonym for anything not English, calling endangered\nlanguages low-resourced is a bit of an overstatement. In this paper, I\ninspect the relation of the endangered with the low-resourced from my\nown experiences.\nKeywords: endangered languages · low-resourced languages · NLP ·\ncriticism of science\n1\nIntroduction\nLow-resourced1 or low-resource language is one of those terms that has never\nbeen deﬁned in our ﬁeld, and yet it has been used very often in many publications\nin the past, present and future. As it is a term that is supposed to be implicitly\nunderstood without any actual thresholds for the number of speakers or the\namount of data etc., it is no wonder that people use the term as they please.\nSeveral tasks have been called low-resourced in the NLP research, for lan-\nguages such as: Chinese [40] (1.2 billion speakers), Arabic [9] (422 million speak-\ners), Bengali [24] (228 million speakers), Japanese [41] (126 million speakers),\nVietnamese [16] (76 million speakers), Dutch [22] (24 million speakers), Sinhala\n[15] (17 million speakers) and Finnish [2] (5 million speakers). To make matters\nworse, even endangered languages have been called low-resourced [14,38,20,18].\nThe listing is not exhaustive, but it illustrates the problem how little semantic\nvalue the term low-resourced has, given that any language can be called low-\nresourced.\nAs someone who is native in a relatively small language, Finnish, I have a\nvery diﬀerent perspective to what low-resourced means. Finnish has around 5\nmillion speakers, and since that is around a half of the population of Tokyo\n(9.3 million), our language does seem small. At any case, I would never call\nmy native language low-resourced2. Why is this, you might ask? Calling Finnish\n1 The form preferred by Dr Jack Rueter\n2 Unless I wanted to get a mediocre paper accepted\narXiv:2103.09567v1  [cs.CL]  17 Mar 2021\n2\nM. Hämäläinen\nlow-resourced is denying the fact that we have our own TV shows, movies, music,\ntheater plays, novels and other cultural products in Finnish. And I am not even\ntalking about small numbers here. Besides, Finnish is a language of education,\nthere is no level of schooling you could not complete entirely in Finnish, from pre-\nschool to defending your PhD. Yes, our language is small on a global scale, but\nwe do have a whole bunch of resources we generate every day by communicating\nwith each other!\nNow, one of the main problems I ﬁnd with the term low-resourced, when used\nabout languages that have millions of speakers, is that the resources are always\nout there. It is, perhaps, more often than not a question of learned helplessness\nof a researcher. There are many ways of doing annotation projection or just\ngathering data in a savvy way by crawling the internet. If some NLP resource\ndoes not exist for a language, stop complaining about how low-resourced it is, get\nup and gather the data. Of course, there are always exceptions when gathering\nthe data required for a large language might not be a walk in a park such\nas when dealing with historical data [11]. And it is true that even resources\nfor non-endangered languages can be noisy [19]. However, working with a non-\nendangered language does not have the same degree of problems as endangered\nlanguages might have, as I will describe later in this paper.\nQuite often there are a lot of annotated resources for a majority language that\nare hidden on a hard drive of a researcher or published somewhere where they\ncan be diﬃcult to ﬁnd. This leads to a situation where a language might seem\nlow-resourced initially, but the resources are already out there, pre-annotated.\nThey are just hidden somewhere where Google will not ﬁnd them, or in the\nNordic context, hidden behind a Korp user interface [4] in such a way that the\nresources have no value for NLP.\nThe main purpose of this paper is to wake people working with NLP up. If\nwe want to continue using the term low-resourced, we had better deﬁne it as a\ncommunity. Or much rather come up with a classiﬁcation of how low-resourced\na language is. It is about time we stopped using the term low-resourced as a\nfancy term to boost our papers or as an excuse for not annotating data (and\nreleasing it for others to use).\n2\nEndangered, but How Endangered?\nFor the reasons that should have become evident by now, I feel that calling\nany endangered language low-resourced is an overstatement, as it clearly lifts a\ntruly resource-poor language into the same league with the big players. Before\ncontinuing any further in this section, I would like to point out that much like\nlow-resourced languages, endangered languages are not a homogeneous group.\nThere is a huge variety in the digital resources and socio-political status these\nlanguages and their speakers have. As an example, UNESCO [21] categorizes en-\ndangered languages into 5 categories: vulnerable, deﬁnitely endangered, severely\nendangered, critically endangered and extinct, depending on the level of inter-\ngenerational language transmission.\nEndangered Languages are not Low-Resourced!\n3\nIn this section, I will describe some of my encounters with endangered lan-\nguage communities. I know that my experiences do not reﬂect all endangered\nlanguages, but I feel that it is important to share them to better contextualize\nwhat endangered languages can be. This is something that gets easily forgotten\nwhen doing NLP research as a rich language and culture get very easily reduced\ninto a dataset, machine learning model and results.\nI had an opportunity to visit Ufa, the capital of the Republic of Bashkor-\ntostan, Russia. The local language, known as Bashkir (bak), is rated vulnerable\naccording to UNESCO with its more than 1.6 million speakers. While visiting the\npremises of Bashkir Encyclopedia3 (Башкирская энциклопедия), it became ev-\nident to me that there was no lack of high-quality written knowledge in Bashkir.\nThe number of diﬀerent encyclopedias about diﬀerent topics they showed us\nwas incredible. Not to mention that they were very serious about writing the\nencyclopedias, according to them, they only believed in facts and numbers. The\nencyclopedias were not thus just mere translations of existing ones, but rather\ntheir own independent work of science. I was also told about TV channels broad-\ncasting TV shows in Bashkir, which while interesting, is not that surprising given\nthe number of speakers.\nFU-Lab4 welcomed me for a research visit in the capital of the Komi Repub-\nlic, Russia, Syktyvkar. While there are several Komi languages, our discussions\nwere mainly related to Komi-Zyrian (kpv), a language marked as deﬁnitely en-\ndangered in the classiﬁcation of UNESCO with as few as 217000 native speakers.\nSeeing the work conducted in FU-Lab in action, one can say that Komi-Zyrian\nhas a surprising amount of digital resources. They actively develop constraint\ngrammar based disambiguators and contribute to the morphological FSTs (ﬁnite-\nstate transducers). In addition to that they compile text and audio corpora for\nKomi (see [7,6,5]) and have many dictionaries available in a digital format. An\ninteresting decision by the Komi Republic that could eventually lead into func-\ntional Komi-Russian machine translation is the fact that all Russian law texts\nare translated into Komi. At FU-Lab, they have ensured that the translations\nremain parallel to the original Russian law texts, which should make machine\ntranslation easy in the future.\nOur system Ve′rdd [1] was the reason I got an opportunity to visit the Sami\nCulture Center Sajos5 in Inari, Finland to collaborate with two Skolt Sami dic-\ntionary editors. Skolt Sami (sms) is a severely endangered language with only\n300 native speakers according to UNESCO. Despite the low number of speak-\ners, they had the presentations of the Sami cultural event simultaneously inter-\npreted from Skolt Sami to Finnish and from other Sami languages to Skolt Sami\nby professional interprets. Thanks to Rueter’s continuous eﬀorts for the digital\nrevitalization of the language, Skolt Sami has an extensive digital multilingual\ndictionary [30] and FST morphology [27]. The situtaion of Skolt Sami is fortu-\nnate in the sense that it is one of many Sami languages. The Sami Parliament\n3 http://www.bashenc.ru/\n4 https://fu-lab.ru/\n5 http://www.sajos.ﬁ/\n4\nM. Hämäläinen\nhas established Sámi Giellagáldu to do work on language norms and terminology\nfor various Sami languages including Skolt Sami.\nAs a summary, it is important to understand that the term endangered lan-\nguage is complicated as well in terms of the linguistic resources available for NLP\ntasks. Some endagered languages may have a surprising amount of resources for\nsome speciﬁc NLP tasks, while others may not have digital resources at all. For\nmore anecdotes, I strongly recommend reading Rueter’s personal experiences of\neveryday situations in Erzya [26].\n3\nThe Underappreciated Problem of Being Endangered\nThere have been several papers trying to tackle low-resourced tasks either by\nsimulating a resource-poor scenario in a high-resourced language or by having\nlimited resources for a high-resourced language [8,39,13]. It is important to re-\nmember that while these eﬀorts are of value in many domains, they might not\nbe directly applicable as such for endangered languages.\nThe issues you might face with an endangered language start from the very\nlow-level: character encoding. I am not referring to any custom or local encod-\ning, but to Unicode, the encoding we know and love. Unicode is not at all as\nuncomplicated when we are dealing with smaller languages. One of the problems\nis that Unicode has multiple ways of encoding one character and that there are\nsimilar looking, but not quite the same characters.\nFig. 1. A typical situation with Skolt Sami data.\nFigure 1 illustrates the aforementioned problem. The word kuälmadlåkka\nseems to be written similarly in word1 and word2. However, they are not iden-\ntical, as seen when they are split into characters. This type of an issue is not as\ncommon in high-resourced languages and it might go unnoticed for the unwary\nresearcher. These issues are present with some endangered languages because of\na multitude of reasons such as a simple lack of a suitable keyboard layout, lack of\na standardized orthography or a change in orthography. Although, for practical\nEndangered Languages are not Low-Resourced!\n5\nreasons, you might see people writing words in a non-standard way even in larger\nlanguages such as writing paral.lel instead of paral·lel in Catalan or ca instead\nof ça in French, however the reason for these non-standard ways of writing are\ndiﬀerent than in the Skolt Sami example. At any rate, misspellings are common\nin texts written in an endangered language as well, as reported for North Sami\n[3].\nFig. 2. Latinitsa letters missing from Unicode\nSometimes not all important characters are in Unicode as seen in Figure 2.\nSuch is the case with the writing system of Komi-Zyrian that was in place before\nthe Cyrillics, латиница (latinitsa). There has been a long-running eﬀort [34] in\ngetting the missing characters into the Unicode standard, but so far this eﬀort\nhas been futile. This means that there is no consistent way of encoding historical\nKomi texts written in this script.\nWhen we write anything in a big language, it is usually clear what is right\nand wrong. An extensive part of any educational system goes into teaching\npeople to write in a normative way. Much of this normative writing is something\nwe who are native in a non-endangered language just learn by being exposed\nto normative language in various places such as books and news. Norms are\nusually established and maintained by a language institute. In Finland, this\npractice is called kielenhuolto (language maintenance), a metaphor that makes\nany non-normative language sound broken like any machine that is in need for\nmaintenance. Even though the \"correct\" way of using a language is internalized\nto diﬀerent levels by diﬀerent people, this practice will be reﬂected in any data\nproduced in a high-resourced language.\nThe tradition of seeking for a correct language is called prescriptive linguis-\ntics, where the focus is on how a language should be. Sometimes this prescriptive\nideology is absent or the prescriptive rules are not internalized by the people na-\ntive in an endangered language due to various reasons such as a limited access\nto education in one’s own language. This leads to a situation where we cannot\nexpect endangered language data to be \"correct\" in the prescriptive sense, but it\nmight be more reﬂective of how people actually use the language. This still does\nnot mean that the data would be consistently deviant of some norm. Just as\nwith bigger languages, endangered languages, even as small as Skolt Sami have\ndiﬀerent dialects [31].\n6\nM. Hämäläinen\nWith the recent edition of the Skolt Sami dictionary [17] there was some dis-\ncussion about certain words such as why Amerikk (America) and ankerias (eel)\nwere used instead of older words Ä′mmrikk and aŋŋerias. Questions like these\nare related to whether a language should be documented as it should be or as it\nis. A highly prescriptive dataset in an endangered language might thus mean no\napplicability to real world data as people using the language might not be aware\nof the norms. In the case of Skolt Sami, I would be surprised if all speakers were\naware of the rules, as Sámi Giellagáldu publishes their latest recommendations\nin their blog, making such recommendations diﬃcult to consult.\nEndangered language data is also more prone to containing mistakes beyond\nencoding and lack of norms. In my work, I have noticed several mistakes in\ndiﬀerent resources such as XML dictionaries [14]. I would not point ﬁngers and\ncall anyone’s work bad, as mistakes do happen, especially when there are several\npeople working on the resources during diﬀerent times. The reason why I believe\nthat there are more mistakes in endangered language resources is the simple\nfact that there are fewer people inspecting them and pointing out errors. It is\nvery common to become blind to one’s own work, and spotting mistakes requires\nexternal inspection.\n4\nDo Only Rules Rule?\nOne of the things that divide people in NLP is rules versus neural networks. Why\nwould you write rules for an endangered language if neural networks work for a\nlow-resourced Hindi? As we have seen in this paper, the problems endangered\nlanguages have are not the same as just about any \"low-resourced\" language\nwould have. But at the same time I am facing the ideology that only rules can\nbe used to model endangered languages. I, myself, don’t believe that either rules\nor neural networks are the answer. The optimal solution is probably somewhere\nin the middle ground.\nRule-based methods are continuously developed for various endangered and\nextinct languages [37,23,36]. Sometimes, due to the lack of resources, rules are\nthe only viable way of dealing with these languages. I believe that here rules\nserve for a more important role than mere engineering of an NLP system. Many\nendangered languages are under-documented, and machine readable rules serve\nfor language documentation purposes as well. They need to capture something\nmeaningful about the language being described in order for them to work to\nbegin with. From this perspective, I think that rule-based systems are not only\nvaluable from the point of view of NLP but also from the point of view of\nlinguistic research. Only machine readable rules let you test out your linguistic\nhypotheses extensively.\nRules are good in the sense that they can be ﬁxed easily, and it is possible\nto reach to a high accuracy with them. This is useful when building systems like\nspell checkers and language learning tools, as the correctness of these tools is of\nutmost importance. However, rules can only go so far. An FST, no matter how\nextensive, is never going to contain all the words in its vocabulary, for example.\nEndangered Languages are not Low-Resourced!\n7\nFor this reason, neural networks are useful, as they can produce output even for\nnew input that was not present in the training data. However, usually accuracy\nis important in the context of endangered languages as many of the NLP tools\nare built for practical purposes and for the beneﬁt of the language community.\nRules can get things right, but their limits can be reached easily. Neural\nnetworks can go beyond a predeﬁned set of rules, but they are more prone to\nproducing incorrect results as well. I think that the two diﬀerent approaches\nshould be used together. Rules can be used to generate training data for neural\nnetworks, something I call fake it till you make it approach, or they can be used\nto ﬁlter out low-quality samples from a training dataset. This way, rules can be\nused in the training process. Because rules can be easily ﬁxed, I would pipeline\nrules with neural networks. Whatever rules cannot cover, a neural network can\nhandle, and if the system produces wrong output, the rule-based method can\nalways be ﬁxed.\nI think that synthetic data generation is still an under-studied way of building\nNLP tools for endangered languages. FSTs are a good way of achieving this as\nthey can be used both for generation and analysis. We have reached to rather\ngood results for some languages with FST generated data and you can expect to\nsee neural models integrated with UralicNLP [12]6 as a backup for failing FSTs\nin the near future.\n5\nConclusions\nThe term low-resourced is truly a complicated one and it makes NLP research\nconducted for endangered languages diﬃcult to get published in the bigger ACL\nvenues. Work with endangered languages is not as state-of-the-art driven as it is\nusually to be expected from NLP papers in bigger venues. Instead such a work is\nmore practical, typically involving producing tools and resources for the beneﬁt\nof the language community.\nAny work with endangered languages includes ethical considerations. I have\nalways been puzzled by the fact that in the world of NLP research not releasing\none’s code, data and models is considered acceptable practice. With endangered\nlanguages not releasing the resources produced is even more severe as such a\nbehavior may be interpreted more as a cultural and linguistic appropriation of\na vulnerable group of people purely for the sake of academic merit.\nEndangered languages pose very diﬀerent types of challenges for NLP re-\nsearch and they have very diﬀerent amounts and types of resources available.\nSome languages have quite advanced NLP tools in place thanks to altruistic\nresearch endeavors and active community members, while others do not have\nanything. As there is such a huge variation within the group of endangered lan-\nguages, grouping them together with anything \"low-resourced\" from Chinese to\nFinnish7 is very misleading.\n6 https://github.com/mikahama/uralicNLP\n7 I still don’t think Finnish is low-resourced\n8\nM. Hämäläinen\nI have shared my personal experiences working with NLP for endangered\nlanguages and working with people who are native in some of them. A lot has\nbeen left unsaid, and I do know that there are a whole lot of languages out\nthere that are dealing with very diﬀerent issues than what I have described in\nthis paper (c.f. [10]). The main purpose of my descriptions has been to show\npeople what type of problems one can encounter when conducing this type of\na research. I am honored for having had this possibility of seeing NLP beyond\nlarge languages.\nAcknowledgments\nI would like to thank Jack Rueter, who was kind enough to supervise my PhD\nthesis even though it ended up being unrelated to Jack’s research interests.\nWithout him, I would have never been exposed to endangered languages nor\nwould have I ever had the chance of traveling to the places where such languages\nare spoken. Also, without his fantastic resources like FSTs [28,25], dictionaries\n[29], corpora [32] and Universal Dependencies treebanks [35,33] NLP would be\na distant dream for many endangered Uralic languages.\nReferences\n1. Alnajjar, K., Hämäläinen, M., Rueter, J., Partanen, N.: Ve’rdd. narrowing the\ngap between paper dictionaries, low-resource nlp and community involvement. In:\nProceedings of the 28th International Conference on Computational Linguistics:\nSystem Demonstrations. pp. 1–6 (2020)\n2. Alnajjar, K., Leppänen, L., Toivonen, H.: No time like the present: methods for\ngenerating colourful and factual multilingual news headlines. In: Proceedings of\nthe 10th International Conference on Computational Creativity. Association for\nComputational Creativity (2019)\n3. Antonsen,\nL.:\nCállinmeattáhusaid\nguorran.[english\nsummary:\nTracking\nmis-\nspellings.]. University of Tromsø (2013)\n4. Borin, L., Forsberg, M., Roxendal, J.: Korp-the corpus infrastructure of spräk-\nbanken. In: LREC. pp. 474–478 (2012)\n5. Федина, МС: Создание официально-делового подкорпуса национального кор-\nпуса коми языка. In: УПРАВЛЕНИЕ СОЦИАЛЬНО-ЭКОНОМИЧЕСКИМ\nРАЗВИТИЕМ\nСУБЪЕКТА\nРОССИЙСКОЙ\nФЕДЕРАЦИИ,\npp.\n205–216\n(2015)\n6. Федина, МС and Левченко, ДА: Из опыта создания коми медиатеки. In: ЭЛЕК-\nТРОННАЯ ПИСЬМЕННОСТЬ НАРОДОВ РОССИЙСКОЙ ФЕДЕРАЦИИ:\nОПЫТ, ПРОБЛЕМЫ И ПЕРСПЕКТИВЫ. pp. 220–227 (2017)\n7. Федина, Марина Серафимовна: Корпус Коми Языка Как База Для Научных\nИсследований. In: II Международная научная конференция «Электронная\nписьменность народов Российской Федерации: опыт, проблемы и перспекти-\nвы» проводится в рамках реализации Государственной программы «Сохране-\nние и развитие государственных языков Республики Башкортостан и языков\nнародов Республики Башкортостан» на 2019–2024 гг. Ответственный редак-\nтор: Ахмадеева АУ. p. 45 (2019)\nEndangered Languages are not Low-Resourced!\n9\n8. Gu, J., Hassan, H., Devlin, J., Li, V.O.: Universal neural machine translation for\nextremely low resource languages. In: Proceedings of the 2018 Conference of the\nNorth American Chapter of the Association for Computational Linguistics: Human\nLanguage Technologies, Volume 1 (Long Papers). pp. 344–354 (2018)\n9. Halabi, D., Awajan, A., Fayyoumi, E.: Arabic lfg-inspired dependency treebank.\nIn: 2017 International Conference on New Trends in Computing Sciences (ICTCS).\npp. 207–215. IEEE (2017)\n10. Hammarström, H.: The status of the least documented language families in the\nworld. Language Documentation & Conservation 4, 177–212 (2010)\n11. Hill,\nM.J.,\nHengchen,\nS.:\nQuantifying\nthe\nimpact\nof\ndirty\nOCR\non\nhis-\ntorical\ntext\nanalysis:\nEighteenth\nCentury\nCollections\nOnline\nas\na\ncase\nstudy.\nDigital\nScholarship\nin\nthe\nHumanities\n34(4),\n825–843\n(04\n2019).\nhttps://doi.org/10.1093/llc/fqz024, https://doi.org/10.1093/llc/fqz024\n12. Hämäläinen, M.: UralicNLP: An NLP library for Uralic languages. Journal of Open\nSource Software 4(37), 1345 (2019). https://doi.org/10.21105/joss.01345\n13. Hämäläinen, M., Alnajjar, K.: A template based approach for training nmt\nfor low-resource uralic languages - a pilot with ﬁnnish. In: ACAI 2019: Pro-\nceedings of the 2019 2nd International Conference on Algorithms, Comput-\ning and Artiﬁcial Intelligence. pp. 520–525. ACM, United States (Dec 2019).\nhttps://doi.org/10.1145/3377713.3377801\n14. Hämäläinen, M., Tarvainen, L., Rueter, J.: Combining concepts and their trans-\nlations from structured dictionaries of uralic minority languages. In: Proceedings\nof the Eleventh International Conference on Language Resources and Evaluation\n(LREC 2018). pp. 862–867 (2018)\n15. Karunanayake, Y., Thayasivam, U., Ranathunga, S.: Transfer learning based free-\nform speech command classiﬁcation for low-resource languages. In: Proceedings\nof the 57th Annual Meeting of the Association for Computational Linguistics:\nStudent Research Workshop. pp. 288–294. Association for Computational Lin-\nguistics, Florence, Italy (Jul 2019). https://doi.org/10.18653/v1/P19-2040, https:\n//www.aclweb.org/anthology/P19-2040\n16. Kruengkrai, C., Nguyen, T.H., Aljunied, S.M., Bing, L.: Improving low-resource\nnamed entity recognition using joint sentence and token labeling. In: Pro-\nceedings of the 58th Annual Meeting of the Association for Computational\nLinguistics. pp. 5898–5905. Association for Computational Linguistics, Online\n(Jul 2020). https://doi.org/10.18653/v1/2020.acl-main.523, https://www.aclweb.\norg/anthology/2020.acl-main.523\n17. Lehtinen,\nM.,\nKoponen,\nE.,\nFofonoﬀ,\nM.,\nLehtola,\nR.,\nRueter,\nJ.\n(eds.):\nSuomi–koltansaame-sanakirja Lää′dd-sää′m-sää′nnˇkee′rjj. Saamelaiskäräjät (2021)\n18. Lim, K., Partanen, N., Poibeau, T.: Multilingual dependency parsing for low-\nresource languages: Case studies on north saami and komi-zyrian. In: Language\nResource and Evaluation Conference (2018)\n19. Mäkelä, E., Lagus, K., Lahti, L., Säily, T., Tolonen, M., Hämäläinen, M.,\nKaislaniemi, S., Nevalainen, T.: Wrangling with non-standard data. In: Proceed-\nings of the Digital Humanities in the Nordic Countries 5th Conference. pp. 81–96\n(2020)\n20. Moeller, S., Kazeminejad, G., Cowell, A., Hulden, M.: Improving low-resource mor-\nphological learning with intermediate forms from ﬁnite state transducers. In: Pro-\nceedings of the 3rd Workshop on the Use of Computational Methods in the Study\nof Endangered Languages Volume 1 (Papers). pp. 81–86. Association for Compu-\ntational Linguistics, Honolulu (Feb 2019), https://www.aclweb.org/anthology/\nW19-6011\n10\nM. Hämäläinen\n21. Moseley, C. (ed.): Atlas of the World′s Languages in Danger. UNESCO Publishing,\n3rd edn. (2010), online version: http://www.unesco.org/languages-atlas/\n22. Perl, T., Chaudhury, S., Giryes, R.: Low resource sequence tagging using sen-\ntence reconstruction. In: Proceedings of the 58th Annual Meeting of the As-\nsociation for Computational Linguistics. pp. 2692–2698. Association for Com-\nputational Linguistics, Online (Jul 2020). https://doi.org/10.18653/v1/2020.acl-\nmain.239, https://www.aclweb.org/anthology/2020.acl-main.239\n23. Pirinen, T.A.: Building minority dependency treebanks, dictionaries and compu-\ntational grammars at the same time—an experiment in karelian treebanking. In:\nProceedings of the Third Workshop on Universal Dependencies (UDW, SyntaxFest\n2019). pp. 132–136 (2019)\n24. Rezaul Karim, M., Kanti Dey, S., Raja Chakravarthi, B.: Deephateexplainer: Ex-\nplainable hate speech detection in under-resourced bengali language. arXiv e-prints\npp. arXiv–2012 (2020)\n25. Rueter, J.: Хельсинкиса университетын кыв туялысь Ижкарын перымса кы-\nвъяс симпозиум вылын лыддь¨омтор. Permistika pp. 154–158 (2000)\n26. Rueter, J.: The erzya language. where is it spoken? Études ﬁnno-ougriennes (45)\n(2013)\n27. Rueter, J., Hämäläinen, M.: Fst morphology for the endangered skolt sami lan-\nguage. In: Proceedings of the 1st Joint Workshop on Spoken Language Technolo-\ngies for Under-resourced languages (SLTU) and Collaboration and Computing for\nUnder-Resourced Languages (CCURL). pp. 250–257 (2020)\n28. Rueter, J., Hämäläinen, M., Partanen, N.: Open-source morphology for endan-\ngered mordvinic languages. In: Proceedings of Second Workshop for NLP Open\nSource Software (NLP-OSS). pp. 94–100. Association for Computational Lin-\nguistics, Online (Nov 2020). https://doi.org/10.18653/v1/2020.nlposs-1.13, https:\n//www.aclweb.org/anthology/2020.nlposs-1.13\n29. Rueter, J., Hämäläinen, M., et al.: On xml-mediawiki resources, endangered lan-\nguages and tei compatibility, multilingual dictionaries for endangered languages.\nIn: AsiaLex 2019 Proceedings of the 13th Conference of the Asian Association for\nLexicography. Asos Publisher (2019)\n30. Rueter, J., Hämäläinen, M.: Synchronized mediawiki based analyzer dictionary\ndevelopment. In: Proceedings of the Third Workshop on Computational Linguistics\nfor Uralic Languages. pp. 1–7 (2017)\n31. Rueter, J., Hämäläinen, M.: Skolt Sami, the makings of a pluricentric language,\nwhere does it stand?, pp. 201–208. No. 21 in Österreichisches Deutsch – Sprache\nder Gegenwart, Peter Lang (2020)\n32. Rueter, J., Partanen, N.: On new text corpora for minority languages on the\nhelsinki korp.csc.ﬁserver. In: Электронная письменность народов Российской\nФедерации: опыт, проблемы и перспективы. p. 32–36 (2019)\n33. Rueter, J., Partanen, N., Ponomareva, L.: On the questions in developing com-\nputational infrastructure for Komi-permyak. In: Proceedings of the Sixth Inter-\nnational Workshop on Computational Linguistics of Uralic Languages. pp. 15–\n25. Association for Computational Linguistics, Wien, Austria (10–11 Jan 2020),\nhttps://www.aclweb.org/anthology/2020.iwclul-1.3\n34. Rueter, J., Ponomareva, L.: Komi latin letters, degrees of unicode facilitation. In:\nProceedings of the Language Technologies for All (LT4All) (2019)\n35. Rueter, J., Tyers, F.: Towards an open-source universal-dependency treebank\nfor Erzya. In: Proceedings of the Fourth International Workshop on Computa-\ntional Linguistics of Uralic Languages. pp. 106–118. Association for Computational\nEndangered Languages are not Low-Resourced!\n11\nLinguistics, Helsinki, Finland (Jan 2018). https://doi.org/10.18653/v1/W18-0210,\nhttps://www.aclweb.org/anthology/W18-0210\n36. Sahala, A., Silfverberg, M., Arppe, A., Lindén, K.: BabyFST - towards a ﬁnite-state\nbased computational model of ancient babylonian. In: Proceedings of the 12th Lan-\nguage Resources and Evaluation Conference. pp. 3886–3894. European Language\nResources Association, Marseille, France (May 2020), https://www.aclweb.org/\nanthology/2020.lrec-1.479\n37. Schmirler, K., Arppe, A.: Modelling plains cree negation with constraint gram-\nmar. In: Proceedings of the NoDaLiDa 2019 Workshop on Constraint Grammar-\nMethods, Tools and Applications, 30 September 2019, Turku, Finland. pp. 27–34.\nNo. 168, Linköping University Electronic Press (2019)\n38. Soisalon-Soininen, E., Granroth-Wilding, M.: Cross-family similarity learning for\ncognate identiﬁcation in low-resource languages. In: Proceedings of the Interna-\ntional Conference on Recent Advances in Natural Language Processing (RANLP\n2019). pp. 1121–1130. INCOMA Ltd., Varna, Bulgaria (Sep 2019), https://www.\naclweb.org/anthology/R19-1129\n39. Tiedemann, J.: The tatoeba translation challenge–realistic data sets for low re-\nsource and multilingual mt. In: Proceedings of the Fifth Conference on Machine\nTranslation. pp. 1174–1182 (2020)\n40. Xu, J., Ma, S., Zhang, Y., Wei, B., Cai, X., Sun, X.: Transfer deep learning for\nlow-resource chinese word segmentation with a novel neural network. In: National\nCCF Conference on Natural Language Processing and Chinese Computing. pp.\n721–730. Springer (2017)\n41. Yu, C., Han, J., Zhang, H., Ng, W.: Hypernymy detection for low-resource lan-\nguages via meta learning. In: Proceedings of the 58th Annual Meeting of the\nAssociation for Computational Linguistics. pp. 3651–3656. Association for Com-\nputational Linguistics, Online (Jul 2020). https://doi.org/10.18653/v1/2020.acl-\nmain.336, https://www.aclweb.org/anthology/2020.acl-main.336\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2021-03-17",
  "updated": "2021-03-17"
}