{
  "id": "http://arxiv.org/abs/2202.09064v2",
  "title": "Can Interpretable Reinforcement Learning Manage Prosperity Your Way?",
  "authors": [
    "Charl Maree",
    "Christian Omlin"
  ],
  "abstract": "Personalisation of products and services is fast becoming the driver of\nsuccess in banking and commerce. Machine learning holds the promise of gaining\na deeper understanding of and tailoring to customers' needs and preferences.\nWhereas traditional solutions to financial decision problems frequently rely on\nmodel assumptions, reinforcement learning is able to exploit large amounts of\ndata to improve customer modelling and decision-making in complex financial\nenvironments with fewer assumptions. Model explainability and interpretability\npresent challenges from a regulatory perspective which demands transparency for\nacceptance; they also offer the opportunity for improved insight into and\nunderstanding of customers. Post-hoc approaches are typically used for\nexplaining pretrained reinforcement learning models. Based on our previous\nmodeling of customer spending behaviour, we adapt our recent reinforcement\nlearning algorithm that intrinsically characterizes desirable behaviours and we\ntransition to the problem of asset management. We train inherently\ninterpretable reinforcement learning agents to give investment advice that is\naligned with prototype financial personality traits which are combined to make\na final recommendation. We observe that the trained agents' advice adheres to\ntheir intended characteristics, they learn the value of compound growth, and,\nwithout any explicit reference, the notion of risk as well as improved policy\nconvergence.",
  "text": "arXiv:2202.09064v2  [cs.LG]  29 Jun 2022\nCAN INTERPRETABLE REINFORCEMENT LEARNING\nMANAGE PROSPERITY YOUR WAY?\nCharl Maree∗and Christian Omlin\nCenter for Artiﬁcial Intelligence Research\nUniversity of Agder\nGrimstad, Norway\n{charl.maree,christian.omlin}@uia.no\nABSTRACT\nPersonalisation of products and services is fast becoming the driver of success in banking\nand commerce. Machine learning holds the promise of gaining a deeper understanding\nof and tailoring to customers’ needs and preferences. Whereas traditional solutions to ﬁ-\nnancial decision problems frequently rely on model assumptions, reinforcement learning\nis able to exploit large amounts of data to improve customer modelling and decision-\nmaking in complex ﬁnancial environments with fewer assumptions. Model explainabil-\nity and interpretability present challenges from a regulatory perspective which demands\ntransparency for acceptance; they also offer the opportunity for improved insight into\nand understanding of customers. Post-hoc approaches are typically used for explaining\npretrained reinforcement learning models. Based on our previous modeling of customer\nspending behaviour, we adapt our recent reinforcement learning algorithm that intrinsi-\ncally characterizes desirable behaviours and we transition to the problem of asset manage-\nment. We train inherently interpretable reinforcement learning agents to give investment\nadvice that is aligned with prototype ﬁnancial personality traits which are combined to\nmake a ﬁnal recommendation. We observe that the trained agents’ advice adheres to\ntheir intended characteristics, they learn the value of compound growth, and, without any\nexplicit reference, the notion of risk as well as improved policy convergence.\nKeywords AI in banking; personalized services; asset management; explainable AI; reinforcement\nlearning; policy regularisation\n1\nIntroduction\nFinancial service providers are employing ever-advancing methods to improve the level of personalisa-\ntion of their services [1, 2]. Artiﬁcial intelligence (AI) is a promising tool in this pursuit in areas such\nas anti-money laundering, trading and investment, and customer relationship management [3]. Examples\nof personalised services are recommender systems for product sales [4], risk evaluation for credit scoring\n[5], and segmentation for customer-centric marketing [6]. More commonly, AI has been applied to stock\ntrading via ensemble learning [7], currency recognition using deep learning [8], stock index performance\nthrough time-series modelling with feature engineering [9], and investment portfolio management using re-\ninforcement learning (RL) [10, 11]. These applications generally lack the personalisation needed to enhance\ncustomer relations and support service delivery for growing customer bases. The lack of explainability and\ninterpretability has thus far hindered the wider adoption of machine learning, mainly due to model opacity;\nmodel understanding is essential in ﬁnancial services [12, 13, 14]. We distinguish between explainabil-\n∗Second afﬁliation: Chief Technology Ofﬁce, Sparebank 1 SR-Bank, Stavanger, Norway.\nity and interpretability: explainability refers to a symbolic representation of the knowledge a model has\nlearned, while interpretability is necessary for reasoning about a model’s predictions.\nWe have previously investigated the interpretability of systems of multiple RL agents [15]. A regularisation\nterm in the objective function imposed a desired agent behaviour during training. For our current purpose of\nasset management, our agents learn distinct optimal policies for continuously distributing a ﬁxed monthly\namount across ﬁve assets: a savings account, property, stocks, luxury items, and mortgage repayments. It is\nour intention to align the agents’ characteristics and behaviour with personality traits - openness, conscien-\ntiousness, extraversion, agreeableness, and neuroticism - as proposed for modelling spending behaviour in\n[16]. A linear combination of the resulting policies can provide investment advice that matches each cus-\ntomer’s unique personality proﬁle. This intrinsic interpretability may fulﬁll the promise of a digital private\nassistant for personal wealth management.\n2\nRelated Work\nRecent evidence has revealed a causal relationship between spending patterns and individual happiness\n[17]: we are happiest when our spending matches our personality. For instance, extraverted individuals\ntypically prefer spending at a bar rather than at a bookshop, while the opposite may apply to introverts. Our\npremise is that spending personality traits can be carried over to asset management: we are happiest when\nour investment matches our personality. For instance, conscientious investors may prefer the predictability\nof property over the volatility of stocks. This is consistent with the high afﬁnity of conscientious spenders\ntowards residential mortgages [17]. It is compelling to expand the notion of personality traits from spending\nto wealth creation, i.e., to base personal investment advice on historical spending behaviour [18, 19].\nRL has been extensively applied to stock portfolio management [20, 21, 22, 23, 24, 25], but not yet to\nholistic asset management; the lack of model transparency may be a contributing factor. Interpretation of\nRL agents typically follows model training [26, 27, 28]; our ambition is to impose a desired characteristic\nbehaviour during training, thus making it an intrinsic property of the agent. Based on a prior that deﬁnes a\ndesired behaviour, we extend the deep deterministic policy gradient (DDPG [29]) objective function with a\nregularisation term [15]. Formally, for each agent i, this objective function is given by:\nJ(θi) = Eoi,ai∼D [Ri(oi, ai)] −λLi\n(1)\nLi =\n1\nMi\nMi\nX\nj=0\nh\nEa∼πθi (aj) −(aj|π0i(a))\ni2\nwhere θi is a set of parameters governing the policy, D is the replay buffer, Ri(oi, ai) is the reward for\naction ai with the partial sate observation oi, λ ∈R≥0 is a scaling parameter, Mi is the number of actions,\nand π0i is the prior that deﬁnes the desired behaviour of the agent. Note that the prior is independent\nof the state, which simpliﬁes it and thus makes it interpretable; this is a departure from traditional policy\nregularisation methods such as KL-regularisation and entropy regularisation which aim to improve learning\nconvergence instead [30, 31]. Traditional regularisation encourages state space exploration by increasing\nthe entropy of the policy, whereas our method guides agents’ learning towards the prior and thus imposes a\ndesired characteristic behaviour.\n3\nEmpirical Methodology\nThe aim of this work was to create an interpretable AI for personal investment management. We selected\nﬁve assets in which a customer could invest a monthly amount over a duration of 30 years: a savings\naccount, property, a portfolio of stocks, luxury expenditures, and additional mortgage payments. We include\nluxury expenditure to the portfolio under the premise that it may increase customer satisfaction in their\nportfolios [17]. We deﬁne luxury items as any expenditure that may appeal to a person’s personality proﬁle;\npeople scoring high on openness might derive joy from spending money on travelling, people scoring high\non extraversion may prefer to spend money on festivities with other people [17], while other luxury items\nsuch as cars or artwork are also possible. We modelled the growth rates of assets according to historical\nindex data, which we describe below.\n2\n3.1\nModelling Assumptions\nWe continuously distribute funds into assets based on the indices of the S&P 500 [32], Norwegian property\n[33], and the Norwegian interest rate [34]. In addition, we invest in mortgages and luxury items. We show\nthis data for a 30-year period in Figure 1.\n1992-01\n2002-01\n2012-01\n2021-12\n2\n4\n6\n8\n10\n12\nIndex value\nSP500 index\nProperty index\nInterest index\nFigure 1: Three asset value indices for a period of 30 years: The S&P 500 stock index, the Norwegian\nproperty index, and the Norwegian interest rate index. All indices are relative to their respective values on\n1 January 1992. While the stock index performs the best overall, it has the highest volatility and therefore\nthe highest risk. Conversely, the interest rate index has the lowest risk but also the lowest growth.\nWe make a number of assumptions which limit the scope of the portfolio and simplify investment choices\nto make the characterization of agent behaviour and interpretation of investment strategies tractable.\nAssumption 1. Asset growth rates can be modelled by their respective asset indices, i.e., a stock port-\nfolio may be modeled by a major stock index - e.g., the S&P 500 -, and an investment in property by its\ncorresponding index.\nThe outright investment in indices such as S&P 500 is very common; it will return the growth rates accord-\ning to these indices. This is a conservative assumption as stock portfolio optimization frequently outper-\nforms indices, which may serve as a performance measure of the investment strategy [25].\nTo give personalised advice, we depart from the premise that there is a mere correlation between spending\nbehaviour and happiness. We are expanding the notion of the causal relationship of spending patterns\nand customer satisfaction to chart an investment strategy and provide advice that is aligned with customer\npersonality [17]. We rated assets in terms of their risk and expected return from the historical values of\nthe indices, and their liquidity, capital requirements, and novelty from domain experts. They also scored\nthe different personality types’ afﬁnity for different assets from the interval [−1, +1]. Individuals with\na high degree of openness may prefer the liquidity of stocks over mortgage payments, whereas neurotic\nindividuals may prefer savings accounts over stocks in their portfolio. These coefﬁcients, shown in Table 1,\nare the weighted sums of the asset ratings and afﬁnities.\nTable 1: Coefﬁcients relating asset risk, expected return, liquidity, capital requirement, and novelty to\nprototypical personality traits: openness (O), conscientiousness (C), extraversion (E), agreeableness (A),\nand neuroticism (N). The values are in the range [−1, 1].\nInvestment\nO\nC\nE\nA\nN\nSavings\n-0.11\n0.08\n-0.15\n0.51\n0.68\nProperty\n-0.15\n0.32\n-0.22\n-0.36\n-0.24\nStocks\n0.82\n-0.61\n0.95\n0.42\n0.12\nLuxury\n0.16\n-0.51\n-0.07\n-0.80\n-0.81\nMortgage\n-0.72\n0.72\n-0.52\n0.23\n0.25\n3\nWe deﬁne a Markov decision process (MDP) for a multi-agent RL setting. The states consist of customer\nage2, the values of the assets3, and two market indicators for each of the three indices, i.e., their mean asset\nconvergence divergence (MACD)4 which predicts trend reversals and relative strength index (RSI)5 which\ncorrects for potential false predictions by MACD. Rewards are the changes in portfolio values between time\nsteps and actions are the continuous distribution of funds across the portfolio of assets. We make an initial\nloan of 2 million NOK in a mortgage and monthly investments over 30 years totalling 3.34 million NOK:\nAssumption 2. The initial values for a portfolio consist of a mortgage of NOK 2 million and a property\nvalued at NOK 2 million. All other assets have zero initial value.\nIt is easy to adjust these initial portfolio assignments for different individuals.\nAssumption 3. We make consistent monthly investments of 10 000 Norwegian kroner (NOK).\nThis can be easily modiﬁed for individual customers’ contributions.\nThere is a priori no lower limit on the investment amounts:\nAssumption 4. Property investment does not require bulk payments, i.e., smaller investments can be made\nthrough property funds, trusts, or crowdfunding.\nWhile investment in physical real estate normally requires larger deposits, we allow our agents to invest\nsmaller amounts into the property market, i.e., a fraction of the monthly investment contribution speciﬁed\nin Assumption 3. This is not a strong assumption as it is possible to invest smaller amounts in property\nindices, trusts, funds, etc.\nWe assign interest rates for savings accounts at 5-10% below, and those of mortgage accounts at 5-10%\nover the interest index. Individuals younger than 35 years receive the more beneﬁcial interest rate, as is\ncommon in Norwegian banks. Luxury items experience a depreciation of 20% per year; the depreciation of\nluxury items is highly variable and depends on the item, e.g., while artwork may appreciate, cars typically\ndepreciate rapidly:\nAssumption 5. Luxury items depreciate at 20% per year.\nDividends are normally included in the calculation of indices and monthly transactions are relatively infre-\nquent compared to high frequency trading:\nAssumption 6. Any additional income from investments - such as dividend payouts or rental income - as\nwell as costs such as transaction costs and fund management costs are ignored.\n3.2\nAgents\nWe train ﬁve DDPG agents, one for each of the ﬁve personality traits. Using Equation (1) we regularise\ntheir objective functions with a prior derived from their respective personality traits in Table 1, e.g., the\nopenness prior πO\n0 places the most weight on stocks and avoids mortgage repayments, property investment,\nand savings, while the conscientiousness prior πC\n0 places the most weight on mortgage repayments and\navoids stocks and luxury expenditure. These priors, shown in Table 2, are probability distributions across\nthe investment channels and therefore add up to one.\nAgents’ actor and critic neural networks each consist of two fully connected feed-forward layers with 2000\nnodes in each layer. The actor networks each have a ﬁnal soft-max activation layer while the critic networks\nhave no ﬁnal activations. We tuned the hyperparameters using a one-at-a-time parameter sweep resulting in\nlearning rates of 0.004 and 0.001 for the actors and critics respectively, target network update parameters\nof τ = 0.05, and regularisation coefﬁcients of λ = 2. Training batch sizes were 256 time steps and we\nsized the replay buffer to hold 2048 transitions. Each iteration collected 256 time steps and completed two\ntraining batches.\n2Customer age is normalized to a range of [0, 1]\n3Asset values are scaled by 1 : 106\n4MACD here is the difference between the 26-month and the 12-month exponential moving average of a trend.\n5RSI = 100 −100/(1 + Px\nNx ) where Px and Nx are the average positive and negative changes to the index values\nrespectively, for x periods.\n4\nTable 2: Regularisation priors πa\n0 for each agent a ∈{openness (O), conscientiousness (C), extraversion\n(E), agreeableness (A), and neuroticism (N)}.\nInvestment\nπO\n0\nπC\n0\nπE\n0\nπA\n0\nπN\n0\nSavings\n0.00\n0.07\n0.00\n0.44\n0.64\nProperty\n0.00\n0.28\n0.00\n0.00\n0.00\nStocks\n0.84\n0.00\n1.00\n0.36\n0.12\nLuxury\n0.16\n0.00\n0.00\n0.00\n0.00\nMortgage\n0.00\n0.65\n0.00\n0.02\n0.24\n4\nResults\nEach of our investment agents learns an optimal investment strategy for their respective prototypical per-\nsonality traits, for instance, openness. The ﬁnal portfolio values after 334 months of investing according\nto these policies are shown in Table 3. Given the common total investment of 3.34 million NOK, the com-\npound annual growth rate varies between 5.8% and 7.8% which is the maximum return possible if investing\nin stocks only.\nTable 3: Portfolio values of the ﬁve optimal policies for each of the prototypical personality traits.\nPolicy\nFinal portfolio value (NOK 1M)\nOpenness\n22.4\nConscientiousness\n18.8\nExtraversion*\n27.7\nAgreeableness\n20.5\nNeuroticism\n16.4\nPersonal agent\n20.3\n*This agent’s regularisation prior was coincidentally the same as the optimal monetary policy πM and it\nachieved the maximum possible ﬁnal portfolio value.\nNote that these personalised policies did not achieve the same ﬁnal portfolio value. In fact, the optimum\npolicy in monetary terms πM in this case would have been to always buy stocks as shown in Figure 2;\nthis is the default policy an agent will converge towards when personality traits are ignored. However, we\npostulate that this is not the ideal personal ﬁnancial advice to give to all individuals; some customers may\nbe more averse to risk and will thus prefer to avoid volatility in their portfolio. Our personalized agent takes\ninto account such preferences and, e.g., it recommends property investments rather than stock investments.\nThus far, our agents have each separately learned an optimal investment strategy for each prototypical\npersonality trait. The aggregate policy is the weighted sum of these individually learned policies: a customer\nhas a blend of personality traits which can be represented as a vector with ﬁve entries with values within the\nrange [−1, +1]. We calculate the inner product of the normalized personality vector and the prototypical\npolicies to arrive at the aggregate investment policy. We show a representative aggregate investment policy\nfor a customer with a random personality proﬁle in Figure 3. We observe that the openness agent is the only\nagent to recommend spending on luxury items; this is to be expected because its regularisation prior πO\n0 is\nthe only one with a non-zero coefﬁcient for luxury purchases. We also observe that the conscientiousness\nagent recommends investing in property in early stages, followed by rigorous loan repayments in the second\nhalf of the investment period. This suggests that our agent has learned the concept of compound growth\nand its utility for portfolio optimization. By contrast, the extraversion agent was steadfast in purchasing\nstocks only, which is consistent with its regularisation prior πE\n0 . Unlike the conscientiousness agent, the\nagreeableness and neuroticism agents consistently recommend investing in savings towards the end of the\ninvestment period. In the early stages of the investment period, the agreeableness and neuroticism agents\nutilize compound growth to increase the portfolio value; in the latter phases, their regimen changes and they\nprefer the safety of savings accounts. This is noteworthy because although risk is not explicitly part of either\nthe reward or regularisation functions, it is consistent with traditional ﬁnancial advice, which decreases the\nrisk level with age. Repeated training produces consistent results. We intend to elucidate this observation\nin future work.\n5\n1992-01\n2002-01\n2012-01\n2021-12\n2\n4\n6\n8\n10\n12\nReturn on Investment\nSP500 index\nProperty index\nInterest index\nFigure 2: The return on investment at every time step, calculated as the index value at the ﬁnal time step\ndivided by the index value at the current time step. It is clear that S&P 500 has the greatest return on\ninvestment at every time step, except for a brief period in ca. 2000 where it was marginally below the\nproperty index. Therefore, the optimum monetary policy πM is to always invest the maximum amount into\nstocks.\n0\n50\n100\n150\n200\n250\n300\nMonth\n0.00\n0.25\n0.50\n0.75\n1.00\nAction\nActions for the agent with preferences towards openness\nBuy stocks\nBuy property\nBuy savings\nPay mortgage\nBuy luxury\n(a)\n0\n50\n100\n150\n200\n250\n300\nMonth\n0.00\n0.25\n0.50\n0.75\n1.00\nAction\nActions for the agent with preferences towards conscientiousness\nBuy stocks\nBuy property\nBuy savings\nPay mortgage\nBuy luxury\n(b)\n0\n50\n100\n150\n200\n250\n300\nMonth\n0.00\n0.25\n0.50\n0.75\n1.00\nAction\nActions for the agent with preferences towards extraversion\nBuy stocks\nBuy property\nBuy savings\nPay mortgage\nBuy luxury\n(c)\n0\n50\n100\n150\n200\n250\n300\nMonth\n0.00\n0.25\n0.50\n0.75\n1.00\nAction\nActions for the agent with preferences towards agreeableness\nBuy stocks\nBuy property\nBuy savings\nPay mortgage\nBuy luxury\n(d)\n0\n50\n100\n150\n200\n250\n300\nMonth\n0.00\n0.25\n0.50\n0.75\n1.00\nAction\nActions for the agent with preferences towards neuroticism\nBuy stocks\nBuy property\nBuy savings\nPay mortgage\nBuy luxury\n(e)\n0\n50\n100\n150\n200\n250\n300\nMonth\n0.0\n0.2\n0.4\nAction\nPersonalized actions for [0.22 0.87 0.21 0.92 0.49]\nBuy stocks\nBuy property\nBuy savings\nPay mortgage\nBuy luxury\n(f)\nFigure 3: Investment strategies for different prototypical personality traits: Figures (a) through (e) show\nthe fractions of monthly investments for different assets. They reveal the distinct investment strategies\nwith changing asset preferences for the ﬁve prototypical personality traits. In Figure (f) we illustrate the\ninvestment strategy for a ﬁctitious customer with a random personality proﬁle [openness, conscientiousness,\nagreeableness, extraversion, and neuroticism] = [0.22, 0.87, 0.21, 0.92, 0.49]. The customer invests in a\nmixture of assets throughout the investment period.\nWe observe that training converges quickly to the desired behaviour (see Figure 4); the contribution of\nthe regularisation term decreases rapidly, which implies that the agent is learning the intended behaviour.\nWe show the regularisation term for the extraversion agent where the regularisation prior πE\n0 matches the\n6\noptimum monetary policy πM in Figure 4(a). Further training causes no instability as is often observed in\nthe DDPG algorithm [31]. We hypothesize that this may be due to the agent characteristics imposed by our\nregularisation whose effect may be similar to entropy regularisation [31].\nThe actions of any linear combination of these agents, i.e., any personal agent, are interpretable through the\nintrinsic characterizations, i.e., priors, of each of the regularized agents.\n0\n2\n4\n6\n8\nTraining step\n0.0\n0.1\n0.2\n0.3\nRegularization term\n(a) Learning curve for the regularisation term of\nthe extraversion agent.\n0\n10\n20\n30\n40\n50\n60\n70\n80\nTraining step\n0.000\n0.025\n0.050\n0.075\n0.100\n0.125\nRegularization term\n(b) A typical learning curve for the regularisation\nterm of other agents.\n0\n50\n100\n150\n200\n250\nTraining step\n0.00\n0.05\n0.10\n0.15\n0.20\nRegularization term\n(c) Learning curve where the regularisation term\ntemporarily falls in a local minimum but subse-\nquently converges to zero.\nFigure 4: The regularisation term L for three different runs. In (a) the regularisation prior πE\n0 of the\nextraverted agent coincides with the optimum monetary policy πM and the policy converges within 5 time\nsteps. (b) shows a typical training run for the other agents which converges within 100-200 training steps.\n(c) shows a training run where the regularisation term appears to fall in local minimum for a time, but\neventually ﬁnds the optimum after about 200 training steps.\n5\nConclusions and Directions for Future Work\nWe have presented a novel application of training RL agents to exhibit desired characteristics and behaviours\nin asset management. The method is based on the regularisation of the policy during training. Here, we use\nprototypical personality traits - openness, conscientiousness, agreeableness, extraversion, and neuroticism\n- to deﬁne a set of priors which express their afﬁnity towards different assets and thus impose different\ninvestment strategies. This makes the agents’ behaviour explicit and thus offers an explanation for their\nrecommendations. Our agents learn distinct optimal strategies for the continuous distribution of monthly\ninvestments across a portfolio of investment assets. We have shown that the agents learned to optimize total\nrewards while adhering to their distinct priors. This makes it possible to interpret the agents’ investment\nstrategies.\nUnlike traditional DDPG algorithms which may diverge with continuous training, our regularisation results\nin quick and robust convergence. This could become relevant if RL agents undergo continuous training to\ngive personalized investment advice to customers. The justiﬁcation of this observation will be subject to\nfuture research.\nOur agents have learned the concept and utility of compound growth rates and risk avoidance, which form\npart of the interpretation of their investment strategies. These are solely based on the regularisation priors\nwhich express their personality traits; the reward function makes no reference to the personality traits.\nWhile the notion of compound growth may emerge from the reward function, we do not yet know whether\nthe notion of risk avoidance is connected to the reward function or regularisation.\n7\nHere, we have chosen a linear combination of different, separately trained agents aligned with the prototyp-\nical personality traits to arrive at an aggregate investment advice. In the future, we will investigate whether\nthe orchestration of these agents can be learned to approach the optimum monetary policy. This aggregation\nwill need an explanation as well as interpretation to understand its impact on the investment strategy. The\nhierarchical orchestration of prototypical agents will be learned from real customers’ personality proﬁles.\nThis will result in an explainable and interpretable personalized ﬁnancial investment advisor.\nFunding\nThis study was partially funded by The Norwegian Research Council; project number 311465.\nReferences\n[1] Matteo Stefanel and Udayan Goyal. Artiﬁcial intelligence & ﬁnancial services: Cutting through the\nnoise. Technical report, APIS partners, London, England, 2019.\n[2] Sunanda Vincent Jaiwant. Artiﬁcial intelligence and personalized banking. In Garg Vikas and Richa\nGoel, editors, Handbook of Research on Innovative Management Using AI in Industry 5.0, pages\n74–87. IGI Global, Bengaluru, India, 2022.\n[3] Joost van der Burgt. General principles for the use of artiﬁcial intelligence in the ﬁnancial sector.\nTechnical report, De Nederlandsche Bank, Amsterdam, The Netherlands, 2019.\n[4] Oladapo Oyebode and Rita Orji. A hybrid recommender system for product sales in a banking envi-\nronment. Journal of Banking and Financial Technology, 4:15–25, 2020.\n[5] Siddharth Bhatore, Lalit Mohan, and Raghu Reddy. Machine learning techniques for credit risk eval-\nuation: a systematic literature review. Journal of Banking and Financial Technology, 4:111–138, 06\n2020.\n[6] Darshana Desai. Hyper-personalization: An AI-enabled personalization for customer-centric market-\ning. In Surabhi Singh, editor, Adoption and Implementation of AI in Customer Relationship Manage-\nment, pages 40–53. IGI Global, Maharashtra, India, 2022.\n[7] Dhanya Jothimani and Surendra Yadav. Stock trading decisions using ensemble-based forecasting\nmodels: a study of the indian stock market. Journal of Banking and Financial Technology, 3:113–\n129, 2019.\n[8] Qian Zhang, Weiqi Yan, and Mohan Kankanhalli. Overview of currency recognition using deep learn-\ning. Journal of Banking and Financial Technology, 3:59–69, 2019.\n[9] Tien-Yu Hsu. Machine learning applied to stock index performance enhancement. Journal of Banking\nand Financial Technology, 5:1–13, 01 2021.\n[10] Petter Kolm and Gordon Ritter. Modern perspectives on reinforcement learning in ﬁnance. SSRN\nElectronic Journal, pages 1–28, 2019.\n[11] Thomas G. Fischer.\nReinforcement learning in ﬁnancial markets - a survey.\nTechnical report,\nFriedrich-Alexander University Erlangen-Nuremberg, Institute for Economics, 2018.\n[12] Alejandro Barredo Arrieta, Natalia Díaz-Rodríguez, Javier Del Ser, Adrien Bennetot, Siham Tabik,\nAlberto Barbado, Salvador Garcia, Sergio Gil-Lopez, Daniel Molina, Richard Benjamins, Raja\nChatila, and Francisco Herrera. Explainable artiﬁcial intelligence (XAI): Concepts, taxonomies, op-\nportunities and challenges toward responsible AI. Information Fusion, 58:82–115, 2020.\n[13] Longbing Cao. Ai in ﬁnance: Challenges, techniques and opportunities. Banking & Insurance eJour-\nnal, 2021.\n[14] Charl Maree, Jan Erik Modal, and Christian W. Omlin. Towards responsible ai for ﬁnancial transac-\ntions. In 2020 IEEE Symposium Series on Computational Intelligence (SSCI), pages 16–21, 2020.\n[15] Charl Maree and Christian Omlin. Reinforcement learning your way: Agent characterization through\npolicy regularization. arXiv, 2201.10003, 2022.\n8\n[16] Joe Gladstone, Sandra Matz, and Alain Lemaire. Can psychological traits be inferred from spending?\nEvidence from transaction data. Psychological Science, 30:1–10, 2019.\n[17] Sandra C. Matz, Joe J. Gladstone, and David Stillwell. Money buys happiness when spending ﬁts our\npersonality. Psychological Science, 27:715–725, 2016.\n[18] Charl Maree and Christian W. Omlin. Clustering in recurrent neural networks for micro-segmentation\nusing spending personality. In 2021 IEEE Symposium Series on Computational Intelligence (SSCI),\npages 1–5, 2021.\n[19] Charl Maree and Christian W. Omlin. Understanding spending behavior: Recurrent neural network\nexplanation and interpretation (in print). In IEEE Computational Intelligence for Financial Engineer-\ning and Economics, pages 1–7, 2022.\n[20] S. M. Bartram, J. Branke, G. D. Rossi, and M. Motahari. Machine learning for active portfolio man-\nagement. The Journal of Financial Data Science, 3(3):9–30, 2021.\n[21] Emmanuel Jurczenko. Machine Learning for Asset Management: New Developments and Financial\nApplications. Wiley - ISTE, London, United Kingdom, 2020.\n[22] Q.Y.E. Lim, Q. Cao, and C. Quek. Dynamic portfolio rebalancing through reinforcement learning.\nNeural Computing and Applications, 33(24):1–15, 2021.\n[23] Michael Pinelis and David Ruppert. Machine learning portfolio allocation. The Journal of Finance\nand Data Science, 8:35–54, 2022.\n[24] Adrian Millea. Deep reinforcement learning for trading—a critical survey. Data, 6(11):119, 2021.\n[25] Charl Maree and Christian W. Omlin. Balancing proﬁt, risk, and sustainability for portfolio manage-\nment (in print). In IEEE Computational Intelligence for Financial Engineering and Economics, pages\n1–8, 2022.\n[26] A. Heuillet, F. Couthouis, and N. Díaz-Rodríguez. Explainability in deep reinforcement learning.\nKnowledge-Based Systems, 214(106685):1–24, 2021.\n[27] Lindsay Wells and Tomasz Bednarz. Explainable AI and reinforcement learning: A systematic review\nof current approaches and trends. Frontiers in Artiﬁcial Intelligence, 4:1–48, 2021.\n[28] S. Gupta, G Singal, and D. Garg. Deep reinforcement learning techniques in diversiﬁed domains: A\nsurvey. Archives of Computational Methods in Engineering, 28:4715–4754, 2021.\n[29] Timothy P. Lillicrap, Jonathan J. Hunt, Alexander Pritzel, Nicolas Heess, Tom Erez, Yuval Tassa,\nDavid Silver, and Daan Wierstra.\nContinuous control with deep reinforcement learning.\narXiv,\n1509.02971, 2019.\n[30] Brian D. Ziebart. Modeling Purposeful Adaptive Behavior with the Principle of Maximum Causal\nEntropy. PhD thesis, Machine Learning Department, Carnegie Mellon University, December 2010.\n[31] Tuomas Haarnoja, Haoran Tang, P. Abbeel, and Sergey Levine. Reinforcement learning with deep\nenergy-based policies. In International Conference on Machine Learning (ICML), 2017.\n[32] Yahoo\nFinance.\nHistorical\ndata\nfor\nS&P500\nstock\nindex,\n2022.\nhttps://finance.yahoo.com/quote/%5EGSPC/history?p=%5EGSPC, Accessed on 30/01/2022.\n[33] Statistics\nNorway.\nTable\n07221\n-\nPrice\nindex\nfor\nexisting\ndwellings,\n2022.\nhttps://www.ssb.no/en/statbank/table/07221/, Accessed on 30/01/2022.\n[34] Norges Bank. Interest rates, 2022. https://app.norges-bank.no/query/#/en/interest, Ac-\ncessed on 30/01/2022.\n9\n",
  "categories": [
    "cs.LG",
    "cs.AI"
  ],
  "published": "2022-02-18",
  "updated": "2022-06-29"
}