{
  "id": "http://arxiv.org/abs/2204.05042v3",
  "title": "Resources for Turkish Natural Language Processing: A critical survey",
  "authors": [
    "Çağrı Çöltekin",
    "A. Seza Doğruöz",
    "Özlem Çetinoğlu"
  ],
  "abstract": "This paper presents a comprehensive survey of corpora and lexical resources\navailable for Turkish. We review a broad range of resources, focusing on the\nones that are publicly available. In addition to providing information about\nthe available linguistic resources, we present a set of recommendations, and\nidentify gaps in the data available for conducting research and building\napplications in Turkish Linguistics and Natural Language Processing.",
  "text": "arXiv:2204.05042v3  [cs.CL]  25 Feb 2023\nLanguage Resources and Evaluation manuscript No.\n(will be inserted by the editor)\nResources for Turkish Natural Language Processing\nA critical survey\nÇağrı Çöltekin · A. Seza Doğruöz · Özlem Çetinoğlu\nReceived: date / Accepted: date\nThe\nﬁnal\nversion\nof\nthis\npaper\nis\npublished\nat\nhttps://doi.org/10.1007/s10579-022-09605-4.\nPlease\ncite\nthe published version.\nAbstract This paper presents a comprehensive survey of corpora and lexical\nresources available for Turkish. We review a broad range of resources, focusing\non the ones that are publicly available. In addition to providing information\nabout the available linguistic resources, we present a set of recommendations,\nand identify gaps in the data available for conducting research and building\napplications in Turkish Linguistics and Natural Language Processing.\nKeywords Turkish · corpora · lexical resources · NLP · linguistics\n1 Introduction\nAs in many other ﬁelds of science and engineering, the data-driven methods\nhave been the dominant approach to natural language processing (NLP) and\ncomputational linguistics (CL) for the last few decades. The recent (re)pop-\nularization of deep learning methods increased the importance and need for\nthe data even further. Similarly, the other subﬁelds of theoretical and applied\nlinguistics have also seen a shift towards more data-driven methods. As a\nresult, availability of large and high-quality language data is essential for both\nlinguistic research and practical NLP applications. In this paper, we present\na comprehensive and critical survey of linguistic resources for Turkish.\nTurkish is a language spoken by over 80 million people, mainly in Turkey,\nalso having a signiﬁcant number of speakers in Cyprus, Europe, and Central\nÇağrı Çöltekin\nUniversity of Tübingen, Tübingen, Germany. E-mail: ccoltekin@sfs.uni-tuebingen.de\nA. Seza Doğruöz\nGhent University, Ghent, Belgium. E-mail: as.dogruoz@ugent.be\nÖzlem Çetinoğlu\nUniversity of Stuttgart, Stuttgart, Germany. E-mail: ozlem@ims.uni-stuttgart.de\n2\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nAsia (Eberhard et al., 2020).1 It exhibits a number of interesting linguistic\ncharacteristics that are often challenging to handle in NLP applications in\ncomparison to the well-studied languages.\nAs a result, the linguistic resources for Turkish are important for building\npractical NLP applications for a large speaker community as well as for quanti-\ntative and computational approaches to linguistics, including multilingual and\ncross-linguistic research. Furthermore, since Turkish is one of the largest and\nmost well-studied languages in the Turkic language family, the resources we\nreview below are potentially useful for language transfer in NLP applications,\nand as examples for resource and tool creation eﬀorts for the other Turkic\nlanguages.\nOur survey mainly focuses on currently available resources (see Aksan and\nAksan, 2018, for a more historical account of Turkish corpora). We also in-\ntroduce a companion webpage which we update as new linguistic resources\nbecome available.2 Our survey provides an overview of the available resources,\ngiving details for the major ones, and aims to identify the areas where more\neﬀort is needed. To our knowledge, this is the ﬁrst survey of its kind on Turkish\nresources. The most similar work is an edited volume of papers on various NLP\ntasks for Turkish (Oﬂazer and Saraçlar, 2018). Unlike our work, however, the\nfocus is not the linguistic resources but NLP techniques and tools, and most of\nthe contributions are updated descriptions of the research published earlier. A\nsimilar initiative to our companion website is the recently announced Turkish\nData Depository (TDD) project (Safaya et al., 2022),3 which aims to build a\nrepository of data and models for Turkish NLP. Our aim is collecting a more\ncomprehensive list of pointers which can be useful for both NLP and linguistic\nresearch, while the TDD intends to store the actual data and the models for\nNLP with a more practical purpose.\nOur focus in this survey is linguistic data, in particular, corpora and lexical\nresources. We do not aim to describe the research questions, methods and/or\nthe results of these studies but focus on describing the resources in detail.\nWe include resources that are potentially useful for NLP applications, as well\nas for linguistic research. We also do not focus on NLP tools explicitly, such\nas data-driven part-of-speech (POS) taggers or parsers and higher level tools\nor services that target non-technical audience such as the web-based NLP\npipelines (e.g., Eryiğit, 2014; Çöltekin, 2015b).\nThe main contribution of the current paper is a broad, comprehensive\noverview of the linguistic data available for Turkish to enable linguists and\nNLP researchers/practitioners to locate these resources easily. We also identify\nmissing or incomplete resources, suggesting potential areas for future resource\n1 Throughout this paper, we use Turkish only for referring to the language variety spoken\nin modern Turkey and use of this variety in other countries/regions. Hence, this count does\nnot include other Turkic languages, including ones mutually intelligible with Turkish.\n2 The web page is publicly available at https://turkishnlp.github.io. The current list\nwas compiled mostly by our own eﬀorts. However, we also welcome suggestions through a\nsimple web-based form, and also through the GitHub repository associated with this URL.\n3 https://tdd.ai/.\nResources for Turkish Natural Language Processing\n3\ncreation eﬀorts. We do not only oﬀer a static survey, but we intend to maintain\na ‘living list’ of resources and a repository of publicly available linguistic data.\n2 Corpora\nThis section surveys corpora available for Turkish. We start with general-\npurpose, linguistically motivated corpora, followed by corpora used for more\nspeciﬁc purposes.\n2.1 Balanced corpora\nSince corpora collected from a single source (genre, domain) contain many\nidiosyncratic aspects of its source, the creation of balanced or representative\ncorpora has been a major activity in computational/corpus linguistics since the\nearliest examples of linguistic corpora (e.g., Francis and Kučera, 1979). There\nare two well-known balanced corpora for Turkish, the Middle East Technical\nUniversity (METU) corpus (Say et al., 2002) and Turkish National Corpus\n(TNC, Aksan et al., 2012).\nThe METU corpus is the ﬁrst balanced corpus released for Turkish. The cor-\npus consists only of written modality sampled from 14 diﬀerent text types in-\ncluding novels, essays, research articles, travel articles, interviews, news, news-\npaper columns, biographies and memoirs. The corpus contains approximately\n1 000 documents and 1.7M tokens.4 The original release does not contain any\nlinguistic annotations. However, a number of annotation projects were carried\nout on parts of this corpus (e.g., Oﬂazer et al., 2003; Zeyrek et al., 2013, both\ndiscussed in Section 2.2). It is available free-of-charge for research purposes\nafter signing a license agreement.\nThe second balanced corpus is the Turkish National Corpus (TNC, Aksan\net al., 2012). The TNC follows the design principles of the British National\nCorpus (BNC, Burnard, 2000). The corpus consists of 50M words from texts\ncollected from books, periodicals, and various published and unpublished ma-\nterial. It also includes a small ‘spoken text’ portion that consists of political\nspeeches and news broadcasts. The TNC contains texts from nine diﬀerent do-\nmains (e.g. ﬁction, scientiﬁc articles, art, opinions and editorials) and includes\nmorphological annotations. The corpus is not available for download but it is\naccessible through a web interface.5 A small part of the TNC is also used in\nconstructing the BOUN Treebank (Türk et al., 2022, described below).\n4 The numbers are based on a version obtained in 2015, which includes minor ﬁxes to the\nﬁrst original release.\n5 Further information and the query interface is available from https://www.tnc.org.tr/.\n4\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nTable 1 A summary of currently available Turkish treebanks. The numbers in the table are\nbased on our own counts on the most recent versions of the datasets. Not all information\nis reported in the respective papers, and there may be mismatches between the numbers\nreported in the papers and the released datasets.\nTreebank\nType\nSentences\nTokens\nMETU-Sabancı\nOﬂazer et al. (2003)\ndep\n5 635\n56 396\nITU Web\nPamay et al. (2015)\ndep\n5 009\n43 191\nUD-GB\nÇöltekin (2015a)\ndep\n2 880\n16 803\nUD-PUD\nZeman et al. (2017)\ndep\n1 000\n16 536\nUD-BOUN\nTürk et al. (2022)\ndep\n9 761\n121 214\nTWT\nKayadelen et al. (2020)\ndep\n4 851\n66 466\nTurkish-Penn-CS\nYıldız et al. (2014)\ncon\n9 560\n81 419\nUD-Turkish-Penn\ndep\n9 560\n87 367\nUD-Tourism\ndep\n19 750\n92 200\nUD-Kenet\ndep\n18 700\n178 700\nUD-FrameNet\ndep\n2 700\n19 221\n2.2 Treebanks and corpora with morphosyntactic annotation\nThis section reviews primarily manually-annotated Turkish corpora with ge-\nneral-purpose linguistic annotations, as opposed to corpora annotated for a\nparticular NLP task. The majority of the corpora discussed below are tree-\nbanks, however we also include a few other corpora with morphosyntactic\nannotations.\nTreebanks are important resources for linguistic research and applications.\nAlthough they have been primarily used for training parsers in CL, multiple\nlevels of linguistic annotations available in treebanks have also been beneﬁcial\nfor other NLP applications and linguistic research. There has been a surge of\ninterest in creating new treebanks for Turkish in recent years. Table 1 presents\nthe currently-available treebanks, along with basic statistics.6 Below, we pro-\nvide a brief historical account of treebanks for Turkish.\nThe ﬁrst Turkish treebank is the METU-Sabancı treebank (Atalay et al.,\n2003; Oﬂazer et al., 2003). The METU-Sabancı treebank is a dependency tree-\nbank including a selection of sentences from the METU corpus discussed in\nSection 2.1, and includes diﬀerent text types of the original resource. As an\nearly eﬀort with relatively low funding, the treebank had various issues with\nformatting and data quality (Say, 2011). Despite these issues, the METU-\nSabancı treebank was the only Turkish treebank over a decade. There has\nbeen a large number of reports of ﬁxes over the years, but most ﬁxes remained\nunpublished, or even introduced other errors or unclear modiﬁcations to the\nannotation scheme. The most up-to-date version of this treebank is made avail-\nable through Universal Dependencies (UD, Nivre et al., 2016; de Marneﬀe et\n6 We only include manually annotated treebanks. All treebanks listed in the table are\ndirectly available for download, with the exception of ITU Web treebank, which requires a\nsigned license agreement to be sent to the maintainers. All UD treebanks can be obtained\nthrough the project’s webpage at https://universaldependencies.org/. Automatic con-\nversion eﬀorts or parsed corpora are not listed in the table.\nResources for Turkish Natural Language Processing\n5\nal., 2021) repositories based on a semi-automatic conversion (Sulubacak et\nal., 2016) of a version from Istanbul Technical University (ITU) and hence,\nnamed UD-IMST (ITU-METU-Sabancı Treebank). Even the latest version is\nreported to have a large number of errors, carried over from earlier versions\nor introduced along the way by many automated conversion processes (see,\ne.g., Türk et al., 2019). Burga et al. (2017) present a conversion of the same\ntreebank into another related framework, namely Surface-Syntactic Universal\nDependencies (SUD, Gerdes et al., 2018). The paper states the intention to\npublish the resulting treebank, but it is not available at time of this writing.\nAfter a long time gap, a growing number of new dependency treebanks have\nrecently been released. One of the new treebanks, ITU-Web treebank (Pamay\net al., 2015), contains user-generated text from the web. It was annotated fol-\nlowing the METU-Sabancı treebank annotation scheme, and later converted\nto the UD annotation scheme automatically. The ﬁrst treebank annotated di-\nrectly using the UD framework is by Çöltekin (2015a). This treebank contains\nlinguistic examples from a grammar book to increase the coverage of diﬀerent\nmorphosyntactic constructions while minimizing the annotation eﬀort. Two\nrelatively larger and more recent dependency treebanks are the Boğaziçi Uni-\nversity (BOUN) treebank (Türk et al., 2022) and the Turkish web treebank\n(TWT, Kayadelen et al., 2020). The BOUN treebank annotates a selection\nof sentences from the TNC (Aksan et al., 2012, see Section 2.1) covering a\nnumber of diﬀerent text types. The BOUN treebank is directly annotated ac-\ncording to the UD annotation scheme. The TWT includes sentences from the\nweb and Wikipedia. The annotations in TwT deviate from the UD and the\nmajority of the existing Turkish dependency treebanks.\nBesides the monolingual treebanks above, there have also been a few paral-\nlel treebanking eﬀorts. Megyesi et al. (2008) and Megyesi et al. (2010) report\nautomatically annotated parallel dependency treebanks of Turkish, Swedish\nand English, containing texts published in the forms of popular literature\nbooks. However, they have not been released publicly. Another early attempt\nof parallel treebanking is the constituency treebank described by Yıldız et al.\n(2014) and Kara et al. (2020b). This treebank includes translations of short\nsentences (less than 15 words) from Penn Treebank (Marcus et al., 1993).\nThe UD-PUD (Zeman et al., 2017) is part of a parallel dependency treebank\neﬀort including 20 languages so far, built on sentences translated predomi-\nnantly from English. The dependency annotations were performed by Google\nwith their own annotation scheme and automatically translated to UD for the\nCoNLL multilingual parsing shared task (Zeman et al., 2017). A diﬀerent type\nof multilingual treebanking eﬀort is the UD-SAGT treebank, which annotates\n2 184 spoken language utterances containing Turkish–German code-switching\ntreebank (Çetinoğlu and Çöltekin, 2019; Çetinoğlu and Çöltekin, 2022). The\ntreebank follows the UD framework. Section 2.9 provides further details about\nthe underlying dataset.\nVersion 2.8 of the UD treebanks, released in May 2021, introduced four\nnew Turkish treebanks from the same group. One of these treebanks is the\ndependency version of the Penn treebank translations (Yıldız et al., 2014).\n6\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nOthers include a domain-speciﬁc tourism treebank, and two treebanks anno-\ntating example sentences from two lexical resources discussed in Section 3\nbelow. The descriptions of the treebanks in the UD repositories indicate that\nall four treebanks are manually annotated. However, no formal descriptions of\nthese treebanks have been published at the time of writing.\nAs described above, Turkish is relatively rich with respect to the quantity of\navailable treebanks. However, the need for improvement in terms of the quality\nof annotations, establishing standards and resolving inconsistencies within and\nacross treebanks has been emphasized by multiple researchers (see, for example\nSay, 2011; Çöltekin, 2016; Türk et al., 2022, for earlier discussions).\nAn unusual, yet potentially useful freely-available dataset with morphosyn-\ntactic annotation is ODIN (Lewis, 2006), a multilingual collection of examples\nfrom linguistics literature with interlinear glosses. Although ODIN does not\ninclude full or uniform morphosyntactic annotations, the glossed example sen-\ntences can be useful for linguistic research; they may serve as test instances\nwith interesting or diﬃcult linguistic constructions; and they can be converted\nto a treebank with less eﬀort than that is required for annotating unanalyzed\ntext.\nThere are also a few corpora that include only morphological annotations.\nThe most popular corpus with morphological annotations is a 1M token corpus\ndisambiguated semi-automatically. The exact procedure used for the disam-\nbiguation is unclear. The corpus was introduced by Hakkani-Tür et al. (2002),\nand made publicly available by later studies on morphological disambigua-\ntion (Yüret and Türe, 2006; Sak et al., 2011; Dayanık et al., 2018). Another\nfully manually disambiguated dataset consisting of 25 098 words is reported in\nKutlu and Çiçekli (2013), which can be obtained from the authors via email.\n2.3 Large-scale (unannotated) linguistic data collections\nAlthough well-balanced, representative corpora have been at the focus of build-\ning corpora in corpus linguistics, opportunistic large collections of linguistic\ndata have also been useful in CL/NLP tasks that require large datasets. Fur-\nthermore, the size and distribution restrictions on balanced corpora often lim-\nits their use both for NLP applications, and research on some linguistic ques-\ntions (e.g., if the questions are concerned with rare linguistic phenomena). In\nthis section, we review some of the unannotated or automatically annotated\ncorpora that are either used in earlier literature, or publicly accessible without\nmajor limitations.\nThe largest Turkish corpora available are two large multilingual web-\ncrawled datasets: supplementary data released as part of CoNLL-2017 UD\nparsing shared task (Zeman et al., 2017; Ginter et al., 2017), and the OSCAR\ncorpus (Ortiz Suárez et al., 2019; Ortiz Suárez et al., 2020). Both corpora are\nsentence shuﬄed to comply with the copyright laws. The Turkish part of the\nCoNLL-2017 dataset contains approximately 3.5 billion words. The data is\ndeduplicated, and automatically annotated for morphology and dependency\nResources for Turkish Natural Language Processing\n7\nrelations. The data can be downloaded directly from the LINDAT/CLARIN\nrepository. The OSCAR corpus is available as raw, and deduplicated versions.\nThe Turkish section contains over 3 billion words after deduplication. The\nOSCAR corpus can be obtained after creating an account automatically. The\npublicly available data does not include any meta information, and the order\nof the sentences is destroyed by shuﬄing. However, the webpage of the OSCAR\ncorpus includes a form to request original data without sentence shuﬄing.\nAnother popular, relatively large Turkish corpus is the BOUN corpus (Sak\net al., 2008). The corpus contains approximately 500M tokens collected from\ntwo major online newspapers and other webpages. Although it is used in many\nstudies, it is not clear how to access this corpus.\nA relatively large, and easily accessible data source is the multilingual\nLeipzig Corpora Collection (Quasthoﬀet al., 2014). The Turkish section con-\ntains over 7M sentences (approximately 100M words) of news, Wikipedia and\nweb crawl. The Leipzig corpora are also sentence shuﬄed. Web-crawled data\nalso contains smaller parts crawled from Turkish-language web sites published\nin Cyprus and Bulgaria.\nThe Turkish parliamentary corpus released as part of the ParlaMint project\n(Erjavec et al., 2021; Erjavec et al., 2022) contains the transcripts of the Turk-\nish parliament (2011–2021), including approximately 43M words from 303 505\nspeeches delivered at the main proceedings of the parliament. The data also\ncontains speaker information (name, gender, party aﬃliation) and automatic\nannotations including morphology, dependency parsing and named entities.\nAnother relatively large (approximately 10M words), freely accessible cor-\npus is the Kaggle old news dataset.7 This is a multilingual collection from\nwell-known news sites. The data also includes publication date of the article\nand the source URL of the document.\nThe TS Corpus (Sezer and Sever Sezer, 2013; Sezer, 2017) is also a large\ncollection of corpora with a web interface. The collection contains some corpora\nreleased earlier (e.g., the BOUN corpus discussed in Section 2.1) as well as sub-\ncorpora collected by the authors. The authors report over 1.3 billion tokens\nin 10 sub-corpora from various text sources and various levels of (automatic)\nannotation. The corpus is served via a web-based query interface, and, to our\nknowledge, the full corpus is not publicly available for download.\nAnother relatively small, but potentially interesting unannotated dataset\nis a compilation of 6 844 essays on creative writing classes by Turkish univer-\nsity students between 2014–2018. The essays (approximately 400K words) are\npublished on the course webpage as PDF ﬁles.\n7 The corpus is not described in any earlier publication. Throughout this survey, we cite\nthe papers describing each resource, if one is available, otherwise provide a hyperlink to\nthe resource. Links to all available resources are provided in the companion webpage at\nhttps://turkishnlp.github.io.\n8\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nTable 2 A summary of WSD resources. The ‘Additional’ column mentions additional an-\nnotations, namely, morph: POS tags and morphology, dep: dependency, con: constituency.\nResource\nType\nAdditional\nSamples\nSent.\nMETU\nOrhan et al. (2007)\nlexical sample morph, dep\n26\n5 385\nITU\nİlgen et al. (2012)\nlexical sample -\n35\n3 616\nIşık\nAkçakaya and Yıldız (2018) all-words\nmorph, con\n7 595\n83 474\n2.4 Corpora with discourse annotation\nThere are two corpora that are annotated for discourse markers in Turkish.\nThe ﬁrst one, Turkish Discourse Bank (TDB, Zeyrek et al., 2013), includes\nroughly 400K words across various written genres in the METU corpus (Sec-\ntion 2.1). The corpus is annotated based on explicit connectives and their two\narguments. The TDB is available for academic use through email. Zeyrek et al.\n(2018) and Zeyrek et al. (2020), on the other hand, focus on annotating dis-\ncourse markers in the transcripts of TED talks in six languages (i.e., English,\nGerman, Polish, European Portuguese, Russian and Turkish). The Turkish\ncorpus measures 5 164 words. The annotation tasks in each language were car-\nried out according to the Penn Discourse Treebank (PTDB) guidelines. The\ncorpus was annotated for ﬁve discourse relation types (i.e., explicit connectives,\nalternative lexicalizations, implicit connectives, no relation) and ﬁve top-level\nsenses (i.e., temporal, comparison, expansion, contingency, hypophora). The\nannotated corpus is freely available.\n2.5 Word sense disambiguation corpora\nThe word sense disambiguation (WSD) task has been deﬁned in two ways:\nlexical sample and all-words. The lexical sample task aims to disambiguate a\nrestricted set of ambiguous words in their context. The all-words variant, on\nthe other hand, disambiguates all words of a given input. Turkish has resources\nfor both variants.\nThe ﬁrst WSD dataset for Turkish is created as part of a SemEval 2007\ntask and opts for the lexical sample variant (Orhan et al., 2007). 26 unique\nlexical samples are tagged for their senses, and each sample is tagged in about\n100 sentences. The corpus used for the annotation is the METU-Sabancı Tree-\nbank, hence the WSD dataset is already accompanied with morphosyntactic\nannotations. The WSD annotation adds ﬁne-grained senses from the dictionary\nof Turkish Language Association (TDK), coarse-grain senses, which are a set\nof semantically closest ﬁne-grained senses, and three levels of ontology. The\nwebsite link provided in the paper for obtaining the resource is not accessible.\nİlgen et al. (2012) also employ the lexical samples approach but choose\ntheir words among the most ambiguous words based on a frequency list (Göz,\n2003). There are 35 lexical samples in total and each sample is annotated in\nat least 100 sentences. The corpus was collected from well-known websites\nResources for Turkish Natural Language Processing\n9\non news, health, sports, and education in Turkish. The word senses come\nfrom the TDK dictionary (though the authors eliminated some senses that are\ninfrequent in online resources). The availability of the resource is unclear.\nThe ﬁrst all-words WSD resource for Turkish annotates a set of sentences\nthat contains translations of Penn Treebank sentences up to 15 tokens (the\ntreebank is described in Section 2.2). Akçakaya and Yıldız (2018) annotates the\ndependency version of the treebank as an all-words WSD resource. Therefore,\nthe sentences also include morphosyntactic annotations. As in other resources,\nthe sense information comes from the TDK dictionary.8 In total, there are 7 595\nunique lexical samples to disambiguate in a corpus of 83 473 tokens. 77 % of\nthese unique samples are nouns, followed by verbs and adjectives. The website\nlink provided in the paper for obtaining the resource is not accessible. The\nstatistics for WSD resources are given in Table 2.\n2.6 Corpora of parent-child interactions\nLanguage acquisition has been a major interest in modern linguistics, where\nTurkish also received a fair amount of attention because of a rather inter-\nesting learning course observed by young learners, for example, an early and\nerror-free acquisition of case morphology (Xanthos et al., 2011). The CHILDES\ndatabase (MacWhinney and Snow, 1985) contains two freely-available Turkish\ndatasets with transcriptions of parent–caregiver interactions. The ﬁrst dataset\n(Aksu-Koç and Slobin, 1985) contains transcripts of 54 sessions consisting of\ninteractions with 33 children between 28 to 56 months of age. The second data-\nset (Altınkamış Türkay, 2005; Altınkamış, 2012) contains transcriptions of 15\nrecordings with the same child between ages 16 months to 28 months. Both cor-\npora mark speakers, and include some extra-linguistic information. The latter\ncorpus also includes morphological annotation of a subset of the child utter-\nances. A larger and more recent child-language dataset is reported in Moran\net al. (2015). However, the Turkish section of this corpus was not released as\nof this writing. Rothweiler (2011) has also released a ‘Turkish-German suc-\ncessive bilinguals corpus’ which contains 94 longitudinal spontaneous speech\nsamples by Turkish-German bilingual children (7–28 months-old) recorded be-\ntween 2003–2008. Part of the data could be viewed for research purposes after\nobtaining a password.\n2.7 Social media text normalization corpora\nNormalization of social media text is an important ﬁrst step in many NLP\napplications, where ill-formed words or phrases are replaced (or associated)\nwith their normal forms. The deﬁnition of ‘ill-formed’ text is debatable and\ntext normalization in social media hinders analyzing social aspects of language\nuse from a computational sociolinguistic point of view (Nguyen et al., 2016;\n8 Note that it is the same dictionary, yet diﬀerent versions.\n10\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nEisenstein, 2013). However, normalization datasets enable the use of tools\ncreated for formal/standard language, and non-destructive text normalization\nis also helpful in analyzing interesting aspects of non-standard language use\nby individuals or groups. We review corpora for normalization purposes here,\nfor lexical resources for the same purpose, see Section 3.5.\nEryiˇgit and Torunoˇglu-Selamet (2017) report a ‘big Twitter dataset’ (BTS)\nfor normalization which consists of 26 149 tweets, as well as using IWT (see\nSection 2.2) as a source of normalization data. The BTS contains 57 088 man-\nually normalized tokens out of a total of 385 568. In IWT, 5 101 tokens (out\nof 39 152 are normalized. The datasets are available from the group’s webpage\nafter signing a license agreement. Çolakoğlu et al. (2019) introduced another\nnormalization test set of 713 tweets (7 948 tokens, 2 856 normalized). The\ndataset is available via W-NUT 2021 Shared Task on Multilingual Text Nor-\nmalization. A more recent Twitter normalization data consisting of 2 000 sen-\ntences was introduced in Köksal et al. (2020). 6 488 out-of-vocabulary (OoV)\ntokens (out of 16 878) identiﬁed using lexical resources were manually anno-\ntated (below 10 % of the OoV tokens are well-formed, e.g., foreign names or\nneologisms). The dataset is available through a GitHub repository. Besides\nthese monolingual resources, a normalization dataset for Turkish–German is\nalso available (van der Goot and Çetinoğlu, 2021). This dataset is a revised\nversion of the data from Çetinoğlu and Çöltekin (2016) for normalization by\nemploying token-level alignment layers and adapting existing language ID and\nPOS tags for these new layers.\n2.8 Corpora for named entity recognition\nNamed entity recognition (NER) for Turkish has been studied by diverse\ngroups of researchers with a few publicly available datasets. Tür et al. (2003)\nis one of the ﬁrst to study NER in Turkish with a dataset compiled from\nnewspaper articles over approximately one year (1997–1998). The dataset is\nannotated for ENAMEX (person, location, organization) named entity types.\nThe dataset has been the standard benchmark for many subsequent studies,\nwith some changes along the way. Original article reports a dataset of approx-\nimately 1M words. The version of the dataset as used by Yeniterzi (2011) con-\nsists of approximately 500K words with 37 189 named entities (16 291 person,\n11 715 location 9 183 organization). This version of the data can be obtained\nthrough email. Çelikkaya et al. (2013) report three additional datasets cover-\ning diﬀerent text sources, namely, a computer hardware forum, orders to a\nspeech assistant, and Twitter. The data is also annotated for NUMEX entities\n(numerical expressions). Şeker and Eryiğit (2017) report an annotation eﬀort\npartially based on the datasets reported in Çelikkaya et al. (2013) and Tür et al.\n(2003), but also annotating the IWT (described in Section 2.2). The datasets\nare available from the group’s webpage after signing a license agreement. Eken\nand Tantug (2015) also report an additional 9 358 tweets annotated similar to\nÇelikkaya et al. (2013). However, availability of this dataset is unclear.\nResources for Turkish Natural Language Processing\n11\nKüçük et al. (2014) and Küçük and Can (2019) report two Twitter data-\nsets of 2 320 and 1 065 tweets, respectively. These datasets are annotated for\nperson, location, organization, date, time, money and misc (e.g., names of TV\nprograms, music bands), and publicly available through the authors’ GitHub\nrepositories. Another, more recent, NER data set annotating 5 000 tweets was\nreleased by Çarık and Yeniterzi (2022).\n2.9 Code-switching corpora\nCode-switching refers to mixing more than one language in written and spoken\ncommunication and it is quite common in multilingual settings (e.g., immigra-\ntion contexts, India, Africa etc.).\nNguyen and Doğruöz (2013) and Papalexakis et al. (2014) report analyzing\ncode-switching (e.g., Turkish-Dutch) in online fora for automatic language\nidentiﬁcation and a prediction task but this data set is not publicly available.\nÇetinoğlu (2016) released a Turkish–German Twitter corpus which is an-\nnotated with language IDs. The dataset consists of 1 029 tweets that are auto-\nmatically collected, semi-automatically ﬁltered, and manually annotated. Each\ntweet contains at least one code-switching point, the tweets are normalized and\ntokenized before adding language IDs. Çetinoğlu and Çöltekin (2016) added\nPOS tag annotations to the same dataset following UD guidelines. A spo-\nken corpus of interviews with Turkish–German bilinguals was presented by\nÇetinoğlu and Çöltekin (2019) and Çetinoğlu and Çöltekin (2022). The audio\nﬁles are annotated with sentence and code-switching boundaries. Sentences\nthat contain at least one code-switching point are transcribed and normal-\nized to their orthographic representation. The resulting 2 184 sentences are\nannotated with language IDs following (Çetinoğlu, 2017), and with lemmas,\nPOS tags, morphological features, and dependency relations following the UD\nframework. The treebank version of the dataset is available in the Univer-\nsal Dependencies repositories, the audio ﬁles and aligned transcriptions are\navailable to researchers after signing a license agreement. Yirmibeşoğlu and\nEryiğit (2018) worked on detecting code-switching in Turkish–English social\nmedia posts. The data is claimed to be available but it was not found on the\nwebsite link suggested in the paper.\nThe MULTILIT project (Schroeder et al., 2015) focuses on multilingual\nchildren and adolescents of Turkish and Kurdish background living in Ger-\nmany and France. The corpora they collected include Turkish oral monologues\n(and their transcription), and written text produced by bilingual students. A\nsubset of the corpus is annotated with POS tags, morphological features and\npartial syntactic structures, as well as markers showing deviations from stan-\ndard language use. The data is not publicly available. The RUEG project\naims at similar goals at a larger range of age groups, and investigates bilin-\ngual speakers of Russian, Turkish and Greek background in Germany and the\nU.S., bilingual speakers of German in the U.S., as well as monolingual speak-\ners of these languages in respective countries. As part of their collection there\n12\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nTable 3 A selection of parallel corpora available for Turkish. The third column lists the\nlanguages in each corpus (numbers include Turkish), for massively parallel corpora Turkish\nmay not be aligned to all languages. The number of sentences indicates the number of\nTurkish sentences in the particular corpus. The number of actual aligned sentences vary\ndepending on the target language. All numbers are based on the corpora as available from\nOPUS parallel corpora collection http://opus.nlpl.eu/.\nCorpus\nText type\nLanguages\nSentences\nBianet (Ataman, 2018)\nNews\nEnglish, Kurdish\n61 472\nBible\nReligious\nMultiple (102)\n48 500\nEU book shop\nEU texts\nMultiple (48)\n33 398\nGlobalVoices\nNews\nMultiple (92)\n8 796\nJW300 (Agić and Vulić, 2019)\nReligious\nMultiple (380)\n535 353\nOpenSubtitles\nSubtitles\nMultiple (62)\n173 215 360\nQED (Abdelali et al., 2014)\nEducational\nMultiple (225)\n753 343\nSETimes (Tyers and Alperen, 2010)\nNews\nBalkan (10)\n1 776 431\nTED talks\nSubtitles\nEnglish\n746 857\nTanzil\nReligious\nMultiple (42)\n105 597\nTatoeba\nMisc\nMultiple (359)\n746 857\nWikipedai (Wołk and Marasek, 2014) Wikipedia\nEnglish, Polish\n175 972\ninfopakki\nInformational Multiple (12)\n50 909\nare Turkish corpora collected in Germany (1 197 sentences) and in Turkey\n(1418 sentences), publicly available as audio ﬁles and annotated transcriptions\n(Wiese et al., 2020). The lemmas, POS tags, and morphological features are\nmanually annotated, dependencies are automatically predicted. All layers fol-\nlow the UD framework except the ﬁne-grained POS tags which follow the\nMULTILIT project.\n2.10 Parallel corpora\nParallel, aligned corpora in multiple languages are essential for machine trans-\nlation (MT) as well as multilingual or cross-lingual research. A number of\nparallel corpora including Turkish have been reported in some of the earlier\nworks on MT between Turkish and mainly English (e.g., Durgar El-Kahlout\nand Oﬂazer, 2010; Oﬂazer et al., 2018; Durgar El-Kahlout et al., 2019). Sim-\nilarly, shared tasks which included Turkish as one of the languages, such as\ntwo IWLST shared tasks (Paul et al., 2010; Cettolo et al., 2013), and WMT\nshared tasks between 2016 and 2018 (Bojar et al., 2016), also provided data\nfor use during the shared tasks. However, none of these resources are available,\nnor are there clear procedures to obtain these datasets. In this review we only\nlist the resources available (for at least for non-commercial, research purposes)\nin detail.\nAlmost all publicly available parallel corpora that include Turkish are avail-\nable from the OPUS corpora collection (Tiedemann, 2012). A selection of\npublicly available corpora are listed in Table 3 (except the parallel treebanks\ndiscussed in Section 2.2). The table does not list corpora of public software lo-\ncalization texts and some of the other small corpora available through OPUS.\nResources for Turkish Natural Language Processing\n13\nThe sizes, text types and the target languages vary considerably. This list of\nresources, to our knowledge, are not used widely by researchers interested in\nmachine translation to/from Turkish.\nAnother active area of machine translation is translation between Tur-\nkic languages (e.g., Hamzaoğlu, 1993; Altıntaş, 2001; Tantuğ et al., 2007;\nGilmullin, 2008; Gökırmak et al., 2019; see Tantuğ and Adalı, 2018 for a recent\nsummary). Similar to the Turkish–English translation studies, the resources\nspeciﬁcally built for the purpose are scarce, and even if they are reported in the\nliterature, to our knowledge, no speciﬁc corpora build for translation between\nTurkic languages were released.9 Except for small samples in Apertium repos-\nitories (Forcada et al., 2011), the corpora build with large-scale parallel text\ncollections (e.g., ones listed in Table 3) seem to be the only easily obtainable\nresource for studies requiring parallel corpora between Turkic languages.\n2.11 Corpora for sentiment and emotion\nDemirtaş and Pechenizkiy (2013) introduced two Turkish datasets consisting\nof movie and product reviews. The movie reviews, scraped from a popular\nTurkish movie review site, contain 5 331 positive and 5 331 negative sentences.\nThe product reviews data, scraped from an online retailer web site, consists\nof 700 positive and 700 negative reviews. The labels are assigned based on the\nscores assigned to the movie or the product by the reviewer. The datasets are\navailable at the author’s web site.\nKaya (2013) used a balanced corpus of 400 newspapers columns from 51\njournalists labeled for positive and negative sentiment. The study also reports\na Twitter corpus of 123 074 tweets (not labeled). Türkmenoğlu and Tantuğ\n(2014) also report multiple datasets, consisting of 20 244 movie reviews, 4 324\ntweets and 101 346 news headlines. The tweet dataset was annotated with\nthree-way classes (positive, negative, neutral). Similar to other studies, movie\nreviews are labeled them based on the scores assigned by the reviewers. How-\never, it is not clear how the authors labeled the headlines corpus and used\nit for the presented research. Yıldırım et al. (2014) report another manually\nannotated Twitter dataset of 12 790 tweets, labeled as positive (3 541) negative\n(4 249) and neutral (5 000). None of these publications indicate the availability\nof the corpora introduced. Hayran and Sert (2017) present another dataset of\n3 200 tweets. The data is labeled (negative or positive) based on the emoticons\nin the messages. The dataset is available through email.\nBoynukalın (2012) has investigated emotions in Turkish through two data-\nsets. The ﬁrst dataset is a translation of a multilingual emotion corpus (ISEAR,\nScherer and Wallbott, 1994) into Turkish where the participants are asked to\ndescribe experiences associated with a given set of emotions (e.g., joy, sadness,\nanger). Although the original study describes seven emotions, the authors fo-\ncused on four of them in Turkish and they have identiﬁed 4 265 short texts in\n9 Except Gökırmak et al. (2019), who state the intention to release their data pending\ncopyright clearance, most papers do not include intentions of sharing their data.\n14\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\ntotal. The second dataset consists of 25 fairy tales in Turkish collected across\nvarious websites on the web. The emotions in this dataset were labeled based\non intensity (low, medium, high) at the sentence and paragraph levels. Demirci\n(2014) analyzed the emotions in a dataset of 6 000 tweets, and labeled based\non the hashtags they contain as anger, fear, disgust, joy, sadness, surprise. The\navailability of these two datasets is unclear. A more recent emotion dataset,\nTREMO, based on the ISEAR corpus is presented by Toçoğlu and Alpkoçak\n(2018). Instead of translating the original texts, Toçoğlu and Alpkoçak (2018)\nfollow the methodology used to collect the ISEAR corpus, and collect 27 350\nentries from 4 709 individuals describing memories and experiences related\nto six emotion categories. Toçoğlu et al. (2019) built a dataset consisting of\n195 445 tweets automatically labeled with these emotion categories based on\na lexicon (see Section 3.5) extracted from the TREMO dataset. Both of these\ndatasets are available online for non-commercial use.\n2.12 Speech and multi-modal corpora\nAs in other languages, speech corpora or other forms of multi-modal datasets\n(e.g., video) are scarce in comparison to text corpora. The only linguistically\nmotivated speech corpus creation eﬀort seems to be the Spoken Turkish Cor-\npus (STC, Ruhi et al., 2010; Ruhi et al., 2012). Although an initial sample\nconsisting of 20 recordings, 4 514 utterances and 16 107 words was released in\n2010, the full corpus is still not available.\nEasily-accessible Turkish speech corpora are generally parts of multilingual\ncorpus creation eﬀorts. Notable examples include Common Voice (Ardila et al.,\n2020), and MediaSpeech (Kolobov et al., 2021). The Common Voice dataset is\nan ongoing data collection eﬀort by Mozilla Foundation. The project collects\naudio recordings of a set of sentences and phrases in multiple languages. The\nJanuary 2022 release includes over 68 hours of recordings from 1 228 Turkish\nspeakers. The MediaSpeech dataset includes 10 hours of speech recordings\n(2 513 short segments less than 15 seconds each) with transcriptions from two\nnews channels. MuST-C (Di Gangi et al., 2019; Cattoni et al., 2021) is a\nmultilingual corpus of TED talks including Turkish transcripts, but the audio\ndata is only in English.\nThe majority of the other speech datasets are collected/created within prac-\ntical speech recognition/processing projects (see Arslan and Barışçı, 2020, for a\nrecent review of Turkish speech recognition). The speech corpus introduced in\nMengüşoğlu and Deroo (2001) consists of broadcast news and a set of sentences\nfrom news read by multiple speakers. Another early speech corpora collection\nis OrienTel-TR (Çiloğlu et al., 2004), Turkish part of the multilingual Orien-\nTel project (Draxler, 2003), collecting phone recordings of pronunciations of a\nselected set of words and phrases. Arısoy et al. (2009) report a larger dataset\nof broadcast news, and a dataset of 38 000 hours of call center recordings is\nreported by Haznedaroğlu and Arslan (2014). A recent speech corpus, consist-\ning of movies with aligned subtitles, and read speech samples are reported by\nResources for Turkish Natural Language Processing\n15\nPolat and Oyucu (2020). The availability of corpora listed in this paragraph\nis unclear.\nSalor et al. (2007) report a spoken corpus of 2 462 sentences, read by 193\nspeakers with varied ages and backgrounds. Another, similar but smaller set\nof recordings are available through GlobalPhone corpus (Schultz et al., 2013),\nwhich is a collection of parallel sentences from 20 languages including Turkish.\nAnother interesting dataset where native speakers were recorded while reading\nparts of dialogues in the ATIS corpus (Hemphill et al., 1990) is reported in\nUpadhyay et al. (2018). These corpora are available for purchase through the\nLDC or the ELRA.\nTopkaya and Erdoğan (2012) report a dataset of audio/video recordings\nin which 141 Turkish speakers pronounce selected numbers, names, phrases\nand sentences in a controlled environment. Finally, it is also worth mentioning\nthe Turkish–German spoken code-switching treebank described in Section 2.9\ncontains aligned audio recordings of Turkish–German bilinguals. Both datasets\ncan be obtained by contacting the authors.\n2.13 Corpora for question answering\nAlthough a highly applicable and popular area, there have been relatively few\nTurkish resources available for question answering (QA) until recently. Early\nQA work on Turkish include short lists of question–answer pairs without the\ncontext including the answer. For example Amasyalı and Diri (2005) report\nthe use of a 524 question–answer pairs. However, to our knowledge none of\nthese datasets are made available. Similarly, Pala Er (2009) includes 105 fac-\ntoid questions and their answers as part of her thesis manuscript. Longpre\net al. (2020) present a freely-available dataset containing human translations\nof 10 000 question–answer pairs sampled from the Natural Questions dataset\n(Kwiatkowski et al., 2019) to 25 languages including Turkish. Another multilin-\ngual QA set released by Artetxe et al. (2020) includes a 1 190 human-translated\nquestion–answer pairs from Stanford Question Answering Data Set (SQuAD,\nRajpurkar et al., 2016). In a more recent study, Gemirter and Goularas (2020)\nreport both a new domain-speciﬁc dataset as well as an automatic translation\nof SQuAD. The availability of this dataset is unclear.\n2.14 Other corpora for speciﬁc applications\nThe subsections above survey the areas where a relatively large number of\nresources are available. In this subsection, we review other areas where there\nare relatively few resources, either because it is a relatively new area, or because\nthere has not been enough interest in the Turkish CL community.\nOﬀensive or aggressive language online has been a concern since the early\ndays of the Internet (Lea et al., 1992). With the increasing popularity of social\nmedia, and because of the regulations introduced against certain forms of of-\nfensive language such as hate speech online, there has been a surge of interest\n16\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nin automatic detection of various types of oﬀensive language. Currently, there\nare two Turkish corpora related to oﬀensive language. The cyberbullying cor-\npus by Özel et al. (2017) is a manually annotated corpus of 15 658 comments\ncollected from multiple social media sites. This dataset is not available. The\ncorpus reported in Çöltekin (2020) is a general oﬀensive language corpus hierar-\nchically annotated according to OﬀensEval guidelines (Zampieri et al., 2019).\nThis corpus is publicly available and consists of 36 232 manually annotated\ntweets. In addition, two recent hate speech date sets were released by research\ngroups at Aselsan (Toraman et al., 2022), at the Sabancı University (Beyhan\net al., 2022).\nNatural language inference (NLI) attracted considerable interest recently.\nThe cross-lingual NLI dataset (XNLI, Conneau et al., 2018), includes 7 500\npremise–hypothesis pairs created for English, and translated to Turkish as well\nas 13 other languages. More recently, Budur et al. (2020) released a dataset con-\nsisting of automatic translations of Stanford NLI (SNLI, Bowman et al., 2015)\nand MuliNLI (Williams et al., 2018) datasets, consisting of approximately\n570 000 and 433 000 sentence pairs, respectively. A small part of the SNLI data\n(250 sentence pairs) was also translated to Turkish earlier for a SemEval-2017\ntask (Cer et al., 2017). The data is available from the SemEval-2017 multilin-\ngual textual similarity shared task website. All NLI datasets listed above are\npublicly available.\nSummarization datasets for Turkish are also mostly from multilingual cor-\npora collection eﬀorts (e.g., Ladhak et al., 2020; Scialom et al., 2020). Almost\nall work on summarization of Turkish texts we are aware of (e.g., Kutlu et al.,\n2010; Özsoy et al., 2011) rely on automatic ways to obtain texts and their\nsummaries. However, the availability of these corpora is not clear.\nParaphrasing corpora have interesting applications such as machine transla-\ntion and determining semantic similarity. Two paraphrasing corpora in Turkish\nare introduced in Demir et al. (2012) and Eyecioğlu and Keller (2016). The\nformer study reports an unpublished (work-in-progress) corpus of 1 270 para-\nphrase pairs but it is not publicly available yet. The latter study reports a\npublicly-available corpus of 1 002 paraphrase pairs which also includes human-\nrated semantic similarities of the sentence pairs. Another textual similarity\ndataset created by automatic translation of the English STS benchmark (Cer\net al., 2017) is published by Beken Fikri et al. (2021).\nText categorization or topic modeling studies in Turkish often use oppor-\ntunistic labeling of the topics published in newspaper sections (e.g., politics,\neconomics, sports). Although there are many studies reporting such datasets,\nthey are rarely made publicly available. We only note one publicly available\ncorpus by Kılınç et al. (2017) which has become a common benchmark data\nfor later studies. This corpus consists of 3 600 news feeds (RSS) obtained from\nonline newspapers in 6 categories.\nSimilar to text categorization, stylometry related studies also typically use\nnewspaper columns scraped from online newspapers, and the corpora are not\nmade available publicly (possibly also due to copyright restrictions). Exception\nwe are aware of are a few datasets available from Yıldız Technical University\nResources for Turkish Natural Language Processing\n17\nNLP group (Amasyalı and Diri, 2006; Türkoğlu et al., 2007) and the pub-\nlicly available dataset of Twitter gender identiﬁcation corpus by Sezerer et al.\n(2019), which contains 5 292 users with more than 100 tweets each manually\nlabeled for gender.\nCoreference resolution is another task for which the quantity of resources\navailable is rather small. Earlier work on coreference resolution (Küçük and\nYöndem, 2007; Küçük and Yazıcı, 2008) report the use of annotated corpora\nwithout indication of availability. In the only publicly available corpus with\ncoreference annotation, Schüller et al. (2018) annotate all sentences of METU-\nSabancı treebank (described in Section 2.2) for coreference.\nWe also note two large multilingual COVID19-related tweet collections by\nQazi et al. (2020) and Abdul-Mageed et al. (2021). The ﬁrst corpus focuses\non tweets geo-location in many languages. Although the number of tweets in\nTurkish is not speciﬁed, the total number of tweets is about half a billion. The\nsecond corpus includes 28.5M Turkish tweets with COVID-19 related keywords.\nBoth COVID-19 datasets are available as tweet IDs. Kartal and Kutlu (2020)\npresents a dataset of Turkish 2 287 tweets labeled whether they are worth fact\nchecking or not. The dataset is available through a GitHub repository.\nLast but not the least, we note two sign-language corpora. The ﬁrst cor-\npora of Turkish sign language was introduced by Camgöz et al. (2016), and\ncontains sentences and phrases from ﬁnance and health domains. Eryiğit et al.\n(2020) present a Turkish sign language with morphological and dependency\nannotations, as well as parallel sentences in Turkish. The availability of these\ntwo corpora is unclear. Sincan and Keleş (2020) describe a publicly available\nsign language corpus. However the link provided in the article is not active at\nthe time of this writing.\n3 Lexical Resources\nIn this section we describe large lexicons and lexical networks that are built ei-\nther as standalone projects or as part of multilingual collections. The majority\nof these lexicons also provide various levels of annotations and in multilingual\ncases, they usually have a mapping to the other languages of the collection.\n3.1 Lexicons, word lists\nInkelas et al. (2000) aim at creating a Turkish Electronic Living Lexicon\n(TELL) that reﬂects actual speaker knowledge. The lexicon they built con-\nsists of 30 000 lexemes from dictionaries and place names. Nouns are inﬂected\nfor ﬁve forms and verbs are for three, more than half also have morphologi-\ncal roots. All entries have phonemic transcriptions, 17 500 of them also have\npronunciations. Moreover, 11 500 entries are annotated with their etymological\nsource language. It is possible to search the whole lexicon via a webpage which\nalso oﬀers an email address to access the database. LC-STAR (Fersøe et al.,\n18\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nTable 4 The statistics for Turkish large-scale lexicons. The ‘Additional’ column mentions\nadditional annotations. ‘etymo.’ stands for etymological source.\nLexicon\nLexemes\nAdditional\nTELL\nInkelas et al. (2000)\n30 000\nphonemic transcriptions, roots,\ninﬂected forms, etymo.\nLC-STAR\nFersøe et al. (2004)\n104 513\nphonetic transcriptions\nBabelNet\nNavigli and Ponzetto (2012)\n?\ntranslations, semantic relations\nPanlex\nKamholz et al. (2014)\n242 635\ntranslations\n2004) is a collection of lexicons for speech translation between 13 languages\nincluding Turkish. The Turkish lexicon consists of 59 213 common words (in\nsport, news, ﬁnance, culture, consumer information, and personal communica-\ntion domains) and 43 500 proper names of persons, places, and organizations.\nThe data has been originally released via ELRA but currently it is not available\nin their catalog.\nBabelNet (Navigli and Ponzetto, 2012) is a semantic network covering 284\nlanguages, It is created using WordNets, Wikipedia, and machine translation.\nThe project’s webpage oﬀers a search interface for end users and APIs for pro-\ngrammers. PanLex (Kamholz et al., 2014) builds translation lexicons for over\n5 700 languages by utilizing their dictionaries and other multilingual resources\nsuch as WordNets. The project’s webpage lists collected lexicons and available\nresources for each language. However, most links for Turkish seem to be broken.\nWhile PanLex is the largest among mentioned lexicons, it should be noted that\nsome non-Turkish entries are marked as Turkish. The lexicons, their number\nof lexemes, and additional annotations are summarized in Table 4.\nInﬂectional and derivational lexicons focus on the morphosyntactic rep-\nresentations of words. The UniMorph project (Sylak-Glassman et al., 2015;\nKirov et al., 2016) aims at building a universal schema for morphological rep-\nresentation of inﬂected forms. So far, over 120 languages are annotated (based\non their webpage) with their features in a combination of automatic extrac-\ntions from Wiktionary and collaborative eﬀorts. For Turkish, there are 275 460\ninﬂected forms of 3 579 unique entries (some are multiword expressions). The\ndata is publicly available.\nTrLex (Aslan et al., 2018) converts the word entries of the Turkish Lan-\nguage Association (TDK) dictionary into an XML format with separate ﬁelds\n(e.g., lemma, POS tag, origin, meaning, example) and annotates them with\nmorphological segmentation for derivational suﬃxes. In addition, there is a\nphonological representation that encodes how entries undergo Turkish mor-\nphophonemic rules. There are 110 960 entries in total. It is possible to obtain\nthe version with morphological segmentation and POS tags through email\ncommunication with the authors.\nUniversal Derivations (UDer, Kyjánek et al., 2019) proposes a uniﬁed\nscheme for derivational morphology. The Turkish part of the project uses Et-\nymWordNet (de Melo and Weikum, 2010) as a resource. The uniﬁed resources\nof 20 languages are currently available online. In the Turkish part, there are\nResources for Turkish Natural Language Processing\n19\n1 937 unique entries and it adds up to 7 774 derived word forms. However, there\nare also errors (e.g., most of the derivational entries are inﬂectional forms).\nOﬂazer et al. (2004) built a multiword expression extraction tool that ex-\nploits the morphological analyzer lexicon of Oﬂazer (1994) for non-lexicalized\nand semi-lexicalized multiwords. The lexicalized multiwords collected in this\nstudy are publicly available.\nZeyrek and Başıbüyük (2019) built a lexicon of discourse connectives ex-\ntracted from Turkish discourse corpora (Zeyrek et al., 2013; Zeyrek and Kurfalı,\n2017; Zeyrek et al., 2018). The lexical entries are annotated with a canonical\nform, orthographic variants, corpus frequency and POS tags. The data is part\nof a publicly available multilingual connective lexicon database.\n3.2 Morphological analyzer lexicons\nSince Turkish is a morphologically rich language, morphological analysis and\nlexical resources related to morphological analyzers have been a central com-\nponent of Turkish NLP. Early attempts of building morphological analyzers\ndate back to Köksal (1975) and Hankamer (1986). The ﬁrst practical and most\ninﬂuential morphological analyzer is by Oﬂazer (1994). This analyzer has been\nused in a large number of studies. It is also extended by Oﬂazer and Inkelas\n(2006) to produce pronunciations as well as the written forms. However, these\nresources are developed using non-free Xerox tools, and their availability and\nlicense is unclear. More recently, increased availability of free ﬁnite-state tools\n(e.g., SFST (Schmid, 2005), HFST (Lindén et al., 2009) and Foma (Hulden,\n2009)) resulted in a relatively large number of freely available morphological an-\nalyzers during the last decade. The free/open-source morphological analyzers\nwritten in conventional ﬁnite-state tools include Çöltekin (2010, implemented\nwith Xerox languages using Foma/HFST), Kayabaş et al. (2019, implemented\nwith SFST), and Öztürel et al. (2019, implemented with OpenFST). Another\npopular tool is Zemberek (Akın and Akın, 2007) which is an open-source appli-\ncation written in Java for various NLP tasks including morphological analysis.\n3.3 WordNets and other lexical networks\nA WordNet is a lexical database where lexical items (words and phrases) are\ngrouped into synonym sets (“synsets”). All synsets are organized in a tree struc-\nture with the hypernymy relation. Some synsets also bear additional semantic\nrelations such as antonymy. The original WordNet for English was built at\nPrinceton University starting in 1990 (Fellbaum, 1998) and over the years\nWordNets have been developed for more than 200 languages (Global Wordnet\nAssociation, 2020).\nThe ﬁrst Turkish WordNet (Bilgin et al., 2004; Çetinoğlu et al., 2018) is\ndeveloped as part of the BalkaNet project (Stamou et al., 2002), which has a\ndirect inﬂuence on the selection of synsets. As the main goal of the project was\n20\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nTable 5 Turkish PropBanks and their basic statistics.‘Avg. arg/prd’ stands for average\narguments per predicate.\nPropBank\nSentences\nAvg. arg/prd\nTurkish PropBank\nŞahin and Adalı (2018)\n5 635\n1.8\nTurkish PropBank\nAk et al. (2018b)\n9 560\n–\nTRopBank\nKara et al. (2020b)\n?\n1.7\nto ensure parallelism among six Balkan WordNets as well as direct mapping to\nPrinceton WordNet and to the eight WordNets of EuroWordNet (Vossen, 1998)\nthe majority of the synset concepts are translated from Princeton WordNet.\nThe remaining synsets are comprised of Balkan-speciﬁc concepts and frequent\nTurkish words. Synonyms of translated synsets and their semantic relations are\npopulated by exploiting the TDK dictionary. The Turkish WordNet is publicly\navailable.\nKeNet (Ehsani et al., 2018), on the contrary, follow a bottom-up approach\nfor creating their version of the Turkish WordNet and take the concepts\nin the TDK dictionary as their starting point. These concepts are semi-\nautomatically grouped into synsets and veriﬁed manually. They also exploit\nTurkish Wikipedia for hypernymy relations. The resulting WordNet is stan-\ndalone. This is partially improved by Bakay et al. (2019) who match 4 417\nof most frequent English senses from Princeton WordNet to KeNet synsets.\nKeNet is also publicly available.\nAnother popular lexical network is a PropBank that annotates semantic\nrelations between predicates and their arguments. The ﬁrst example is the\nEnglish PropBank (Palmer et al., 2005) and several PropBanks followed over\nthe years, including Turkish ones. The ﬁrst Turkish PropBank is annotated\nby Şahin and Adalı (2018) on top of the IMST dependency treebank. Later, it\nwas adapted to the UD version of the same treebank. The annotation scheme\nincludes numbered arguments (up to six), which correspond to the core argu-\nments of a verb (e.g., Buyer is Arg0 for the predicate buy), and 14 temporary\nroles that represent adjunct-like arguments (e.g., DIR for direction) of a verb.\nThe resource is available by requesting it via a license form.\nAnother PropBank for Turkish is constructed by Ak et al. (2018b) on\ntop of the constituency treebank of Turkish (Yıldız et al., 2014). In this case,\nnumbered arguments are up to four and nine temporary roles are employed. Ak\net al. (2018a) compare their PropBank to that of Şahin and Adalı (2018). The\nsame group has continued working on PropBanks and released TRopBank\n(Kara et al., 2020a) which employ numbered arguments up to four and a\ndiﬀerent set of semantic role labels. While the former paper has a broken link,\nthe latter version is publicly available online. The number of sentences that are\nannotated and the average of arguments per predicate are provided in Table\n5 for all PropBanks.\nConceptNet (Speer et al., 2018) is a semantic network that creates knowl-\nedge graphs from several multilingual resources such as infoboxes of Wikipedia\narticles, Wiktionary, and WordNets. The concepts are connected with intralin-\nResources for Turkish Natural Language Processing\n21\ngual and interlingual links. 304 languages take part in the project with varying\nvocabulary sizes. Turkish is in the mid-range with a vocabulary size of 65 892.\nAs a follow-up project, Speer and Lowry-Duda (2017) have developed mul-\ntilingual embeddings based on ConceptNet. Both resources are available for\ndownload.\nFrameNet (Baker et al., 1998) is a lexical database that structures predi-\ncates and their arguments as frames. The ﬁrst FrameNet is developed for En-\nglish and over the years other languages have built their FrameNets. A Turkish\nFrameNet was recently introduced (Marşan et al., 2021). It is designed to be\ncompatible with KeNet (Ehsani et al., 2018; Bakay et al., 2019) and TRop-\nBank (Kara et al., 2020b) by using the same lemma IDs. In total there are 139\nframes that include 2769 synsets, which corresponds to 4080 predicates. The\nFrameNet is available online.\n3.4 Word embeddings and pre-trained language models\nWord embeddings have gained substantial ground with the rise of neural mod-\nels. As a consequence, several pretrained models for Turkish were released,\nas well as multilingual models. For Turkish, there are Word2vec (Şen and Er-\ndoğan, 2014; Güngör and Yıldız, 2017),10 GloVe (Ferreira et al., 2016), fastText\n(Grave et al., 2018), ELMo (Che et al., 2018), and several BERT (Schweter,\n2020) models available for download. Kuriyozov et al. (2020) created cross-\nlingual fastText embeddings aligned to English embeddings for ﬁve Turkic\nlanguages. The embeddings as well as the dictionaries they used for alignments\nare publicly available. Turkish is also part of the multilingual embeddings such\nas MUSE (Conneau et al., 2017), mBERT (Devlin et al., 2019), and XLM-R\n(Conneau et al., 2020).\n3.5 Sentiment, emotion and other application-speciﬁc lexicons\nEmotion and sentiment lexicons play an important part for emotion and sen-\ntiment analysis approaches. Çakmak et al. (2012) has created an emotion\nwords lexicon for Turkish by translating EMO20Q’s list of English emotions\n(Kazemzadeh et al., 2011) and adding synonyms for some translations. The\ntotal list of 197 words is not publicly available. A more recent emotion lexicon\nis introduced by Toçoğlu and Alpkoçak (2019), which contains scores for six\nemotion categories across 4 966 lexical entries. The lexicon is available online\nfor non-commercial use.\nVural (2013) has translated SentiStrength (Thelwall et al., 2012) to obtain\na sentiment lexicon. SentiStrength assigns positive and negative scores to a set\nof words as well as creating lists of booster words, negation words, idioms, and\n10 Also at https://github.com/akoksal/Turkish-Word2Vec without an associated publi-\ncation.\n22\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nTable 6 The statistics for Turkish sentiment lexicons. For SentiTurkNet, each synset mem-\nber is counted as one token.\nSentiment Lexicon\nTokens Polarity\nTr SentiStrength\nVural (2013)\n1 366\nPos (1-5), Neg (1-5)\nMultilingualsentiment Chen and Skiena (2014)\n2 500\nPos, Neg\nSentiTurkNet\nDehkharghani et al. (2016)\n21 623\nPos (0-7),Neg (0-7),Neut\nemoticons. All lists are created also for Turkish. The paper does not provide\ninformation about the availability of the dataset.\nChen and Skiena (2014) have automatically generated sentiment lexicons\nfor 136 languages including Turkish, using English as the source language.\nThey used Wiktionary, Google Machine Translation API, and WordNets as\nmapping resources. About 60 % of the words are negative in the Turkish lexi-\ncon. The dataset is accessible via the authors’ webpage.\nDehkharghani et al. (2016) utilize Turkish WordNet (Çetinoğlu et al., 2018)\nto create a sentiment lexicon named SentiTurkNet. They ﬁrst manually label\neach synset with positive, negative, and neutral polarity. Then they make\nuse of the synset mapping between Turkish and English WordNets (Fellbaum,\n1998) so that by transitivity SentiTurkNet can inherit the polarity strength\nscores of SentiWordNet (Baccianella et al., 2010), a sentiment lexicon which is\nbuilt on top of the English WordNet. The dataset is publicly available online.\nA normalization lexicon for social media text normalization is presented in\nDemir et al. (2016). The lexicon is demonstrated to provide accurate normal-\nization, but statistics of the lexicon are not speciﬁed. The paper notes that\nthe resource is publicly available without indicating a method for obtaining it.\n4 General Discussion\nThe focus of our survey is exploring data sources for Turkish NLP applications,\ncomputational/quantitative linguistics research, as well as (digital) humanities\nresearch that may beneﬁt from linguistic data. In this section, we list some\nof our observations, followed by a short list of recommendations for future\neﬀorts on creating language resources. Although we found them to be more\nprevalent in comparison to eﬀorts for resource rich, well-studied languages,\nmost of the observations and recommendations are not speciﬁc to Turkish\nlanguage resource creation eﬀorts. We believe these recommendations could\nparticularly be useful for linguistic resource creation eﬀorts for languages for\nwhich there are relatively few data-driven studies, and the conventions and\ntraditions in the ﬁeld are not yet well established.\nAvailability and maintenance of resources Although it is not unique\nto Turkish resources, we have encountered diﬃculties about ﬁnding and/or\nconﬁrming the availability of the data sources. The locations of published re-\nsources are not always stable and/or permanent. The URLs indicating the\nlocation of the resources in papers or on the webpages of the authors or in-\nResources for Turkish Natural Language Processing\n23\nstitutions are not always maintained and the resources often disappear after\npublication. Although our eﬀorts to reach out to the authors/creators of the\nresources often yielded positive results, it is desirable to diminish these barriers\nto keep up with the fast-paced research community.\nAnother diﬃculty about the availability and maintenance of the resources\nis related to the publication traditions in other ﬁelds outside computational\nlinguistics. In particular, most papers published in general computer science\nvenues (e.g., in ACM conferences or journals) do not include information about\nthe availability of their data sources. In some ﬁelds (e.g., speech processing),\nit is more common to make the resource available for a fee which reduces their\naccessibility especially for early stage researchers or researchers with limited\nresearch budgets. In addition, the majority of published resources for Turkish\ndo not include an explicit license or ethical statement concerning collection,\ndistribution and use of the data.\nAwareness of earlier work Although it is not unique for the research pa-\npers in Turkish Computational Linguistics, earlier research/resources (either\nfor Turkish or other languages) are not cited or there is only a short list of ref-\nerences ignoring other relevant research. This results in many repetitions and\ninconsistencies in the newly created resources.11 For example, the inconsisten-\ncies and the lack of communication during the creation of diﬀerent treebanks\nfor Turkish have been brought up by multiple researchers (see Section 2.2).\nAnother, related, observation is the tendency to create new resources rather\nthan improving the existing ones. This leads to substantial eﬀort put into the\nsame work, without clear improvements over the earlier systems. For example,\ndespite the fact that some of the earlier morphological analyzers reviewed in\nSection 3.2 have been available with free licenses, a large number of new ones\nwere created without a clear statement of diﬀerence or comparison. Similar\nobservations can be made for other resources (e.g., WordNets) and annotation\ntools as well, e.g., improving existing annotation tools could be more useful\nthan creating new tools which are often used in a single project.\nAlthough most research in computational linguistics is publicly available,\nthere is also a need for better communication among scholars to inform each\nother and collaborate on the ongoing projects, eﬀorts and plans for building\nand maintaining linguistic resources. In addition, there is a need for more com-\nmunication and collaboration between linguists and computational linguists for\ncreating, annotating and analyzing language related data and resources.\nIssues about multilingual resources There is a rapid increase in the\neﬀorts of building massively multilingual resources for various tasks and appli-\ncations. We covered some of these eﬀorts in our survey as well. By necessity,\nthese eﬀorts involve either opportunistic annotations (e.g., use of already ex-\nisting information for other purposes, like word lists in Wiktionary), or rely\nheavily on crowd sourcing and/or automatic annotations. However, a potential\npitfall is the lack of quality checks for these resources which do not necessarily\n11 This criticism does not refer to the creations of similar resources from multiple indepen-\ndent groups. As the CL and NLP become more and more data driven, we deﬁnitely beneﬁt\nfrom more data, and well-informed and yet diﬀerent approaches to the same problem.\n24\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\ninvolve linguistic expertise in each language included in the resource. For ex-\nample, there are serious issues about the inﬂectional and derivational lexicons\ndiscussed in Section 3.1. Although these multilingual resources are useful in\nmany tasks, one should be aware of potential quality issues as well.\nIssues about translated resources Like for other languages, automatic\nor manual translations of large datasets created originally for English are also\ntranslated to Turkish. Although this approach is interesting as it yields par-\nallel resources, the resource created in this manner includes eﬀects of ‘trans-\nlationese’, as well as additional errors that may be introduced during the\ntranslation process. Translated datasets may even include correct translations\nthat are not appropriate for a particular task. For example, as noted by Budur\net al. (2020), the inferential relation for two English sentences may be reversed\nwhen translated to Turkish, because Turkish pronouns are gender-neutral. In\ngeneral, the same type of inference in the original language may not be applica-\nble in the translation. Similar problems are diﬃcult to prevent with automatic\ntranslations or non-expert human translations performed without paying at-\ntention to the purpose of the dataset.\nIssues about quantity and quality With respect to the quantity of\nresources, Turkish may be considered close to a ‘resource-rich’ language. For\nexample, Turkish has the largest number of treebanks (together with English)\nin the Universal Dependencies repositories (as of UD version 2.1). However,\nmost Turkish treebanks are smaller in size in comparison to treebanks in other\nlanguages, and quality and inconsistency issues have been raised in multiple\nearlier studies (see Section 2.2 for a short discussion and pointers to relevant\npapers). The same trend can be observed in other types of resources as well.\nFor example, Aksan and Aksan (2018) report partial results of a question-\nnaire conducted in 2011, where Turkish NLP specialists were asked to rate\nthe quantity and quality of the available corpora on a scale of 0 to 6. The\nresults indicate rather low judgments, 1.9 for quantity and 2.9 for quality.12\nAlthough the quantity issues seem less of a problem currently, the number of\nlinguistic resources for Turkish are still relatively low compared to well-studied\nEuropean languages.\nOverall, it is diﬃcult to qualify Turkish as a ‘low-resource language’ based\non the breadth and depth of the resources available. However, the resources\nare rather scattered across diﬀerent ﬁelds, and there are issues of availability\nand quality. In sum, it is probably apt to classify Turkish as a ‘resource poor’\nlanguage (following the terminology used by Zaghouani (2014) for Arabic).\nDescriptions of datasets A related problem in the publications intro-\nducing resources is the lack of suﬃcient descriptions. In some cases, even the\nbasic statistics about the data are not presented or it is diﬃcult to interpret\nthe statistics due to unclear units of measurements. There is also a need for\nbetter descriptions of proper quality assurance procedures, metrics and inter-\nannotator agreements (IAA). Lack of proper linguistic glosses and translations\n12 The complete results of the questionnaire are not published. Hence, the wording of the\nquestions, and the type of corpora queried are not clear.\nResources for Turkish Natural Language Processing\n25\nin the provided examples also create extra barriers for readers without any\nTurkish background to understand and evaluate the research article and/or\nthe data resource.\nGaps in the existing resources Although there are a number of sources\nfor (social media) text normalization, we are not aware of any publications on\ndatasets of spelling or grammar errors.13 Similarly, there is no known learner\ncorpus or resources that can help second language research and practice for\nTurkish.\nAnother general area with no or little resources is semantics. Except for\nthe lexical resources listed in Section 3, we are not aware of any semantically\nannotated corpora (e.g., one that would be used for semantic parsing). There\nis also a lack of benchmark datasets for assessing pre-trained word or text\nrepresentations (word embeddings, or pre-trained language models). So far,\nmost linguistic resources available for Turkish aim to be domain independent.\nIf a resource is domain-speciﬁc, it is often due to practical reasons rather\nthan a speciﬁc interest in this particular domain. On the other hand, domain-\nspeciﬁc data is crucial for NLP applications. Although the uses of unpublished\ndatasets were reported in earlier literature (e.g., a corpus of radiology reports\nby Hadımlı and Yöndem, 2011), there is a big gap in domain-speciﬁc datasets\nfor critical domains or sub-ﬁelds like biomedical, legal or ﬁnancial NLP.\nThere is also a need for more systematic data collection and analysis of\ndialectal and sociolinguistic variation with easy-to-access language resources\n(Doğruöz, forthcoming).\nA concise list of recommendations The issues raised above in this\nsection have some rather obvious solutions. Nevertheless, the concise list below\nmay be beneﬁcial for future resource creation eﬀorts.\n– Publish your corpora, and publish it on permanent (or long-lasting) venues.\nBeyond the value of the published data and code for reproducibility, pub-\nlished data allows others to study the data in ways creators of the data\ncannot possibly foresee. Furthermore, growing evidence suggests that the\npapers that publish their data get more recognition (Wieling et al., 2018;\nColavizza et al., 2020). It is also important to publish the data in locations\nthat would not disappear shortly after the publication. Our experience\nin this survey shows that the data shared through personal and also in-\nstitutional webpages often become inaccessible as authors move to other\ninstitutions, or their research interests change. As a result, publishing the\ndata in general repositories like Zenodo and OSF, or CLARIN repositories\nthat are more specialized for language resources is a better choice than\npersonal and institutional webpages. Similarly, to our experience, software\ndevelopment infrastructures like GitHub also provide stable locations for\npublishing linguistic data.\n– Describe all aspects of the corpora adequately. As we occasionally noted\nabove, a large number of papers we reviewed do not describe the resources\n13 A new spelling dictionary with an associated tool has been announced during the ﬁnal\nrevisions of this paper.\n26\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nintroduced suﬃciently. It is important for a paper to include information\non aspects of the corpora such as, size, label distribution, source material,\nsampling method, as well as indications of annotation quality (e.g., IAA)\nin proper units and using proper metrics for the task at hand. Being aware\nof the earlier recommendations (e.g., Ide et al., 2017; Bender and Friedman,\n2018; Gebru et al., 2020) for resource creation eﬀorts and their descriptions\nwould be useful for any annotation or curation project.\n– Be explicit about the licensing and potential ethical issues. Although major\ncomputational linguistics venues started to require statements about legal\nand ethical aspects of data collection and sharing, not all the venues require\nsuch statements. It is important to be aware of the existing guidelines, such\nas ACM code of ethics (Gotterbarn et al., 2018), or the guidelines adapted\nby major CL conferences,14 as well as the recent discussion in the ﬁeld (e.g.,\nŠuster et al., 2017; Rogers et al., 2021). Even though the common guidelines\nmay not ﬁt every task, or every legal jurisdiction, being aware of potential\nissues, and being explicit about the legal and ethical considerations during\ndata collection and annotation is important. The lack of clarity around\nthese issues may also reduce the usability of the data (and hence, the\nrecognition the creators may receive).\n– Before creating a new resource, perform a thorough literature review of the\nrelevant research, consider improving existing resources, and collaborating\nwith other scholars in the ﬁeld. As evidenced by the lack of citations in\npublished papers, most resources are built from scratch, not paying at-\ntention to the lessons learned in the earlier work. The quality of linguistic\nresources could be improved by awareness of earlier work and more collabo-\nration between diﬀerent groups. Besides individual eﬀorts from researchers\nand reviewers, a regular meeting of CL/NLP researchers and practition-\ners working on Turkish (and possibly Turkic languages) may help alleviate\nthis problem. Although a number of ‘ﬁrst attempts’ were made for such\nmeetings, unlike many other CL communities, no regular/stable meeting\nhas been established so far.\n– Contribute to multilingual resource creation eﬀorts. One of the issues we\nobserved above with large-scale, multilingual resources is the lack of quality\nin Turkish data in these eﬀorts. Bringing the language expertise of Turkish\n(computational) linguists in these projects would deﬁnitely improve the\nquality of these eﬀorts, which, in turn, would be beneﬁcial to the CL/NLP\nstudies in Turkish.\n5 Conclusion\nOur goal in this survey was to present a comprehensive summary of language\nresources NLP and computational/quantitative linguistic research for Turkish.\nIn addition to the resources listed in our survey, we also provide a companion\n14 For example, NAACL guidelines at https://2021.naacl.org/ethics/faq/ which is also\nadapted by some of the other major CL conferences.\nResources for Turkish Natural Language Processing\n27\nwebsite (https://turkishnlp.github.io) which includes links to even more\nTurkish resources, and we will update it regularly. In this way, our survey\nand the companion website will serve as stable and sustainable resources for\nresearchers across disciplines (e.g., linguistics, NLP) who are currently working\non Turkish. In addition, researchers who are not currently working on Turkish\nbut who need linguistic resources outside their current expertise and/or those\nwho are interested in including Turkish in multi- or cross-lingual tasks could\nbeneﬁt from our contribution as well.\nBesides the comprehensive overview of the resources, we have also sum-\nmarized some of the common problematic issues and gaps in the ﬁeld and\nprovided a set of short suggestions for future resource creation eﬀorts. We\ncautiously note that not all the problematic issues could easily be resolved\nby individual researchers and research groups immediately. Some of these is-\nsues require long-term collaborative eﬀorts within the community as well as\nsubstantial support from academic funding agencies for further research. The\nissues we raise in this paper are based on our impression from published pa-\npers and cursory inspection of the available corpora. To understand the factors\nbehind these issues better and propose informed solutions, future studies with\nin-depth analyses (e.g., through questionnaires directed to creators and users\nof the resources, or more systematic inspection of the available data) can be\nhelpful. Similarly, eﬀectiveness of the guidelines (oﬀered in papers we cite in\nSection 4) may also be measured in future experimental studies.\nIn short, we hope that our survey and its companion webpage will serve as\na useful reference for locating resources for existing fundamental and applied\nresearch and for creating future resources and projects for Turkish and/or\nother languages.\nReferences\nAbdelali, Ahmed, Francisco Guzman, Hassan Sajjad, and Stephan Vogel (2014). “The\nAMARA Corpus: Building Parallel Language Resources for the Educational Domain”.\nIn: Proceedings of the Ninth International Conference on Language Resources and\nEvaluation (LREC’14). Reykjavik, Iceland: European Language Resources Association\n(ELRA), pp. 1856–1862. url: http://www.lrec-conf.org/proceedings/lrec2014/pdf\n/877_Paper.pdf.\nAbdul-Mageed, Muhammad, AbdelRahim Elmadany, El Moatez Billah Nagoudi, Dinesh\nPabbi, Kunal Verma, and Rannie Lin (2021). “Mega-COV: A Billion-Scale Dataset of\n100+ Languages for COVID-19”. In: Proceedings of the 16th Conference of the Euro-\npean Chapter of the Association for Computational Linguistics: Main Volume. Online:\nAssociation for Computational Linguistics, pp. 3402–3420. url: https://www.aclweb.o\nrg/anthology/2021.eacl-main.298.\nAgić, Željko and Ivan Vulić (2019). “JW300: A Wide-Coverage Parallel Corpus for Low-\nResource Languages”. In: Proceedings of the 57th Annual Meeting of the Association for\nComputational Linguistics. Florence, Italy: Association for Computational Linguistics,\npp. 3204–3210. doi: 10.18653/v1/P19-1310. url: https://www.aclweb.org/anthology\n/P19-1310.\nAk, Koray, Özge Bakay, and Olcay Taner Yıldız (2018a). “Comparison of Turkish Proposi-\ntion Banks by Frame Matching”. In: 2018 3rd International Conference on Computer\nScience and Engineering (UBMK), pp. 352–356. doi: 10.1109/UBMK.2018.8566426.\n28\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nAk, Koray, Cansu Toprak, Volkan Esgel, and Olcay Taner Yıldız (2018b). “Construction of\na Turkish proposition bank”. In: Turkish Journal of Electrical Engineering & Computer\nSciences 26.1, pp. 570–581.\nAkçakaya, Sinan and Olcay Taner Yıldız (2018). “An all-words sense annotated Turkish cor-\npus”. In: 2018 2nd International Conference on Natural Language and Speech Processing\n(ICNLSP), pp. 1–6. doi: 10.1109/ICNLSP.2018.8374368.\nAkın, Ahmet Afşın and Mehmet Dündar Akın (2007). “Zemberek, an open source NLP\nframework for Turkic languages”. In: Structure 10, pp. 1–5.\nAksan, Mustafa and Yeşim Aksan (2018). “Linguistic corpora: A view from Turkish”. In:\nTurkish Natural Language Processing. Springer, pp. 291–315.\nAksan, Yeşim, Mustafa Aksan, Ahmet Koltuksuz, Taner Sezer, Ümit Mersinli, Umut Ufuk\nDemirhan, Hakan Yılmazer, Gülsüm Atasoy, Seda Öz, İpek Yıldız, and Özlem Kurtoğlu\n(2012). “Construction of the Turkish National Corpus (TNC)”. In: Proceedings of the\nEighth International Conference on Language Resources and Evaluation (LREC’12).\nIstanbul, Turkey: European Language Resources Association (ELRA), pp. 3223–3227.\nurl: http://www.lrec-conf.org/proceedings/lrec2012/pdf/991_Paper.pdf.\nAksu-Koç, Ayhan and Dan Isaac Slobin (1985). “The Acquisition of Turkish”. In: The\nCrosslinguistic Study of Language Acquisition. Ed. by Dan Isaac Slobin. Vol. 1. Lawrence\nErlbaum Associates. Chap. 9, pp. 839–878.\nAltınkamış, Feyza (2012). Turkish Altınkamış Corpus. doi: 10.21415/T5H89W. url: http\n://childes.talkbank.org/access/Other/Turkish/Altinkamis.html.\nAltınkamış Türkay, Feyza (2005). “Children’s early lexicon in terms of noun/verb domi-\nnance”. PhD thesis. Çukurova University. url: https://tez.yok.gov.tr/UlusalTezMe\nrkezi/TezGoster?key=vbVkXe1KChYWNElr1MuLZkSZIFvXBJpcL-G5wtalqSvAlPjIZeecxgY\neEKGMm7xZ.\nAltıntaş, Kemal (2001). “Turkish to Crimean Tatar machine translation system”. MA thesis.\nBilkent University.\nAmasyalı, M Fatih and Banu Diri (2005). “Bir soru cevaplama sistemi: Baybilmiş”. In:\nTürkiye Bilişim Vakfı Bilgisayar Bilimleri ve Mühendisliği Dergisi 1.1.\nAmasyalı, M Fatih and Banu Diri (2006). “Automatic Turkish text categorization in terms\nof author, genre and gender”. In: International Conference on Application of Natural\nLanguage to Information Systems. Springer, pp. 221–226.\nArdila, Rosana, Megan Branson, Kelly Davis, Michael Kohler, Josh Meyer, Michael Henretty,\nReuben Morais, Lindsay Saunders, Francis Tyers, and Gregor Weber (2020). “Common\nVoice: A Massively-Multilingual Speech Corpus”. In: Proceedings of the 12th Language\nResources and Evaluation Conference. Marseille, France: European Language Resources\nAssociation, pp. 4218–4222. isbn: 979-10-95546-34-4. url: https://www.aclweb.org/an\nthology/2020.lrec-1.520.\nArısoy, Ebru, Doğan Can, Sıddıka Parlak, Haşim Sak, and Murat Saraçlar (2009). “Turkish\nbroadcast news transcription and retrieval”. In: IEEE Transactions on Audio, Speech,\nand Language Processing 17.5, pp. 874–883.\nArslan, Recep Sinan and Necaattin Barışçı (2020). “A detailed survey of Turkish automatic\nspeech recognition”. In: Turkish Journal of Electrical Engineering & Computer Sciences\n28.6, pp. 3253–3269.\nArtetxe, Mikel, Sebastian Ruder, and Dani Yogatama (2020). “On the Cross-lingual Trans-\nferability of Monolingual Representations”. In: Proceedings of the 58th Annual Meet-\ning of the Association for Computational Linguistics. Online: Association for Com-\nputational Linguistics, pp. 4623–4637. doi: 10.18653/v1/2020.acl- main.421. url:\nhttps://www.aclweb.org/anthology/2020.acl-main.421.\nAslan, Özkan, Serkan Günal, and B Taner Dinçer (2018). “A computational morphological\nlexicon for Turkish: Trlex”. In: Lingua 206, pp. 21–34.\nAtalay, Nart B., Kemal Oﬂazer, and Bilge Say (2003). “The Annotation Process in the\nTurkish Treebank”. In: Proceedings of 4th International Workshop on Linguistically\nInterpreted Corpora (LINC-03) at EACL 2003. url: https://www.aclweb.org/anthol\nogy/W03-2405.\nAtaman, Duygu (2018). “Bianet: A Parallel News Corpus in Turkish, Kurdish and English”.\nIn: Proceedings of the Eleventh International Conference on Language Resources and\nEvaluation (LREC 2018). Ed. by Jinhua Du, Mihael Arcan, Qun Liu, and Hitoshi Isa-\nResources for Turkish Natural Language Processing\n29\nhara. Miyazaki, Japan: European Language Resources Association (ELRA). isbn: 979-\n10-95546-15-3.\nBaccianella, Stefano, Andrea Esuli, and Fabrizio Sebastiani (2010). “SentiWordNet 3.0: An\nEnhanced Lexical Resource for Sentiment Analysis and Opinion Mining”. In: Proceed-\nings of the Seventh International Conference on Language Resources and Evaluation\n(LREC’10). Valletta, Malta: European Language Resources Association (ELRA). url:\nhttp://www.lrec-conf.org/proceedings/lrec2010/pdf/769_Paper.pdf.\nBakay, Özge, Ergelen Özlem, and Olcay Taner Yıldız (2019). “Integrating Turkish WordNet\nKeNet to Princeton WordNet: The Case of One-to-Many Correspondences”. In: 2019\nInnovations in Intelligent Systems and Applications Conference (ASYU), pp. 1–5. doi:\n10.1109/ASYU48272.2019.8946386.\nBaker, Collin F, Charles J Fillmore, and John B Lowe (1998). “The Berkeley FrameNet\nProject”. In: 36th Annual Meeting of the Association for Computational Linguistics\nand 17th International Conference on Computational Linguistics, Volume 1, pp. 86–90.\nBeken Fikri, Figen, Kemal Oﬂazer, and Berrin Yanikoglu (2021). “Semantic Similarity Based\nEvaluation for Abstractive News Summarization”. In: Proceedings of the 1st Workshop\non Natural Language Generation, Evaluation, and Metrics (GEM 2021). Online: Asso-\nciation for Computational Linguistics, pp. 24–33. doi: 10.18653/v1/2021.gem-1.3. url:\nhttps://aclanthology.org/2021.gem-1.3.\nBender, Emily M and Batya Friedman (2018). “Data statements for natural language pro-\ncessing: Toward mitigating system bias and enabling better science”. In: Transactions\nof the Association for Computational Linguistics 6, pp. 587–604.\nBeyhan, Fatih, Buse Çarık, İnanç Arın, Ayşecan Terzioğlu, Berrin Yanikoglu, and Reyyan\nYeniterzi (2022). “A Turkish Hate Speech Dataset and Detection System”. In: Proceed-\nings of the Language Resources and Evaluation Conference. Marseille, France: European\nLanguage Resources Association, pp. 4177–4185. url: https://aclanthology.org/202\n2.lrec-1.443.\nBilgin, Orhan, Özlem Çetinoğlu, and Kemal Oﬂazer (2004). “Building a WordNet for Turk-\nish”. In: Romanian Journal of Information Science and Technology 7.1-2, pp. 163–172.\nBojar, Ondřej, Rajen Chatterjee, Christian Federmann, Yvette Graham, Barry Haddow,\nMatthias Huck, Antonio Jimeno Yepes, Philipp Koehn, Varvara Logacheva, Christof\nMonz, Matteo Negri, Aurélie Névéol, Mariana Neves, Martin Popel, Matt Post, Raphael\nRubino, Carolina Scarton, Lucia Specia, Marco Turchi, Karin Verspoor, and Marcos\nZampieri (2016). “Findings of the 2016 Conference on Machine Translation”. In: Pro-\nceedings of the First Conference on Machine Translation: Volume 2, Shared Task Pa-\npers. Berlin, Germany: Association for Computational Linguistics, pp. 131–198. doi:\n10.18653/v1/W16-2301. url: https://www.aclweb.org/anthology/W16-2301.\nBowman, Samuel R., Gabor Angeli, Christopher Potts, and Christopher D. Manning (2015).\n“A large annotated corpus for learning natural language inference”. In: Proceedings of\nthe 2015 Conference on Empirical Methods in Natural Language Processing. Lisbon,\nPortugal: Association for Computational Linguistics, pp. 632–642. doi: 10.18653/v1/D\n15-1075. url: https://www.aclweb.org/anthology/D15-1075.\nBoynukalın, Zeynep (2012). “Emotion analysis of Turkish texts by using machine learning\nmethods”. MA thesis. Middle East Technical University.\nBudur, Emrah, Rıza Özçelik, Tunga Güngör, and Christopher Potts (2020). “Data and\nRepresentation for Turkish Natural Language Inference”. In: Proceedings of the 2020\nConference on Empirical Methods in Natural Language Processing (EMNLP). Online:\nAssociation for Computational Linguistics, pp. 8253–8267. url: https://www.aclweb.o\nrg/anthology/2020.emnlp-main.662.\nBurga, Alicia, Alp Öktem, and Leo Wanner (2017). “Revising the METU-Sabancı Turkish\nTreebank: An Exercise in Surface-Syntactic Annotation of Agglutinative Languages”. In:\nProceedings of the Fourth International Conference on Dependency Linguistics (Depling\n2017). Pisa, Italy: Linköping University Electronic Press, pp. 32–41. url: https://www\n.aclweb.org/anthology/W17-6506.\nBurnard, Lou, ed. (2000). The British National Corpus Users Reference Guide. url: http\n://www.natcorp.ox.ac.uk/docs/userManual/.\nÇakmak, Ozan, Abe Kazemzadeh, Serdar Yıldırım, and Shri Narayanan (2012). “Using in-\nterval type-2 fuzzy logic to analyze Turkish emotion words”. In: Proceedings of The\n30\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\n2012 Asia Paciﬁc Signal and Information Processing Association Annual Summit and\nConference. IEEE, pp. 1–4.\nCamgöz, Necati Cihan, Ahmet Alp Kındıroğlu, Serpil Karabüklü, Meltem Kelepir, Ayşe\nSumru Özsoy, and Lale Akarun (2016). “BosphorusSign: A Turkish Sign Language\nRecognition Corpus in Health and Finance Domains”. In: Proceedings of the Tenth In-\nternational Conference on Language Resources and Evaluation (LREC’16). Portorož,\nSlovenia: European Language Resources Association (ELRA), pp. 1383–1388. url: htt\nps://aclanthology.org/L16-1220.\nÇarık, Buse and Reyyan Yeniterzi (2022). “A Twitter Corpus for Named Entity Recogni-\ntion in Turkish”. In: Proceedings of the Language Resources and Evaluation Confer-\nence. Marseille, France: European Language Resources Association, pp. 4546–4551. url:\nhttps://aclanthology.org/2022.lrec-1.484.\nCattoni, Roldano, Mattia Antonino Di Gangi, Luisa Bentivogli, Matteo Negri, and Marco\nTurchi (2021). “MuST-C: A multilingual corpus for end-to-end speech translation”. In:\nComputer Speech & Language 66, p. 101155.\nÇelikkaya, Gökhan, Dilara Torunoğlu, and Gülşen Eryiğit (2013). “Named entity recognition\non real data: a preliminary investigation for Turkish”. In: 2013 7th International Con-\nference on Application of Information and Communication Technologies. IEEE, pp. 1–\n5.\nCer, Daniel, Mona Diab, Eneko Agirre, Iñigo Lopez-Gazpio, and Lucia Specia (2017).\n“SemEval-2017 Task 1: Semantic Textual Similarity Multilingual and Crosslingual Fo-\ncused Evaluation”. In: Proceedings of the 11th International Workshop on Semantic\nEvaluation (SemEval-2017). Vancouver, Canada: Association for Computational Lin-\nguistics, pp. 1–14. doi: 10.18653/v1/S17-2001. url: https://www.aclweb.org/anthol\nogy/S17-2001.\nÇetinoğlu, Özlem (2016). “A Turkish-German Code-Switching Corpus”. In: Proceedings of\nthe Tenth International Conference on Language Resources and Evaluation (LREC\n2016). Ed. by Nicoletta Calzolari (Conference Chair), Khalid Choukri, Thierry Declerck,\nSara Goggi, Marko Grobelnik, Bente Maegaard, Joseph Mariani, Helene Mazo, Asun-\ncion Moreno, Jan Odijk, and Stelios Piperidis. Portorož, Slovenia: European Language\nResources Association (ELRA), pp. 23–28. isbn: 978-2-9517408-9-1.\nÇetinoğlu, Özlem (2017). “A Code-Switching Corpus of Turkish-German Conversations”. In:\nProceedings of the 11th Linguistic Annotation Workshop. Valencia, Spain: Association\nfor Computational Linguistics, pp. 34–40. doi: 10.18653/v1/W17-0804. url: https://a\nclanthology.org/W17-0804.\nÇetinoğlu, Özlem, Orhan Bilgin, and Kemal Oﬂazer (2018). “Turkish Wordnet”. In: ed. by\nKemal Oﬂazer and Murat Saraçlar. Theory and Applications of Natural Language Pro-\ncessing. Springer International Publishing. Chap. 15, pp. 317–336. isbn: 9783319901657.\nÇetinoğlu, Özlem and Çağrı Çöltekin (2016). “Part of Speech Annotation of a Turkish-\nGerman Code-Switching Corpus”. In: Proceedings of the 10th Linguistic Annotation\nWorkshop held in conjunction with ACL 2016 (LAW-X 2016). Berlin, Germany: Asso-\nciation for Computational Linguistics, pp. 120–130. doi: 10.18653/v1/W16-1714. url:\nhttps://www.aclweb.org/anthology/W16-1714.\nÇetinoğlu, Özlem and Çağrı Çöltekin (2019). “Challenges of Annotating a Code-Switching\nTreebank”. In: Proceedings of the 18th International Workshop on Treebanks and Lin-\nguistic Theories (TLT, SyntaxFest 2019). Paris, France: Association for Computational\nLinguistics, pp. 82–90. doi: 10.18653/v1/W19-7809. url: https://www.aclweb.org/an\nthology/W19-7809.\nÇetinoğlu, Özlem and Çağrı Çöltekin (2022). “Two languages, one treebank: building a\nTurkish–German code-switching treebank and its challenges”. In: Language Resources\nand Evaluation, pp. 1–35. issn: 1574-020X. doi: 10.1007/s10579-021-09573-1.\nCettolo, Mauro, Jan Niehues, Sebastian Stüker, Luisa Bentivogli, and Marcello Federico\n(2013). “Report on the 10th IWSLT evaluation campaign”. In: Proceedings of the Inter-\nnational Workshop on Spoken Language Translation. Heidelberg, Germany.\nChe, Wanxiang, Yijia Liu, Yuxuan Wang, Bo Zheng, and Ting Liu (2018). “Towards Better\nUD Parsing: Deep Contextualized Word Embeddings, Ensemble, and Treebank Con-\ncatenation”. In: Proceedings of the CoNLL 2018 Shared Task: Multilingual Parsing from\nResources for Turkish Natural Language Processing\n31\nRaw Text to Universal Dependencies. Brussels, Belgium: Association for Computational\nLinguistics, pp. 55–64. url: http://www.aclweb.org/anthology/K18-2005.\nChen, Yanqing and Steven Skiena (2014). “Building Sentiment Lexicons for All Major Lan-\nguages”. In: Proceedings of the 52nd Annual Meeting of the Association for Compu-\ntational Linguistics (Volume 2: Short Papers). Baltimore, Maryland: Association for\nComputational Linguistics, pp. 383–389. doi: 10.3115/v1/P14-2063. url: https://www\n.aclweb.org/anthology/P14-2063.\nÇiloğlu, Tolga, Dinç Acar, and Ahmet Tokatlı (2004). “OrienTel-Turkish: Telephone Speech\nDatabase Description and Notes on the Experience”. In: Eighth International Conference\non Spoken Language Processing.\nYıldırım, Ezgi, Fatih Samet Çetin, Gülşen Eryiğit, and Tanel Temel (2014). “The Impact of\nNLP on Turkish Sentiment Analysis”. In: Türkiye Bilişim Vakfı Bilgisayar Bilimleri ve\nMühendisliği Dergisi 7 (1), pp. 43–51.\nÇolakoğlu, Talha, Umut Sulubacak, and Ahmet Cüneyd Tantuğ (2019). “Normalizing Non-\ncanonical Turkish Texts Using Machine Translation Approaches”. In: Proceedings of\nthe 57th Annual Meeting of the Association for Computational Linguistics: Student\nResearch Workshop. Florence, Italy: Association for Computational Linguistics, pp. 267–\n272. doi: 10.18653/v1/P19-2037. url: https://www.aclweb.org/anthology/P19-2037.\nColavizza, Giovanni, Iain Hrynaszkiewicz, Isla Staden, Kirstie Whitaker, and Barbara\nMcGillivray (2020). “The citation advantage of linking publications to research data”.\nIn: PLOS ONE 15.4, pp. 1–18. doi: 10.1371/journal.pone.0230416. url: https://do\ni.org/10.1371/journal.pone.0230416.\nÇöltekin, Çağrı (2010). “A Freely Available Morphological Analyzer for Turkish”. In: Pro-\nceedings of the 7th International Conference on Language Resources and Evaluation\n(LREC 2010), pp. 820–827. url: http://www.lrec-conf.org/proceedings/lrec2010\n/summaries/109.html.\nÇöltekin, Çağrı (2015a). “A grammar-book treebank of Turkish”. In: Proceedings of the\n14th workshop on Treebanks and Linguistic Theories (TLT 14). Ed. by Markus Dickin-\nson, Erhard Hinrichs, Agnieszka Patejuk, and Adam Przepiórkowski. Warsaw, Poland,\npp. 35–49.\nÇöltekin, Çağrı (2015b). “Turkish NLP web services in the WebLicht environment”. In:\nProceedings of the CLARIN Annual Conference.\nÇöltekin, Çağrı (2016). “(When) do we need inﬂectional groups?” In: Proceedings of The\nFirst International Conference on Turkic Computational Linguistics.\nÇöltekin, Çağrı (2020). “A Corpus of Turkish Oﬀensive Language on Social Media”. In: Pro-\nceedings of The 12th Language Resources and Evaluation Conference. Marseille, France,\npp. 6174–6184. url: https://www.aclweb.org/anthology/2020.lrec-1.758.\nConneau, Alexis, Kartikay Khandelwal, Naman Goyal, Vishrav Chaudhary, Guillaume Wen-\nzek, Francisco Guzmán, Edouard Grave, Myle Ott, Luke Zettlemoyer, and Veselin Stoy-\nanov (2020). “Unsupervised Cross-lingual Representation Learning at Scale”. In: Pro-\nceedings of the 58th Annual Meeting of the Association for Computational Linguistics.\nOnline: Association for Computational Linguistics, pp. 8440–8451. doi: 10.18653/v1/2\n020.acl-main.747. url: https://www.aclweb.org/anthology/2020.acl-main.747.\nConneau, Alexis, Guillaume Lample, Marc’Aurelio Ranzato, Ludovic Denoyer, and Hervé Jé-\ngou (2017). “Word Translation Without Parallel Data”. In: arXiv preprint arXiv:1710.04087.\nConneau, Alexis, Ruty Rinott, Guillaume Lample, Adina Williams, Samuel Bowman, Hol-\nger Schwenk, and Veselin Stoyanov (2018). “XNLI: Evaluating Cross-lingual Sentence\nRepresentations”. In: Proceedings of the 2018 Conference on Empirical Methods in Nat-\nural Language Processing. Brussels, Belgium: Association for Computational Linguistics,\npp. 2475–2485. doi: 10.18653/v1/D18-1269. url: https://www.aclweb.org/anthology\n/D18-1269.\nDayanık, Erenay, Ekin Akyürek, and Deniz Yüret (2018). “MorphNet: A sequence-to-\nsequence model that combines morphological analysis and disambiguation”. In: CoRR\nabs/1805.07946. url: http://arxiv.org/abs/1805.07946.\nDehkharghani, Rahim, Yücel Saygın, Berrin Yanıkoğlu, and Kemal Oﬂazer (2016). “Senti-\nTurkNet: a Turkish polarity lexicon for sentiment analysis”. In: Language Resources and\nEvaluation, pp. 1–19.\n32\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nDe Marneﬀe, Marie-Catherine, Christopher D. Manning, Joakim Nivre, and Daniel Zeman\n(2021). “Universal Dependencies”. In: Computational Linguistics 47.2, pp. 255–308. issn:\n0891-2017. doi: 10.1162/coli_a_00402.\nDe Melo, Gerard and Gerhard Weikum (2010). “Towards Universal Multilingual Knowl-\nedge Bases”. In: Principles, Construction, and Applications of Multilingual WordNets.\nProceedings of the 5th Global WordNet Conference (GWC 2010). Ed. by Pushpak Bhat-\ntacharyya, Christiane Fellbaum, and Piek Vossen. Mumbai, India: Narosa Publishing,\npp. 149–156. isbn: 978-81-8487-083-1. url: http://citeseerx.ist.psu.edu/viewdoc/s\nummary?doi=10.1.1.194.2529.\nDemir, Şeniz, İlknur Durgar El-Kahlout, Erdem Ünal, and Hamza Kaya (2012). “Turkish\nParaphrase Corpus”. In: Proceedings of the Eighth International Conference on Lan-\nguage Resources and Evaluation (LREC’12). Istanbul, Turkey: European Language Re-\nsources Association (ELRA), pp. 4087–4091. url: http://www.lrec-conf.org/procee\ndings/lrec2012/pdf/968_Paper.pdf.\nDemir, Şeniz, Murat Tan, and Berkay Topcu (2016). “Turkish Normalization Lexicon for\nSocial Media”. In: Computational Linguistics and Intelligent Text Processing: 17th In-\nternational Conference, CICLing, pp. 418–429.\nDemirci, Sinem (2014). “Emotion analysis on Turkish tweets”. MA thesis. Middle East Tech-\nnical University.\nDemirtaş, Erkin and Mykola Pechenizkiy (2013). “Cross-lingual polarity detection with ma-\nchine translation”. In: Proceedings of the Second International Workshop on Issues of\nSentiment Discovery and Opinion Mining, pp. 1–8.\nDevlin, Jacob, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova (2019). “BERT: Pre-\ntraining of Deep Bidirectional Transformers for Language Understanding”. In: Proceed-\nings of the 2019 Conference of the North American Chapter of the Association for\nComputational Linguistics: Human Language Technologies, Volume 1 (Long and Short\nPapers). Minneapolis, Minnesota: Association for Computational Linguistics, pp. 4171–\n4186. doi: 10.18653/v1/N19-1423. url: https://www.aclweb.org/anthology/N19-142\n3.\nDi Gangi, Mattia A., Roldano Cattoni, Luisa Bentivogli, Matteo Negri, and Marco Turchi\n(2019). “MuST-C: a Multilingual Speech Translation Corpus”. In: Proceedings of the\n2019 Conference of the North American Chapter of the Association for Computational\nLinguistics: Human Language Technologies, Volume 1 (Long and Short Papers). Min-\nneapolis, Minnesota: Association for Computational Linguistics, pp. 2012–2017. doi:\n10.18653/v1/N19-1202. url: https://www.aclweb.org/anthology/N19-1202.\nDoğruöz, A. Seza (forthcoming). “Documenting Sociolinguistic Variation in Turkish”. In:\nRoutledge Handbook of Variationist Sociolinguistics. Ed. by Yoshi Asahi, Alexandra\nD’arcy, and Paul Kerswill. UK: Routledge. Forthcoming.\nDraxler, Chr. (2003). “Orientel: Recording telephone speech of Turkish speakers in Ger-\nmany”. In: Proceedings of the Eighth European Conference on Speech Communication\nand Technology, pp. 1557–1560.\nDurgar El-Kahlout, İlknur, Emre Bektaş, Naime Şeyma Erdem, and Hamza Kaya (2019).\n“Translating Between Morphologically Rich Languages: An Arabic-to-Turkish Machine\nTranslation System”. In: Proceedings of the Fourth Arabic Natural Language Processing\nWorkshop. Florence, Italy: Association for Computational Linguistics, pp. 158–166. doi:\n10.18653/v1/W19-4617. url: https://www.aclweb.org/anthology/W19-4617.\nDurgar El-Kahlout, İlknur and Kemal Oﬂazer (2010). “Exploiting morphology and local\nword reordering in English-to-Turkish phrase-based statistical machine translation”. In:\nIEEE transactions on audio, speech, and language processing 18.6, pp. 1313–1322.\nEberhard, David M., Gary F. Simons, and Charles D. Fennig, eds. (2020). Ethnologue:\nLanguages of the World. Online version: http://www.ethnologue.com. Dallas, Texas.\nEhsani, Razieh, Ercan Solak, and Olcay Taner Yıldız (2018). “Constructing a WordNet for\nTurkish using manual and automatic annotation”. In: ACM Transactions on Asian and\nLow-Resource Language Information Processing (TALLIP) 17.3, pp. 1–15.\nEisenstein, Jacob (2013). “What to do about bad language on the Internet”. In: Proceedings\nof the 2013 Conference of the North American Chapter of the Association for Compu-\ntational Linguistics: Human Language Technologies. Atlanta, Georgia: Association for\nResources for Turkish Natural Language Processing\n33\nComputational Linguistics, pp. 359–369. url: https://www.aclweb.org/anthology/N1\n3-1037.\nEken, Beyza and Cüneyd A Tantug (2015). “Recognizing named entities in Turkish tweets”.\nIn: Proceedings of the Fourth International Conference on Software Engineering and\nApplications. Dubai, UAE.\nErjavec, Tomaž, Maciej Ogrodniczuk, Petya Osenova, Nikola Ljubešić, Kiril Simov, Vladislava\nGrigorova, Michał Rudolf, Andrej Pančur, Matyáš Kopp, Starkaður Barkarson, Steinþór\nSteingrímsson, Henk van der Pol, Griet Depoorter, Jesse de Does, Bart Jongejan,\nDorte Haltrup Hansen, Costanza Navarretta, María Calzada Pérez, Luciana D. de\nMacedo, Ruben van Heusden, Maarten Marx, Çağrı Çöltekin, Matthew Coole, Tom-\nmaso Agnoloni, Francesca Frontini, Simonetta Montemagni, Valeria Quochi, Giulia\nVenturi, Manuela Ruisi, Carlo Marchetti, Roberto Battistoni, Miklós Sebők, Orsolya\nRing, Roberts Dar ‘gis, Andrius Utka, Mindaugas Petkevičius, Monika Briedien˙e, Tomas\nKrilavičius, Vaidas Morkevičius, Roberto Bartolini, Andrea Cimino, Sascha Diwersy,\nGiancarlo Luxardo, and Paul Rayson (2021). Linguistically annotated multilingual\ncomparable corpora of parliamentary debates ParlaMint.ana 2.1. Slovenian language\nresource repository CLARIN.SI. url: http://hdl.handle.net/11356/1431.\nErjavec, Tomaž, Maciej Ogrodniczuk, Petya Osenova, Nikola Ljubešić, Kiril Simov, Andrej\nPančur, Michał Rudolf, Matyáš Kopp, Starkaður Barkarson, Steinþór Steingrímsson,\nÇağrı Çöltekin, Jesse de Does, Katrien Depuydt, Tommaso Agnoloni, Giulia Venturi,\nMaría Calzada Pérez, Luciana D. de Macedo, Costanza Navarretta, Giancarlo Luxardo,\nMatthew Coole, Paul Rayson, Vaidas Morkevičius, Tomas Krilavičius, Roberts Dar´gis,\nOrsolya Ring, Ruben van Heusden, Maarten Marx, and Darja Fišer (2022). “The Par-\nlaMint corpora of parliamentary proceedings”. In: Language Resources and Evaluation.\ndoi: 10.1007/s10579-021-09574-0.\nEryiğit, Gülşen (2014). “ITU Turkish NLP Web Service”. In: Proceedings of the Demonstra-\ntions at the 14th Conference of the European Chapter of the Association for Compu-\ntational Linguistics. Gothenburg, Sweden: Association for Computational Linguistics,\npp. 1–4. doi: 10.3115/v1/E14-2001. url: https://www.aclweb.org/anthology/E14-20\n01.\nEryiğit, Gülşen, Cihat Eryiğit, Serpil Karabüklü, Meltem Kelepir, Aslı Özkul, Tuğba Pamay,\nDilara Torunoğlu-Selamet, and Hatice Köse (2020). “Building the ﬁrst comprehensive\nmachine-readable Turkish sign language resource: methods, challenges and solutions”.\nIn: Language Resources and Evaluation 54.1, pp. 97–121.\nEryiˇgit, Gülşen and Dilara Torunoˇglu-Selamet (2017). “Social media text normalization for\nTurkish”. In: Natural Language Engineering 23.6, pp. 835–875. doi: 10.1017/S1351324\n917000134.\nEyecioğlu, Aslı and Bill Keller (2016). “Constructing a Turkish corpus for paraphrase identi-\nﬁcation and semantic similarity”. In: International Conference on Intelligent Text Pro-\ncessing and Computational Linguistics. Springer, pp. 588–599.\nFellbaum, Christiane (1998). WordNet: An Electronic Lexical Database. Language, Speech\nand Communication. MIT Press. isbn: 9780262061971.\nFerreira, Daniel C., André F. T. Martins, and Mariana S. C. Almeida (2016). “Jointly\nLearning to Embed and Predict with Multiple Languages”. In: Proceedings of the 54th\nAnnual Meeting of the Association for Computational Linguistics (Volume 1: Long\nPapers). Berlin, Germany: Association for Computational Linguistics, pp. 2019–2028.\ndoi: 10.18653/v1/P16-1190. url: https://www.aclweb.org/anthology/P16-1190.\nFersøe, Hanne, Elviira Hartikainen, Henk van den Heuvel, Giulio Maltese, Asunción Moreno,\nShaunie Shammass, and Ute Ziegenhain (2004). “Creation and Validation of Large Lex-\nica for Speech-to-Speech Translation Purposes”. In: Proceedings of the Fourth Inter-\nnational Conference on Language Resources and Evaluation, LREC 2004, May 26-28,\n2004, Lisbon, Portugal. European Language Resources Association. url: http://www.l\nrec-conf.org/proceedings/lrec2004/summaries/452.htm.\nForcada, Mikel L, Mireia Ginestí-Rosell, Jacob Nordfalk, Jim O’Regan, Sergio Ortiz-Rojas,\nJuan Antonio Pérez-Ortiz, Felipe Sánchez-Martínez, Gema Ramírez-Sánchez, and Fran-\ncis M Tyers (2011). “Apertium: a free/open-source platform for rule-based machine\ntranslation”. In: Machine translation 25.2, pp. 127–144.\n34\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nFrancis, W. Nelson and Henry Kučera (1979). Brown corpus manual: Manual of Information\nto Accompany a Standard Corpus of Present-Day Edited American English for Use with\nDigital Computers. Brown University. Providence, USA.\nGebru, Timnit, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna\nWallach, Hal Daumé III, and Kate Crawford (2020). Datasheets for Datasets. arXiv:\n1803.09010 [cs.DB].\nGemirter, Cavide Balkı and Dionysis Goularas (2020). “A Turkish Question Answering Sys-\ntem Based on Deep Learning Neural Networks”. In: Journal of Intelligent Systems:\nTheory and Applications 4.2, pp. 65–75.\nGerdes, Kim, Bruno Guillaume, Sylvain Kahane, and Guy Perrier (2018). “SUD or Surface-\nSyntactic Universal Dependencies: An annotation scheme near-isomorphic to UD”. In:\nProceedings of the Second Workshop on Universal Dependencies (UDW 2018). Brussels,\nBelgium: Association for Computational Linguistics, pp. 66–74. doi: 10.18653/v1/W18\n-6008. url: https://www.aclweb.org/anthology/W18-6008.\nGilmullin, RA (2008). “The Tatar-Turkish machine translation based on the two-level mor-\nphological analyzer”. In: Interactive Systems and Technologies: The Problems of Human-\nComputer Interaction, pp. 179–186.\nGinter, Filip, Jan Hajič, Juhani Luotolahti, Milan Straka, and Daniel Zeman (2017).\nCoNLL 2017 Shared Task - Automatically Annotated Raw Texts and Word Embed-\ndings. LINDAT/CLARIAH-CZ digital library at the Institute of Formal and Applied\nLinguistics (ÚFAL), Faculty of Mathematics and Physics, Charles University. url:\nhttp://hdl.handle.net/11234/1-1989.\nGlobal Wordnet Association (2020). Wordnets in the World. http://globalwordnet.org/w\nordnets-in-the-world. Accessed: November 30, 2020.\nGökırmak, Memduh, Francis Tyers, and Jonathan Washington (2019). “Machine Translation\nfor Crimean Tatar to Turkish”. In: Proceedings of the 2nd Workshop on Technologies\nfor MT of Low Resource Languages. Dublin, Ireland: European Association for Machine\nTranslation, pp. 24–31. url: https://www.aclweb.org/anthology/W19-6805.\nGotterbarn, Don, Bo Brinkman, Catherine Flick, Michael S Kirkpatrick, Keith Miller, Kate\nVaransky, Marty J Wolf, Eve Anderson, Ron Anderson, Amy Bruckman, Karla Carter,\nMichael Davis, Penny Duquenoy, Jeremy Epstein, Kai Kimppa, Lorraine Kisselburgh,\nShrawan Kumar, Andrew McGettrick, Natasa Milic-Frayling, Denise Oram, Simon\nRogerson, David Shamma, Janice Sipior, Eugene Spaﬀord, and Les Waguespack (2018).\nACM Code of Ethics and Professional Conduct. url: https://www.acm.org/code-of\n-ethics.\nGöz, İlyas, ed. (2003). Yazılı Türkçenin kelime sıklığı sözlüğü. Türk Dil Kurumu.\nGrave, Edouard, Piotr Bojanowski, Prakhar Gupta, Armand Joulin, and Tomas Mikolov\n(2018). “Learning Word Vectors for 157 Languages”. In: Proceedings of the International\nConference on Language Resources and Evaluation (LREC 2018).\nGüngör, O. and E. Yıldız (2017). “Linguistic features in Turkish word representations”. In:\n2017 25th Signal Processing and Communications Applications Conference (SIU), pp. 1–\n4. doi: 10.1109/SIU.2017.7960223.\nHadımlı, Kerem and Meltem Turhan Yöndem (2011). “Two Alternate Methods for Informa-\ntion Retrieval from Turkish Radiology Reports”. In: Computer and Information Sciences\nII. Springer, pp. 527–532.\nHakkani-Tür, Dilek Z., Kemal Oﬂazer, and Gökhan Tür (2002). “Statistical Morphological\nDisambiguation for Agglutinative Languages”. In: Computers and the Humanities 36.4,\npp. 381–410.\nHamzaoğlu, İlker (1993). “Machine translation from Turkish to other Turkic languages and\nan implementation for the Azeri language”. MA thesis. Boğazici University.\nHankamer, Jorge (1986). “Finite state morphology and left to right phonology”. In: Proceed-\nings of the West Coast Conference on Formal Linguistics. Vol. 5. Stanford Linguistic\nAssociation.\nHayran, Ahmet and Mustafa Sert (2017). “Sentiment analysis on microblog data based on\nword embedding and fusion techniques”. In: 2017 25th Signal Processing and Commu-\nnications Applications Conference (SIU), pp. 1–4.\nResources for Turkish Natural Language Processing\n35\nHaznedaroğlu, Ali and Levent M Arslan (2014). “Language model adaptation for automatic\ncall transcription”. In: 2014 IEEE International Conference on Acoustics, Speech and\nSignal Processing (ICASSP). IEEE, pp. 4102–4106.\nHemphill, Charles T., John J. Godfrey, and George R. Doddington (1990). “The ATIS Spo-\nken Language Systems Pilot Corpus”. In: Proceedings of the Workshop on Speech and\nNatural Language. HLT ’90. Hidden Valley, Pennsylvania: Association for Computa-\ntional Linguistics, pp. 96–101. doi: 10.3115/116580.116613.\nHulden, Mans (2009). “Foma: a ﬁnite-state compiler and library”. In: Proceedings of the 12th\nConference of the European Chapter of the Association for Computational Linguistics:\nDemonstrations Session. Association for Computational Linguistics, pp. 29–32.\nIde, Nancy, Nicoletta Calzolari, Judith Eckle-Kohler, Dafydd Gibbon, Sebastian Hellmann,\nKiyong Lee, Joakim Nivre, and Laurent Romary (2017). “Community standards for\nlinguistically-annotated resources”. In: Handbook of Linguistic Annotation. Springer,\npp. 113–165.\nİlgen, Bahar, Eşref Adalı, and A Cüneyd Tantuğ (2012). “Building up lexical sample dataset\nfor Turkish word sense disambiguation”. In: 2012 International Symposium on Innova-\ntions in Intelligent Systems and Applications. IEEE, pp. 1–5.\nInkelas, Sharon, Aylin Küntay, C. Orhan Orgun, and Ronald Sprouse (2000). “Turkish\nElectronic Living Lexicon (TELL): A Lexical Database”. In: Proceedings of the Second\nInternational Conference on Language Resources and Evaluation (LREC’00). Athens,\nGreece: European Language Resources Association (ELRA). url: http://www.lrec-co\nnf.org/proceedings/lrec2000/pdf/86.pdf.\nKamholz, David, Jonathan Pool, and Susan Colowick (2014). “PanLex: Building a Resource\nfor Panlingual Lexical Translation”. In: Proceedings of the Ninth International Confer-\nence on Language Resources and Evaluation (LREC’14). Reykjavik, Iceland: European\nLanguage Resources Association (ELRA), pp. 3145–3150. url: http://www.lrec-conf\n.org/proceedings/lrec2014/pdf/1029_Paper.pdf.\nKara, Neslihan, Deniz Baran Aslan, Büşra Marşan, Özge Bakay, Koray Ak, and Olcay\nTaner Yıldız (2020a). “TRopBank: Turkish PropBank V2.0”. In: Proceedings of The 12th\nLanguage Resources and Evaluation Conference. Marseille, France: European Language\nResources Association, pp. 2763–2772. url: https://www.aclweb.org/anthology/2020\n.lrec-1.336.\nKara, Neslihan, Büşra Marşan, Merve Özçelik, Bilge Nas Arıcan, Aslı Kuzgun, Neslihan\nCesur, Deniz Baran Aslan, and Olcay Taner Yıldız (2020b). “Creating A Syntactically Fe-\nlicitous Constituency Treebank For Turkish”. In: 2020 Innovations in Intelligent Systems\nand Applications Conference (ASYU), pp. 1–6. doi: 10.1109/ASYU50717.2020.9259873.\nKartal, Yavuz Selim and Mucahid Kutlu (2020). “TrClaim-19: The First Collection for\nTurkish Check-Worthy Claim Detection with Annotator Rationales”. In: Proceedings of\nthe 24th Conference on Computational Natural Language Learning. Online: Association\nfor Computational Linguistics, pp. 386–395. doi: 10.18653/v1/2020.conll-1.31. url:\nhttps://aclanthology.org/2020.conll-1.31.\nKaya, Mesut (2013). “Sentiment analysis of Turkish political columns with transfer learning”.\nMA thesis. Middle East Technical University.\nKayabaş, Ayla, Helmut Schmid, Ahmet Ercan Topcu, and Özkan Kılıç (2019). “TRMOR: a\nﬁnite-state-based morphological analyzer for Turkish”. In: Turkish Journal of Electrical\nEngineering & Computer Sciences 27.5, pp. 3837–3851.\nKayadelen, Tolga, Adnan Öztürel, and Bernd Bohnet (2020). “A Gold Standard Dependency\nTreebank for Turkish”. In: Proceedings of The 12th Language Resources and Evaluation\nConference. Marseille, France: European Language Resources Association, pp. 5156–\n5163. isbn: 979-10-95546-34-4. url: https://www.aclweb.org/anthology/2020.lrec-1\n.634.\nKazemzadeh, Abe, Sungbok Lee, Panayiotis G Georgiou, and Shrikanth S Narayanan (2011).\n“Emotion twenty questions: Toward a crowd-sourced theory of emotions”. In: Interna-\ntional Conference on Aﬀective Computing and Intelligent Interaction. Springer, pp. 1–\n10.\nKirov, Christo, John Sylak-Glassman, Roger Que, and David Yarowsky (2016). “Very-large\nScale Parsing and Normalization of Wiktionary Morphological Paradigms”. In: Proceed-\nings of the Tenth International Conference on Language Resources and Evaluation\n36\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\n(LREC’16). Portorož, Slovenia: European Language Resources Association (ELRA),\npp. 3121–3126. url: https://www.aclweb.org/anthology/L16-1498.\nKılınç, Deniz, Akın Özçift, Fatma Bozyiğit, Pelin Yıldırım, Fatih Yücalar, and Emin Boran-\ndağ (2017). “TTC-3600: A new benchmark dataset for Turkish text categorization”. In:\nJournal of Information Science 43.2, pp. 174–185. doi: 10.1177/0165551515620551.\nKöksal, A (1975). “A ﬁrst approach to a computerized model for the automatic morphological\nanalysis of Turkish”. PhD thesis. Hacettepe University, Ankara.\nKöksal, Asiye Tuba, Özge Bozal, Emre Yürekli, and Gizem Gezici (2020). “#Turki$hTweets:\nA Benchmark Dataset for Turkish Text Correction”. In: Findings of the Association\nfor Computational Linguistics: EMNLP 2020. Online: Association for Computational\nLinguistics, pp. 4190–4198. url: https://www.aclweb.org/anthology/2020.findings\n-emnlp.374.\nKolobov, Rostislav, Olga Okhapkina, Olga Omelchishina, Andrey Platunov, Roman\nBedyakin, Vyacheslav Moshkin, Dmitry Menshikov, and Nikolay Mikhaylovskiy (2021).\n“MediaSpeech: Multilanguage ASR Benchmark and Dataset”. In: arXiv preprint\narXiv:2103.16193.\nKüçük, Dilek and Fazlı Can (2019). A Tweet Dataset Annotated for Named Entity Recog-\nnition and Stance Detection. arXiv: 1901.04787 [cs.CL].\nKüçük, Dilek, Guillaume Jacquet, and Ralf Steinberger (2014). “Named Entity Recognition\non Turkish Tweets”. In: Proceedings of the Ninth International Conference on Lan-\nguage Resources and Evaluation (LREC’14). Reykjavik, Iceland: European Language\nResources Association (ELRA), pp. 450–454. url: http://www.lrec-conf.org/procee\ndings/lrec2014/pdf/380_Paper.pdf.\nKüçük, Dilek and Adnan Yazıcı (2008). “Identiﬁcation of coreferential chains in video texts\nfor semantic annotation of news videos”. In: 2008 23rd International Symposium on\nComputer and Information Sciences. IEEE, pp. 1–6.\nKüçük, Dilek and Meltem Turhan Yöndem (2007). “Automatic identiﬁcation of pronominal\nAnaphora in Turkish texts”. In: 2007 22nd international symposium on computer and\ninformation sciences. IEEE, pp. 1–6.\nKuriyozov, Elmurod, Yerai Doval, and Carlos Gómez-Rodríguez (2020). “Cross-Lingual\nWord Embeddings for Turkic Languages”. In: Proceedings of The 12th Language Re-\nsources and Evaluation Conference. Marseille, France: European Language Resources\nAssociation, pp. 4054–4062. url: https://www.aclweb.org/anthology/2020.lrec-1.4\n99.\nKutlu, Mücahid and İlyas Çiçekli (2013). “A Hybrid Morphological Disambiguation System\nfor Turkish”. In: Proceedings of the Sixth International Joint Conference on Natural\nLanguage Processing. Nagoya, Japan: Asian Federation of Natural Language Processing,\npp. 1230–1236. url: https://www.aclweb.org/anthology/I13-1175.\nKutlu, Mücahid, Celal Çığır, and İlyas Çiçekli (2010). “Generic text summarization for\nTurkish”. In: The Computer Journal 53.8, pp. 1315–1323.\nKwiatkowski, Tom, Jennimaria Palomaki, Olivia Redﬁeld, Michael Collins, Ankur Parikh,\nChris Alberti, Danielle Epstein, Illia Polosukhin, Jacob Devlin, Kenton Lee, Kristina\nToutanova, Llion Jones, Matthew Kelcey, Ming-Wei Chang, Andrew M. Dai, Jakob\nUszkoreit, Quoc Le, and Slav Petrov (2019). “Natural Questions: A Benchmark for\nQuestion Answering Research”. In: Transactions of the Association for Computational\nLinguistics 7, pp. 452–466. doi: 10.1162/tacl_a_00276. url: https://www.aclweb.org\n/anthology/Q19-1026.\nKyjánek, Lukáš, Zdeněk Žabokrtský, Magda Ševčíková, and Jonáš Vidra (2019). “Univer-\nsal Derivations Kickoﬀ: A Collection of Harmonized Derivational Resources for Eleven\nLanguages”. In: Proceedings of the Second International Workshop on Resources and\nTools for Derivational Morphology. Prague, Czechia: Charles University, Faculty of\nMathematics, Physics, Institute of Formal, and Applied Linguistics, pp. 101–110. url:\nhttps://www.aclweb.org/anthology/W19-8512.\nLadhak, Faisal, Esin Durmuş, Claire Cardie, and Kathleen McKeown (2020). “WikiLingua:\nA New Benchmark Dataset for Cross-Lingual Abstractive Summarization”. In: Findings\nof the Association for Computational Linguistics: EMNLP 2020. Online: Association\nfor Computational Linguistics, pp. 4034–4048. doi: 10.18653/v1/2020.findings-emnl\np.360. url: https://www.aclweb.org/anthology/2020.findings-emnlp.360.\nResources for Turkish Natural Language Processing\n37\nLea, Martin, Tim O’Shea, Pat Fung, and Russell Spears (1992). “‘Flaming’in computer-\nmediated communication: Observations, explanations, implications.” In: Contexts of\nComputer-Mediated Communication. Ed. by Martin Lea. Harvester Wheatsheaf, pp. 89–\n112.\nLewis, William D (2006). “ODIN: A model for adapting and enriching legacy infrastructure”.\nIn: 2006 Second IEEE International Conference on e-Science and Grid Computing (e-\nScience’06). IEEE, pp. 137–137.\nLindén, Krister, Miikka Silfverberg, and Tommi Pirinen (2009). “HFST Tools for Morphology–\nAn Eﬃcient Open-Source Package for Construction of Morphological Analyzers”. In:\nState of the Art in Computational Morphology. Ed. by Cerstin Mahlow and Michael\nPiotrowski, pp. 28–47.\nLongpre, Shayne, Yi Lu, and Joachim Daiber (2020). MKQA: A Linguistically Diverse\nBenchmark for Multilingual Open Domain Question Answering. url: https://arxiv.o\nrg/pdf/2007.15207.pdf.\nMacWhinney, Brian and Catherine Snow (1985). “The child language data exchange system”.\nIn: Journal of Child Language 12.2, pp. 271–269. doi: 10.1017/S0305000900006449.\nMarcus, Mitchell P., Beatrice Santorini, and Mary Ann Marcinkiewicz (1993). “Building a\nLarge Annotated Corpus of English: The Penn Treebank”. In: Computational Linguistics\n19.2, pp. 313–330. url: https://www.aclweb.org/anthology/J93-2004.\nMarşan, Büşra, Neslihan Kara, Merve Özçelik, Bilge Nas Arıcan, Neslihan Cesur, Aslı\nKuzgun, Ezgi Sanıyar, Oğuzhan Kuyrukçu, and Olcay Taner Yıldız (2021). “Build-\ning the Turkish FrameNet”. In: Proceedings of the 11th Global Wordnet Conference.\nUniversity of South Africa (UNISA): Global Wordnet Association, pp. 118–125. url:\nhttps://aclanthology.org/2021.gwc-1.14.\nMegyesi, Beáta, Bengt Dahlqvist, Éva Á. Csató, and Joakim Nivre (2010). “The English-\nSwedish-Turkish Parallel Treebank”. In: Proceedings of the Seventh International Con-\nference on Language Resources and Evaluation (LREC’10). Valletta, Malta: European\nLanguage Resources Association (ELRA). url: http://www.lrec-conf.org/proceedin\ngs/lrec2010/pdf/116_Paper.pdf.\nMegyesi, Beáta, Bengt Dahlqvist, Eva Pettersson, and Joakim Nivre (2008). “Swedish-\nTurkish Parallel Treebank”. In: Proceedings of the Sixth International Conference on\nLanguage Resources and Evaluation (LREC’08). Marrakech, Morocco: European Lan-\nguage Resources Association (ELRA). url: http://www.lrec-conf.org/proceedings\n/lrec2008/pdf/121_paper.pdf.\nMengüşoğlu, Erhan and Olivier Deroo (2001). “Turkish LVCSR: Database Preparation and\nLanguage Modeling for an Aglutinative Language”. In: IEEE International Conference\non Acoustics Speech And Signal Processing. Vol. 6. IEEE; 1999, pp. 4018–4018.\nMoran, Steven, Robert Schikowski, Danicai Pajović, Cazim Hysi, and Sabine Stoll (2015).\nThe ACQDIV Corpus: a comparative longitudinal language acquisition corpus. Version\n1.0.\nNavigli, Roberto and Simone Paolo Ponzetto (2012). “BabelNet: The automatic construction,\nevaluation and application of a wide-coverage multilingual semantic network”. In: Artiﬁ-\ncial Intelligence 193, pp. 217–250. issn: 0004-3702. doi: 10.1016/j.artint.2012.07.001.\nurl: http://www.sciencedirect.com/science/article/pii/S0004370212000793.\nNguyen, Dong and A. Seza Doğruöz (2013). “Word Level Language Identiﬁcation in Online\nMultilingual Communication”. In: Proceedings of the 2013 Conference on Empirical\nMethods in Natural Language Processing. Seattle, Washington, USA: Association for\nComputational Linguistics, pp. 857–862. url: https://www.aclweb.org/anthology/D1\n3-1084.\nNguyen, Dong, A. Seza Doğruöz, Carolyn P. Rosé, and Franciska de Jong (2016). “Compu-\ntational Sociolinguistics: A Survey”. In: Computational Linguistics 42.3, pp. 537–593.\ndoi: 10.1162/COLI\\_a\\_00258.\nNivre, Joakim, Marie-Catherine de Marneﬀe, Filip Ginter, Yoav Goldberg, Jan Hajič,\nChristopher Manning, Ryan McDonald, Slav Petrov, Sampo Pyysalo, Natalia Silveira,\nReut Tsarfaty, and Daniel Zeman (2016). “Universal Dependencies v1: A Multilin-\ngual Treebank Collection”. In: Proceedings of the Tenth International Conference on\nLanguage Resources and Evaluation (LREC’16), pp. 23–28.\n38\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nOﬂazer, Kemal (1994). “Two-level description of Turkish morphology”. In: Literary and\nLinguistic Computing 9.2.\nOﬂazer, Kemal, Özlem Çetinoğlu, and Bilge Say (2004). “Integrating Morphology with Multi-\nword Expression Processing in Turkish”. In: Proceedings of the Workshop on Multiword\nExpressions: Integrating Processing. Barcelona, Spain: Association for Computational\nLinguistics, pp. 64–71. url: https://aclanthology.org/W04-0409.\nOﬂazer, Kemal and Sharon Inkelas (2006). “The architecture and the implementation of a\nﬁnite state pronunciation lexicon for Turkish”. In: Computer Speech & Language 20.1,\npp. 80–106.\nOﬂazer, Kemal and Murat Saraçlar, eds. (2018). Turkish Natural Language Processing. The-\nory and Applications of Natural Language Processing. Springer International Publishing.\nisbn: 9783319901657.\nOﬂazer, Kemal, Bilge Say, Dilek Zeynep Hakkani-Tür, and Gökhan Tür (2003). “Building\na Turkish treebank”. In: Treebanks: Building and Using Parsed Corpora. Ed. by Anne\nAbeillé. Springer. Chap. 15, pp. 261–277.\nOﬂazer, Kemal, Reyyan Yeniterzi, and İlknur Durgar-El Kahlout (2018). “Statistical Ma-\nchine Translation and Turkish”. In: ed. by Kemal Oﬂazer and Murat Saraçlar. Theory\nand Applications of Natural Language Processing. Springer International Publishing.\nChap. 10, pp. 207–236. isbn: 9783319901657.\nOrhan, Zeynep, Emine Çelik, and Neslihan Demirgüç (2007). “SemEval-2007 Task 12: Turk-\nish Lexical Sample Task”. In: Proceedings of the Fourth International Workshop on\nSemantic Evaluations (SemEval-2007). Prague, Czech Republic: Association for Com-\nputational Linguistics, pp. 59–63. url: https://www.aclweb.org/anthology/S07-1011.\nOrtiz Suárez, Pedro Javier, Laurent Romary, and Benoît Sagot (2020). “A Monolingual\nApproach to Contextualized Word Embeddings for Mid-Resource Languages”. In: Pro-\nceedings of the 58th Annual Meeting of the Association for Computational Linguistics.\nOnline: Association for Computational Linguistics, pp. 1703–1714. url: https://www.a\nclweb.org/anthology/2020.acl-main.156.\nOrtiz Suárez, Pedro Javier, Benoît Sagot, and Laurent Romary (2019). “Asynchronous\npipelines for processing huge corpora on medium to low resource infrastructures”. In: ed.\nby Piotr Bański, Adrien Barbaresi, Hanno Biber, Evelyn Breiteneder, Simon Clematide,\nMarc Kupietz, Harald Lüngen, and Caroline Iliadi. Proceedings of the Workshop on\nChallenges in the Management of Large Corpora (CMLC-7) 2019. Cardiﬀ, 22nd July\n2019. Mannheim: Leibniz-Institut für Deutsche Sprache, pp. 9–16. doi: 10.14618/ids\n-pub-9021. url: http://nbn-resolving.de/urn:nbn:de:bsz:mh39-90215.\nÖzel, Selma Ayşe, Erhan Öztürk, and Esra Saraç Eşsiz (2017). “A New Dataset for Cyber-\nbully Detection from Turkish Texts”. In: 5th International Conference on Natural and\nEngineering Sciences (ICNES). IEEE, pp. 366–370.\nÖzsoy, Makbule Gülçin, Ferda Nur Alpaslan, and İlyas Çiçekli (2011). “Text summarization\nusing latent semantic analysis”. In: Journal of Information Science 37.4, pp. 405–417.\nÖztürel, Adnan, Tolga Kayadelen, and Işın Demirşahin (2019). “A Syntactically Expressive\nMorphological Analyzer for Turkish”. In: Proceedings of the 14th International Con-\nference on Finite-State Methods and Natural Language Processing. Dresden, Germany:\nAssociation for Computational Linguistics, pp. 65–75. doi: 10.18653/v1/W19-3110. url:\nhttps://www.aclweb.org/anthology/W19-3110.\nPala Er, Nagehan (2009). “Turkish factoid question answering using answer pattern match-\ning”. MA thesis. Bilkent University.\nPalmer, Martha, Daniel Gildea, and Paul Kingsbury (2005). “The Proposition Bank: An\nAnnotated Corpus of Semantic Roles”. In: Computational Linguistics 31.1, pp. 71–106.\ndoi: 10.1162/0891201053630264. url: https://www.aclweb.org/anthology/J05-1004.\nPamay, Tuğba, Umut Sulubacak, Dilara Torunoğlu-Selamet, and Gülşen Eryiğit (2015).\n“The Annotation Process of the ITU Web Treebank”. In: Proceedings of The 9th Lin-\nguistic Annotation Workshop. Denver, Colorado, USA: Association for Computational\nLinguistics, pp. 95–101. doi: 10.3115/v1/W15-1610. url: https://www.aclweb.org/an\nthology/W15-1610.\nPapalexakis, Evangelos, Dong Nguyen, and A. Seza Doğruöz (2014). “Predicting Code-\nswitching in Multilingual Communication for Immigrant Communities”. In: Proceedings\nof the First Workshop on Computational Approaches to Code Switching. Doha, Qatar:\nResources for Turkish Natural Language Processing\n39\nAssociation for Computational Linguistics, pp. 42–50. doi: 10.3115/v1/W14-3905. url:\nhttps://www.aclweb.org/anthology/W14-3905.\nPaul, Michael, Marcello Federico, and Sebastian Stüker (2010). “Overview of the IWSLT\n2010 evaluation campaign”. In: International Workshop on Spoken Language Translation\n(IWSLT) 2010.\nPolat, Hüseyin and Saadin Oyucu (2020). “Building a Speech and Text Corpus of Turkish:\nLarge Corpus Collection with Initial Speech Recognition Results”. In: Symmetry 12.2,\np. 290.\nQazi, Umair, Muhammad Imran, and Ferda Oﬂi (2020). “GeoCoV19: A dataset of hundreds\nof millions of multilingual COVID-19 tweets with location information”. In: SIGSPA-\nTIAL Special 12.1, pp. 6–15.\nQuasthoﬀ, Uwe, Dirk Goldhahn, and Thomas Eckart (2014). “Building Large Resources\nfor Text Mining: The Leipzig Corpora Collection”. In: Text Mining. Ed. by Chris Bie-\nmann and Alexander Mehler. Theory and Applications of Natural Language Processing.\nSpringer, pp. 3–24. isbn: 978-3-319-12654-8. doi: 10.1007/978-3-319-12655-5_1.\nRajpurkar, Pranav, Jian Zhang, Konstantin Lopyrev, and Percy Liang (2016). “SQuAD:\n100,000+ Questions for Machine Comprehension of Text”. In: Proceedings of the 2016\nConference on Empirical Methods in Natural Language Processing. Austin, Texas: As-\nsociation for Computational Linguistics, pp. 2383–2392. doi: 10.18653/v1/D16-1264.\nurl: https://www.aclweb.org/anthology/D16-1264.\nRogers, Anna, Timothy Baldwin, and Kobi Leins (2021). “‘Just What do You Think You’re\nDoing, Dave?’ A Checklist for Responsible Data Use in NLP”. In: Findings of the Associ-\nation for Computational Linguistics: EMNLP 2021. Punta Cana, Dominican Republic:\nAssociation for Computational Linguistics, pp. 4821–4833. doi: 10.18653/v1/2021.fin\ndings-emnlp.414. url: https://aclanthology.org/2021.findings-emnlp.414.\nRothweiler, Monika (2011). Turkish-German Successive-Bilinguals Corpus (TÜ_DE_cL2\nHamburg). Version 0.1. Publication date 2011-06-30. url: http://hdl.handle.net/110\n22/0000-0000-7D90-1.\nRuhi, Şükriye, Betil Eröz-Tuğa, Çiler Hatipoğlu, Hale Işık-Güler, M Güneş Can Acar, Kerem\nEryılmaz, Hümeyra Can, Özlem Karakaş, and Derya Çokal Karadaş (2010). “Sustaining\na corpus for spoken Turkish discourse: Accessibility and corpus management issues”. In:\nProceedings of the Workshop on Language Resources: From Storyboard to Sustainability\nand LR Lifecycle Management. Vol. 44.\nRuhi, Şükriye, Kerem Eryılmaz, and M Güneş Can Acar (2012). “A Platform for Creating\nMultimodal and Multilingual Spoken Corpora for Turkic Languages: Insights from the\nSpoken Turkish Corpus”. In: Proceedings of the First Workshop on Language Resources\nand Technologies for Turkic Languages, pp. 57–63.\nSafaya, Ali, Emirhan Kurtuluş, Arda Göktoğan, and Deniz Yüret (May 2022). “Mukayese:\nTurkish NLP Strikes Back”. In: Findings of the Association for Computational Linguis-\ntics: ACL 2022. Dublin, Ireland: Association for Computational Linguistics, pp. 846–\n863. doi: 10.18653/v1/2022.findings-acl.69. url: https://aclanthology.org/2022\n.findings-acl.69.\nŞahin, Gözde Gül and Eşref Adalı (2018). “Annotation of semantic roles for the Turkish\nproposition bank”. In: Language Resources and Evaluation 52.3, pp. 673–706.\nSak, Haşim, Tunga Güngör, and Murat Saraçlar (2008). “Turkish language resources: Mor-\nphological parser, morphological disambiguator and web corpus”. In: International Con-\nference on Natural Language Processing (GoTAL 2008). Springer, pp. 417–427.\nSak, Haşim, Tunga Güngör, and Murat Saraçlar (2011). “Resources for Turkish morpholog-\nical processing”. In: Language resources and evaluation 45.2, pp. 249–261.\nSalor, Özgül, Bryan L. Pellom, Tolga Çiloğlu, and Mübeccel Demirekler (2007). “Turkish\nspeech corpora and recognition tools developed by porting SONIC: Towards multilingual\nspeech recognition”. In: Computer Speech & Language 21.4, pp. 580–593. issn: 0885-2308.\ndoi: 10.1016/j.csl.2007.01.001.\nSay, Bilge (2011). “To Build on The Past for a Better Future in Turkish Natural Language\nProcessing”. In: Multisaund: Ulusal Konuşma ve Dil Teknolojileri Platformu Kuruluşu\nve Türkçede Mevcut Durum Çalıştayı Bildirileri. Ed. by M Doğan. TÜBİTAK-BİLGEM.\nGebze, pp. 54–56.\n40\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nSay, Bilge, Deniz Zeyrek, Kemal Oﬂazer, and Umut Özge (2002). “Development of a Corpus\nand a TreeBank for Present-day Written Turkish”. In: Proceedings of the Eleventh Inter-\nnational Conference of Turkish Linguistics. Eastern Mediterranean University, Cyprus.\nScherer, Klaus R and Harald G Wallbott (1994). “Evidence for universality and cultural\nvariation of diﬀerential emotion response patterning”. In: Journal of personality and\nsocial psychology 66.2, p. 310.\nSchmid, Helmut (2005). “A programming language for ﬁnite state transducers”. In: Proceed-\nings of the 5th International Workshop on Finite State Methods in Natural Language\nProcessing (FSMNLP 2005). Helsinki, pp. 308–309.\nSchroeder, Christoph, Christin Schellhardt, Mehmet-Ali Akıncı, Meral Dollnick, Ginesa\nDux, Esin Işıl Gülbeyaz, Anne Jähnert, Ceren Koç-Gültürk, Patrick Kühmstedt, Flo-\nrian Kuhn, Verena Mezger, Carol Pfaﬀ, and Betül Sena Ürkmez (2015). MULTILIT:\nManual, criteria of transcription and analysis for German, Turkish and English. Ed.\nby Christoph Schroeder and Christin Schellhardt.\nSchüller, Peter, Kübra Cingilli, Ferit Tunçer, Barış Gün Sürmeli, Ayşegül Pekel, Ayşe Hande\nKaratay, and Hacer Ezgi Karakaş (2018). “Marmara Turkish Coreference Corpus and\nCoreference Resolution Baseline”. In: CoRR abs/1706.01863. arXiv: 1706.01863. url:\nhttp://arxiv.org/abs/1706.01863.\nSchultz, Tanja, Ngoc Thang Vu, and Tim Schlippe (2013). “Globalphone: A multilingual\ntext & speech database in 20 languages”. In: 2013 IEEE International Conference on\nAcoustics, Speech and Signal Processing. IEEE, pp. 8126–8130.\nSchweter, Stefan (2020). BERTurk - BERT models for Turkish. Version 1.0.0. doi: 10.5281\n/zenodo.3770924. url: https://doi.org/10.5281/zenodo.3770924.\nScialom, Thomas, Paul-Alexis Dray, Sylvain Lamprier, Benjamin Piwowarski, and Jacopo\nStaiano (2020). “MLSUM: The Multilingual Summarization Corpus”. In: Proceedings of\nthe 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP).\nOnline: Association for Computational Linguistics, pp. 8051–8067. doi: 10.18653/v1/20\n20.emnlp-main.647. url: https://www.aclweb.org/anthology/2020.emnlp-main.647.\nŞeker, Gökhan Akın and Gülşen Eryiğit (2017). “Extending a CRF-based named entity\nrecognition model for Turkish well formed text and user generated content”. In: Semantic\nWeb 8.5, pp. 625–642.\nŞen, Mehmet Umut and Hakan Erdoğan (2014). “Learning word representations for Turkish”.\nIn: 2014 22nd Signal Processing and Communications Applications Conference (SIU).\nIEEE, pp. 1742–1745.\nSezer, Taner (2017). “TS Corpus Project: An online Turkish Dictionary and TS DIY Corpus”.\nIn: European Journal of Language and Literature 3.3, pp. 18–24.\nSezer, Taner and Bengü Sever Sezer (2013). “TS corpus: Herkes için Türkçe derlem”. In:\nProceedings of the 27th Turkish National Linguistics Conference, pp. 217–225.\nSezerer, Erhan, Ozan Polatbilek, and Selma Tekir (2019). “A Turkish Dataset for Gen-\nder Identiﬁcation of Twitter Users”. In: Proceedings of the 13th Linguistic Annotation\nWorkshop. Florence, Italy: Association for Computational Linguistics, pp. 203–207. doi:\n10.18653/v1/W19-4023. url: https://www.aclweb.org/anthology/W19-4023.\nSincan, Özge Mercanoğlu and Hacer Yalım Keleş (2020). “Autsl: A large scale multi-modal\nturkish sign language dataset and baseline methods”. In: IEEE Access 8, pp. 181340–\n181355.\nSpeer, Robert and Joanna Lowry-Duda (2017). “ConceptNet at SemEval-2017 Task 2: Ex-\ntending Word Embeddings with Multilingual Relational Knowledge”. In: Proceedings of\nthe 11th International Workshop on Semantic Evaluation (SemEval-2017). doi: 10.18\n653/v1/s17-2008. url: http://dx.doi.org/10.18653/v1/S17-2008.\nSpeer, Robyn, Joshua Chin, and Catherine Havasi (2018). ConceptNet 5.5: An Open Multi-\nlingual Graph of General Knowledge. arXiv: 1612.03975 [cs.CL].\nStamou, Soﬁa, Kemal Oﬂazer, Karel Pala, Dimitris Christoudoulakis, Dan Cristea, Dan\nTuﬁs, Svetla Koeva, George Totkov, Dominique Dutoit, and Maria Grigoriadou (2002).\n“Balkanet: A multilingual Semantic Network for Balkan Languages”. In: Proceedings of\nthe First Global WordNet Conference. Mysore, India.\nSulubacak, Umut, Memduh Gökırmak, Francis Tyers, Çağrı Çöltekin, Joakim Nivre, and\nGülşen Eryiğit (2016). “Universal Dependencies for Turkish”. In: Proceedings of COL-\nResources for Turkish Natural Language Processing\n41\nING 2016, the 26th International Conference on Computational Linguistics: Technical\nPapers. Osaka, Japan, pp. 3444–3454. url: http://aclweb.org/anthology/C16-1325.\nŠuster, Simon, Stéphan Tulkens, and Walter Daelemans (2017). “A Short Review of Ethical\nChallenges in Clinical Natural Language Processing”. In: Proceedings of the First ACL\nWorkshop on Ethics in Natural Language Processing. Valencia, Spain: Association for\nComputational Linguistics, pp. 80–87. doi: 10.18653/v1/W17-1610. url: https://acla\nnthology.org/W17-1610.\nSylak-Glassman, John, Christo Kirov, Matt Post, Roger Que, and David Yarowsky (2015).\n“A universal feature schema for rich morphological annotation and ﬁne-grained cross-\nlingual part-of-speech tagging”. In: International Workshop on Systems and Frameworks\nfor Computational Morphology. Springer, pp. 72–93.\nTantuğ, A Cüneyd, Eşref Adalı, and Kemal Oﬂazer (2007). “A MT system from Turkmen to\nTurkish employing ﬁnite state and statistical methods”. In: Machine Translation Summit\nXI. European Association for Machine Translation (EAMT).\nTantuğ, A. Cüneyd and Eşref Adalı (2018). “Machine Translation Between Turkic Lan-\nguages”. In: Turkish Natural Language Processing. Ed. by Kemal Oﬂazer and Murat\nSaraçlar. Springer International Publishing. Chap. 11, pp. 317–336.\nThelwall, Mike, Kevan Buckley, and Georgios Paltoglou (2012). “Sentiment strength detec-\ntion for the social web”. In: Journal of the American Society for Information Science\nand Technology 63.1, pp. 163–173. doi: 10.1002/asi.21662.\nTiedemann, Jörg (2012). “Parallel Data, Tools and Interfaces in OPUS”. In: Proceedings of\nthe Eighth International Conference on Language Resources and Evaluation (LREC’12).\nIstanbul, Turkey: European Language Resources Association (ELRA), pp. 2214–2218.\nurl: http://www.lrec-conf.org/proceedings/lrec2012/pdf/463_Paper.pdf.\nToçoğlu, Mansur Alp and Adil Alpkoçak (2018). “TREMO: A dataset for emotion analysis\nin Turkish”. In: Journal of Information Science 44.6, pp. 848–860. doi: 10.1177/01655\n51518761014.\nToçoğlu, Mansur Alp and Adil Alpkoçak (2019). “Lexicon-based emotion analysis in Turkish”.\nIn: Turkish Journal Of Electrical Engineering & Computer Sciences 27.2, pp. 1213–\n1227.\nToçoğlu, Mansur Alp, Okan Öztürkmenoğlu, and Adil Alpkoçak (2019). “Emotion Analysis\nFrom Turkish Tweets Using Deep Neural Networks”. In: IEEE Access 7, pp. 183061–\n183069. doi: 10.1109/ACCESS.2019.2960113.\nTopkaya, İbrahim Saygın and Hakan Erdoğan (2012). “SUTAV: A Turkish Audio-Visual\nDatabase”. In: Proceedings of the Eighth International Conference on Language Re-\nsources and Evaluation (LREC’12). Istanbul, Turkey: European Language Resources\nAssociation (ELRA), pp. 2334–2337. url: http://www.lrec-conf.org/proceedings/l\nrec2012/pdf/483_Paper.pdf.\nToraman, Çağrı, Furkan Şahinuç, and Eyüp Halit Yılmaz (2022). “Large-Scale Hate Speech\nDetection with Cross-Domain Transfer”. In: Proceedings of the Language Resources and\nEvaluation Conference. Marseille, France: European Language Resources Association,\npp. 2215–2225. url: https://aclanthology.org/2022.lrec-1.238.\nTür, Gökhan, Dilek Hakkani-Tür, and Kemal Oﬂazer (2003). “A statistical information\nextraction system for Turkish”. In: Natural Language Engineering 9.2, pp. 181–210. doi:\n10.1017/S135132490200284X.\nTürk, Utku, Furkan Atmaca, Şaziye Betül Özateş, Balkız Öztürk Başaran, Tunga Güngör,\nand Arzucan Özgür (2019). “Improving the Annotations in the Turkish Universal De-\npendency Treebank”. In: Proceedings of the Third Workshop on Universal Dependen-\ncies (UDW, SyntaxFest 2019). Paris, France: Association for Computational Linguistics,\npp. 108–115. doi: 10.18653/v1/W19-8013. url: https://www.aclweb.org/anthology/W\n19-8013.\nTürk, Utku, Furkan Atmaca, Şaziye Betül Özateş, Gözde Berk, Seyyit Talha Bedir, Ab-\ndullatif Köksal, Balkız Öztürk Başaran, Tunga Güngör, and Arzucan Özgür (2022).\n“Resources for Turkish Dependency Parsing: Introducing the BOUN Treebank and the\nBoAT Annotation Tool”. In: Language Resources and Evaluation 56, pp. 259–307. doi:\n10.1007/s10579-021-09558-0.\nTürkmenoğlu, Cumali and Ahmet Cüneyd Tantuğ (2014). “Sentiment analysis in Turkish\nmedia”. In: International Conference on Machine Learning (ICML).\n42\nÇ. Çöltekin, A. S. Doğruöz, Ö. Çetinoğlu\nTürkoğlu, Filiz, Banu Diri, and M Fatih Amasyalı (2007). “Author attribution of Turk-\nish texts by feature mining”. In: International Conference on Intelligent Computing.\nSpringer, pp. 1086–1093.\nTyers, Francis M and Murat Serdar Alperen (2010). “South-East European Times: A parallel\ncorpus of Balkan languages”. In: Proceedings of the LREC Workshop on Exploitation of\nMultilingual Resources and Tools for Central and (South-) Eastern European Languages,\npp. 49–53.\nUpadhyay, Shyam, Manaal Faruqui, Gökhan Tür, Hakkani-Tür Dilek, and Larry Heck (2018).\n“(Almost) zero-shot cross-lingual spoken language understanding”. In: 2018 IEEE In-\nternational Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE,\npp. 6034–6038.\nVan der Goot, Rob and Özlem Çetinoğlu (2021). “Lexical Normalization for Code-switched\nData and its Eﬀect on POS Tagging”. In: Proceedings of the 16th Conference of the\nEuropean Chapter of the Association for Computational Linguistics: Volume 1, Long\nPapers. Association for Computational Linguistics.\nVossen, Piek, ed. (1998). EuroWordNet: A Multilingual Database with Lexical Semantic\nNetworks. Kluwer Academic Publishers. isbn: 978-94-017-1491-4.\nVural, A Güral (2013). “Sentiment-focused web crawling”. PhD thesis. Middle East Technical\nUniversity.\nWieling, Martijn, Josine Rawee, and Gertjan van Noord (2018). “Reproducibility in Com-\nputational Linguistics: Are We Willing to Share?” In: Computational Linguistics 44.4,\npp. 641–649. doi: 10.1162/coli_a_00330. url: https://www.aclweb.org/anthology/J\n18-4003.\nWiese, Heike, Artemis Alexiadou, Shanley Allen, Oliver Bunk, Natalia Gagarina, Kateryna\nIefremenko, Esther Jahns, Martin Klotz, Thomas Krause, Annika Labrenz, Anke Lüdel-\ning, Maria Martynova, Katrin Neuhaus, Tatiana Pashkova, Vicky Rizou, Tracy Rose-\nmarie, Christoph Schroeder, Luka Szucsich, Wintai Tsehaye, Sabine Zerbian, and Yulia\nZuban (2020). RUEG Corpus. Version 0.3.0. Zenodo. doi: 10.5281/zenodo.3765218.\nurl: https://doi.org/10.5281/zenodo.3765218.\nWilliams, Adina, Nikita Nangia, and Samuel Bowman (2018). “A Broad-Coverage Challenge\nCorpus for Sentence Understanding through Inference”. In: Proceedings of the 2018 Con-\nference of the North American Chapter of the Association for Computational Linguis-\ntics: Human Language Technologies, Volume 1 (Long Papers). New Orleans, Louisiana:\nAssociation for Computational Linguistics, pp. 1112–1122. doi: 10.18653/v1/N18-1101.\nurl: https://www.aclweb.org/anthology/N18-1101.\nWołk, Krzysztof and Krzysztof Marasek (2014). “Building Subject-aligned Comparable Cor-\npora and Mining it for Truly Parallel Sentence Pairs”. In: Procedia Technology 18. In-\nternational workshop on Innovations in Information and Communication Science and\nTechnology, IICST 2014, 3-5 September 2014, Warsaw, Poland, pp. 126–132. issn: 2212-\n0173. doi: 10.1016/j.protcy.2014.11.024. url: http://www.sciencedirect.com/sci\nence/article/pii/S2212017314005453.\nXanthos, Aris, Sabine Laaha, Steven Gillis, Ursula Stephany, Ayhan Aksu-Koç, Anastasia\nChristoﬁdou, Natalia Gagarina, Gordana Hrzica, F. Nihan Ketrez, Marianne Kilani-\nSchoch, Katharina Korecky-Kröll, Melita Kovacěvić, Klaus Laalo, Marijan Palmović,\nBarbara Pfeiler, Maria D. Voeikova, and Wolfgang U. Dressler (2011). “On the role of\nmorphological richness in the early development of noun and verb inﬂection”. In: First\nLanguage 31.4, pp. 461–479. doi: 10.1177/0142723711409976.\nYeniterzi, Reyyan (2011). “Exploiting Morphology in Turkish Named Entity Recognition\nSystem”. In: Proceedings of the ACL 2011 Student Session. Portland, OR, USA: Asso-\nciation for Computational Linguistics, pp. 105–110. url: https://www.aclweb.org/ant\nhology/P11-3019.\nYirmibeşoğlu, Zeynep and Gülşen Eryiğit (2018). “Detecting Code-Switching between\nTurkish-English Language Pair”. In: Proceedings of the 2018 EMNLP Workshop W-\nNUT: The 4th Workshop on Noisy User-generated Text. Brussels, Belgium: Associa-\ntion for Computational Linguistics, pp. 110–115. doi: 10.18653/v1/W18- 6115. url:\nhttps://www.aclweb.org/anthology/W18-6115.\nYıldız, Olcay Taner, Ercan Solak, Onur Görgün, and Razieh Ehsani (2014). “Constructing\na Turkish-English Parallel TreeBank”. In: Proceedings of the 52nd Annual Meeting of\nResources for Turkish Natural Language Processing\n43\nthe Association for Computational Linguistics (Volume 2: Short Papers). Baltimore,\nMaryland: Association for Computational Linguistics, pp. 112–117. doi: 10.3115/v1/P\n14-2019. url: https://www.aclweb.org/anthology/P14-2019.\nYüret, Deniz and Ferhan Türe (2006). “Learning morphological disambiguation rules for\nTurkish”. In: Proceedings of the Human Language Technology Conference of the North\nAmerican Chapter of the Association of Computational Linguistics. HLT-NAACL ’06.\nNew York, pp. 328–334. doi: 10.3115/1220835.1220877.\nZaghouani, Wajdi (2014). “Critical Survey of the Freely Available Arabic Corpora”. In: Pro-\nceedings of the LREC 2014 Workshop on Free/Open-Source Arabic Corpora and Cor-\npora Processing Tools, pp. 1–8.\nZampieri, Marcos, Shervin Malmasi, Preslav Nakov, Sara Rosenthal, Noura Farra, and\nRitesh Kumar (2019). “Predicting the Type and Target of Oﬀensive Posts in Social\nMedia”. In: Proceedings of the 2019 Conference of the North American Chapter of the\nAssociation for Computational Linguistics: Human Language Technologies, Volume 1\n(Long and Short Papers). Minneapolis, Minnesota: Association for Computational Lin-\nguistics, pp. 1415–1420. doi: 10.18653/v1/N19-1144. url: https://www.aclweb.org/a\nnthology/N19-1144.\nZeman, Daniel, Martin Popel, Milan Straka, Jan Hajic, Joakim Nivre, Filip Ginter, Juhani\nLuotolahti, Sampo Pyysalo, Slav Petrov, Martin Potthast, Francis Tyers, Elena Bad-\nmaeva, Memduh Gökırmak, Anna Nedoluzhko, Silvie Cinkova, Jan Hajic jr., Jaroslava\nHlavacova, Václava Kettnerová, Zdenka Uresova, Jenna Kanerva, Stina Ojala, Anna Mis-\nsilä, Christopher D. Manning, Sebastian Schuster, Siva Reddy, Dima Taji, Nizar Habash,\nHerman Leung, Marie-Catherine de Marneﬀe, Manuela Sanguinetti, Maria Simi, Hiroshi\nKanayama, Valeria dePaiva, Kira Droganova, Héctor Martínez Alonso, Çağrı Çöltekin,\nUmut Sulubacak, Hans Uszkoreit, Vivien Macketanz, Aljoscha Burchardt, Kim Harris,\nKatrin Marheinecke, Georg Rehm, Tolga Kayadelen, Mohammed Attia, Ali Elkahky,\nZhuoran Yu, Emily Pitler, Saran Lertpradit, Michael Mandl, Jesse Kirchner, Hector\nFernandez Alcalde, Jana Strnadová, Esha Banerjee, Ruli Manurung, Antonio Stella, At-\nsuko Shimada, Sookyoung Kwak, Gustavo Mendonca, Tatiana Lando, Rattima Nitisaroj,\nand Josie Li (2017). “CoNLL 2017 Shared Task: Multilingual Parsing from Raw Text to\nUniversal Dependencies”. In: Proceedings of the CoNLL 2017 Shared Task: Multilingual\nParsing from Raw Text to Universal Dependencies. Vancouver, Canada: Association for\nComputational Linguistics, pp. 1–19. url: http://www.aclweb.org/anthology/K/K17\n/K17-3001.pdf.\nZeyrek, Deniz and Kezban Başıbüyük (2019). “TCL - a Lexicon of Turkish Discourse Con-\nnectives”. In: Proceedings of the First International Workshop on Designing Meaning\nRepresentations. Florence, Italy: Association for Computational Linguistics, pp. 73–81.\ndoi: 10.18653/v1/W19-3308. url: https://www.aclweb.org/anthology/W19-3308.\nZeyrek, Deniz, Işın Demirşahin, Ayışığı B. Sevdik-Çallı, and Ruket Çakıcı (2013). “Turkish\nDiscourse Bank: Porting a discourse annotation style to a morphologically rich language”.\nIn: Dialogue Discourse 4.2, pp. 174–184.\nZeyrek, Deniz and Murathan Kurfalı (2017). “TDB 1.1: Extensions on Turkish Discourse\nBank”. In: Proceedings of the 11th Linguistic Annotation Workshop. Valencia, Spain:\nAssociation for Computational Linguistics, pp. 76–81. doi: 10.18653/v1/W17-0809. url:\nhttps://www.aclweb.org/anthology/W17-0809.\nZeyrek, Deniz, Amália Mendes, Yulia Grishina, Murathan Kurfalı, Samuel Gibbon, and\nMaciej Ogrodniczuk (2020). “TED Multilingual Discourse Bank (TED-MDB): a parallel\ncorpus annotated in the PDTB style”. In: Language Resources and Evaluation 54.2,\npp. 587–613. doi: s10579-019-09445-9.\nZeyrek, Deniz, Amália Mendes, and Murathan Kurfalı (2018). “Multilingual Extension of\nPDTB-Style Annotation: The Case of TED Multilingual Discourse Bank”. In: Proceed-\nings of the Eleventh International Conference on Language Resources and Evaluation\n(LREC 2018). Miyazaki, Japan: European Language Resources Association (ELRA).\nurl: https://www.aclweb.org/anthology/L18-1301.\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2022-04-11",
  "updated": "2023-02-25"
}