{
  "id": "http://arxiv.org/abs/2206.00437v1",
  "title": "What a Creole Wants, What a Creole Needs",
  "authors": [
    "Heather Lent",
    "Kelechi Ogueji",
    "Miryam de Lhoneux",
    "Orevaoghene Ahia",
    "Anders Søgaard"
  ],
  "abstract": "In recent years, the natural language processing (NLP) community has given\nincreased attention to the disparity of efforts directed towards high-resource\nlanguages over low-resource ones. Efforts to remedy this delta often begin with\ntranslations of existing English datasets into other languages. However, this\napproach ignores that different language communities have different needs. We\nconsider a group of low-resource languages, Creole languages. Creoles are both\nlargely absent from the NLP literature, and also often ignored by society at\nlarge due to stigma, despite these languages having sizable and vibrant\ncommunities. We demonstrate, through conversations with Creole experts and\nsurveys of Creole-speaking communities, how the things needed from language\ntechnology can change dramatically from one language to another, even when the\nlanguages are considered to be very similar to each other, as with Creoles. We\ndiscuss the prominent themes arising from these conversations, and ultimately\ndemonstrate that useful language technology cannot be built without involving\nthe relevant community.",
  "text": "What a Creole Wants, What a Creole Needs\nHeather Lent1, Kelechi Ogueji2, Miryam de Lhoneux1,3,4, Orevaoghene Ahia5, Anders Søgaard1\n1 University of Copenhagen, Denmark\n2 University of Waterloo, Canada\n3 Uppsala University, Sweden\n4 KU Leuven, Belgium\n5 University of Washington, United States\n{hcl, ml, soegaard}@di.ku.dk\nkelechi.ogueji@uwaterloo.ca, oahia@cs.washington.edu\nAbstract\nIn recent years, the natural language processing (NLP) community has given increased attention to the disparity of efforts\ndirected towards high-resource languages over low-resource ones. Efforts to remedy this delta often begin with translations\nof existing English datasets into other languages. However, this approach ignores that different language communities have\ndifferent needs. We consider a group of low-resource languages, Creole languages. Creoles are both largely absent from the\nNLP literature, and also often ignored by society at large due to stigma, despite these languages having sizable and vibrant\ncommunities.\nWe demonstrate, through conversations with Creole experts and surveys of Creole-speaking communities,\nhow the things needed from language technology can change dramatically from one language to another, even when the\nlanguages are considered to be very similar to each other, as with Creoles. We discuss the prominent themes arising from\nthese conversations, and ultimately demonstrate that useful language technology cannot be built without involving the relevant\ncommunity.\nKeywords: natural language processing, low-resource languages, Creole\n1.\nIntroduction\nThe ﬁeld of natural language processing (NLP) has be-\ncome aware that most of the world’s languages are un-\nfortunately under-represented, or entirely absent, from\nthe ﬁeld’s body of work (Joshi et al., 2020). In re-\ncent years, there has been a push in efforts to ame-\nliorate this discrepancy (Nekoto et al., 2020; Mirza-\nkhalov et al., 2021; Ogueji et al., 2021).\nAmong\nthese low-resourced languages1 are Creole languages,\nwhich are particularly under-resourced due to barri-\ners like societal stigma (Siegel, 1999), despite the fact\nthat these languages are spoken by many people glob-\nally. One line of work has focused on creating datasets\nfor low-resource languages via the translation of ex-\nisting high-resource language datasets (Conneau et al.,\n2018; Artetxe et al., 2020b; Budur et al., 2020). De-\nspite the popularity of this method, it poses several is-\nsues, which can negatively affect the communities of\nthese low-resource languages. One such issue lies in\ntranslation artifacts, which have been shown to have\nnotable impacts on the performance of models trained\nwith such datasets (Artetxe et al., 2020a). Furthermore,\ntranslated datasets are often simpliﬁed and unnatural, a\nphenomenon referred to as translationese (Volansky et\nal., 2013). This has also been shown to adversely af-\nfect the evaluation of machine translation models (Gra-\nham et al., 2020). Creoles, too, are not immune to the\nshortcomings of this approach. Moreover, many trans-\n1This term is often largely ambiguous, and all “low-\nresource” languages should not be conﬂated together into one\nlarge group, but rather considered independently, in the con-\ntext of its speakers, their culture, and their needs.\nlated datasets will simply not be relevant to communi-\nties speaking a Creole language, as concepts relevant to\nthe original high-resource source language are subse-\nquently translated into the low-resource language, de-\nspite being irrelevant to people or cultures speaking the\nlanguage (Liu et al., 2021). For example, sentences\nabout American football or the American Thanksgiving\nholiday are simply not relevant or necessary for speak-\ners of Creole languages. The same mismatch also ap-\nplies to other more geographical-speciﬁc domain infor-\nmation present in the data, such as landmarks or land-\nscapes.\nAll of these show that, while there may be\ngood intentions behind this approach, it could poten-\ntially lead to poor models for speakers of low-resource\nlanguages and even to the creation of tools of little use\nor relevance for Creole speakers.\nMeanwhile, works such as Hu et al.\n(2011) con-\ncretely demonstrate how crowd-sourcing data from\ntarget-language speakers, even if monolingual, leads to\nimproved results for statistical machine translation sys-\ntems. While these ﬁndings are not up to date with con-\ntemporary neural machine translation, involving native\nspeakers minimizes the risk of having non-relevant ex-\namples included in the dataset. However, as the au-\nthors also note, there can be considerable logistical dif-\nﬁculties of ﬁnding native speakers to contribute, even\nwhen offering payment. And even if one manages to\nrecruit paid speakers, a large problem still remains:\nthe underlying exploitative nature of treating language\nspeaking communities like data resources to be mined.\nBird (2020) discusses in detail these foundational prob-\nlems within the language technology community, and\narXiv:2206.00437v1  [cs.CL]  1 Jun 2022\nhow, in order to break the cycle of harmful colonial-\nism in our science, we must fundamentally change\nthe relationship between researchers and the language-\nspeaking communities. But the only way we can learn\nthis, claims Bird (2020), is by establishing a respectful,\n“feedback/collaboration loop”, and necessarily involv-\ning community members in our research.\nFollowing the work of Bird (2020), in this work, we\nfocus on the problem of creating resources for low-\nresource languages, in this case Creoles, and the in-\nherent presupposition by researchers of what technolo-\ngies are indeed wanted and needed by the communi-\nties speaking those languages. While many researchers\nmay assume that the “best-case scenario” for all lan-\nguages would be to have all language technologies\nequally available, the fact of the matter is that many\ncommunities have very speciﬁc wants and needs of\nlanguage technology, as well as language technologies\nthat are notably unwelcome, even though they are a\ncommonplace for high-resource languages. Disregard-\ning the needs of a language community can lead to mis-\nuse of ﬁnite resources on creating unnecessary datasets\nor technologies while leaving the community’s highest\npriorities neglected. And ﬁnally, when researchers as-\nsume what technologies are wanted on the behalf of a\ncommunity, it inherently alienates that community and\ntakes away their agency (Bird, 2020). In this work,\nwe explore how the needs of different Creole-speaking\ncommunities vary wildly from one another, and we\ndemonstrate the need to establish respectful relation-\nships with experts and communities, in order to make\ntruly useful language technology.\nOur contributions in this work are as follows:\n• We present a survey of Creole NLP, and dis-\ncussion of features from Creole languages that\npresent unique challenges to existing NLP work-\nﬂows.\n• We discuss important considerations, gleaned\nfrom conversations with experts, and a survey of\nCreole language speakers.\n• We propose a Creole continuum for language\ntechnology, as a guiding framework of research\nconsiderations, to help NLP researchers planning\nto work on Creoles.\n2.\nBackground\nToday, Creole languages are spoken widely through-\nout the Caribbean and West Africa, as well as parts of\nSouth America, Asia, Australia and the Paciﬁc. Creoles\nhave long captured the attention of linguists due to their\nunique, and sometimes tragic2, histories with regards to\nlanguage evolution. Typically, Creole languages orig-\ninate from situations in which multiple different lan-\nguages have come into close contact with each other\n2For example, Caribbean Creoles resulted from the dis-\nplacement of African peoples in the Atlantic slave trade.\n(Thomason and Kaufman, 1992). The exact process\nof how a Creole language is “born” (i.e. Creole gene-\nsis), as well as discussion of which linguistic features a\nCreole inherited from the various “parent” languages,\nhave been the subject of intense and ongoing linguistic\ndebate for decades (Alleyne, 1971; Bickerton, 1984;\nMuysken and Smith, 1986; Sessarego, 2020). On one\nhand, some believe that Creoles themselves form a\nunique typological class of languages, with a separate\nplace on the phylogenetic tree of languages (i.e. Creole\nexceptionalism, Bickerton (1984)). Linguists support-\ning Creole exceptionalism typically claim that Creoles\nare more simple than other languages (Parkvall and\nothers, 2008), for example, lacking in complex mor-\nphology (McWhorter, 1998). On the other hand, others\nargue that there are no grounds to claim that Creole\nevolution is especially different from the language evo-\nlution of so-called “normal” (DeGraff, 2003; DeGraff,\n2005). And indeed, Creoles do exhibit behaviors just\nas complex as non-Creole languages (DeGraff, 2001),\nincluding complex morphology (Henri et al., 2020).\nMoreover, some criticisms of Creole exceptionalism\nalso examine how the history of Creole studies itself\nhas unfortunately been riddled with discrimination and\nracism (DeGraff, 2005). In the past, Creoles were of-\nten considered to be something short of a full-ﬂedged\nlanguage (or, more harshly, “degenerate variants or\ndialects of their parent languages”3).\nAccording to\nKouwenberg and Singler (2009), “A part of the legacy\nof slavery in the Caribbean and elsewhere has been the\nstigmatization of the languages associated with slaves\n... [the] willingness to apply the concept of linguistic\nrelativism – whereby every language is understood to\nbe complete and valid – may have been extended to\nHopi and Hausa4, but it generally stopped short of be-\ning extended to Creoles.” In line with this, in this work,\nwe hope to raise awareness in the NLP community\nabout why Creoles are important to work with. Beyond\nbeing the subject of vibrant linguistic debate, Creoles\nare often ignored when it comes to language technol-\nogy, which puts speakers of already often stigmatized\nlanguages at a further disadvantage. For the remainder\nof this section, we will present a survey of existing Cre-\nole datasets, a summary of works published on NLP for\nCreoles, and ﬁnally end this section with a discussion\nof some speciﬁc features of Creole languages that are\nnotable within the context of NLP.\n2.1.\nCreole Data and Creole NLP\nIn this section we will detail existing resources and\ndatasets for Creole languages (including those which\nare now seemingly defunct), as well as discuss related\nworks actively focused on NLP for Creoles.\n3https://en.wikipedia.org/wiki/Creole_\nlanguage#Overview\n4Hopi is an Native American indigenous language from\nArizona, United States; Hausa is a Chadic language, spoken\nin West and Central Africa.\nVeriﬁed Resources\nAlthough Creole languages are\nin general very low-resourced, the datasets that do exist\nvary widely from task to task, as well as from language\nto language. Hagemeijer et al. (2014) presents an ex-\ntensive overview of Creole data resources through 2014\nfor a wide variety of Creoles, many of which are more\ntraditional corpora, (e.g., transcriptions of conversa-\ntions made by linguists with formal training, or scans of\ndocuments originally written in the Creole language);\nthough these may not have the relevant annotations for\ncommon NLP tasks. Lent et al. (2021) also provides a\nthorough overview of existing NLP datasets for Haitian\nKreyol, Singaporean Colloquial English (Singlish), and\nNigerian Pidgin English. In this work, we set about the\ntask of manually verifying each dataset presented by\nHagemeijer et al. (2014) and Lent et al. (2021), as\nwell as searching for additional resources. We present\nall “veriﬁed” datasets in Table 1. Here, we use “ver-\niﬁed” to mean that we could easily ﬁnd the resource\ndescribed in the paper, through either a provided URL\nin a publication, or through a search engine.\nReaders should note that we excluded both extinct Cre-\noles and ostensibly historical Creole data from Table 1.\nThose interested can see that there are available data\nfor the extinct Virgin Islands Dutch Creole.5\nOther\nhistorical Creole data include the Corpus of Mauritian\nCreole Texts (Baker and Sing, 2007), a collection of\ntexts spanning the 1730 to 1930, and the Surinam Cre-\nole Archive (suca.ruhosting.nl), which should\nhave historical texts for both Sranan Tongo and Sara-\nmaccan, although the hyperlinks are presently broken\nin this website.\nLastly, to utilize linguistic information about Creoles,\nthe Atlas of Pidgin and Creole Language Structures\n(APiCS) is an indispensable resource (Michaelis et al.,\n2013). APiCS is an extension of the popular WALS\nresource (Dryer and Haspelmath, 2013), but is solely\ndedicated to pidgins and Creoles.\nUnveriﬁed Resources\nUnfortunately many of the\nCreole corpora reviewed in Hagemeijer et al. (2014)\nare no longer available, with broken URLs. We de-\nscribe any resource as “not veriﬁable”, when we can-\nnot track down the resource through the combination\nof a URL, a simple web search, or through the original\npublication. These resources may still exist, but they\nare too difﬁcult to ﬁnd with a reasonable effort made.\nThe list of “not veriﬁable” resources can be found in\nTable 2. We hope that highlighting the “not veriﬁable”\ndatasets can serve as a call to action in the ﬁeld, to con-\nsider long term data hosting solutions. In order to make\nthe information we gathered about datasets useful in the\nlong-term, we release a community-based webpage.6 It\nis hosted on github pages and allows pull requests so\nthat community members can help us maintain up-to-\ndate information about data available for Creoles.\n5doecreoltaal.com\n6https://creole-nlp.github.io/\nMoreover, in this section, we would also like to dis-\ncuss book-based corpora. We do not include them in\nTable 2, as considerable work would need to be done\nto digitize these datasets, before they can be usable for\nmost NLP tasks. Still, these resources could be use-\nful for those wanting to work with some Creole lan-\nguages, not listed in Table 1 or Table 2. Creole corpora\ndocumented in books include the Corpus of Written\nBritish Creole (Sebba, 1998), a corpus of folktales in\nTok Pisin (Slone, 2001), and a corpus of Jamaican Cre-\nole (Hinrichs, 2006). We also found the following ad-\nditional resources described by Kouwenberg and Sin-\ngler (2009) : transcripts of Guyanese Creole (Rickford,\n1987), transcripts of English-based Central American\nCreoles were introduced by (Holm, 1982), and a cor-\npus of various French-based Creoles, such as Louisiana\nCreole and Reunionese Creole (Corne, 1999).\nNLP for Creoles\nCreole languages, though largely\nabsent from the NLP literature, have been investi-\ngated directly in a small number of works.\nOf the\nfew works actively focused on Creoles, two works ex-\nplore directly Creole genesis in the context of computa-\ntional linguistics. First, Daval-Markussen and Bakker\n(2012) employ phylogenetic tools to explore whether\nCreole langauges form a unique typological group.\nBy treating each Creole as a list of binary linguis-\ntic features, including data from WALS (Dryer and\nHaspelmath, 2013), they analyze the output of a phy-\nlogenetic network program (Huson and Bryant, 2006),\nto inform their investigation. The overall conclusion\nmade by Daval-Markussen and Bakker (2012), was that\nCreoles indeed formed their own distinct typological\nclass, distinguishable from non-Creoles. However, this\nwork was later refuted by Murawaki (2016), who ar-\ngued that the study by Daval-Markussen and Bakker\n(2012) had some methodological shortcomings. No-\ntably, Murawaki (2016) use APiCS features (Michaelis\net al., 2013) to encode Creoles, and utilize different ap-\nproaches for language evolution modeling, to reach the\nﬁnal conclusion that Creoles are not typologically dis-\ntinct from non-Creole languages.\nMeanwhile, Lent et al. (2021) explored the question\nof how to effectively build language models for three\nCreole languages (Haitian Kreyol, Singaporean Collo-\nquial English, and Nigerian Pidgin). Their approach\ninvolved experimenting with distributionally robust ob-\njectives (Oren et al., 2019), to ascertain whether data\nfrom a Creole’s “parent” languages could help the lan-\nguage model to be more robust. In the end, they found\nthat straightforward training of language models for\nCreoles, without adding information from their related\nlanguages, produced the strongest results, thus high-\nlighting the relative stability of Creoles.\nFinally, there have been a handful of other works aim-\ning to develop NLP algorithms usable for end users,\nprimarily in the area of machine translation, for Cre-\noles like Haitian Kreyol, Mauritian Creole, and Nig-\neran Pidgin (Callison-Burch et al., 2011; Dabre et al.,\nLanguage\nResource\nDescription\nStatus\nHaitian Kreyol\nHaitian Disaster Response Corpus (Munro,\n2010; Callison-Burch et al., 2011)\nSMS\nVeriﬁed; E-mail\nauthors for ac-\ncess.\nCMU\nHaitian\nCorpus\nhttp://www.\nspeech.cs.cmu.edu/haitian/\nSpeech and Text Cor-\npora\nVeriﬁed; E-mail\nauthors for ac-\ncess.\nHawaiian Pidgin\nMultilingual Hawai’i Linguistic Landscape\nCorpus (Purschke, 2021)\nImage Repository with\nAnnotations\nVeriﬁed\nNigerian Pidgin\nNaijaSynCor (Bigi et al., 2017)\nSpeech Recognition\nVeriﬁed\nJW300 Corpus (Agi´c and Vuli´c, 2019)\nParallel Texts for Ma-\nchine Translation\nVeriﬁed\nPidgin UNMT (Ogueji and Ahia, 2019)\nMonolingual Texts for\nMachine Translation\nVeriﬁed\nNaija-English\nCodeswitching\nCorpus\n(Ndubuisi-Obi et al., 2019)\nNews\nArticles\nwith\nComments; Annotated\nfor code switching\nVeriﬁed\nSurface-Syntactic UD Treebank for Naija\n(Caron et al., 2019)\nUniversal\nDependen-\ncies\nVeriﬁed\nSpeech-to-Text\nNigerian\nPidgin\nDataset\n(Ajisafe et al., 2020)\nSpeech Recognition\nVeriﬁed\nNaijaNER (Oyewusi et al., 2021)\nNamed Entity Recog-\nnition\nVeriﬁed\nMasakhaner (Adelani et al., 2021)\nNamed Entity Recog-\nnition\nVeriﬁed\nNaijaSenti (Muhammad et al., 2022)\nSentiment Analysis\nVeriﬁed\nReunionese Creole &\nCreolica\nText and Short Stories\nVeriﬁed\nSeychellois Creole\nhttp://creolica.net/\nin HTML or PDFs\nSinglish\nNational University of Singapore SMS Cor-\npus (Chen and Min-Yen, 2015)\nSMS\nVeriﬁed\nUniversal Dependencies for Colloquial Sin-\ngaporean English (Wang et al., 2017)\nUD Treebank\nVeriﬁed\nWebcrawler for Singaporean Hardware Fo-\nrum (Tan et al., 2020)\nWebcrawler\nVeriﬁed\nSri Lankan Malay\nThe Language Archive (Nordhoff, 2006)\nAudio and XML\nVeriﬁed\n(Endangered)\nTable 1: Descriptions of every Creole resource or dataset that we could identify and also verify as being readily\navailable online.\n2014; Millour and Fort, 2020; Ahia and Ogueji, 2020).\n2.2.\nNotable Features of Creoles\nMany Creole languages are noteworthy for their large\ncapacity for linguistic variation. A speaker’s individ-\nual style of Creole can vary dramatically depending on\nsocial factors, such as their age, ethnicity, geography,\nand social status. These variations can manifest them-\nselves in different linguistic functions of the Creole, for\ninstance, in the chosen syntax, morphology, or lexical\nchoices (Bajpai et al., 2017). Below, we discuss other\nfeatures of some (not all) Creoles, that are particularly\nnotable in the context for NLP.\nSocietal Stigma vs Recognized Status\nCreole lan-\nguages are infamously stigmatised (Alleyne, 1971;\nSiegel, 1999). To this day, prejudice against Creole\nlanguages has thwarted Creole-based education being\nmade available to Creole speakers, for example. The\nrelative status of a language can change drastically,\nfrom Creole to Creole. For instance, use of Singlish\nhas been actively discouraged by government ofﬁcials,\nciting the need to “Speak Good English”.7 Meanwhile,\na handful of other countries have come to embrace Cre-\nole (to varying degrees) in their education system, such\nas Haitian Kreyol, Papiamento, Seychellois Creole, and\nTok Pisin (Kouwenberg and Singler, 2009). The rela-\ntive celebration or suppression a Creole receives will\n7https://en.wikipedia.org/wiki/Speak_\nGood_English_Movement\nLanguage\nResource\nDescription\nStatus\nAntillean Creole\nCREOLORAL\nhttp://ircom.\ncorpus-ir.fr/site/description_\nprojet.php?projet=CREOLORAL\nAudio, Transcriptions,\nand Translations\nNot veriﬁable\nBastimentos Creole\nEndangered Language Archive\nAudio, Video,\nNot veriﬁable;\nEnglish\nhttp://elar.soas.ac.uk/\ndeposit/0171\nTranscriptions, Trans-\nlations\nMembership re-\nquired\nGulf of Guinea Creoles\nThe Gulf of Guinea Creole Corpora (Hage-\nmeijer et al., 2014)\nDocument Scans and\nTranscriptions\nLimited Veriﬁa-\nbility\nHaitian Kreyol\nCorpus of Northern Haitian Creole https:\n//www.indiana.edu/˜Creole/\nAudio and Transcrip-\ntion\nNot veriﬁable\nMalaccan Portuguese\nEndangered Language Archive\nAudio, Video,\nNot veriﬁable;\nCreole\nhttp://elar.soas.ac.uk/\ndeposit/0123\nTranscriptions, Trans-\nlations\nMembership re-\nquired\nMauritian Creole\nALLEX Project http://www.edd.uio.\nno/allex/corpus/africanlang.\nhtml\nConcordance of 200k\nWords\nNot veriﬁable\nNigerian Pidgin\nNigerian Pidgin Tweets (Oyewusi et al.,\n2020)\nSentiment Analysis\nNot Veriﬁable\nPortuguese Creole\nCreolData (Schang et al., 2005)\nLexical Database\nNot veriﬁable\nSinglish\nSinglish Sentiment Lexicon (Bajpai et al.,\n2017)\nKnowledge Base\nNot Veriﬁable\nSinglish SenticNet (Ho et al., 2018)\nSentiment Resource\nNot Veriﬁable\nTable 2: Description of Creole datasets presented in our resource survey, which we were not able to verify the\nexistence of. Note here that “Gulf of Guinea Creoles” refers to a collection of four distinct Creole languages:\nSantome, Angolar, Principense, and Fa d’Ambo.\ncertainly impact who is speaking the Creole language,\nand how they will use it.\nSpoken Languages\nToday a large number of Cre-\nole languages exist primarily, or almost entirely, as a\nspoken language only (this can also be a consequence\nof high stigmatization, as explained in the paragraph\nabove (Sebba, 1997)). If Creole speakers are not typ-\nically writing in the language, development of text-\nbased NLP methods may be largely superﬂuous, unless\nmembers of that community have expressed a desire to\nbegin writing (more) in Creole. Consequently, speech\ntechnologies may be more relevant to a large number\nof Creole speaking communities.\nNon-standardized\nOrthography\nor\nGrammar\nWriting conventions for Creoles can vary greatly,\nfrom Creole to Creole, and even from speaker to\nspeaker.\nGiven that Creoles arise from a complex\nprocess involving several parent languages (Sessarego,\n2020), and formal writing education in that Creole is\nnot a guarantee for speakers (Siegel, 1999), there is\noften no standard way of writing them. On one hand,\nspellings can depend on an individual and informed\nby their own oral version of the language (Millour\nand Fort, 2020).\nMoreover, spelling and grammar\nconventions in Creole can also be affected greatly by\na speaker’s proﬁciency in that Creole. For instance,\nnative speakers of Nigerian Pidgin may speak a ﬂuent,\nfast, and strong variety of the Creole (i.e., less diluted\nwith English), while others speak a weaker Creole,\nlearned as a second language, characterized by heavy\nuse of just one ancestral Nigerian language. This kind\nof variety in many cases, as with Nigerian Pidgin,\nis considered a very positive aspect of a Creole, as\nit grants speakers a lot of opportunity for nuanced\nexpression.\nGiven that contemporary NLP methods\nare typically not robust to such linguistic variation, it\nis important not to limit Creole speakers to one register\nof communication (Do˘gru¨oz et al., 2021).\nMeanwhile, some Creole languages are undergoing an\nongoing cultural shift, with a push towards standard-\nization, in a manner intended to help cultivate a culture\nof writing in that Creole. For example, in 2014, a lan-\nguage academy was founded for Haitian Kreyol8,9. For\nthose planning to work on text-based Creole applica-\ntions, it is vital to become attuned to the current writ-\ning culture of that Creole’s community, and be aware of\nhow speakers are wanting to use their Creole in writing.\n8https://en.wikipedia.org/wiki/\nAkademi_Krey%C3%B2l_Ayisyen\n9http://akademikreyol.net/\nBugs or Features?\nIn summary, many of the fea-\ntures discussed above may be perceived as introducing\n“challenges” or difﬁcult “problems” for NLP to grap-\nple with, as these features are not shared with high-\nresource languages, like English or Mandarin. How-\never, these so-called “problems for NLP” are often con-\nsidered positive features by Creole language speakers\nthemselves. We challenge readers not to think of how\nthey can make Creoles work for NLP, but how NLP can\nwork for Creoles.\n3.\nWhat’s Wanted and What’s Needed\nIn this section, we will give an overview of the key\ntakeaways from our conversations with experts, as well\nas the major ﬁndings from surveying speakers belong-\ning to various Creole speaking communities.\nConnecting with Experts\nAs discussed by Bird\n(2020), building respectful relationships with the rel-\nevant community is absolutely necessary, and reaching\nout to relevant experts is a great ﬁrst step towards this\ndirection. For the scope of this work, our deﬁnition of\nan “expert” is not strict. We consider an expert to be\nanyone who is engaged in research, education, or other\ncommunity outreach, somehow involving the Creole.\nThis can include, for example, individuals working at\nlanguage schools, ﬁeld linguists doing research in the\narea, local scientists in any ﬁeld, or even graduate stu-\ndents who are native speakers of such languages. In-\ndeed, there are many reasons to begin by reaching out\nto experts, before even deﬁning your project. First, de-\nspite coming from diverse academic backgrounds, ex-\nperts across different specialities typically speak the\nsame language of scholarship. Although terminolog-\nical baggage may still interfere with discussion, gener-\nally it is easier for fellow ﬁeld experts to understand,\nand empathise with each others’ goals, than perhaps\nothers. Moreover, even if the experts are not directly\nworking in your ﬁeld, they may still be familiar or ex-\nposed to it. In establishing this relationship, and learn-\ning about each other’s research or work, there is also a\nlikelihood that some interests overlap, and the opportu-\nnity presents itself that you can also help them, which\nin turn helps to end the norm of treating low-resource\nlanguage speakers as resources to extract from, and es-\ntablish a collaborative relationship (Bird, 2020). Ad-\nditionally, experts also have the authority and knowl-\nedge to give you an informed “bird’s eye” view of the\nCreole community, their needs, and desires, as the ex-\npert is also a part of it. It’s a great (probably neces-\nsary) starting point for anyone planning on working on\na Creole-language, while not already embedded in the\ncommunity.\nSurveying Creole Speakers\nWith this in mind, dis-\ncussion with experts alone runs a large risk of missing\nout on the thoughts of every day Creole speakers, for\nwhom the language technology is ultimately intended.\nThus, their thoughts, opinion, desires, and worries are\nof utmost importance. For this work, we invited Creole\nspeakers to voice their opinions, and to participate in\na survey, through both Twitter and Reddit. Two points\nshould be noted about this approach: (1) One limitation\nof this method is that our posts already unfortunately\nexclude Creole speakers not also speaking English or\nFrench, and (2) We attempt to break away from ex-\ntractive/exploitative research practices by asking only\nthose with additional interest in the topic to ﬁll out the\nsurvey (i.e., for those individuals without substantial\ninterest, we try to minimize the time required for them\nto contribute to the discussion, by asking general, open\nended questions). While the best case scenario would\nhave been to compensate people for their time, as Hu et\nal. (2011) recall, it can be very difﬁcult to ﬁnd people\nwilling to participate even for payment. Fortunately for\nthis work, we were still able to ﬁnd a sizeable number\nof Creole speakers interested in this topic, and willing\nto have a discussion with us, even if they did not ﬁll\nout the survey. For the survey, we had 37 participants\nin total (35 in English, 2 in French), residing in a di-\nverse range of regions (e.g., Caribbean, Africa, North\nAmerica, Europe, Asia, and the Paciﬁc). We ﬁrst asked\nquestions about their linguistic background, and use of\nvarious languages in daily life. Then, to target NLP\nwants and needs, we asked more questions about their\nlanguage use with regards to technology (”e.g. read-\ning/writing SMS on mobile phone, reading/writing on\nthe internet, reading and writing e-mails, interacting\nwith home assistant devices, etc.”). For many ques-\ntions, we included additional prompts, welcoming par-\nticipants to expand and explain their answers in short-\nform, which ultimately yielded many important discus-\nsion points from the Creole speakers10.\nFor the rest of this section, we will review the consis-\ntent themes that arose in our conversations with ex-\nperts, about the wants and needs of Creole language\nusers. These themes will be further expanded upon by\nthe input provided by Creole speakers from our survey.\nAgain, not all themes will be relevant for every Creole.\nOn the contrary, themes seem to be primarily relevant\nto Creoles with very speciﬁc attributes in common (see\nSection 4).\nIs Language Technology Wanted or Needed?\nAs\ndiscussed throughout this paper, Creole languages are\nincredibly diverse, including in the way people want\n(or don’t want) to use these languages to interact with\ntechnology.\nThus, it should come as little surprise,\nthat the answer to the question: “Is language technol-\nogy wanted and/or needed for this language?”, can be\neverything from “Yes!”, “Some technology would be\nnice”, “No”, and “Why would you waste time doing\nthat?!”, among others.\nAmongst both experts and Creole speaking survey re-\nspondents, the answer to this question appeared to be\nlargely contingent on how proﬁcient members of the\nlarger community are in the local, high-prestige lan-\n10Please contact us directly if you would like access to our\nsurveys.\nFigure 1: We map a sample of Creole languages to our proposed Creole continuum for language technology. PL\nhere refers to “Prestige Language”. We map Haitian Kreyol (HK), Hawaiian Pidgin (HP), Louisiana Creole (LC),\nNigerian Pidgin (NP), Papiamento (PM), Singlish (SI).\nguage (typically English, French, or Portuguese). For\ninstance, a limited subset of the population of Haiti\nspeaks French, and thus Haitian Kreyol is used in most\naspects of every day life, and technology to ease the use\nof Haitian Kreyol is highly desired. On the other end of\nthe spectrum, experts and speakers of Hawaiian Pidgin\nhad difﬁculties coming up with reasons why language\ntechnology support for their Creole would be particu-\nlarly useful, as the overwhelming majority of speakers\n(if not all) are highly proﬁcient in English.\nCurrent Obstacles\nIn our discussions, some ex-\npressed that they already use their Creole for basic\ntasks, such as texting friends, but that it was not always\neasy. For example, existing autocomplete or autocor-\nrect software on phones and computers (installed in the\nrelevant high-prestige language, as these technologies\nare not readily available to Creoles) often automatically\n“corrects” Creole spellings or words, and inadvertently\nsuppressing written Creole usage in daily life.\nAnother issue that Creole speakers mentioned about\nexisting speech technology, was the lack of support for\nCreole accents or casual code-switching with common-\nplace Creole words. For instance, navigational assis-\ntants for GPS struggle to understand Hawaiian Pidgin\naccents, in addition to being unable to pronounce local\nstreet names, which can be uttered in Hawaiian Pidgin,\nbut not in Standard American English. Extending exist-\ning speech technology for dominant, high-prestige lan-\nguages in this space is much desired, and can be prefer-\nable over having a separate, Creole-only system. But\nwithout these modiﬁcations, existing language technol-\nogy for the local, high-prestige language can actively\nharm Creole speakers.\nSpeech Technology\nAs discussed in the Background,\nmany Creole languages are used almost exclusively\nused in spoken conversation. For such Creoles, text-\nbased language technology are likely moot. Although\nthis can change with time, we encourage readers inter-\nested in working in Creole spaces to check with experts\nand communities, to ascertain if text-based technolo-\ngies are even needed.\nWhen speech technology was discussed, most Cre-\nole languages expressed interest and desire in having\nspeech technology (both text-to-speech and speech-to-\ntext), with the small exception of Creole languages un-\nder threat of decreolization (the process by which a\nCreole ceases to exist), where language revitalization is\nthe dominant concern. But overall, speech technology\nwas perceived by experts and survey respondents to be\nthe most desirable and wanted language technology.\nFacilitating Writing\nSome Creole speaking com-\nmunities already do a lot of writing in their Creole\nlanguage (despite some obstacles, as we have seen),\nand/or are trying to foster a culture of writing in the\nCreole, including standardizing the language. In our\nconversations with experts and survey responders, we\nnote that there is an expressed need by some Cre-\nole communities for basic word processing tools, such\nas word processors, spell-checkers, grammar-checkers,\nauto-transcription, etc.\nHowever, we found that not\nall Creole communities welcome all of these technolo-\ngies equally. For example, speakers of Haitian Kreyol\nmostly welcome spell-checkers, meanwhile speakers\nof Nigerian Pidgin would eschew these, as it constrains\ntheir language use. This point demonstrates how, even\nwhen there is a shared desire for a speciﬁc kind of\nlanguage technology, the implementation and speciﬁc\nneeds for a Creole can be highly specialized. Lastly,\nwe note that, just as you must learn to walk before you\ncan run, technologies that ease or improve writing in\nCreoles may be necessary before Creole speakers could\nhave a need for semantic parsing, for example.\nQuestion\nAnswering and\nMachine\nTranslation\nBoth question answering (QA) and machine transla-\ntion (MT) came up as desired technologies for many\nCreoles, albeit for different reasons. For Creoles al-\nready used online to some extent, QA could improve\nonline search, while MT from Creole into a high re-\nsource language, or vice-versa, could provide access to\nother parts of the world for Creole speakers. Also, MT\nwas cited as desirable for even some endangered Cre-\noles, like Louisiana Creole, as it could help with revi-\ntalization. For example, automatic translation from En-\nglish or French to Louisiana Creole, could allow people\nto enjoy new domains in Louisiana Creole, and in turn\nassist with (re)learning the language.\nSummary\nOverall, our discussions with Creole ex-\nperts and every day Creole speakers underscored how\ndiverse the needs of Creoles can be, for even within\none group of languages. We hope this discussion, and\nthe themes put forward, can serve as a springboard for\nthose planning to work on NLP for Creoles.\n4.\nCreole Continuum for Language\nTechnology\nWhile the previous section demonstrated that Creoles\nare not a monolith when it comes to wants and needs\nfor language technology, we did observe several pat-\nterns, where Creoles seemed to cluster together, based\non their language technology needs, depending on a\nfew shared attributes. To this effect, we introduce a\nCreole continuum for language Technology (inspired\nby the post-Creole continuum (DeCamp, 1971)), and\npropose that there are three key factors that can heav-\nily inﬂuence the general needs of a Creole, as follows:\n(1) Monolingual, Bilingual, or Multilingual commu-\nnity (in other words, is the Creole a lingua franca, fa-\ncilitating cross-lingual communication?); and (2) Gen-\neral ﬂuency in the relevant prestige language (i.e., do\nmost people also speak the more globally prestigious\nlanguage, and get on ﬁne, without the Creole?); and (3)\nSocietal acceptance of Creole (e.g., is the Creole lan-\nguage embraced by society as large, or does the Creole\nstruggle from a bad reputation?). We present this con-\ntinuum in Figure 1, with a small collection of Creole\nlanguages, to serve as an example.11\nThe ﬁrst pattern we would like to draw to the reader’s\nattention to is that the Creoles existing within predom-\ninantly monolingual societies, that are also highly ﬂu-\nent in the local prestige language, are those that do not\n11We speciﬁcally intend the graph axis to be ﬂexible for\ninterpretation, as different Creoles will have different needs,\nand strict or concrete axis categories may risk reinforcing ex-\nisting marginalization.\nneed language technology (Hawaiian Pidgin), at least\nnot beyond revitalization (Louisiana Creole). Also, any\ntime that the larger society exhibits very low ﬂuency\nin the prestige language, language technology is much\nmore likely to be wanted and needed in these commu-\nnities (Haitian Kreyol). For other Creoles, it is not so\nclear cut, though. For example, both Singlish and Papi-\namento exist in generally multilingual societies, with\na majority of speakers also ﬂuent in Dutch and En-\nglish, respectively, and yet the increased societal accep-\ntance of Papiamento (Papiamento is a recognized lan-\nguage of Aruba), means that speakers are more likely to\nwelcome or express needs for language technologies.\nStill, Singlish is not to be completely neglected, but\ndue to its lower acceptance, language technology suit-\ning more informal situations (e.g. dialog) will likely be\nmore relevant. And ﬁnally, the speakers of languages\nwith high acceptance of Creole, namely Papiamento,\nHaitian Kreyol, and Nigerian Pidgin, are those who\ntypically have the most clear cut wants and needs from\nlanguage technology, as they already likely use their\nCreole to interact with technology.\n5.\nConclusion\nIn this work, we have demonstrated that Creole lan-\nguages should be of larger interest to the NLP commu-\nnity, and we provide a survey of resources and NLP\nresearch produced for Creoles. In doing this, we have\nalso shown that Creoles cannot be conﬂated together, if\nwe are to make language technology that is truly useful\nfor a community. Truly, the best approach to devel-\noping NLP for Creoles to to get in contact with both\nexperts and community members, and listen earnestly\nto their wants and needs for language technologies, as\nwell as what is speciﬁcally not wanted.\n6.\nAcknowledgements\nWe would like to thank the Creole language experts\nand Creole speakers, without whom, this work would\nnot be possible. This includes Michel Degraff (MIT\nHaiti Initiative), Christina Higgins (Charlene Junko\nSato Center for Pidgin, Creole, and Dialect Studies),\nand our Creole-speaking colleagues in NLP, namely,\nSamson Tan (National University of Singapore; Sales-\nforce) and Rasul Dent (Universit´e de Lorraine). Fi-\nnally, this project has received funding from the Eu-\nropean Union’s Horizon 2020 research and innova-\ntion programme under the Marie Skłodowska-Curie\ngrant agreement No 801199 (for Heather Lent)\n⋆\n⋆\n⋆\n⋆\n⋆\n⋆\n⋆\n⋆\n⋆⋆⋆\n⋆,\nthe Swedish Research Council Grant 2020-00437 (for\nMiryam de Lhoneux), and the Google Research Award\n(for Heather Lent and Anders Søgaard).\n7.\nBibliographical References\nAdelani, D. I., Abbott, J., Neubig, G., D’souza, D.,\nKreutzer, J., Lignos, C., Palen-Michel, C., Buza-\naba, H., Rijhwani, S., Ruder, S., Mayhew, S., Az-\nime, I. A., Muhammad, S. H., Emezue, C. C.,\nNakatumba-Nabende, J., Ogayo, P., Anuoluwapo,\nA., Gitau, C., Mbaye, D., Alabi, J., Yimam, S. M.,\nGwadabe, T. R., Ezeani, I., Niyongabo, R. A., Muki-\nibi, J., Otiende, V., Orife, I., David, D., Ngom, S.,\nAdewumi, T., Rayson, P., Adeyemi, M., Muriuki,\nG., Anebi, E., Chukwuneke, C., Odu, N., Waira-\ngala, E. P., Oyerinde, S., Siro, C., Bateesa, T. S.,\nOloyede, T., Wambui, Y., Akinode, V., Nabagereka,\nD., Katusiime, M., Awokoya, A., MBOUP, M., Ge-\nbreyohannes, D., Tilaye, H., Nwaike, K., Wolde,\nD., Faye, A., Sibanda, B., Ahia, O., Dossou, B.\nF. P., Ogueji, K., DIOP, T. I., Diallo, A., Akin-\nfaderin, A., Marengereke, T., and Osei, S. (2021).\nMasakhaNER: Named entity recognition for African\nlanguages. Transactions of the Association for Com-\nputational Linguistics, 9:1116–1131.\nAgi´c, ˇZ. and Vuli´c, I.\n(2019).\nJW300:\nA wide-\ncoverage parallel corpus for low-resource languages.\nIn Proceedings of the 57th Annual Meeting of the\nAssociation for Computational Linguistics, pages\n3204–3210, Florence, Italy, July. Association for\nComputational Linguistics.\nAhia, O. and Ogueji, K. (2020). Towards supervised\nand unsupervised neural machine translation base-\nlines for nigerian pidgin. ArXiv, abs/2003.12660.\nAjisafe, D., Adegboro, O. G., Oduntan, E., and Aru-\nlogun, T. O. (2020). Towards end-to-end training\nof automatic speech recognition for nigerian pidgin.\nArXiv, abs/2010.11123.\nAlleyne, M. (1971). Acculturation and the cultural\nmatrix of creolization.\nPidginization and, pages\n169–186.\nArtetxe, M., Labaka, G., and Agirre, E.\n(2020a).\nTranslation artifacts in cross-lingual transfer learn-\ning.\nIn Proceedings of the 2020 Conference on\nEmpirical Methods in Natural Language Process-\ning (EMNLP), pages 7674–7684, Online, November.\nAssociation for Computational Linguistics.\nArtetxe, M., Ruder, S., and Yogatama, D. (2020b).\nOn the cross-lingual transferability of monolingual\nrepresentations. In Proceedings of the 58th Annual\nMeeting of the Association for Computational Lin-\nguistics, pages 4623–4637, Online, July. Association\nfor Computational Linguistics.\nBajpai, R., Poria, S., Ho, D., and Cambria, E. (2017).\nDeveloping a concept-level knowledge base for sen-\ntiment analysis in singlish. CoRR, abs/1707.04408.\nBaker, P. and Sing, G. F. (2007). The making of Mau-\nritian Creole. Analyses diachroniques `a partir des\ntextes anciens. Number 9. Battlebridge.\nBickerton, D. (1984). The language bioprogram hy-\npothesis. Behavioral and brain sciences, 7(2):173–\n188.\nBigi, B., Caron, B., and Abiola, O. S. (2017). Devel-\noping resources for automated speech processing of\nthe african language naija (nigerian pidgin).\nBird, S. (2020). Decolonising speech and language\ntechnology. In Proceedings of the 28th International\nConference on Computational Linguistics, pages\n3504–3519, Barcelona, Spain (Online), December.\nInternational Committee on Computational Linguis-\ntics.\nBudur, E., ¨Ozc¸elik, R., Gungor, T., and Potts, C.\n(2020). Data and Representation for Turkish Natu-\nral Language Inference. In Proceedings of the 2020\nConference on Empirical Methods in Natural Lan-\nguage Processing (EMNLP), pages 8253–8267, On-\nline, November. Association for Computational Lin-\nguistics.\nChris Callison-Burch, et al., editors.\n(2011).\nPro-\nceedings of the Sixth Workshop on Statistical Ma-\nchine Translation. Association for Computational\nLinguistics, Edinburgh, Scotland, July.\nCaron, B., Courtin, M., Gerdes, K., and Kahane, S.\n(2019). A surface-syntactic UD treebank for Naija.\nIn Proceedings of the 18th International Workshop\non Treebanks and Linguistic Theories (TLT, Syn-\ntaxFest 2019), pages 13–24, Paris, France, August.\nAssociation for Computational Linguistics.\nChen, T. and Min-Yen, K. (2015). The national univer-\nsity of singapore sms corpus.\nConneau, A., Rinott, R., Lample, G., Williams, A.,\nBowman, S., Schwenk, H., and Stoyanov, V. (2018).\nXNLI: Evaluating cross-lingual sentence represen-\ntations. In Proceedings of the 2018 Conference on\nEmpirical Methods in Natural Language Process-\ning, pages 2475–2485, Brussels, Belgium, October-\nNovember. Association for Computational Linguis-\ntics.\nCorne, C. (1999). From French to Creole: The devel-\nopment of new vernaculars in the French colonial\nworld, volume 5. Westminster creolistics.\nDabre, R., Sukhoo, A., and Bhattacharyya, P. (2014).\nAnou tradir: Experiences in building statistical ma-\nchine translation systems for mauritian languages –\ncreole, English, French. In Proceedings of the 11th\nInternational Conference on Natural Language Pro-\ncessing, pages 82–88, Goa, India, December. NLP\nAssociation of India.\nDaval-Markussen, A. and Bakker, P. (2012). Explo-\nrations in creole research with phylogenetic tools. In\nEACL 2012.\nDeCamp, D. (1971). Toward a generative analysis of\na post-creole speech continuum. Cambridge Univer-\nsity Press.\nDeGraff, M. (2001). On the origin of creoles: A carte-\nsian critique of neo-darwinian linguistics. Linguistic\nTypology, 5(2/3):213–310.\nDeGraff, M. (2003). Against creole exceptionalism.\nLanguage, 79(2):391–410.\nDeGraff, M. (2005). Linguists’ most dangerous myth:\nThe fallacy of creole exceptionalism. Language in\nsociety, 34(4):533–591.\nDo˘gru¨oz, A. S., Sitaram, S., Bullock, B. E., and\nToribio, A. J. (2021). A survey of code-switching:\nLinguistic and social perspectives for language tech-\nnologies. In Proceedings of the 59th Annual Meet-\ning of the Association for Computational Linguistics\nand the 11th International Joint Conference on Nat-\nural Language Processing (Volume 1: Long Papers),\npages 1654–1666, Online, August. Association for\nComputational Linguistics.\nMatthew S. Dryer et al., editors. (2013). WALS On-\nline. Max Planck Institute for Evolutionary Anthro-\npology, Leipzig.\nGraham, Y., Haddow, B., and Koehn, P. (2020). Statis-\ntical power and translationese in machine translation\nevaluation. In Proceedings of the 2020 Conference\non Empirical Methods in Natural Language Process-\ning (EMNLP), pages 72–81, Online, November. As-\nsociation for Computational Linguistics.\nHagemeijer, T., G´en´ereux, M., Hendrickx, I., Mendes,\nA., Tiny, A., and Zamora, A. (2014). The Gulf of\nGuinea creole corpora. In Proceedings of the Ninth\nInternational Conference on Language Resources\nand Evaluation (LREC’14), pages 523–529, Reyk-\njavik, Iceland, May. European Language Resources\nAssociation (ELRA).\nHenri, F., Stump, G., and Tribout, D. (2020). Deriva-\ntion and the morphological complexity of three\nfrench-based creoles. In The Complexities of Mor-\nphology, pages 105–135. Oxford University Press.\nHinrichs, L. (2006). Codeswitching on the Web. John\nBenjamins Amsterdam.\nHo, D., Hamzah, D., Poria, S., and Cambria, E. (2018).\nSinglish senticnet: A concept-based sentiment re-\nsource for singapore english. In 2018 IEEE Sympo-\nsium Series on Computational Intelligence (SSCI),\npages 1285–1291.\nHolm, J. (1982). Central American English, volume 2.\nJohn Benjamins Publishing.\nHu, C., Resnik, P., Kronrod, Y., Eidelman, V., Buzek,\nO., and Bederson, B. B.\n(2011).\nThe value of\nmonolingual crowdsourcing in a real-world transla-\ntion scenario: Simulation using Haitian Creole emer-\ngency SMS messages. In Proceedings of the Sixth\nWorkshop on Statistical Machine Translation, pages\n399–404, Edinburgh, Scotland, July. Association for\nComputational Linguistics.\nHuson, D. H. and Bryant, D. (2006). Application\nof phylogenetic networks in evolutionary studies.\nMolecular biology and evolution, 23(2):254–267.\nJoshi, P. M., Santy, S., Budhiraja, A., Bali, K., and\nChoudhury, M. (2020). The state and fate of lin-\nguistic diversity and inclusion in the nlp world. In\nACL.\nKouwenberg, S. and Singler, J. V. (2009). The hand-\nbook of pidgin and creole studies. John Wiley &\nSons.\nLent, H., Bugliarello, E., de Lhoneux, M., Qiu, C.,\nand Søgaard, A. (2021). On language models for\ncreoles. In Proceedings of the 25th Conference on\nComputational Natural Language Learning, pages\n58–71, Online, November. Association for Compu-\ntational Linguistics.\nLiu, F., Bugliarello, E., Ponti, E., Reddy, S., Col-\nlier, N., and Elliott, D. (2021). Visually grounded\nreasoning across languages and cultures.\nArXiv,\nabs/2109.13238.\nMcWhorter, J. H. (1998). Identifying the creole pro-\ntotype: Vindicating a typological class. Language,\npages 788–818.\nSusanne Maria Michaelis, et al., editors.\n(2013).\nAPiCS Online. Max Planck Institute for Evolution-\nary Anthropology, Leipzig.\nMillour, A. and Fort, K. (2020). Text corpora and\nthe challenge of newly written languages. In Pro-\nceedings of the 1st Joint Workshop on Spoken\nLanguage Technologies for Under-resourced lan-\nguages (SLTU) and Collaboration and Computing\nfor Under-Resourced Languages (CCURL), pages\n111–120, Marseille, France, May. European Lan-\nguage Resources association.\nMirzakhalov, J., Babu, A., Ataman, D., Kariev, S.,\nTyers, F., Abduraufov, O., Hajili, M., Ivanova, S.,\nKhaytbaev, A., Laverghetta Jr., A., Moydinboyev,\nB., Onal, E., Pulatova, S., Wahab, A., Firat, O., and\nChellappan, S. (2021). A large-scale study of ma-\nchine translation in Turkic languages. In Proceed-\nings of the 2021 Conference on Empirical Meth-\nods in Natural Language Processing, pages 5876–\n5890, Online and Punta Cana, Dominican Republic,\nNovember. Association for Computational Linguis-\ntics.\nMuhammad, S. H., Adelani, D. I., Ruder, S., Ahmad,\nI. S., Abdulmumin, I., Bello, B. S., Choudhury, M.,\nEmezue, C. C., Abdullahi, S. S., Aremu, A., Jeorge,\nA., and Brazdil, P. (2022). Naijasenti: A nigerian\ntwitter sentiment corpus for multilingual sentiment\nanalysis.\nMunro, R. (2010). Crowdsourced translation for emer-\ngency response in haiti: the global collaboration of\nlocal knowledge. In In Relief 2.0 in Haiti.\nMurawaki, Y. (2016). Statistical modeling of creole\ngenesis. In NAACL.\nMuysken, P. and Smith, N. (1986). Substrata versus\nuniversals in creole genesis: papers from the Am-\nsterdam Creole Workshop, April 1985, volume 1.\nJohn Benjamins Publishing.\nNdubuisi-Obi, I., Ghosh, S., and Jurgens, D. (2019).\nW´etin dey with these comments? modeling sociolin-\nguistic factors affecting code-switching behavior, in\nnigerian online discussions. In Proceedings of the\n57th Annual Meeting of the Association for Compu-\ntational Linguistics (Volume 2: Short Papers).\nNekoto, W., Marivate, V., Matsila, T., Fasubaa, T.,\nFagbohungbe, T., Akinola, S. O., Muhammad, S.,\nKabongo Kabenamualu, S., Osei, S., Sackey, F.,\nNiyongabo, R. A., Macharm, R., Ogayo, P., Ahia,\nO., Berhe, M. M., Adeyemi, M., Mokgesi-Selinga,\nM., Okegbemi, L., Martinus, L., Tajudeen, K.,\nDegila, K., Ogueji, K., Siminyu, K., Kreutzer, J.,\nWebster, J., Ali, J. T., Abbott, J., Orife, I., Ezeani,\nI., Dangana, I. A., Kamper, H., Elsahar, H., Duru,\nG., Kioko, G., Espoir, M., van Biljon, E., White-\nnack, D., Onyefuluchi, C., Emezue, C. C., Dossou,\nB. F. P., Sibanda, B., Bassey, B., Olabiyi, A., Ramk-\nilowan, A., ¨Oktem, A., Akinfaderin, A., and Bashir,\nA. (2020). Participatory research for low-resourced\nmachine translation: A case study in African lan-\nguages. In Findings of the Association for Computa-\ntional Linguistics: EMNLP 2020, pages 2144–2160,\nOnline, November. Association for Computational\nLinguistics.\nOgueji, K. and Ahia, O. (2019). Pidginunmt: Un-\nsupervised neural machine translation from west\nafrican pidgin to english. ArXiv, abs/1912.03444.\nOgueji, K., Zhu, Y., and Lin, J. (2021). Small data?\nno problem!\nexploring the viability of pretrained\nmultilingual language models for low-resourced lan-\nguages. In Proceedings of the 1st Workshop on Mul-\ntilingual Representation Learning, pages 116–126,\nPunta Cana, Dominican Republic, November. Asso-\nciation for Computational Linguistics.\nOren, Y., Sagawa, S., Hashimoto, T. B., and Liang, P.\n(2019). Distributionally robust language modeling.\narXiv preprint arXiv:1909.02060.\nOyewusi, W. F., Adekanmbi, O., and Akinsande, O.\n(2020). Semantic enrichment of nigerian pidgin en-\nglish for contextual sentiment classiﬁcation. ArXiv,\nabs/2003.12450.\nOyewusi, W. F., Adekanmbi, O., Okoh, I., Onuigwe, V.,\nSalami, M. I., Osakuade, O., Ibejih, S., and Musa,\nU. A. (2021). Naijaner : Comprehensive named\nentity recognition for 5 nigerian languages. ArXiv,\nabs/2105.00810.\nParkvall, M. et al. (2008). The simplicity of creoles in\na cross-linguistic perspective. Language complexity:\nTypology, contact, change, pages 265–285.\nPurschke, C. (2021). Crowdscapes. participatory re-\nsearch and the collaborative (re) construction of lin-\nguistic landscapes with lingscape. Linguistics Van-\nguard, 7(s1).\nRickford, J. R.\n(1987).\nDimensions of a Creole\ncontinuum: History, texts & linguistic analysis of\nGuyanese Creole. Stanford University Press.\nSchang, E., Roug´e, J.-L., Eshkol, I., and Petit, M.\n(2005). Creoldata: A lexical database on creole lan-\nguages. Revue francaise de linguistique appliquee,\n10(1):65–76.\nSebba, M. (1997). Contact languages: Pidgins and\ncreoles. Macmillan International Higher Education.\nSebba, M. (1998). Phonology meets ideology: the\nmeaning of orthographic practices in british cre-\nole. Language problems and language planning,\n22(1):19–47.\nSessarego, S. (2020). Not all grammatical features are\nrobustly transmitted during the emergence of cre-\noles. Humanities and Social Sciences Communica-\ntions, 7:1–8.\nSiegel, J. (1999). Stigmatized and standardized vari-\neties in the classroom: Interference or separation?\nTesol Quarterly, 33(4):701–728.\nSlone, T. H. (2001). One Thousand One Papua New\nGuinean Nights: Tales form 1972-1985, volume 1.\nMasalai Press.\nTan, S., Joty, S., Varshney, L., and Kan, M.-Y. (2020).\nMind your inﬂections!\nImproving NLP for non-\nstandard Englishes with Base-Inﬂection Encoding.\nIn Proceedings of the 2020 Conference on Empirical\nMethods in Natural Language Processing (EMNLP),\npages 5647–5663, Online, November. Association\nfor Computational Linguistics.\nThomason, S. G. and Kaufman, T. (1992). Language\ncontact, creolization, and genetic linguistics. Univ\nof California Press.\nVolansky, V., Ordan, N., and Wintner, S. (2013). On\nthe features of translationese. Digital Scholarship in\nthe Humanities, 30(1):98–118, 07.\nWang, H., Zhang, Y., Chan, G. L., Yang, J., and\nChieu, H. L. (2017). Universal Dependencies pars-\ning for colloquial singaporean English. In Proceed-\nings of the 55th Annual Meeting of the Association\nfor Computational Linguistics (Volume 1: Long Pa-\npers), pages 1732–1744, Vancouver, Canada, July.\nAssociation for Computational Linguistics.\n8.\nLanguage Resource References\nNordhoff, Sebastian. (2006). Collection ‘Sri Lanka\nMalay‘. The Language archive.\n",
  "categories": [
    "cs.CL",
    "cs.CY"
  ],
  "published": "2022-06-01",
  "updated": "2022-06-01"
}