{
  "id": "http://arxiv.org/abs/2210.04451v1",
  "title": "Self-move and Other-move: Quantum Categorical Foundations of Japanese",
  "authors": [
    "Ryder Dale Walton"
  ],
  "abstract": "The purpose of this work is to contribute toward the larger goal of creating\na Quantum Natural Language Processing (QNLP) translator program. This work\ncontributes original diagrammatic representations of the Japanese language\nbased on prior work that accomplished on the English language based on category\ntheory. The germane differences between the English and Japanese languages are\nemphasized to help address English language bias in the current body of\nresearch. Additionally, topological principles of these diagrams and many\npotential avenues for further research are proposed. Why is this endeavor\nimportant? Hundreds of languages have developed over the course of millennia\ncoinciding with the evolution of human interaction across time and geographic\nlocation. These languages are foundational to human survival, experience,\nflourishing, and living the good life. They are also, however, the strongest\nbarrier between people groups. Over the last several decades, advancements in\nNatural Language Processing (NLP) have made it easier to bridge the gap between\nindividuals who do not share a common language or culture. Tools like Google\nTranslate and DeepL make it easier than ever before to share our experiences\nwith people globally. Nevertheless, these tools are still inadequate as they\nfail to convey our ideas across the language barrier fluently, leaving people\nfeeling anxious and embarrassed. This is particularly true of languages born\nout of substantially different cultures, such as English and Japanese. Quantum\ncomputers offer the best chance to achieve translation fluency in that they are\nbetter suited to simulating the natural world and natural phenomenon such as\nnatural speech.\n  Keywords: category theory, DisCoCat, DisCoCirc, Japanese grammar, English\ngrammar, translation, topology, Quantum Natural Language Processing, Natural\nLanguage Processing",
  "text": "QUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n1 \n \n \nSelf-move and Other-move:  \nQuantum Categorical Foundations of Japanese \nRyder Dale Walton \nCapitol Technical University \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n2 \n \n2 \n \nAbstract \nThe purpose of this work is to contribute toward the larger goal of creating a Quantum \nNatural Language Processing (QNLP) translator program. This work contributes \noriginal diagrammatic representations of the Japanese language based on prior work that \naccomplished on the English language based on category theory. The germane \ndifferences between the English and Japanese languages are emphasized to help address \nEnglish language bias in the current body of research. Additionally, topological \nprinciples of these diagrams and many potential avenues for further research are \nproposed. Why is this endeavor important? Hundreds of languages have developed over \nthe course of millennia coinciding with the evolution of human interaction across time \nand geographic location. These languages are foundational to human survival, \nexperience, flourishing, and living the good life. They are also, however, the strongest \nbarrier between people groups. Over the last several decades, advancements in Natural \nLanguage Processing (NLP) have made it easier to bridge the gap between individuals \nwho do not share a common language or culture. Tools like Google Translate and \nDeepL make it easier than ever before to share our experiences with people globally. \nNevertheless, these tools are still inadequate as they fail to convey our ideas across the \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n3 \n \n3 \n \nlanguage barrier fluently, leaving people feeling anxious and embarrassed. This is \nparticularly true of languages born out of substantially different cultures, such as \nEnglish and Japanese. Quantum computers offer the best chance to achieve translation \nfluency in that they are better suited to simulating the natural world and natural \nphenomenon such as natural speech. \n \nKeywords: category theory, DisCoCat, DisCoCirc, Japanese grammar, English \ngrammar, translation, topology, Quantum Natural Language Processing, Natural \nLanguage Processing \n \n \n \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n4 \n \n4 \n \nWhy Quantum Computers? \n \nNatural Language Processing (NLP) is a field of much interest in computer \nscience and continues to produce significant new technologies. Indeed, the ongoing \nsuccess of NLP cannot be oversold. Voice assistants—Siri and Google Assistant—and \nsmart home hubs—Amazon Alexa, Google Home, and Apple HomePod—rely on NLP \nfor all their command inputs and basic functions. This includes reception of audio, \ngenerating text, parsing said text into tokens, processing the tokens, finding search \nresults, and performing other various commands. If classical computers provide all \nthese NLP benefits and successes, why spend the time to research what quantum \ncomputers can do? \nThe Problem \nScience Fiction authors and fans have long mused over the concept of a \nuniversal language translator. In fact, even the significantly less ambitious endeavor of \nproducing a fluent translator from one source language to another target language seems \nlike magic. Why? Frankly, NLP, despite its resounding success and significant forward \nmomentum, continues to fail to produce fluent translations. Consider Google Translate \nor DeepL. These machine translators provide a translation that is good enough to allow \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n5 \n \n5 \n \npeople from different cultures to communicate with one another. That alone is a modern \nmarvel, but if you ask anyone who has used such a translator if the translations sounded \nnatural—if they were fluent—at all, then they would simply respond with a “No”. \nAgain, why? It turns out that the translators do not know anything about culture. \nFurther, they do not know anything about extra-textual context. Even worse, they do not \nknow anything about grammar. Thus, ultimately, they do not know anything about \nlanguage. Machine translators do know an awful lot about corpora, probability, and \n“bags of words” though, which is enough to be very effective and reasonably accurate \nwith translations of single sentences (Coecke et al., 2020). However, it is not enough to \nbe fluent. It is, therefore, still necessary to rely on human translators in most situations \nwhere trans-cultural communication is required. Machine translators are simply not \ncapable enough to replace human translators in corporate meetings, travel tours, or long \ninterpersonal interactions. The present study aims to provide one step toward solving \nthis problem by building on research performed on English grammar in the field of \nQuantum Natural Language Processing (QNLP), extending that research to Japanese \ngrammar.  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n6 \n \n6 \n \nBut why would quantizing NLP provide a potential solution to the fluency \nproblem? Well, language is a natural phenomenon that has developed organically in \nhuman brains and in human cultures over millennia. Since language is a natural \nphenomenon, creating approaches to simulate grammar, like simulating quantum-sized \nproblems—molecular systems and chemical compounds—, is one potential path \nforward to improve machine language processing capabilities.1 In fact, the underlying \nmathematics of both reduce to the same core category theoretic representation, namely \ncompact closed categories (Zeng & Coecke, 2016). The main problem associated with \nmodeling languages, both grammar and semantics, is that it is far too resource intensive \nto be feasible on classical computers. This, then, is precisely why quantum computers \nfit the bill. Modeling processes require many, many variables and have many, many \npossible outcomes. Such problems are said to be “quantum-native” because quantum \ncomputers provide a pathway to unlocking the needed resources that classical \ncomputers can never attain (QNLP, 2019). Namely, the tensor product of many qubits \nprovides an exponential space advantage over classical bits (Meichanetzidis et al., \n \n1 Scott Aaronson notes that simulation of quantum systems is one of the more obvious uses of \nquantum computation (2013). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n7 \n \n7 \n \n2021). Suddenly, with quantum hardware, machine-generated translation fluency enters \nthe realm of the possible because modeling of grammar and semantics becomes possible \n(Zeng & Coecke, 2016). Other benefits include potential Grover’s algorithm-style \nquadratic speedups in processing (QNLP, 2019); and that quantum circuits are natively \nvectors or matrices (Coecke et al., 2018a). Particularly, working with density matrices \nallows for efficient preservation of more data, which means the system can track and \nmanipulate more state data (Coecke & Meichanetzidis, 2020). These stated benefits are \nonly a few of the known benefits of using quantum computers for language processing. \nThe possibility for more benefits certainly exists and is a topic of continuing research. \nFigure 0 \nComparison of a General NLP Pipeline with a General QNLP Pipeline \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n8 \n \n8 \n \n \nNote. This figure is original but based on work from a few different sources (Chen, \n2020; Lorenz et al., 2021; Meichanetzidis et al., 2021). Because the NLP pipeline relies \non Machine Learning (ML), there is a considerable amount of trial and error in each \nstep. Different representations of data, machine learning models, evaluation methods, \nCollect Data \nClean & Preprocess \nData \nRepresent Data \nFeatures \nChoose ML Model \nEvaluate Model \nPerformance \nDeploy Model into \nProduction \nParse Text into \nSyntax Tree \nCreate DisCo \nDiagram \nSimplify DisCo \nDiagram \nCreate Initial \nQuantum Circuit \nOptimize Quantum \nCircuit \nMeasurement: \nProcess Statistics \nNLP \nQNLP \nRepeat \nResult \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n9 \n \n9 \n \npreprocessing techniques, and the like all impact the performance of the model. \nAdditionally, as new information is made available, that information must be fed back \ninto the model to retrain it. The QNLP approach here, on the other hand, can leverage \ngrammar, greatly simplifying the number of choices. Unfortunately, creating a quantum \ncircuit from a DisCoCat diagram is not a solved problem and relies on ansatz and \noptimization. Still, having a set grammar eliminates the need for ML to be trained over \na bag of words or any other approach. This is a great boon. \n \nThe purpose of the present work, then, is to provide a necessary step forward for \ntranslating English into Japanese with a high degree of accuracy—whether the intended \nmeaning was conveyed correctly—and fluency—whether the meaning was conveyed \nnaturally. The present study differs from prior research in that it not only aims to \ncontribute to QNLP research, but also intends to cover blind spots in the literature that \nmay exist because of English language bias.2 To achieve this, diagrammatic reasoning, \nwhich is based on category theory, will be used throughout the work to contribute new \n \n2 Abbaszade et al. assert that studying other languages is an important area of further research in \nQNLP (2021). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n10 \n \n10 \n \ndiagrams to the field to aid further research while specifying general topological \nprinciples for said diagrams. \nBackground: Category Theory \nAll categories are made up of two types of entities, “objects and morphisms” \n(van de Wetering, 2020). Objects are the subjects of the category theory and morphisms \nare the legal operations on said subjects. An example is particularly enlightening \nbecause, to many, category theory may be unfamiliar territory. However, all current and \nformer students of mathematics are familiar with this example, most basic category: \nSets. In sets, objects are the sets themselves, and the morphisms are functions that map \none set to another.  \nCategories require two basic operations. First, categories must have sequential \ncomposition, which must be associative in nature. Suppose the following morphisms \nexist in a basic category: 𝑓: 𝐴→𝐵  and 𝑔: 𝐵→𝐶. In relation to sets, these represent a \ntransformation from the set on the left to the set on the right. Since sequential \ncomposition must be upheld to be a category, it must be possible to nest these two \nmorphisms and create a new one. This nesting produces the following result: 𝑔 ∘\n 𝑓: 𝐴 →𝐶. This can be read as “g after f” as a sequential composition represents \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n11 \n \n11 \n \nmorphemes that occur on objects one after the other (Coecke & Kissinger, 2017). \nAssociativity of sequential compositions means that the following must also be true: \nℎ ∘ (𝑔 ∘ 𝑓) = (ℎ ∘ 𝑔) ∘ 𝑓. In other words, regardless of the order in which the \nmorphemes are calculated produces the same result. \nSecondly, categories must have an identity morphism. The identity morphism is \nquite simple: 𝑖𝑑𝐴 : 𝐴 →𝐴. Simply put, the identity morphism maps the object back \nonto itself. In the case of sets, the function would produce no change. When the identity \nmorphism sequentially composes with another morphism, the result is as follows: \n𝑖𝑑𝐴  ∘ 𝑓= 𝑓. Thus, sequentially composing any morphism with the identity morphism \nresults in no change to the object. Nevertheless, the identity must hold for category \ntheory broadly to hold. \nWhile the above features of category theory are sufficient for working with sets, \nthey are inadequate for working with both languages and quantum mechanics. The first \nmissing piece is a way to represent actions happening simultaneously. Recall that \nsequential composition represents only sequential action—things happening one after \nthe other. There must also be some way to represents actions happening at the same \ntime. Fortunately, this is precisely what “monoidal” categories provide (van de \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n12 \n \n12 \n \nWetering, 2020). Monoidal categories do this by using the tensor product—a special \nquantum mechanical operator that denotes an addition of two subsystems, like vector \nspaces—to represent the sum of the two objects: 𝐴 ⨂𝐵∶= 𝐴+ 𝐵. This expression \nprovides parallel composition because there is no change to object A or change to \nobject B. It simply says that within the expanse of the object both A and B are \nrepresented. Now, is parallel composition associative? Is 𝐴 ⨂𝐵= 𝐵 ⨂𝐴? This is not \nnecessarily the case in a monoidal category, but it is true for a symmetric monoidal \ncategory (van de Wetering, 2020). The category is said to be symmetric because 𝐴 ⨂𝐵 \nand 𝐵 ⨂𝐴 are necessarily isomorphic. In this case, then, the order of the objects does \nnot matter when they are composed in parallel.  \nThe second missing piece is less intuitive. For a category theory to be sufficient \nfor quantum mechanics, there must also be a way to transform inputs to outputs and \noutputs to inputs. When such a structure is present and the category is symmetric, the \ncategory is called “compact closed” (van de Wetering, 2020). Why is this necessary? \nFor working with quantum mechanical ideas, the idea of non-separability must be \naddressed. Essentially, this means that there must be some graphical component that \nrepresents quantum entanglement because quantum theory is founded on the idea that \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n13 \n \n13 \n \nsomethings cannot be divided or separated—contrary to the assumptions of classical \nphysics. To accomplish this goal, it turns out that the graph must allow inputs to be \nconnected to other inputs and outputs connected to other outputs (Coecke & Kissinger, \n2017). This concept is easier to depict graphically and will be discussed further in the \nnext section. Suffice it to say for now that a compact closed symmetric monoidal \ncategory, or compact closed category for short, is sufficient for the present study.3 It is, \nafter all, “the fundamental structure in categorical quantum mechanics” (van de \nWetering, 2020). \nBut what does this have to do with language? It turns out the compact closed \ncategories that underlie quantum mechanics also underlie algebraic linguistics (Coecke, \n2020). Since both quantum mechanics and algebraic linguistics boil down to compact \nclosed categories, this reinforces the earlier assertion that language problems are \nquantum native. More discussion follows, but for now know that words correspond to \n \n3 Compact closed categories are a special case of rigid categories (Meichanetzidis et al., 2021). \nAdditionally, Zeng and Coecke use dagger compact categories as the basis of their work, which \ninclude the involutive functor, which is drawn as a dagger. This functor performs the identity \noperation on objects, but morphisms are mapped to their adjoints (2016). There is much more \nthat could be discussed in this regard from the perspective of category theory, which is a branch \nof mathematics. For the current discussion, this level of understanding suffices. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n14 \n \n14 \n \nquantum states, and grammatical structures correspond to quantum measurements \n(Coecke et al, 2021). Given this revelation, one can approach quantum problems and \nlinguistic problems from the same perspective using the same tools. In fact, using these \ntools makes the preprocessing of data into a quantum friendly structure quite easy \n(O’Riordan et a., 2020).  \nThe Software Tool  \nWhen it comes to category theory, one key software tool is DisCoPy, which is \na portmanteau of “Categorical Compositional Distributional” (DisCoCat4) and Python \n(Coecke, 2020; de Felice et al., 2021). Before continuing, it is worth mentioning that \nDisCoCat and Circuit-shaped Compositional Distributional (DisCoCirc) are two related \ndiagrammatic representations of category theoretical concepts that follow in this section \n(Coecke, 2020). Both kinds of diagrams can be referred to simultaneously as \nCompositional Distributional (DisCo) diagrams.5 DisCoCat is used when determining \n \n4 The order of the terms in the DisCoCat is in reverse because the acronym follows the same \nlogic as sequential composition. Stated plainly, it is “Distributional after Compositional after \nCategorical”.  \n5 The idea of distributional structure is decades old and is based on the idea that grammar \nenforces order, restrictions, and relative occurrences of elements (Harris, 1954). This suggests \nthat language can be represented by distributionally and is a cornerstone of DisCo diagrams. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n15 \n \n15 \n \nwhether a single sentence is grammatical and determining the meaning of a single \nsentence. DisCoCirc is used across a larger body of a text, in which each sentence is a \nprocess with inputs and outputs that are nouns, to track the updating of said nouns’ \nmeanings in said text (Coecke, 2020). Now, DisCoPy is a Python package that allows \nfor easy creation of string diagrams, which are diagrammatic representations of \nmorphisms in compact closed categories. This essentially means that DisCoPy allows \nfor the creation of diagrams that are potentially useful for studying natural languages. \nNow, string diagrams are particularly helpful when working with category theories \nbecause of the over-abundance of symbols and expressions required to describe \ncategories. The vernacular of category theory can also be quite overwhelming for the \nuninitiated. However, diagrammatic representations alleviate all this pain.  \nFor a first example, consider the morphemes f and g mentioned previously. The \nformer was simply defined as some operation that changes object A to object B: 𝑓: 𝐴→\n𝐵. Diagrammatically, DisCoPy depicts this as a box—morpheme—with two wires—\nobjects. Figure 1 is an example. \nFigure 1 \nf Depicted Diagrammatically Using DisCoPy \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n16 \n \n16 \n \n \n \nThroughout this work, the standard will be that the input, or domain, is \nrepresented at the top of the diagram. The bottom of the diagram is the output, or \ncodomain. Thus, this diagram represents some input A that undergoes some \ntransformation process into the output B. It could not be any simpler. 𝑔: 𝐵→𝐶 defines \na morpheme that changes B into C and is depicted similarly in Figure 2. While this may \nseem trivial at first, there is one difference between f and g that is worth noting. The \nbase types do not match. A, B, and C all represent something different. Thus, f and g \nmay not be equivalent processes. \nFigure 2 \ng Depicted Diagrammatically Using DisCoPy \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n17 \n \n17 \n \n \n \nFurthermore, these processes may be composed together. Recall 𝑔 ∘ 𝑓: 𝐴 →\n𝐶, which denotes the process g taking place after the process f concludes. \nDiagrammatically is depicted as follows in Figure 3. \nFigure 3 \nSequential Composition of f and g \n \n \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n18 \n \n18 \n \nThis is only the second stage of development of a diagrammatic depiction of \ncategory theory, and it already is easier to understand than using symbols. In this \nexample, all one needs to do is remember that these morphemes are a funnel. Since time \ntravels from top to bottom, object A enters morpheme f and outputs as B. Object B is \nthen input into morpheme g and outputs as C. The logic flows much the same as when \ndropping a coin into a machine or dropping a marble into a Rube Goldberg machine. On \nthe other hand, symbolic representation requires not only understanding of objects and \nmorphemes, but also an understanding of what the colon (:), the arrow (→), and the \nnewly introduced circle (∘) mean. Each of these characters introduce new readings that \nmust be memorized for the symbolic representation to make sense. Recall the \nmnemonic used earlier for ∘ to be read as “after”. The diagrammatic approach \nintroduced here avoids any extra overhead. \n \nBefore continuing, let us demonstrate associativity for sequential composition \nusing the diagram for the example above.6. The symbolic equation for associativity is \n \n6 A more detailed proof can be found in Coecke’s 2016 work. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n19 \n \n19 \n \nℎ ∘ (𝑔 ∘ 𝑓) = (ℎ ∘ 𝑔) ∘ 𝑓. Note that because time flows downward, there is no need \nto use parentheses. There is only one simplified graph required. See Figure 4. \nFigure 4 \nSequential Composition Associativity Diagrammatically Depicted \n \n \nWhat about parallel composition? As it turns out, this is also very easily \nrepresented diagrammatically, as in Figure 5. Recall that the symbolic representation is \n𝐴 ⨂𝐵, and the figure means “A while B” (Coecke & Kissinger, 2017). The diagram \nmanages to capture the same idea without forcing one to understand the tensor product, \nor even the simplified understanding of the tensor product used in category theory—A’s \nspace added to B’s space. The diagram shows both morphemes and all inputs and \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n20 \n \n20 \n \noutputs plainly. Though the morphemes do not interact with one another, they do exist. \nThis picture represents the totality of possibilities as they relate to these morphemes \nwith only two boxes and four wires. As an aside, it is worth noting that associativity for \nparallel composition can be demonstrated simply by graphing g on the left side of f \ninstead of the right side. \nFigure 5 \nParallel Composition of f and g Diagrammatically Depicted \n \n \n \nTo create graphs that represent quantum mechanical and linguistic ideas, the \nfinal required diagrammatic component for string diagrams connects inputs to inputs \nand outputs to outputs. This is done using “cups” and “caps” (Coecke & Kissinger, \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n21 \n \n21 \n \n2017). They get their names from their appearance. Figure 6 depicts a cup, and Figure 7 \ndepicts a cap. The X represents the original object, which is also referred to as the base \ntype. The X.R and the X.L represent the right and left adjoint of the underlying matrix \nstructure respectively. Beneath all these neat wires and boxes lies a rich world of linear \nalgebra. When considering grammar, the underlying formulation is some mathematical \ngrammar, such as Lambek’s pregroup grammar or Combinatory Categorical \nGrammar—CCG (Coecke, 2020; Lambek, 1997, 2008; Yeung & Kartsaklis, 2021). This \nchoice is typically not critical for later processing (Bolt et al., 2016). \nFigure 6 \nA Cup \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n22 \n \n22 \n \n \n \nFigure 7 \nA Cap \n \n \nNow, to understand how cup and cap connections work, it is instructive to see an \nexample. Figure 8 depicts cups and caps in the context of a larger diagram. Note that \nthis toy diagram is based on the most often used example by Coecke et al. (2020). \nWhile it is true that this sentence provides a toy example, it, nevertheless, is a complete \nlinguistic diagram of a simple subject-verb-object (SVO) sentence in English. \nTherefore, this diagram deserves some initial analysis and introductory explanation. \nFigure 8 \nCups and Caps in the Context of an English Sentence \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n23 \n \n23 \n \n \n \nFirst, note that the left side and right side of the arrow are equivalent in meaning \neven though they are not equivalent in representation. The left side is simpler and \nrequires only cups to complete the diagram. Each noun in the sentence is represented as \na box—like a morpheme, also called a process7, in Figure 1—at the semantic level, \nwhile the noun is assigned the pregroup grammar base type n. Transitive verbs also \nappear as boxes, but the wiring is more complicated. The transitive verb requires two \nnouns to be connected to it, one on the left and one on the right. Due to the rigid word \norder of English, the noun on the right side is the object of the verb, while the subject is \nthe noun on the left side. The verb, then, must contain the right adjoint and left adjoint \n \n7 Morphemes and their objects are often referred to as processes when the objects are \nenvisioned as inputs and outputs (Coecke & Kissinger, 2017). This is simply because processes \nhave inputs and outputs. It is a higher-level abstraction of the mechanisms at play. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n24 \n \n24 \n \nof the subject noun and object noun base types, respectively, and it must output some \nbase type to indicate that the sentence is grammatically correct. This output type is \nreferred to as s in the diagram. It is worth noting that all the wires are outputs—not \ninputs—because they are located on the bottom of the boxes. Again, thinking of the \nunderlying structure of these diagrams as matrices is helpful here. The subject noun \nmatrix and its right adjoint cancel out.8 The object noun matrix and its left adjoint \nmatrix cancel out. All that remains, then, is the sentence type. This is understood as \nproof that the sentence is grammatical. It follows that if these simplifications are not \npossible, then the sentence is not grammatically correct.  \nNext, the right side of the diagram follows all the same rules and simplifies \ndown to a grammatically correct sentence as well. The difference is that there are also \ncaps present in this diagram. Here it is easy to see the magical power of cups and caps. \nThe difference on the right is that there is an additional noun type required to be an \ninput into the transitive verb. Using the rule of string diagrams that allow outputs of one \nbox to plug into outputs of another box, provides a simpler way to work with the \n \n8 This is the case in quantum computation because the matrices are necessarily unitary. The \nadjoint, then, is equivalent to the inverse. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n25 \n \n25 \n \nunderlying mathematics. This, ultimately, is the reason for cups and caps. Including \nthem provides several elegant simplifications commonly referred to as the “yanking \nequations”9 (Coecke & Kissinger, 2017). By leveraging the yanking equations, many \ndiagrammatic simplifications become straightforward. To conserve space, diagrams in \nthis work are displayed after applying the yanking equations going forward. \nBackground: The Meta of the English Language \n \nSome might consider English the lingua franca of the world as it is spoken by \nbillions of people and recognized as the de facto language of international business and \npolitics throughout the world. English is a non-agglutinative, West Germanic, Indo-\nEuropean language that has absorbed components of many different languages—\nFrench, Latin, and Greek to name a few—into itself (Potter et al., 2020). Like most \nlanguages, it has evolved greatly over many centuries so that its contemporary form is \nvery distinguished from its earlier forms. Even native speakers of the language struggle \nto discern texts written in its older forms. \n \n9 The yanking equations are also known as the “snake equations” (Al-Mehairi et al., 2017; \nCoecke et al., 2018b). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n26 \n \n26 \n \nThe grammar of English deserves some comment before proceeding. There are \nessentially three kinds of sentences: simple, compound, and complex. Simple sentences \nfollow a very strict SVO pattern (Potter et al., 2020). The subject of the sentence is the \nactor, or the thing being discussed if the sentences is passive. The verb is the action and \nthe dynamic core of the sentence. Without the verb, the subject and the object, also \noften called the complement, hang in a spacey void—a kind of abyss devoid of semantic \nmeaning. In other words, without the verb, nothing ever happens. There are only \nplayers, but no play. The object is the thing that receives the action or is being acted \nupon, and it often has some supporting grammatical structures that are referred to as the \npredicate. A simple sentence must strictly follow the SVO word order or semantically \nthe sentence will fail. An example of a simple sentence is as follows: “Mary birthed \nJesus”10 (King James Bible, 1769/2017, Luke 2:7). The grammatically prescribed word \norder in English is very rigid with only a few exceptions—fluidity in placement of \nadverbs and prepositional phases being two examples (Potter et al., 2020). Additionally, \nthere are compound sentences that feature a direct object and either an indirect object or \n \n10 For clarity, this is not a direct quote of the text. The quotation indicates only the content of \nthe example sentence. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n27 \n \n27 \n \nsome predicate noun, verb, or adjective. This means there are multiple complements in a \nsentence with a single subject and one core verb. An example of such a sentence is as \nfollows: “Jesus gave Mary to John”11 (King James Bible, 1769/2017, John 19:26-27). \nFinally, there are complex sentences that contain multiple whole clauses, which follow \nthe rules of the simple or compound sentences above mentioned. The simplest example \nhere is “Mary birthed Jesus, and then Jesus gave Mary to John.” It is critical to \nreemphasize that the structure of the English language is indeed very rigid. There is \nlittle that can be changed in terms of word order that does not also require some other \nsort of grammatical change to compensate. \nLiterature Review: Brief Overview of QNLP Diagrams in English \nIt is worth the time to review relevant QNLP literature before introducing the \nJapanese language and its diagrammatic representations. Specifically, this section \nintroduces work from studies performed on the English language. The goal here is to \ncreate a point of comparison with the Japanese diagrams to be introduced later. \nParticularly, it is crucial now to review word order and grammar. \n \n11 For clarity, this is not a direct quote of the text. The quotation indicates only the content of \nthe example sentence. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n28 \n \n28 \n \nIn English, meaning is fundamentally tied to word order. Commonly, it is said \nthat English follows a SVO word order. This is true, especially when referring to the \nkernel of an English sentence. Larger sentences require a more refined understanding of \nwhat precisely makes a subject and what precisely makes an object—often called the \npredicate. Much of the QNLP work has primarily focused on addressing the kernel of \nmeaning. In fact, the examples provided in the Background: Category Theory section of \nthis work do as well. See Figure 8 for an example generated with DisCoPy. A common \nexample, with the same topological structure, from much of the literature is represented \nin Figure 9 (Coecke, 2016, 2020; Coecke et al., 2020, 2021). As mentioned before, the \nword order is lifted directly from English and into the diagram. This works to create a \nstring diagram to calculate a semantic meaning precisely because the semantic structure \nof the sentence is built atop an underlying algebraic grammar (Bolt et al., 2016). \nFigure 9 \nEnglish DisCoCat Diagram’s SVO Word Order Core Topology \n \nNote. This figure is featured in many of Coecke’s works (2016, 2020; Coecke et al., \n2020, 2021). Whenever words are included in a diagram, that diagram is functioning at \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n29 \n \n29 \n \nthe semantic level. The algebraic grammar of choice is the foundation on which such a \ndiagram is constructed. \nThe choice of grammar is flexible and an area of active research. Yeung and \nKartsaklis recently based their work on a Combinatory Categorical Grammar (CCG)—\nFigure 10—where it is possible to curry the parts of speech defined by the grammar and \narrange them into planar graphs12 to produce grammatically correct sentences (2021). \nIn Figure 10, “his hat” is connected to “put” via an underwire because it is the object of \nthe verb. “Bruce” and the remaining unpaired underwires of “put” are curried over to \n“on”, which accepts them as inputs—recall that quantum string diagrams accept inputs \ninto their outputs as well to capture ideas like entanglement—and outputs a \ngrammatically correct sentence.  \nFigure 10 \nA Combinatory Categorical Grammar Implementation of DisCoCat \n \n12 It is worth mentioning that the word order can be altered, and the meaning can be preserved. \nIf this happens, then the graph is no longer planar, and the sentence would read “Bruce put on \nhis hat”. This does not change the SVO kernel of the sentence, however. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n30 \n \n30 \n \n \nNote. This image originally comes from Lorenz et al. (2021). The most helpful part of \nthis image for this work is that it clearly depicts both the semantic and the grammatical \nlevel of the graph. The semantic is depicted within the boxes, and the grammatical is \ndepicted on the wires. \nMost examples in the literature use Lambek’s pregroup grammar, which \nLambek produced as a replacement for earlier mathematical linguistic calculi (Lambek, \n1997, 2008). See Figure 11, which is pulled from an experiment that tested these \ntheories on real hardware (Lorenz et al, 2021). This sentence is grammatically identical \nto Figure 9. “John” is the subject, and “Mary” is the object. John “likes” Mary, meaning \nthat he has some sort of fondness for her. The verb type is made up of a right adjoint \nand a left adjoint of the noun base type as well as a sentence base type. When the \nadjoints are joined with the base types, they contract, leaving only the sentence base \ntype remaining. This confirms that the sentence is grammatically correct and, therefore, \nproduces a semantically valid meaning. Pregroup grammars are often used because they \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n31 \n \n31 \n \nare genius in their simplicity, easy to understand, and the foundation for many other \ncategory theoretical approaches that followed—the aforesaid CCG being a prime \nexample. \nFigure 11 \nExample of Lambek’s Pregroup Grammar with Cups and Caps as Underwires \n \nNote. This image originally comes from Lorenz et al. (2021). In this image, the boxes \nare missing. They can be assumed to be present for simplicity. \n \nNow, DisCoCirc takes a similar approach but is intended to work with larger \nbodies of texts. See Figure 12 for an example of an SVO sentence in DisCoCirc \n(Coecke, 2020). Figure 12 contains two nouns: Alice and Bob. In a longer text, the \nmeanings of words, particularly nouns, are altered as the context begins to add nuance \nto them (Coecke, 2020). In this case, Alice’s meaning is updated to include the fact that \nAlice is a dog. In kind, Bob’s meaning is updated, defining that Bob is a person. The \nword order is preserved in the diagram because it is fundamental to English. Therefore, \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n32 \n \n32 \n \nit is clear here that Alice is the one who bites Bob. Subjects appear to the left of verbs, \nand objects appear to the right. \nFigure 12 \nAn SVO Sentence in DisCoCirc \n \nNote. This image originally comes from Coecke’s 2020 work. \nNow, to be clear, it is not the nouns’ specific positions that determine left and \nright. It is the noun’s associated wires. Pay special attention to the wire orders in Figure \n13, which represents the same sentence as Figure 12. The nouns, their wires, and their \nmodifiers have been completely swapped; however, the meaning is the same because \nthe wires connect to the verb in the same respective spots. When taking these same \nconcepts and applying them to languages with different grammatical structures, the \nunderlying algebraic grammar must be modified. Indeed, many languages function \nentirely differently than English. When applying these concepts to such a language, \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n33 \n \n33 \n \ndistinct differences in the topologies of these diagrams will emerge, which is, in part, \nwhat the present study aims to illuminate. \nFigure 13 \nFigure 12 with Alice and Bob Swapped \n \n \nBackground: The Meta of the Japanese Language \n \nJapanese is one of the world’s major languages with approximately 128 million \nspeakers worldwide. These speakers primarily reside in Japan, but the popularity of \nJapanese entertainment and media has spread interest in the language abroad. The \ngenetic origin of the Japanese language is a bit of a mystery (Shibatani et al., 2015). \nThere is still active debate in scholarship regarding the origin of the language and \nBob \nperson \nAlice \ndog \nbites \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n34 \n \n34 \n \nwhether there are any other languages closely related to it—aside from Ryukyuan.13 \nLike all languages, it evolved throughout time so that earlier forms of the language are \ndifficult for contemporary speakers to understand without some degree of \nfamiliarization (Shibatani et al., 2015). Close interaction with China has repeatedly \ninfluenced Japanese over the course of many centuries. This has led to the adoption of \nkanji into the written language and the use of many Chinese loanwords. In more recent \ntimes, the influence of the West has led to an increase of English and other European \nloanwords being adopted into Japanese and spelled with katakana14 characters. \nThe word order of Japanese, when compared with English, is remarkably fluid. \nGeneral rules exist, and most often say Japanese follows a Subject-Object-Verb (SOV) \n \n13 Ryukyuan is a common way to refer to Okinawan, which is a dialect disparate enough from \nthe rest of Japanese that it is often described as a separate language. \n14 One of the more incredible aspects of the Japanese language is that one is required to learn \nfour different writing systems to be able to read fluently. These writing systems include kanji, \nhiragana, katakana, and romaji. First, kanji characters are symbolic, meaning that each character \nhas a meaning unto itself. Kanji are the closest written characters to an ancient system such as \nEgyptian hieroglyphics still in use today. Second, hiragana characters are used to write native \nJapanese words and to add inflectable endings onto kanji characters. Third, katakana characters \nare used for loanwords, primarily from the West, and to write something emphatically. The latter \nuse is like how italics are often used in English writing. Finally, romaji—the English alphabet—is \nused directly in many cases for convenience or for cool factor. The Japanese people tend to have \na high view of the English language and, therefore, a desire to sprinkle romaji characters in their \ntexts whenever appropriate. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n35 \n \n35 \n \nword order (Shibatani et al., 2015). This is not entirely true (Dolly, 2019a). More \nimportantly, it is not required to be true because the grammatical functions of words are \nmarked explicitly in Japanese with special little words called particles. There are \nparticles for marking the subject, the object, direction, and much more. Particles that \nappear at the end of sentences are used to perform functions like adding emotion, \nadding emphasis, soliciting a response, or turning the sentence explicitly into a question. \nDespite the presence of particles, it is incorrect to assume that word order does not \nmatter at all (Dolly, 2019a). It is mandatory that a sentence be ended by a verb, \nadjective, or the copula, and it is generally accepted that the topic of discussion or the \nsubject of the sentence resides near the beginning of the sentence or paragraph. \nJapanese Compared to QNLP Literature \n \nThis section compares Japanese to English regarding the current state of QNLP \nresearch. The purpose of this section is to contrast Japanese with English concisely. \nNow, the concept of SVO sentence structure does not exist in Japanese. Recall that \nmany believe that Japanese is often called an SOV language. In truth, two basic rules \nfor word order exist (Dolly, 2019a). The first of these, as alluded to before, is that the \nlast word in a sentence is the verb, an adjective, or the copula—the “engine” of the \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n36 \n \n36 \n \nsentence (Dolly, 2019a). The second is words can only modify words that come after \nthem. Typically, word modification is limited to words that are directly adjacent to one \nanother, but adverbs and time-related words have greater flexibility. In practice, this \ntypically results in an SOV ordering where the subject is mentioned prior to the object. \nNow, the key to Japanese sentence fluidity is that particles paired with nouns determine \nthose nouns their grammatical role in the sentence. Depending on the use particles, \nJapanese sentences take different forms. The first of these can be thought of as self-\nmove, while the second is other-move (Dolly, 2018b). Conceptually, self-move and \nother-move sentences differ in whether the action of the sentence is directed at the \nsubject in the former case or the object in the latter case. This is roughly, though not \nprecisely, equivalent to transitive and intransitive sentences in English.  \n \nSelf-move sentences are typically very simple. The complexity of the \nsentences, of course, varies; however, the kernel of the sentence is a subject, the particle \nが [ga], and a verb. Table 1 shows an example sentence. \nTable 1  \nParts of Speech of a Self-move Sentence with English Translations \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n37 \n \n37 \n \nSubject \nParticle \nVerb \nPossible Translations \n猫 \nNeko \nが \nga \n渡る \nwataru \nThe cat crosses over. \nThe cat will cross over. \n \nThe sentence kernel is simple enough and easy to demonstrate. The subject \n“neko” is followed by “ga”. The main role of “ga” is to mark the subject of a sentence, \nand that role is key. Many Japanese teachers incorrectly profess that “ga” can mark the \nsubject or the object of the sentence, and that is not the case. This construction, then, \ngrammatically indicates that the cat is moving itself across something—context would \ndetermine the identity of said something but perhaps a street or threshold—as opposed \nto being carried across said something by another subject. It is also worth noting that \nself-movement is not the same thing as passive voice. The cat in this sentence is acting \nupon itself. It is not being acted upon by another any other agent. \n \nOther-move sentences provide the grammatical construction required to \nexpress actions done by subjects to objects. Therefore, in other-move sentences the \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n38 \n \n38 \n \nsubject is acting on something besides itself. Table 2 provides the counter example to \nthat provided in Table 1. \nTable 2 \nParts of Speech of an Other-move Sentence with English Translations \nSubject \nParticle Object Particle Verb \nPossible Translation \n私 \nWatashi \nが \nga \n猫 \nneko \nを \nwo \n渡す \nwatasu \nI hand the cat over. \nI will hand the cat over. \n \nIn this sentence, the subject is 私 [watashi], which is one of the first person \npronouns of Japanese.15 Thus, “I” performs the action on the object, which is a cat in \nthis case. The receiver of the cat is not specified in this sentence, which it is \nunimportant for this example, but the receiver would be dictated by the context since the \nreceiver is often obvious. Suffice it to say that the entity being moved by the action is an \n \n15 Because Japanese has a multi-layered, complex system of honorifics, there are multiple first-\nperson pronouns. This is a dramatic difference with the English language and warrants its own \nstudy on how to best incorporate worldly context to provide more fluent translations. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n39 \n \n39 \n \nimportant concept built into Japanese sentences via verbs and supported by particles \nlike を[wo].16 \n \nOnce again, the rigid SVO structure of English is drastically different than the \nmore fluid word order of Japanese. This means that any algebraic grammar, such as \nLambek’s pregroups, must be curated to support the Japanese language. Further, the \nself-move and other-move concept is critical to understanding a Japanese utterance, so a \nfluent translation must account for verb choice and the corresponding use of particles to \ncorrectly discern and translate meaning. The closest English grammatical constructions \nare transitive and intransitive sentences. It is worth investigating whether quantum \ntranslation programs could leverage density matrices, or some other method, to fluently \ntranslate these sentences by leveraging grammar and context. This work hopes to lay the \ngroundwork for such an investigation in the future. \nTowards a Diagrammatic Taxonomy of the Japanese Language \n \n16 The particle を is commonly pronounced like the English word “oh” despite the fact that it is \nspelled with the character for the “wo” sound. Essentially, the “w” sound is omitted, making the \ncharacter silent in most utterances. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n40 \n \n40 \n \n \nA taxonomy is a rigorous classification of items within a given category. In this \nsection, diagrammatic depictions of self-move and other-move sentences are introduced. \nThese diagrams will be created using both the DisCoCat and DisCoCirc methodologies, \nderived from category theory, for each individual grammatical construction. The intent \nof this section is to demonstrate the power of diagrammatic reasoning while introducing \na small collection of diagrams for others to use in their own research. In time, this small \ncollection can be built into a true taxonomy. This is important because once the \ntopologies of the diagrams are identified, any sentence where words of the same parts of \nspeech can be process regardless of the specific words chosen. The underlying grammar \nfor the diagrams in this section is based on Lambek’s pregroup grammar. Before \nproceeding, this grammar must be defined explicitly. \nA Pregroup Grammar for Japanese \n \nPregroup grammars are logical grammars that were introduced and explained \nusing Figure 8. As a brief review, the basic idea is that types are used to calculate \nwhether a group of words, typically a sentence, is grammatical or not. In practice, left \nand right adjoints are grouped together with the base—non-adjoint—type. When this \nhappens, the grouping effectively cancels out and the grouping contracts to a value of \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n41 \n \n41 \n \none—effectively cancelling the value out of the calculation17 (Cardinal, 2007). In the \ncase of sentences, the goal is to contract all the types save for one—the sentence type—\nthat ensures that the sentence in question is a grammatically correct utterance. What \nform might a pregroup grammar take for Japanese? Fortunately, some research into this \nquestion has been done. Cardinal defines the basic types as shown in Table 3 (2002). \nTable 3 \nCardinal's Pregroup Grammar for the Japanese Language \nSymbol Part of Speech \nExample \nEnglish Meaning \n𝝅 \nPronoun \n私 [watashi] \nI \n𝒏 \nProper name \n鈴木 [Suzuki] \nThe name “Suzuki” \nn \nNoun \n猫 [neko] \nCat \n𝒂 \nAdjective \n赤い [akai] \nred \n𝒂n \nAdjectival Noun \n好き [suki] \nliked \n \n17 A contraction refers to computations on simple types, represented here by a generic base type \nt, of the following forms: tlt → 1 and ttr → 1. Expansion is precisely the reverse: 1→tlt and 1→ ttr. \nThese are the two fundamental operations performed on pregroup grammars (Cardinal, 2007). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n42 \n \n42 \n \nSymbol Part of Speech \nExample \nEnglish Meaning \nav \nAdjectival Verb \n難しい [muzukashii] \ndifficult \n𝜶 \nAdverb \n新しく[atarashiku] \nnewly \ns \nStatement without a \ngermane tense a \nほら[hora] \nLook! \n𝒔 \nTopic sentence \n私は私だ。 \n[Watashi ha watashi da.] \nI am me. \nAs for me, I am me. \ns1 \nNon-perfective tense \nstatement b \n彼が走る。 \n[Kare ga hashiru.] \nHe will run. \ns2 \nPerfective tense \nstatement \n彼が走った。 \n[Kare ga hashitta.] \nHe ran. \nq \nQuestion \n彼が走るか。 \n[Kare ga hashiru ka?] \nWill he run? \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n43 \n \n43 \n \nSymbol Part of Speech \nExample \nEnglish Meaning \nc1 \nNominative \ncomplement \nが [ga] \nMarks the subject of \nthe sentence. \nc2 \nGenitive complement \nの [no] \nShows ownership \nc3 \nDative complement \nに [ni] \nMarks indirect objects \nc4 \nAccusative \ncomplement \nを [wo] \nMarks the object \nc5 \nLocative or \nInstrumental \ncomplement c \nで [de] \nSpecifies the \nboundaries, range, or \nextant of an action. \nThis can refer to a \nlocation or a tool. \nc6 \nAblative complement \nから [kara] \nSpecifies movement \naway from a noun \nNote. This table is adapted from Cardinal’s 2002 master’s thesis. The collection of all \nthese types is sometimes referred to as the “alphabet” of the grammar (Bolt et al., 2016). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n44 \n \n44 \n \nThese are also often referred to as “generators” (Duneau, 2021). \na Some utterances are not necessarily grammatically complete or lack verbs, but the \nmeaning of the utterance is carried by context. Examples include single words, \nidiomatic expressions, and meanings heavily implied by use of particles without the \nexplicit use of a verb. It is possible that CCG approaches to grammars that allow for \nplanar graphs could also be applied in Japanese to address these utterances (see Figure \n10). This is an avenue for further research. \nb The term “perfective” here is used in widely the same way as past tense is used in \nEnglish, and for the purposes of this work that understanding is sufficient. \nc で, “de” is a particularly versatile particle. An in-depth discussion on how “de” should \nbe handled is outside of the scope of the present study. For now, suffice it to say that the \nlocative and instrumental complement, or case, will be conflated. An argument can be \nprovided that such a conflation is perfectly valid in the Japanese language (Dolly, \n2019b). \nThe types presented in Table 3 seem much more complicated than one might \nexpect given that Japanese words reduce primarily to nouns, adjectives, and verbs \n(Dolly, 2019b). Indeed, reducing these types to a minimal subset would be a worthy \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n45 \n \n45 \n \nendeavor for further research, that topic is beyond the present scope. Further, while \nterms like nominative, genitive, dative, accusative, and locative refer to Western \ngrammatical ideas, they help when considering how to parse a Japanese sentence and \ntranslate it into the English language. Since these concepts aid in parsing, which is \ncritical to the endeavor of machine translation, they are worth considering for now. It is \nworth noting that combinations of the base types from Table 3 can be used to represent \nadjectives and verbs in a variety of ways. The concept that allows for various types of \nwords to be reduced is defined by Cardinal’s initial partial order postulates found in \nFigure 14 (2002).  \nFigure 14 \nInitial Partial Order Postulates of Cardinal’s Japanese Pregroup Grammar \n \nNote. This image originally came from Cardinal’s master’s thesis (2002). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n46 \n \n46 \n \nThese postulates show the partial ordering of one base type to another by means \nof the binary relation (Cardinal, 2002).18 This comes into play when selecting pregroup \ngrammar types for use in implementing a part of speech for a conversational grammar. \nA type on the right, such as s, can link with any type to the left of it, such as s1, and \nthose types will also contract. It is akin to an inheritance relationship between classes or \nan interface in a strongly typed, object-oriented programming language. The interface, \nwhether explicitly added to the class or inherited from a parent, broadens the possible \nuses and application of the class. An illustrative example is in order. Let us create an \nimaginary device to demonstrate. For laughs, let us call it a Walton Device. In essence, \na Walton Device is any modular item onto which any arbitrary number of arbitrarily \nshaped plugs can be grafted. One is depicted in Figure 15. \nFigure 15 \nA Walton Device with Undefined Types \n \n18 This construction somewhat contrasts with the actual linguistic reality. Pronouns are simply \nnouns. Nouns are not pronouns. So, the construction of the pregroup grammar is somewhat out \nof alignment with the actual linguistic reality of Japanese. While it is functional, it would be \nworthwhile to pursue bringing these two views of grammar into better alignment. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n47 \n \n47 \n \n \n \nAt first glance, the Walton Device depicted in Figure 15 looks a bit like an \nintergalactic polyhedral space pig. However, a more useful observation is that the main \nspherical body has precisely four uniquely shaped plugs protruding from it. It stands to \nreason that each of these distinct plugs has a matching, distinct receptacle counterpart \ninto which it snugly fits. The Walton Device, then, is simply a graphical representation \nof the concepts of interfaces, types, and—in hardware—plugs. Each plug is a basic type, \nand all plugs on the same Walton Device are related according to some defined partial \norder, like those defined in Figure 14. Figure 16 shows the systematic construction of a \nWalton Device to represent a portion of Cardinal’s noun rule from Figure 14. \nFigure 16 \nDevelopment of a Walton Device for Noun Types Across Four Stages \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n48 \n \n48 \n \n \n \nStarting from the left, Figure 16 develops a Walton Device from null to a \nrepresentation of a subset the noun types in Figure 14. All Walton Devices start from \nnull, which is represented at stage 1 with a circle because a circle has no pluggable \nshapes grafted onto it. For each stage, the most inclusive postulate type on the Walton \nDevice is written in the circle as well. The most inclusive type is defined as that \nrepresented on the plug that the previous Walton Device from the same postulate is \nlacking. This represents the highest order type the Walton device can support if there is \na hierarchy among the types postulated. If no such hierarchy exists, then the body of the \ndevice can be left blank or marked with an appropriate fundamental type—such as the \nempty set. At stage 2, then the noun interface is added to the top of the device. It is now \nn\n𝜋\n𝜋 \n𝑛\nnull \nn \nn \nn \n𝑛 \n𝑛 \n1\n2 \n3 \n4 \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n49 \n \n49 \n \nable to plug into a noun receptacle, which in this case means the device can fulfill the \nrole of a noun in Cardinal’s grammar. Stage 3 adds the proper noun interface, thus \nincreasing its potential connectivity, which is equivalent to saying its level of \nabstraction is increased. Finally, stage 4 adds the pronoun base type, which now gives \nthis device three interfaces, maximizing the potential pluggability of this Walton \nDevice. Therefore, in any place in the grammar where a noun-shaped receptacle would \nbe it can be mated with any non-null Walton Device found in the hierarchy of Figure \n16. This is the power of interfaces, the power of types, and the power of abstraction all \nwrapped up into one visual idea. It will soon be demonstrated that this degree of \nabstraction is extremely useful when working with Japanese particles. \nLet us diagram some sentences using Cardinal’s grammar to demonstrate this \nidea. See Figure 17, which handles the case of self-move sentences and juxtaposes each \nsentence with the corresponding Walton Device for the noun. \nFigure 17  \nJuxtaposed Self-Move Sentences with Walton Devices to Compare Noun Types \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n50 \n \n50 \n \n \nFirst, consider the top sentence of Figure 17. This sentence uses the third-\nperson male pronoun as the subject. Since a pronoun is used, the πtype is assigned to \nKare  \nga      hashitta. \nKoji       ga      hashitta. \nNeko     ga      hashitta. \n𝜋 \nc1 \n𝜋𝑟 \ns2 \nc1\ns2 \n𝑛 \nc1 \n𝜋𝑟 \ns2 \nc1\ns2 \n𝑛 \nc1 \n𝜋𝑟 \ns2 \nc1\ns2 \nn \nn \nn \n𝑛 \n𝑛 \nn \n𝜋 \n𝜋 \n𝑛 \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n51 \n \n51 \n \nit. Comparing the top sentence with the middle and bottom sentences illustrates the \npartial ordering and why Walton Devices are helpful visual aids. The subject of the \nsecond sentence is a proper noun, while the final sentence is a normal noun. All three of \nthese noun base types are the subject of their sentences because they are paired with the \n“ga” particle. In accordance with Cardinal’s partial ordering via the binary relation, the \nWalton Devices for the nouns have broader interfaces as one reads from the bottom of \nFigure 17 to the top.19 Therefore, “neko”, “Koji”, and “kare” can all be paired with the \nconstructed type for “ga” and the right adjoint simple type in the “ga” construction \nsimplifies to 1, which cleanly removes it from the calculation. This leaves the \nnominative complement simple type c1 unpaired. Complement types such as this are \npaired with the verb in the sentence, thus providing a link through the particle between \nthe noun and the action of the verb. After this link is satisfied, the perfective tense \nsentence type s2 remains, which satisfies the grammatical rules of both the logical \ngrammar and Japanese semantics. Therefore, this sentence is well-formed and legal.  \n \n19 The metaphor implies that the plug needs to mate with a receptacle. Depicting a receptacle is \nmuch more difficult with an image, so for simplicity, base types are written on the plugs even \nthough the plugs technically should all have a superscript “r” after them. The right adjoints \nwould be plugs in this metaphor. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n52 \n \n52 \n \n \nBefore concluding this section on pregroup grammar types, consider an other-\nmove sentence. Everything previously illustrated with Walton Devices still applies, so \nWalton Devices have been omitted here to conserve space. Other-move sentences have \nan object, which introduces another particle into the grammar. It is instructive to see \nhow this new particle is constructed using pregroup types. \nFigure 18 \nType Grammar Representation of an Other-move Sentence \n \n \nFigure 18 provides a second example of the usage of “ga”, and its typing \nremains consistent. This suggests, correctly, that a particle has one simple type \ndefinition per one grammatical usage. This does mean that there is potential for other \ntype constructions of these particles that would produce legal sentences (Cardinal, \n2002). There are also constructions that are used more often than others. For the present \nWatashi   ga      neko      wo        watasu. \n𝜋 \nc1 \n𝜋𝑟 \ns1 \nc1\nr \ns1 \nn \nc4 \n𝜋𝑟 \nc4\nr\n \nI handed over the cat. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n53 \n \n53 \n \nstudy, this single construction of “ga” is sufficient. Another observation to make is that \nthe right adjoint is very commonly used in Japanese. This is due to the heuristic that a \ngiven word modifies the word that immediately follows it in the grammar, which is not \nshocking since Japanese is an agglutinative language. Thus, most word pairings will be \na word with its right-adjoint since the right-adjoint follows its paired word. Now, “wo” \nis used to mark the object of the verb. Here, there is a clear subject, and a clear object. \nTheir interaction is, of course, defined by the verb. This necessitates20 the inclusion of \nanother simple type in the verb type construction for this sentence to cancel out the \naccusative complement type introduced by “wo”. The verb is in the non-perfective tense \ns1, so a non-perfective, legal sentence is what remains after the calculation. Using this \ngrammar as the foundation, it is a simple matter to extend these ideas into diagrammatic \nrepresentations using DisCoCat and DisCoCirc, which also extends beyond the realm of \ngrammar and into that of semantics. Let us proceed to that end. \nEnter DisCo Diagrammatic Representations \n \n20 See Cardinal’s 2002 work for a slightly different approach that adds an additional sentence \nsimple type to “ha”, the topic marker, to create a legal sentence without adding a third type to \nthe verb. This approach allows the result to boil down to a topic sentence 𝑠. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n54 \n \n54 \n \n \nFrom this point forward, quantum diagrams are introduced. Everything that \nprecedes this section provides adequate background for understanding the underlying \nrationale behind these diagrams from a linguistic perspective. As certain key points \nbecome relevant, they will be re-emphasized to help facilitate understanding. \nAdditionally, any general observations indicate some larger principles and heuristics \nwill be highlighted and named as they occur. \nMoving the Self  \nThis section discusses how self-move sentences with predicate adjectives work, \nsets the stage for a direct comparison between a self-move and other-move sentence \nlater, and consolidates all the diagram types for a self-move sentence into one section. \nVerb  \nBefore proceeding, revisit Figure 17. This figure depicts Walton Devices for \nself-move sentences with a noun, proper noun, and pronoun, in juxtaposition, all of \nwhich feature the verb 走った [hashitta]. With all the groundwork already prepared, it \nwould be criminal to not build the DisCoCat and DisCoCirc diagrammatic \nrepresentations of one of the sentences depicted here as an introduction. First, the \nDisCoCat diagram is depicted in Figure 19. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n55 \n \n55 \n \nFigure 19 \nDisCoCat Representation of a Basic Self-move Sentence with a Verb \n \n \nFigure 19 depicts a string diagram that is sufficient for implementing simple \nquantum mechanics and algebraic linguistics. This is the first depiction of such in the \nJapanese language, and this is one of the simplest diagrams that could be created. Even \nstill, it warrants comments. The pregroup grammar provides the mathematical \nsubstructure to ensure that the connections are grammatically legal, as has been \ndiscussed earlier. The boxes represent the semantic level of understanding beyond the \ngrammar substructure and is implemented via a quantum state (Coecke et al., 2021). \n彼 \nKare \nが \nga \n走った \nhashitta \nn \n𝜋r \ns2 \nc1 \nc1\nr \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n56 \n \n56 \n \nEach cup satisfies and symbolizes a matrix and its adjoint being multiplied together and \nresulting in a 1 value. This is realized by quantum measurements, or Bell tests (Coecke \net al., 2021). It is, therefore, negated and provides no additional effect on the \ncalculation. The final remaining type is some variety of the s or the q base types. These \ndemonstrate that the sentence is grammatically legal and, therefore, makes sense \nsemantically. Now, this explanation should sound familiar. It is, in essence, the same \nexplanation offered when discussing underwires in pregroup grammars. To be clear, the \nmajor difference is the inclusion of the quantum states and measurements that require an \nadditional level of implementation beyond that of grammatical linking (Coecke et al., \n2021). Without quantum mechanics, these boxes would simply be boxes. It is \nastounding that with such a small visual step, linguistics gets quantum. \n \nNow, here are some general observations about Japanese DisCoCat diagrams \nthat derive from Figure 19. First, because Japanese is a very noun heavy language, there \nare going to be a lot of 𝜋𝑟 \nsimple types encoded into particles. Why is this? Because a \nparticle always succeeds the noun it suffixes, is directly adjacent to said noun, and \nparticles abound in proper Japanese sentences. Further, using the 𝜋𝑟 \ntype ensures that \nthe particle can satisfy a standard noun, proper noun, and a pronoun. There is no reason \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n57 \n \n57 \n \nto adjust the encoding due to the type implication imposed by the partial ordering \npreviously illustrated with Walton Devices (see Figure 17). This observation is known \nas the Pi are Numerous Principle. \n \nSecond, the persisting sentence type that remains after the pregroup calculation \ntends to reside in the verb, adjective, or copula that ends the sentence. The final word in \na Japanese sentence is the driver of meaning. All other words in the sentence are \nsomehow related to the action or statement of being made by this final word. This \nobservation is known as the Train Engine Principle since the engine sits at the end of \nthe train and pulls it along the track21 (Dolly, 2018a). It is worth noting, however, that \nthere is an exception to this principle, one of which is particularly notable and will be \nintroduced later. Now, it is important to notice that the final word’s simple type \ndefinition is flexible. Therefore, while it can be said that a verb or a predicate adjective \nmay have a typical simple type definition based on its normal—most frequent—usage, \nit cannot be said that the type definition will always be the same since the use of \n \n21 Using train terminology to name the principles is an ode to Cure Dolly, who passed away this \nyear. Much of her life was spent trying to teach Japanese to native English speakers in a more \norganic way, so naming things after her lessons is done here as a simple way to honor her \nmemory. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n58 \n \n58 \n \nadverbs and additional particles are typically accounted for within the verb or adjective \nbeing modified. In addition to this observation, it is also true that most Japanese \nDisCoCat diagrams will be planar without the need for currying (see Figure 10). This \nobservation is further supported by the next. \n \nThird and lastly, since most of the time Japanese nouns tend to modify the \nwords that immediately follow them and that particles attach to the words that \nimmediately precede them, there will be many cups connecting two adjacent quantum \nstates in the diagram. As such, this observation is known as the Train Car Principle. \nUltimately, this means there are minimal opportunities for graphs to become non-planar \nwhen diagramming out sentences in Japanese.22 Before proceeding, it is worth \ndiscussing how particles seem to buck the trend of words modifying the word that \nproceed them? Is a particle not modifying the word that precedes it? This is a matter of \nperspective. It may be more helpful to consider the noun as modifying the particle that \nfollows it. This produces an effect that allows for the particles to be explicitly translated \ninto English using compound nouns or relative clauses. For example, a literalistic \n \n22 The notable exception could be a large leap in a topical sentence from adverbs that modify the \nfinal word of the sentence. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n59 \n \n59 \n \ntranslation of Figure 19 that implements this approach would yield a translation like the \nfollowing: “He, that is the subject, ran.” If the relative clause makes the point too \nmurky, then consider this translation “He-subject ran.” Thus, what kind of subject is it? \nIt is the “he” kind. So, in this way, the noun is making explicit some quality of the \nsubject of the sentence. Thus, the words on the left side of the sentence continue to \ninform those on the right side of the sentence even if they are particles. If it is helpful, \nconsider employing this perspective to make the meaning flow and connections between \nwords more uniform. If not, think of particles as suffixes instead of independent words. \nFrom this perspective, suffixes will attach to words from the right side, while whole \nwords will continue to modify the words that follow them—proceeding from left to \nright. This latter approach is the more native of the two. \n \nWhat about DisCoCirc? Figure 20 introduces a very simple DisCoCirc \nrepresentation to match Figure 19. Because there is only one simple sentence, this \ndiagram is essentially analogous to the “Hello World” program of DisCoCirc. Indeed, \nthis example could not be simpler and remain functional. “Kare” is the noun, which is \nrepresented by the wire. The wire flows through “hashitta”, a quantum state, which \nupdates the meaning of “kare” to mean the “he who ran”. In this way, a transitive verb \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n60 \n \n60 \n \nupdates the meaning of the noun just as an adjective does. Since the verb here is a \nquantum state and not an effect, the noun is not terminated and continues to persist, \nawaiting its next meaning update as the text continues. \nFigure 20 \nA “Hello World” Example of DisCoCirc Diagrams \n \n \nPredicate Adjective  \nNow, let us consider predicate adjectives in self-move sentences. One of the \ndefining traits of Japanese is the topic marking particle は [ha], which is very powerful \nand multifaceted. It has the specific function of singling out the topic, but it also has the \nbroader function of denoting difference, contrast, or non-inclusion.23 The ability of the \nJapanese speaker to explicitly define a topic allows the speaker to change the locus of \n \n23 The sister particle of は [ha] is も [mo], which denotes inclusivity. “Mo” is often translated \ninto English as “too” or “also”. \nkare \nhashitta \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n61 \n \n61 \n \nspeech, meaning that the perspective of the situation—where the speech is situated—\ncan be shifted from one person, place, thing, or action to another with great ease without \nchanging the grammatical subject of the sentence containing the topic. The topic, then, \nfunctions at a higher level—above the level of a single sentence—than the grammatical \nsubject does. How does this work? Consider the sentence introduced in Table 4. While \nthis sentence only contains seven words, it is sophisticated enough to demonstrate a \ncrucial point. \nTable 4 \nSelf-move Sentence’s Parts of Speech Featuring a Predicate Adjective \nNoun \nParticle Noun \nNoun Particle Adjective \nCopula \nTranslation \n私 \nWatashi \nは \nha \nオレン\nジ \norenji \n色 \niro \nが \nga \n好き \nsuki \nだ \nda \nI like orange. \nFirst, notice that there are two particles in this sentence. From left to right, the \nfirst is the topic marker, and the second is the subject marker. Obviously, then, the topic \nand the subject of the sentence are two different entities. In this case, the topic of the \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n62 \n \n62 \n \nsentence is the speaker, and orange-color is the subject of this specific sentence. Again, \ntopics are special because their reach extends beyond the realm of a single sentence and \ninto larger blocks of text. The extent of a topic’s reach is often referred to as a comment \n(Dvorak & Walton, 2014). In this case, the reach of the topic is the same as that of the \nsubject since they are both confined to a single sentence example. So, then, how are the \ntopic and the subject different? Are there two actors in this sentence? Plainly, no. The \ntopic defines the perspective of the sentence in a case such as Table 4. The comment \nthat follows after the は [ha] is a sentence unto itself, and it is framed within the view \nof the topic. Perhaps comparing progressively more literal translations will make this \nphenomenon more apparent. Table 5 juxtaposes three potential translations for easy \ncomparison. \nTable 5 \nA Few English Translations of Table 4 Juxtaposed \nSimple  \nMore Detailed \nLiteral \nI like orange. \nI like the color orange. \nAs for me, the color orange is likeable. \n \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n63 \n \n63 \n \nThe literal translation is a far cry from the simple translation. The latter tends to \nbe the one taught to beginner-level students of Japanese. Notice how the adjectival noun \n好き [suki], meaning “likeable”, is translated as a verb.24 Notice also how the subject \nof the sentence is conflated with the topic in the English translation. In fact, the simple \nEnglish sentence is slightly more ambiguous. Is the “orange” here a color or a fruit? A \nnative English speaker would be able to decipher this based on the singular “orange” \ninstead of the plural “oranges”, but perhaps a non-native reader would struggle to tell. \nThe more detailed translation resolves the ambiguity, but there is still grammatical \nconfusion regarding the subject, topic, and the translation of an adjectival noun into a \nverb. Therefore, the literal translation is provided to untie all these conceptual knots: \n“As for me, the color orange is likeable.” Now, this sentence is not natural in English, \nbut it does demonstrate, via the use of the comma and the preposition “for”, the framing \nof the sentence from a certain perspective before proceeding to the body of the sentence. \nThere is no ambiguity now. The subject is orange-color, and it is described by the \n \n24 This is called an adjectival noun here for expediency, but since it is a so-called “na-adjective”, \nit is really just a noun that requires a special version of the copula, called な [na], to modify \nwords that succeed it in the sentence (Dolly, 2017). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n64 \n \n64 \n \npredicate adjective “likeable”. This, then, is what is meant by shifting the locus of \nspeech with ease. \n \nHaving demonstrated that predicate adjectives are employed to reflect some \nquality about a subject from the perspective of the topic, let us now consider the \nalgebraic grammar of such a sentence. This representation is found in Figure 21. \nFigure 21 \nA Self-move Sentence Logical Grammar Diagram with a Predicate Adjective \n \n \nThe analysis pertaining to Table 5 above is made evident in Figure 21. The \n“ha” makes the sentence a topical sentence. It also divides the sentence into two pieces \nAs for me, I like the color orange.  \n𝜋 \n𝜋𝑟\n𝑛 𝑛𝑙 \nWatashi  ha      orenji  iro    ga     suki    da. \n𝑠ҧ \ns\nl \n𝑛 \n𝜋𝑟c1 \n𝑎𝑛\nc1\nr \n𝑎𝑟\ns1 \n𝑠ҧ \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n65 \n \n65 \n \nlike an equal sign does in equations. There is everything that comes before the “ha”, \nwhich is the locus of the speech—the perspective from which the rest of the sentences \ncomes or the situation to which it refers. Then, there is the sentence proper containing \nthe subject as marked by “ga”. Notice that this example uses the adjective types from \nTable 3 and the adjectival version of the copula. This same sentence’s semantic \nmeaning would be represented in a DisCoCat diagram as shown in Figure 22. \nFigure 22 \nDisCoCat Representation of a Self-move Sentence with a Predicate Adjective \n \n \n私 \nWatashi \nオレンジ \norenji \nは \nha \n色 \niro \ns1 \n𝜋r \nc1 \n𝑛 \nc1\n𝛼𝑛 \n𝛼𝑟\nが \nga \n好き \nsuki \nだ \nda \n𝜋 \n𝜋r \n𝑛𝑙 \n𝑛 \ns\nl \n𝑠ҧ \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n66 \n \n66 \n \n \nThe DisCoCat diagram again quantizes the grammar to yield semantics. \nHowever, Figure 22 is differs from Figure 19. One obvious difference is that this \ndiagram contains an adjective; therefore, the diagram contains adjective types. \nSpecifically, it contains the adjectival noun base type and the right adjoint as a simple \ntype. Adjectives in Japanese generally will be one of three types, and these three types \nare named based on their function in a sentence. It will be either a noun modifier, a \nnoun, or a verb. The first of these cases is the noun modifier, which is the archetypal \nand essential case of an adjective. It modifies some person, place, or thing by attributing \nsome quality, limit, count, or the like to it. In the second case, the adjective is simply \nfunctioning as a noun. In this case, the adjective has no morphological forms or \ntransformations. Instead, a な [na] is affixed to the end of the word to modify the word \nthat follows (Dolly, 2017). Lastly, the verb case refers to sentences where an i-adjective \nappears in the predicate position. These adjectives can be morphologically transformed \nto indicate positive, negative, non-perfective, and perfective tenses. Thus, they are \nbehaving as verbs and might as well be considered a limited class of verb. Figure 22 \nrepresents the adjectival noun case, which has a unique partial order that reduces the \nadjectival noun to a noun: an → n (see Table 3; Figure 14). After this reduction occurs, \nthe adjectival noun can be treated like a noun in the grammar in all other cases. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n67 \n \n67 \n \n  \nThe first difference leads logically to the second. Instead of a verb, this \nsentence contains the copula だ [da]. The copula represents all possible versions of \n“is”, “am”, and “are” from the English language in one easy to use package. Thus, it is \nemployed to create a grammatical statement of equivalence. Additionally, the polite and \nhonorific forms of the copula can be used to raise the politeness level of a sentence. In \nthe case of Figure 22, it is functioning only as a statement of equivalence and nothing \nmore. The copula is an interesting case because in extremely casual Japanese, it is \npossible that the copula might be dropped so that the sentence is easier to say. In this \ncase, it is treated like a particle. The reason why omitting the copula still carries the \nmeaning is because of its ubiquitous use. Like が [ga], the subject marking particle だ \n[da] is present even when it is not spoken by the sheer power of implication. Because \nJapanese is a high-context language, it is simply assumed to be there even if unuttered. \nThus, it is likely that parsing programs would benefit from inserting the missing copula \nat the end of the sentence when it is omitted, which would provide a degree of \nuniformity across sentences. This assertion remains yet untested and is an avenue for \nfurther research.  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n68 \n \n68 \n \nNow, what about the Train Engine Principle? Figure 22 seems to violate the \nheuristic that the sentence type is carried by the final word in the sentence. As \nmentioned earlier, there is an exception to the Train Engine Principle, but it is only an \nexception in part. In reality, it is still true that the sentence in Figure 22 carries the \nsentence type in its final word; however, Figure 22 also contains a topic marking \nparticle は [ha]. That topic marker is the kicker. Recall from the discussion on Figure \n21 that the topic marker divides the sentence into two chunks, identifying the left side of \nthe sentence as the topic of the following comment. The right side of the sentence is its \nown self-contained sentence even if the subject is implicit and omitted. It turns out, \nwhen a topic marker is used, the topic sentence base type is what remains after the types \nresolve. Now, just as it makes perfect sense that the Train Engine Principle asserts that \nthe sentence type resides in the last word of the sentence because it bears the meaning, it \nis equally true that the topic marker should bear the meaning of a topical sentence. This \nis because a topical sentence defines a perspective that informs all the sentences that \nfollow until the topic is changed again. It is, therefore, fitting that the topic marker \noverride the Train Engine Principle, since the latter functions at only sentence level. \nThis observation is known as the Non-Logical Primacy Principle because the topic \nmarker is considered a non-logical particle, while the subject marker and others are \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n69 \n \n69 \n \nlogical particles (Dolly, 2018c). Again, logical particles function at the sentence level \nwhile non-logical particles have a larger purview and provide different shades of \nmeaning from their logical counterparts. \nOne final observation on Figure 22 is that it introduces left adjoint simple \ntypes. Unlike right adjoint simple types, which are included to resolve a previously \nintroduced type that has no pairing, left adjoint types anticipate types to come. There are \na couple of instances of this in Figure 22, but a single example should suffice. So, for \ninstance, consider the cup connecting the topic marker to the copula. The topic marker \nis defined by three simple types: the right adjoint of the pronoun, the topic sentence \nbase type, and the left adjoint of the sentence. The left adjoint cannot stand on its own, \nmeaning that the topic marker25 is anticipating the sentence to follow. This result is \nagain fitting since the topic marker is forecasting a statement that provides information \nabout the topic or from the topic’s perspective. \n \n25 Because Japanese is such a high-context language, it is possible for the topic marker to end a \nsentence. The result is an implied question. For example, the sentence 私は [watashi ha]? \nLiterally means, “As for me?” Because the rest of the sentence is omitted, the assumed portion of \nthe sentence is assumed to be an inquiry. This assumed portion of the sentence is very strong \nand nearly always understood by the interlocutor. In this example, it is akin to saying, “What \nabout me?” in the English language. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n70 \n \n70 \n \n \nNext, consider a DisCoCirc diagram. Normally, the idea in DisCoCirc is to \ntake the important nouns, persist them, and specify the relationships between them. \nThese relationships are typically captured by verbs or adjectives, which then link the \ntwo nouns together or link directly to the noun respectively. Recall Figure 12 for an \nexample in English. English, however, does not have a topic marker. There is, therefore, \nno direct parallel in the English literature on how to represent this. One idea is as \ndepicted in Figure 23. \nFigure 23 \nProposed DisCoCirc Diagram of a Self-Move Sentence with a Topic Marker \n \n \n \niro \norenji \nwatashi \nSuki \nha \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n71 \n \n71 \n \nLet us consider what this Figure 23 is attempting to convey. The two selected \nnouns26 of importance are “watashi” and “iro”. The former means “I”, and the latter \nmeans “color”. This seems reasonable since the interlocutors are likely discussing their \nfavorite colors. It makes sense that the term color would persist through the discourse \nand receive meaning updates. Here, the color is described as “orenji”, meaning orange, \nand “suki”, or “likeable” in English. Now, the first question is, how to link this meaning \nback to “watashi”. The proposal in this image is to consider the topic marker akin to a \ntransitive verb. Transitive verbs link a subject and an object together and update the \nmeaning of both nouns accordingly. Figure 12 also includes an example of this \nhappening in English. The question is, ultimately, whether this is an accurate \nrepresentation of what is naturally occurring in Japanese speech. The entirety of the idea \nexpressed in the sentence is clearly to update the meaning of “watashi”. After all, each \nsentence until the topic change is grammatically required to be some comment related to \nthe topic. An interesting problem here is how to ensure the sentences that follow \ncontinue to update the topic even though it is not present. One likely approach is to \n \n26 For simplicity, the term “noun” is used to refer to nouns, proper nouns, and pronouns since \nthe difference ultimately does not matter in Japanese grammar or DisCoCirc as either are \nformulated in this section. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n72 \n \n72 \n \npersist the current topic and add the implied topic back into each sentence when parsing. \nNext, recall that the sentence containing the topic marker is typically divided into two \nhalves, with the latter half being both a comment on the former and its own independent \nsentence. For now, including the topic marker in this way is a potential solution that \nwould involve a minimal amount of special consideration when working with the \nJapanese language. More tightly formulating the solution to this problem, working with \nlarger blocks of text, and testing out potential solutions is an area for further research. \nSame Old Verb, Different Forms \nObviously, verbs are another part of speech that can produce a self-move \nsentence. Figure 19 is one example where exactly this occurred. The difference in this \nsection is that the idea of a single verb having a self-move and other-move form is \nintroduced, discussed, and demonstrated. Such a verb one stem but slight morphological \ndifferences that signify whether the verb moves the self or moves the other—whether \nthe verb is akin to an intransitive verb or a transitive verb in the English language. This \nsection introduces a self-move form of one such verb and serves as a bridge from the \nself-move portion to the other-move portion of this work as well.  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n73 \n \n73 \n \nAs always, the natural grammar of the sentence is introduced first. To begin, \nthen, consider Table 6. There’s nothing particularly unique or outstanding about this \nsentence, but it does accomplish two things. First, simply note that the verb is 決まっ\nた [kimatta],which is derived from 決まる [kimaru]. This verb means “decide” and is \nself-moving or intransitive. That means it is linked directly to the subject and not an \nobject in the sentence. Second, Table 6 represents the first use of an adverb type. Its \nfunction is, naturally, to modify the use of the verb. \nTable 6 \nA Self-move Sentence with a Verb \nNoun \nParticle \nAdverb \nVerb \nEnglish Translation \nそれ \nSore \nは \nha \nもう \nmou \n決まった \nkimatta \nThat was already decided. \n \n \nNext, the algebraic grammar diagram is shown in Figure 24. Again, this is a \nvery straightforward representation. It is worth mentioning a couple things, however. \nFirst, observe how the adverb type, represented by an alpha, modifies the verb that \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n74 \n \n74 \n \ndirectly succeeds it. This is the standard case, and there is nothing new in this \nexample.27 Second, note that the use of “ha” is not the only way to render this sentence. \nFigure 24, as it stands, would be used to change the topic to “sore”, meaning “that”, as \nopposed to something else. If there is no need to change the topic, a “ga” would be used \ninstead. This would change the representation of the verb to that of Figure 25 instead. \nFigure 24 \nA Pregroup Grammar Representation of a Self-Move Sentence with a Verb \n \n \n \n27 Adverbs are freer in terms of sentence structure than most other parts of speech in Japanese. \nThe adverb is often the first word of the sentence. When this happens, it is typically represented \nwith the left adjoint of the sentence type to indicate that it is modifying the whole sentence \nrather than just the verb. In effect, these two types of modification are not so different given the \nway Japanese grammar parses. \nSore       ha        mou    kimatta.  \nThat was already decided. \n𝜋 \n𝜋𝑟 \n𝑠ҧ \ns\nl \n𝛼 \n𝛼𝑟 \ns2 \n𝑠ҧ \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n75 \n \n75 \n \nThe Figure 25 case simply shows that self-move verbs can accompany が \n[ga], or は [ha]. The sentence will ultimately fulfill a different purpose depending on \nthe employed particle.28 In this case, the c1r simple type must be added to the verb to \naccount for the use of “ga”. Therefore, this distinction is critical when considering \nfluent speech and translations. Forcing a translation algorithm to discern between topics \nand subjects is of paramount importance if a translator is going to be truly fluent. \nFigure 25 \nAlternative Self-move Verb Options with Subject Marker Instead of Topic Marker \n \n28 When “ha” is used and there is no “ga” present, the implied subject is equivalent to the topic. \nIn this case, the “ga” is dropped for convenience. Nevertheless, the implied subject’s presence \nremains in the sentence. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n76 \n \n76 \n \n \nNote. This diagram also demonstrates the type encoding differences when an adverb is \nused. The adverb type is represented by the Greek letter alpha. \n \nNow, returning to the representation found in Figure 24, let us proceed with the \nDisCoCat representation of this sentence. It is found in Figure 26. Again, this graph is \nincluded for comparison purposes. There is nothing in this graph that has not already \nbeen introduced, but Figure 26 is included for completeness and is useful for \ncomparison.. \nFigure 26 \nDisCoCat Representation of a Sentence with a Self-move Verb \n𝛼𝑟 \ns2 \nc1\nr\ns2 \nc1\nr\nWith Adverb \nWithout Adverb \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n77 \n \n77 \n \n \n \nThe DisCoCirc diagram for this sentence is included here for completeness, \nthough this graph would be unlikely to be used. Because “sore” is a pronoun, the noun \nto which it refers would likely be the noun of importance that would be preserved and \nupdated through the larger discourse. Nevertheless, Figure 27 documents the diagram \nthat would suffice, if required. It is worth noting that this DisCoCirc diagram is \nstructurally equivalent to Figure 20; however, including the adverb as part of the \nupdating process can capture a more nuanced idea of decision. \nFigure 27 \nA DisCoCirc Diagram of a Sentence with a Self-move Verb \nそれ \nSore \nもう \nmou \nは \nha \n決まった \nkimatta \ns2 \n𝜋r \n𝛼 \n𝛼𝑟 \n𝜋 \ns\nl \n𝑠ҧ \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n78 \n \n78 \n \n \nNote. The self-move verb functions equivalently to an adjective. See Figure 20 for a \ncomparison. \nMoving the Other  \n \nOther-move sentences are more complicated than self-move sentences by their \nvery nature. Every sentence in Japanese requires at least an implicit subject marked by \nが [ga]. This subject and the subject marker itself are often dropped in casual speech, \nbut even if it is not spoken, it is both grammatically and contextually implied. This is \npossible due to the high-context nature of the Japanese language. Especially deft \nspeakers can say an incredible amount with a minimal number of words.29 An other-\n \n29 Exploring this idea is itself an area for further research. For a quantum computer to provide \nconsistent and fluent translation outputs, it may be necessary for the translation algorithm to \ninsert implicit subjects and particles. It is worth studying specifically what this overhead might \namount to when performing translations and how well inserting explicit grammar where it is \nintentionally omitted might scale to large bodies of text. Additionally, it is worth investigating \nwhat the minimal type alphabet and grammar rule set might be to handle extremely casual \nspeech. Both avenues of research are beyond the scope of the current study. \nsore \nmou kimatta \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n79 \n \n79 \n \nmove sentence not only includes the subject marker, but it also includes the object \nmarker を [wo].30 The sentence then, by definition, must include an additional noun, \nan additional particle, and all the grammatical connections required to support them. An \nexample is provided here to analyze other-move sentence structure in more detail. \nFurthermore, this section will feature the other-move version of the previously \ndiscussed verb 決まる [kimaru], which is 決める [kimeru].  \n \nTable 7 introduces the other-move sentence in natural Japanese grammar. As \nbefore, simple parts of speech are used to emphasize that most Japanese words fall into \nthe broad, easy to identify categories. In addition to an other-move verb, Table 7 also \nincludes a relative clause. Relative clauses in Japanese are too large a topic to discuss \nhere in detail, but the important thing to remember is that Japanese creates relative \nclauses be modifying nouns on the right with verbs on the left.31 In this way, an entire \nsentence worth of meaning can be directly attributed to a single noun. \n \n30 In fact, it is possible for there to be multiple object markers when the same subject is \nperforming the same action on multiple objects. \n31 Many have discussed the wiring of relative pronouns in English, which requires special \nconsideration (Coecke et al., 2018c; Sadrzadeh, 2013, 2014). Japanese, thankfully, does not \nrequire special consideration regarding this topic because relative clauses are not constructed \nwith relative pronouns. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n80 \n \n80 \n \nTable 7 \nAn Other-move Sentence with a Verb \nNoun Particle Noun \nParticle Verb \nNoun Particle Verb \nEnglish Translation \nかれ \nKare \nは \nha \n薬 \nkusuri \nを \nwo \n付ける \ntsukeru \nこと \nkoto \nを \nwo \n決めた \nkimeta \nHe decided to apply \nthe medicine. \n \nWhen translated literally into English, the obvious subject of Table 7 is “Kare, \nwho decided”. The content of that decision is made explicit by the relative clause \n“kusuri wo tsukeru koto”. One way to translate this idea more literally into English is to \nrefer to it as an event or an action. Transforming a verbal idea into an explicit noun is \none of the primary roles of “koto” in Japanese. Table 8 is provided to help make the \nfunction of “koto”, meaning “thing”, “matter”, “situation”, or “event”, easier to grasp. \nBased on Table 8, it is easy to see the function of “koto” in Table 7 even though the \nliteral translation is very unnatural in English. “Koto” takes a clause with a verb and \nmakes it a generic relative clause. It nominalizes a verb so that it can play the role of a \nnoun in the sentence. Why is this important? Verbs are unable to accept logical \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n81 \n \n81 \n \nparticles32 as suffixes. Therefore, there must be some way to make a verb into a noun to \nfulfill grammatical duties in conjunction with particles. This is done in English using “-\ning” as a suffix. In this Japanese sentence, it is often done using “koto”.33  \nTable 8 \nJuxtaposed Potential Translations of Table 7’s Other-move Sentence \nLiteral English Translation \nFluent English Translation \nAs for him, he decided the apply \nthe medicine matter. \nHe decided to apply the medicine. \n \n \n32 Verbs can, however, take sentence-ending particles as suffixes. Like は [ha] and も [mo], \nsentence-ending particles are non-logical in the sense that they do not define any specific \ngrammatical relationship between words in a sentence. They, instead, perform functions like \nproviding emotion and soliciting feedback. \n33 This can also be done with the particle の [no]. The two sometimes overlap enough in \nmeaning that the choice does not particularly matter, but often one sounds more natural than the \nother depending on the context and content of the sentence. Covering this in more detail is \nbeyond the scope of the current discussion, but it is a potential area for further research. \nCapturing the subtlety in semantics is critical. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n82 \n \n82 \n \n \nNow, Table 9 provides a direct comparison between the self-move and the \nother-move versions of the sentence-ending verbs in Table 6 and Table 7. Comparing \nthese two verbs directly is instructive. \nTable 9 \nDirect Comparison of Self-move and Other-move Forms of a Verb with Same Stem \nSelf-Move Form \nOther-Move Form \n決める \nkimeru \n決まる \nkimaru \n \nThere are a couple of things to notice in Table 9. First, note that the kanji \ncharacter used in both words is the same. The roles of the kanji in the word is to convey \nthe basic, or core, meaning of the word and to represent the word’s stem. The kanji can \nbe compounded by combining with a second kanji, or the kanji can be supplemented \nwith Japanese kana characters. This latter case is what is done in true adjectives and in \nverbs. Thus, the attached kana characters are used to shape the meaning of the verb in \nsome way. The second point of importance here is that the second character in both \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n83 \n \n83 \n \nwords begins with the “m” sound. Now, the Japanese syllabary consists of columns of \nfive vowel sounds and the consonants that can be prefixed onto the vowel to make a \nlegal utterance. In Japanese, there are many verbs built on the same kanji that differ \nonly in that the middle syllable’s vowel sound in one is an “e” sound and an “a” sound \nin the other.34 This is a telltale sign that one is the self-move form of a verb, and the \nother is the other-move version.35 While it is usually true that the “e” sound signals an \nother-move form and the “a” sound signals a self-move, this is not always the case. This \nis one of the relatively few places where Japanese is not entirely consistent (Dolly, \n2018b). The use of particles is, once again, the ultimate arbiter on whether a verb is self-\nmove or other-move. Why is this important? Primarily because understanding \nintricacies such as this in Japanese will help determine the optimal number of qubits to \nuse in translation circuits. The morphology of Japanese ought to be studied to define the \n \n34 A fascinating topic related to this one is the 五段 [godan] verb. “Godan” verbs have five \ndifferent forms of the same core of a word. The core is indicated by a kanji character and, often, \na hiragana character. The five different vowel sounds each represent a different basic meaning \nalteration applied to the core idea of the word. Quantum implementations of “godan” verbs is \nanother potential avenue for further research beyond the scope of this work. \n35 This is not the only potential difference between self-move and other-move verbs, but it is the \ndifference that applies in this example. Another common difference is whether the final kana \ncharacter is a す[su] or a る[ru]. A classic example of this difference would be 返す[kaesu] and \n返る[kaeru]. The former is typically other-move and the latter is self-move (Dolly, 2018b). \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n84 \n \n84 \n \nlevel of qubit granularity needed to optimize translation. More qubits provide more \nflexibility but also more overhead. The opposite is also true. The question, which is \nanother area of potential research is, do translation algorithms provide more fluent \noutputs when operating at the word level or at the morpheme level? The answer remains \nto be seen. \n \nNext, let us move on to the algebraic grammar analysis of the sentence from \nTable 7 to see the underpinnings of the logical grammatical structure. Figure 28 was \ndevised to do just that. This example sentence is once again topical. The topical \nconstruction was chosen to keep the self-move and the other-move sentences more \nsimilar.36 \nFigure 28 \nPregroup Grammar Diagram of an Other-move Sentence \n \n36 The non-topical construction would result in an other-move verb that links to the が [ga] \nparticle. This particle bears the nominative type, which is c1. Because the verb is also an other-\nmove verb, it also must link to an accusative case particle with type c4. The verb in Figure 28 is in \nperfective tense, so the complete type definition for the verb in the non-topical construction \nwould be c1rc4rs2. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n85 \n \n85 \n \n \nBecause this sentence is topical also, it also breaks down into two halves like \nan equation. The right half is a fully grammatical sentence with an implied が [ga] that \nhas been dropped since the subject and the topic are the same word, namely “kare”. The \nrelative clause in the sentence uses the noun こと [koto] to nominalize the clause, and \nthe particle を [wo] is suffixed onto “koto” to indicate the accusative case. The verb \n“tsukeru” relies on a useful type definition strategy to connect anything to a succeeding \nnoun. This strategy, known as the Noun Sandwich Principle, relies on the left adjoint’s \nability to forecast a type in the sentence to create a noun sandwich (see Figure 21). This \nsentence contains the accusative particle twice, which might seem alarming at first; \nhowever, since the accusative particles are in separate clauses, it causes no ambiguity \nand, therefore, no problem. The utterance remains perfectly comprehendible. It is the \nKare  ha    kusuri  wo  tsukeru  koto  wo   kimeta. \nHe decided to apply the medicine. \n𝜋 \n𝜋𝑟𝑠ҧ \ns\nl \n𝜋𝑟c4 \n𝑛 \n𝜋𝑟c4 \nc4\nr \n𝑛 𝑛𝑙𝑛 \nc4\nr\n \ns\n𝑠ҧ \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n86 \n \n86 \n \naccusative particle that follows the “koto” that links to the other-move verb, namely 決\nめた [kimeta]. \n \nThe next diagrammatic evolution is the DisCoCat diagram. Figure 29 shows \nthe DisCoCat representation. By now, it is not surprising. It is a perfect extension of the \npregroup grammar diagram found in Figure 28 into the realm of semantics. \nFigure 29 \nDisCoCat Diagram of an Other-move Sentence with a Relative Clause \n \n \n彼 \nKare \n薬 \nkusuri \nは \nha \nを \nwo \ns2 \n𝜋r \nc4 \n𝑛 \nc4\nr \n付ける \ntsukeru \nこと \nkoto \nを \nwo \n𝜋 \n𝜋r \ns\nl \n𝑠ҧ \n決めた \nkimeta \nc4 \n𝜋r \nc4\nr \n𝑛 \n𝑛 \n𝑛𝑙 \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n87 \n \n87 \n \nFigure 29 demonstrates several of the same principles that have been \nintroduced before. The topic marker は [ha] again demonstrates Non-Logical Primacy. \nIn this example, however, there is a large leap of five words, non-inclusive, to the main \nverb—the would-be train engine. Again, because the sentence is topical, the Train \nEngine Principle is superseded. The Train Car Principle is evident as there are many \ncups between adjacent quantum states, or words. The Noun Sandwich Principle is also \nevident. It is here applied to join the other-move verb 付ける [tsukeru] to the \nnominalizer こと [koto]. The noun sandwich has an intriguing quality in that it relies \non a cup that skips over a noun to connect to the subsequent particle. This gives the \neffect of suffixing the particle onto the verb in Figure 29, which is precisely what \n“koto” intended to do. Suffice it to say that the DisCoCat representation is perfectly \ncapable of representing self-move and other-move sentences. It is instructive to compare \nthe diagrams with one another to pictorially show the underlying grammatical \nmechanisms at play and how these mechanisms inform the topology of the semantic \ndiagrams. This is particularly true when comparing diagrams containing the self-move \nand other-move versions of the same base verb. Ultimately, the choice of verb form \ndetermines whether the train cars can be towed well; therefore, this type of \nconsideration is of utmost importance when musing over the idea of fluency. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n88 \n \n88 \n \n \nLastly, a DisCoCirc diagram is provided in Figure 30. This diagram is \nrepresentative, meaning it is one possible diagram that might exist. It is very likely that \nこと [koto], would not be considered a primary noun because it is used primarily out of \ngrammatical necessity.37 \nFigure 30 \nDisCoCirc Diagram of an Other-move Sentence \n \n \nNevertheless, for this example, “kare”, “kusuri”, and “koto” are chosen as the \nprimary nouns, and each is granted its own wire. These nouns mean “he”, “medicine”, \n \n37 Though, it is possible that nominalizers like こと [koto] and の [no] could be selected as \nprimary nouns over a very large text since these nouns will appear over and again. They are \nexceptionally common. Whether there is any benefit to including them is an avenue of further \nresearch and experimentation. \nkare \n \nkusuri \ntsukeru \nkoto \nkimeta \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n89 \n \n89 \n \nand “thing” respectively. Because of the realization that the “koto” wire may not be \npermanent, it ends by feeding directly into “kimeta”, the other-move verb that links with \n“kare”. Terminating “koto” in this way is instructive. This termination is depicted \ngraphically by mirroring the quantum state across a horizontal cross section. This is the \ndiagrammatical representation of an effect, which in DisCoCirc representation \nrepresents an imposition of a subject onto an object (Coecke, 2020). The noun \nrepresenting the object has its wire terminated as part of the effect, which is a quantum \nmeasurement. Now, reasoning backwards—up—through the diagram, a rough \ntranslation of the bottom and left portions would be something like “he decided the \nthing”. The quantum effect used to represent “kimeta” indicates that deciding something \nin this graph terminates the wire. The upper and right portions link “kusuri” through \n“tsukeru” to “koto”. This, clearly, is the portion of the diagram that represents the \nrelative clause. The “thing” being discussed here is the “application of medicine thing”. \nThus, when both sides are taken as a whole, the upper-right side is completed first. This \nis represented by the verb “tsukeru”, meaning “apply to something” in this case., being \nlisted higher than “kimeta”, which means “decided”. So, the meaning of “koto” is \nupdated first, then the meaning of “kare” is updated last. “Kare” and “kusuri” continue \nto persist farther into the narrative—are outputted through the sentence as represented \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n90 \n \n90 \n \nby a process. “Koto”, on the other hand, does not. This termination of noun wires is an \nimportant distinction between self-move and other move sentences. The former applies \nattributes to the subject, while the latter acts on objects. \nConclusion \nIn a world where quantum computers are capable of error correction, assuming \nthis requires the devices to also have a suitable number of qubits, translation devices \nusing QNLP will be superior to classical machines with standard methods of NLP; \ntherefore, the power of quantum computers may be the key to achieving unprecedented \ntranslation accuracy and even fluency. Achieving this goal is still beyond the horizon, \nbut enough of the groundwork has been laid to consider how such a dream may be \nachievable. That groundwork has been the subject of this research and is summarized \nhere.  \nFirst, category theory-based approaches to QNLP show much promise because \nthey can represent complex mathematical concepts and calculations as simple pictures \nwith varied boxes and wires. One no longer needs to be a quantum physicist to represent \nand solve problems that reduce to quantum mechanics. It is even possible to create these \ndiagrams using software tool like DisCoPy, which is a fantastic boon. Furthermore, they \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n91 \n \n91 \n \nare also a very natural extension of pregroup grammars and partial orders, which makes \nquantum calculations approachable to algebraic linguists. Quantum computing, then, is \nbecoming increasingly democratized by these novel approaches. \nThe English language has been the primary research focus when working with \ncategory theory-based diagrams. This leaves the research open to biases when \nconsidering other languages. The English language perspective is one out of a great \nmany of languages in the world. As a logical and low-context language with a strict \nword order core, the infamous SVO ordering, it is dramatically different from \nagglutinative languages that demonstrate another word order and have different \ngrammatical rules for verbs. Studying the Japanese language then, precisely because it \nis so different from the English language, leads to remedies for some potential \noversights that ought to be addressed in a QNLP pipeline. The present work addresses \nself-move and other-move verbs, the baseline grammatical structures that support them, \nand the string diagrams that represent their semantics. Additionally, this work serves as \na primer to the behavior of particles in DisCoCat and a first speculation into that of \nDisCoCirc. \nAs far as visual representations are concerned pregroup grammar, DisCoCat, and \nDisCoCirc diagrams for Japanese self-move and other-move sentences were introduced \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n92 \n \n92 \n \nand discussed. The study of DisCoCat diagrams yielded some observable principles that \naid in making sense of the topologies of the diagrams. To provide the same for \nDisCoCirc would require investigations of much larger bodies of text. These DisCoCat \nprinciples are as follows: \n1. The Pi are Numerous Principle: That, due to the partial order of nouns as \ndepicted by Walton Devices and the frequency of use of particles in the Japanese \nlanguage, diagrams of sentences with any degree of complexity will contain \nmany pronoun types, which are represented by π. These are mainly manifested \nas the right-adjoints of π, shown as πr , hence the wordplay in the choice of \n“are” in place of “is”. The latter would be grammatically correct, but much less \nfun. \nb. The Train Engine Principle: That the final word of a Japanese sentence is always \nthe mover of the sentence. The s base type is encoded into this final word. It is, \ntherefore, like a train engine pulling a series of train cars. The exception to this \nrule is topical sentences, which have their own overriding principle. \nc. The Train Car Principle: That Japanese modification flows from left to right in \nsingle hops much like how train cars are linked one to another to form a proper \ntrain. The exceptions to this principle are topical particles and adverbs, which, \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n93 \n \n93 \n \ndespite having a standard position, have more word order freedom in Japanese. \nNevertheless, this general observation is a foundational heuristic of these graphs. \nd. Non-Logical Primacy Principle: That non-logical particles, such as the topic \nmarker は [ha] will supersede the Train Engine Principle. The s base type is \nencoded in the non-logical particle in this case. The reason for this is the topic \ncan influence meaning beyond the sentence that contains it. It affects a larger \nportion of the text, which is known as the comment (Dvorak & Walton 2014). \ne. The Noun Sandwich Principle: That adjectival nouns, which rely な [na] to \nconnect to the noun that follows, verbs in relative clauses, and other words that \nfunction as prefixes are encoded with nnl and that these types will be joined by a \nn base type from the right, the adjacent word being modified, by a cup. The \nresult is that three noun types are used together across two words. This creates a \nsandwich of noun types.  \nThis work also introduces many avenues for continued research into Japanese. \nOne first order concern is the granularity with which diagrams are constructed. Japanese \ncontains not only words, but morphemes. It is not at all obvious whether constructing \ndiagrams at the word level or the morpheme level produce more accurate and more \nfluent translations. This becomes particularly important when working with causal and \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n94 \n \n94 \n \npassive verbs as morphemes are critical to correctly parsing the meanings of these \nverbs. Concerning parsing generally, Japanese, as a high-context language, drops many \nof its crucial grammatical elements when spoken. This includes the subject marker が\n[ga], which is the linchpin of a sentence. Parsing methods will be crucial as a \npreprocessing step to producing DisCo diagrams. It is likely that implied elements will \nneed to be made explicit during the parsing process. Obviously, there is the question of \nwhat typical diagrams might be created in the ZX-Calculus, or other potential \ndiagrammatic representations, and whether there are any useful topological principles \nthat may be gleaned from them. It follows that typical quantum circuit topologies \nremain to be demonstrated based on the baseline of this work. Additionally, other \nalgebraic grammars remain to be tested. It is certainly possible to test alternative \ngrammars for potential hidden benefits as well as minimize Cardinal’s alphabet to a \nstreamlined set. Of course, there are many other grammatical constructs in Japanese that \nremain to be studied. Adverbs, adjectives, and relative clauses are mentioned here, and \nthis work would serve as a good foundation to launch into those investigations in more \ndetail. There are also many grammatical choices with implicit meanings that warrant \nferreting out. A great example here is the use of こと[koto] or の[no] for nominalizing \nverbs. Naturally, there is also the topic of logical negation and how to best represent that \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n95 \n \n95 \n \nconcept in Japanese. Negation in Japanese is handled by the adjective ない [nai], \nwhich functions quite differently than the \"not\" of English. There is also much more to \nbe said about representing particles in DisCoCirc diagrams. Particles function very \nuniquely when compared to English grammar. In the same vein, Japanese also has \nlayers of politeness that are heavily, heavily informed by worldy context. It, then, is \nabsolutely crucial to investigate ways to incorporate worldly context into translations so \nthat the proper level of politeness—in addition to conversational negation—is produced \nby the translation (Rodatz et al., 2021). The translation cannot be fluent without \naddressing this concern. Lastly, any one of these observations could be the subject of \nexperimentation with publishable results. Many of the finer points of quantum \ntranslation will require quantitative and qualitative study to fine tune the algorithms and \nprocesses. \n \n \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n96 \n \n96 \n \nReferences \nAaronson, S. (2013). Quantum computing since Democritus. Cambridge University \nPress. \nAbbaszade, M., Salari, V., Mousavi, S. S., Zomorodi, M., & Zhou, X. (2021). \nApplication of quantum natural language processing for language \ntranslation. IEEE Access, 9, 130434–130448.  \nAl-Mehairi, Y., Coecke, B., & Lewis, M. (2017). Categorical compositional \ncognition. Quantum Interaction, 10106(QI 2016), 122–134. \nhttps://doi.org/10.1007/978-3-319-52289-0_10  \nBolt, J., Coecke, B., Genovese, F., Lewis, M., Marsden, D., & Piedeleu, R. (2016). \nInteracting conceptual spaces. Electronic Proceedings in Theoretical Computer \nScience, 221, 11–19. https://arxiv.org/abs/1608.01402  \nCardinal, K. (2002). An algebraic study of Japanese grammar [Master’s thesis, McGill \nUniversity]. eScholarship@McGill. \nhttps://escholarship.mcgill.ca/concern/theses/m326m3733  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n97 \n \n97 \n \nCardinal, K. (2007). A pregroup analysis of Japanese causatives. In Pacific Asia \nConference on Language, Information and Computation (pp. 96–104). The \nKorean Society for Language and Information (KSLI). \nhttps://aclanthology.org/Y07-1009  \nChen, A. (2020). NLP Pipeline. National Taiwan Normal University. \nhttps://alvinntnu.github.io/NTNU_ENC2045_LECTURES/nlp/nlp-\npipeline.html#post-modeling-phases  \nCoecke, B., & Meichanetzidis, K. (2020). Meaning updating of density matrices. arXiv. \nhttps://doi.org/10.48550/arXiv.2001.00862  \nCoecke, B., de Felice, G., Marsden, D., & Toumi, A. (2018a). Towards compositional \ndistribution discourse analysis. Electronic Proceedings in Theoretical Computer \nScience, 283, 1–12. https://doi.org/10.48550/arXiv.1811.03277  \nCoecke, B., de Felice, G., Meichanetzidis, K., & Toumi, A. (2020). Foundations for \nnear-term quantum natural language processing. arXiv. \nhttps://doi.org/10.48550/arXiv.2012.03755  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n98 \n \n98 \n \nCoecke, B., de Felice, G., Meichanetzidis, K., & Toumi, A. (2021). How to make qubits \nspeak. arXiv. https://doi.org/10.48550/arXiv.2107.06776  \nCoecke, B., Genovese, F., Lewis, M., Marsden, D., & Toumi, A. (2018b). Generalized \nrelations in linguistics and cognition. Theoretical Computer Science, 752, 104–\n115. https://doi.org/10.1016/j.tcs.2018.03.008  \nCoecke, B., & Kissinger, A. (2017). Picturing quantum processes: A first course in \nquantum theory and diagrammatic reasoning. Cambridge University Press. \nCoecke, B., Lewis, M., & Marsden, D. (2018c). Internal wiring of cartesian verbs and \nprepositions. Electronic Proceedings in Theoretical Computer Science, 283, 75–\n88. https://doi.org/10.4204/EPTCS.283.6  \nCoecke, Bob. (2016). From quantum foundations via natural language meaning to a \ntheory of everything. arXiv. https://doi.org/10.48550/arXiv.1602.07618  \nCoecke, Bob. (2020). The mathematics of text structure. arXiv. \nhttps://doi.org/10.48550/ARXIV.1904.03478  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n99 \n \n99 \n \nde Felice, G., Toumi, A., & Coecke, B. (2021). DisCoPy: Monoidal categories in \npython. Electronic Proceedings in Theoretical Computer Science, 333, 183–197. \nhttps://doi.org/10.4204/EPTCS.333.13  \nDolly, C. (2017, December 10). Japanese adjectives i and na - secrets they never tell \nyou! Four facts that make adjectives easy [Video]. YouTube. \nhttps://www.youtube.com/watch?v=yJ2EhSPLQsk  \nDolly, C. (2018a, March 25). Lesson 1: Japanese made easy! What schools never teach. \nThe core Japanese sentence -organic Japanese [Video]. YouTube. \nhttps://www.youtube.com/watch?v=pSvH9vH60Ig&t=138s  \nDolly, C. (2018b, June 23). Lesson 15: Transitivity- the 3 facts that make it easy. \nTransitive/intransitive verbs unlocked [Video]. YouTube. \nhttps://www.youtube.com/watch?v=ELk1dqaEmyk  \nDolly, C. (2018c, October 6). Lesson 8b: Japanese particles explained. How they \nREALLY work. [Video]. YouTube. \nhttps://www.youtube.com/watch?v=dwcTI9qvO-U&list=PLg9uYxuZf8x-\nFpkArMEoVVfw10TDT9I1h&index=1  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n100 \n \n100 \n \nDolly, C. (2019a, June 8). Japanese word order MATTERS (more than you think) 2 \nsimple rules rack tough sentences | Lesson 46 [Video]. YouTube. \nhttps://www.youtube.com/watch?v=T5PD1lORiwk  \nDolly, C. (2019b, August 24). Secrets of the で [de] particle. Why do we say みんなで\n行く[minna de iku]? and 世界で一番[sekai de ichiban]? | Lesson 55 [Video]. \nYouTube. https://www.youtube.com/watch?v=OiKgudW9xB8  \nDuneau, T. (2021). Parsing conjunctions in DisCoCirc. In Proceedings of the 2021 \nWorkshop on Semantic Spaces at the Intersection of NLP, Physics, and \nCognitive Science (SemSpace) (pp. 66–75). Association for Computational \nLinguistics. https://aclanthology.org/2021.semspace-1.7  \nDvorak, J. D., & Walton, R. D. (2014). Clause as Message: Theme, Topic, and \nInformation Flow in Mark 2:2-12 and Jude. Biblical and Ancient Greek \nLinguistics, 3, 31–85. \nhttps://www.academia.edu/8695843/Clause_as_Message_Theme_Topic_and_In\nformation_Flow_in_Mark_2_1_12_and_Jude?sm=b  \nHall, E. T. (1976). Beyond culture. Anchor Press. \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n101 \n \n101 \n \nHarris, Z. S. (1954). Distributional structure. WORD, 10(2–3), 146–162. \nhttps://doi.org/10.1080/00437956.1954.11659520  \nKing James Bible. (2017). King James Bible Online. \nhttps://www.kingjamesbibleonline.org/ (Original work published 1769). \nLambek, J. (1997). Type grammar revisited. In A. Lecomte, F. Lamarche, & G. Perrier \n(Eds.), LACL ’97: Selected Papers from the Second International Conference on \nLogical Aspects of Computational Linguistics (pp. 1–27). Springer-Verlag. \nhttps://dl.acm.org/doi/10.5555/645666.665029 a \nLambek, J. (2008). From word to sentence: A computational algebraic approach to \ngrammar. Polimetrica. \nhttps://books.google.com/books/about/From_Word_to_Sentence.html?id=ZHgR\naRaadJ4C  \nLorenz, R., Pearson, A., Meichanetzidis, K., Kartsaklis, D., & Coecke, B. (2021). \nQNLP in practice: Running compositional models of meaning on a quantum \ncomputer. arXiv. https://doi.org/10.48550/arXiv.2102.12846  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n102 \n \n102 \n \nMeichanetzidis, K., Gogioso, S., de Felice, G., Chiappori, N., Toumi, A., & Coecke, B. \n(2021). Quantum natural language processing on near-term quantum \ncomputers. Electronic Proceedings in Theoretical Computer Science, 340, 213–\n229. https://doi.org/10.4204/EPTCS.340.11  \nO’Riordan, L., Doyle, M., Baruffa, F., & Kannan, V. (2020). A hybrid classical-\nquantum workflow for natural language processing. Machine Learning: Science \nand Technology, 2(1). https://doi.org/10.1088/2632-2153/abbd2e  \nPotter, S., Crystal, D., Editors of Encyclopaedia Britannica, Schwarcz, T., Augustyn, \nA., Gaur, A., Kuiper, K., Lewis, R., Lotha, G., Leubering, J. E., Mahajan, D., \nPromeet, D., Ray, M., Rodriguez, E., Sampaolo, M., Tikkanen, A., & \nWallenfeldt, J. (2020, October 20). English language - Characteristics of \nmodern English. Britannica.com. https://www.britannica.com/topic/English-\nlanguage  \nQNLP. (2019, December 19). Why NLP is quantum-native, and beyond! [Video]. \nYouTube. https://www.youtube.com/watch?v=6-uKZN5_eAU  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n103 \n \n103 \n \nRodatz, B., Shaikh, R., & Yeh, L. (2021). Conversational negation using worldly \ncontext in compositional distributional semantics. arXiv. \nhttps://doi.org/10.48550/arXiv.2105.05748  \nSadrzadeh, M., Clark, S., & Coecke, B. (2013). The frobenius anatomy of word \nmeanings I: Subject and object relative pronouns. Journal of Logic and \nComputation [Special Issue], 23(6), 1293–1317. \nhttps://doi.org/10.1093/logcom/ext044  \nSadrzadeh, M., Clark, S., & Coecke, B. (2014). The frobenius anatomy of word \nmeanings II: Possessive relative pronouns. Journal of Logic and \nComputation, 26(2), 785–815. https://doi.org/10.48550/arXiv.1406.4690  \nShibatani, M., The Editors of Encyclopaedia Britannica, Gil, M., Eldridge, A., Gaur, A., \nHiggins, J., Kuiper, K., Liesangthem, G., & Ray, M. (2015, June 30). Japanese \nlanguage. Britannica.com. https://www.britannica.com/topic/Japanese-language  \nvan de Wetering, J. (2020). ZX-calculus for the working quantum computer scientist. \narXiv. https://doi.org/10.48550/arXiv.2012.13966  \nQUANTUM SELF-MOVE AND OTHER-MOVE IN JAPANESE  \n104 \n \n104 \n \nYeung, R., & Kartsaklis, D. (2021). A CCG-based version of the DisCoCat framework. \narXiv. https://doi.org/10.48550/arXiv.2105.07720  \nZeng, W., & Coecke, B. (2016). Quantum algorithms for compositional natural \nlanguage processing. Electronic Proceedings in Theoretical Computer \nScience, 221, 67–75. https://doi.org/10.4204/EPTCS.221.8  \n \n",
  "categories": [
    "cs.CL"
  ],
  "published": "2022-10-10",
  "updated": "2022-10-10"
}