{
  "id": "http://arxiv.org/abs/2302.02406v1",
  "title": "Pre-screening breast cancer with machine learning and deep learning",
  "authors": [
    "Rolando Gonzales Martinez",
    "Daan-Max van Dongen"
  ],
  "abstract": "We suggest that deep learning can be used for pre-screening cancer by\nanalyzing demographic and anthropometric information of patients, as well as\nbiological markers obtained from routine blood samples and relative risks\nobtained from meta-analysis and international databases. We applied feature\nselection algorithms to a database of 116 women, including 52 healthy women and\n64 women diagnosed with breast cancer, to identify the best pre-screening\npredictors of cancer. We utilized the best predictors to perform k-fold Monte\nCarlo cross-validation experiments that compare deep learning against\ntraditional machine learning algorithms. Our results indicate that a deep\nlearning model with an input-layer architecture that is fine-tuned using\nfeature selection can effectively distinguish between patients with and without\ncancer. Additionally, compared to machine learning, deep learning has the\nlowest uncertainty in its predictions. These findings suggest that deep\nlearning algorithms applied to cancer pre-screening offer a radiation-free,\nnon-invasive, and affordable complement to screening methods based on imagery.\nThe implementation of deep learning algorithms in cancer pre-screening offer\nopportunities to identify individuals who may require imaging-based screening,\ncan encourage self-examination, and decrease the psychological externalities\nassociated with false positives in cancer screening. The integration of deep\nlearning algorithms for both screening and pre-screening will ultimately lead\nto earlier detection of malignancy, reducing the healthcare and societal burden\nassociated to cancer treatment.",
  "text": "Pre-screening breast cancer with machine\nlearning and deep learning\nRolando Gonzales Martinez* and Daan-Max van Dongen**\n*Royal Netherlands Academy of Arts and Sciences, Netherlands\nInterdisciplinary Demographic Institute (NIDI), University of\nGroningen (Netherlands). Contact: r.m.gonzales.martinez@rug.nl\n**University College London (United Kingdom)\nJanuary 2023\nAbstract\nDeep learning has been widely applied in breast cancer screening to analyze\nimages obtained from X-rays, ultrasounds, magnetic resonances, and biopsies.\nWe suggest that deep learning can also be used for pre-screening cancer by\nanalyzing demographic and anthropometric information of patients, as well\nas biological markers obtained from routine blood samples and relative risks\nobtained from meta-analysis and international databases.\nIn this study, we\napplied feature selection algorithms to a database of 116 women, including 52\nhealthy women and 64 women diagnosed with breast cancer, to identify the best\npre-screening predictors of cancer. We utilized the best predictors to perform\nk-fold Monte Carlo cross-validation experiments that compare deep learning\nagainst traditional machine learning algorithms. Our results indicate that a\ndeep learning model with an input-layer architecture that is \fne-tuned using\nfeature selection can e\u000bectively distinguish between patients with and without\ncancer, since the average area under the curve (AUC) of a deep learning model\nis 87%, with a 95% con\fdence interval between 82% and 91%. Additionally,\ncompared to machine learning, deep learning has the lowest uncertainty in its\npredictions, as indicated by its standard deviation of AUC equal to 0.0345.\nThese \fndings suggest that deep learning algorithms applied to cancer pre-\nscreening o\u000ber a radiation-free, non-invasive, and a\u000bordable complement to\nscreening methods based on imagery. The implementation of deep learning\nalgorithms in cancer pre-screening o\u000ber opportunities to identify individuals\nwho may require imaging-based screening, can encourage self-examination, and\ndecrease the psychological externalities associated with false positives in cancer\nscreening. The integration of deep learning algorithms for both screening and\npre-screening will ultimately lead to earlier detection of malignancy, reducing\nthe healthcare and societal burden associated to cancer treatment.\n1\narXiv:2302.02406v1  [stat.ML]  5 Feb 2023\n1\nIntroduction\nBreast cancer is now the most commonly diagnosed cancer worlwide. More than\n2.26 million new cases of breast cancer were estimated for 2020 (Wilkinson and\nGathani, 2022), with Belgium and the Netherlands having the highest age-standardized\nincidence of breast cancer, and developing countries as Somalia and Syria having\nthe highest breast cancer mortality. Machine learning and deep learning algorithms\nare at the core of breast cancer screening in developing countries (Torres-Galv\u0013an\net al., 2019). These algorithms are applied to predict the presence of anomalies\nrelated to the presence breast cancer in digitalized images (Debelee et al., 2020; Yu\net al., 2021; Zhou et al., 2020) obtained from magnetic resonance imaging, ultra-\nsounds (Zheng et al., 2020), digital breast tomosynthesis (Bai et al., 2021), breast\ndensity from mammograms (Yala et al., 2019), tissue images (Naik et al., 2020), or\ncell nuclei from \fne needle aspirates of breast mass (Khuriwal and Mishra, 2018;\nStreet et al., 1993).\nWe suggest that deep learning can also be applied to the prognosis of breast\ncancer through the application of these algorithms to the information of patients\nobtained from medical records (demographic and anthropometric information), bi-\nological markers obtained from routine blood samples, and relative risks obtained\nfrom meta-analysis and publicly available databases. The development and progres-\nsion of breast cancer has been linked for example to glucose dysmetabolism, insulin\nresistance and changes in adipokine secretion (Crisostomo et al., 2016), and hence\npredictive models of breast cancer based on biological markers (glucose, insulin,\nHOMA, leptin, adiponectin, resistin and MCP-1) can be applied as pre-screening\ntools for the early detection of breast cancer, particularly when the information\nof biological markers is combined with the demographic and anthropometric infor-\nmation of patients and their relative risk by age and sex according to body mass\nindex (BMI). While the carcinogenic mechanisms that related overweight and obe-\n2\nsity to breast cancer are still uncertain, the positive association between high BMI\nand breast cancer risk in postmenopausal women was speculated to result from the\nhigher level of estrogen derived from the aromatization of androstenedione within\nthe larger fat reserves of women with high BMI (Lake et al., 1997). The tetrad\nof BMI, leptin, the ratio of leptin/adiponectin and the antigen 15.3 (CA15-3), are\nconsidered reliable biomarkers of breast cancer (Santill\u0013an-Ben\u0013\u0010tez et al., 2013), and\nresistin levels tend to be signi\fcantly elevated in postmenopausal breast cancer,\nafter adjusting for demographic, metabolic and clinicopathological features (Dala-\nmaga et al., 2013).\nIn this study, we analyzed the ability of machine learning and deep learning to\npredict the presence of breast cancer with pre-screening information. Machine learn-\ning and deep learning algorithms were applied to the information of 116 women,\n52 healthy women and 64 women that were diagnosed with breast cancer at the\nUniversity Hospital Centre of Coimbra (UHCC). The UHCC data contains demo-\ngraphic and anthropometric information, besides biological markers obtained from\nblood samples of the 166 women that were part of the study. The UHCC dataset\nwas extended with information of relative risks of breast cancer obtained from the\nGlobal Burden of Disease Study 2019 (Vos et al., 2020) and the relative risks of the\nmeta-analysis of Liu et al. (2018). The optimal predictors of breast cancer were\nselected with the SULOV-gradient boosting algorithm. The SULOV algorithm re-\nduced the full set of potential explanatory predictors to a subset of features with\nthe highest relevance and the lowest redundancy for predicting breast cancer. The\noptimal set of predictors were used in a k-fold Monte Carlo cross-validation ex-\nperiment that compared deep learning against seven traditional machine learning\nalgorithms: support vector machines, neural networks, logistic regression, XGBoost,\nrandom forests, naive Bayes and stochastic gradient algorithms. The results indi-\ncate that deep learning has the highest predictive ability and the highest precision,\n3\ncompared to machine learning algorithms. This \fnding indicates that deep learning\nalgorithms can be used to create a non-invasive, radiation-free and a\u000bordable pre-\nscreening medical recommendation system that can complement and guide cancer\nscreening.\n2\nMaterials and Methods\n2.1\nData\nThe data of the University Hospital Centre of Coimbra (UHCC) contains infor-\nmation of 116 women, 52 healthy women and 64 women that were diagnosed with\nbreast cancer. The information of UHCC was collected between 2009 and 2013 for a\nstudy of biomarkers of breast cancer, based on the results of routine blood analysis.\nDemographic and anthropometric information of patients was recorded during the\n\frst consultation of the patients with the physician (Patr\u0013\u0010cio et al., 2018). The de-\nmographic information in the dataset is the age of women and the anthropometric\ninformation is the BMI of women. The diagnosis of breast cancer was the result\nof a mammography and was con\frmed histologically with samples collected before\nsurgery or treatment. The samples of tumor tissue were obtained by mastectomy\nor tumourectomy and were evaluated by a pathologist at the Anatomic Pathology\nDepartment of UHCC. The counterfactual group of women without breast cancer\nin the database were healthy volunteers that were enrolled in the study as controls.\nBoth the patients with breast cancer and the control group of healthy women had no\nprior cancer treatment and were free from infections, acute diseases or comorbidities\nat the time of participating in the study.\nBlood samples of the women with breast cancer and the control group of healthy\nwomen were extracted at the Laboratory of Physiology of the Faculty of Medicine\nof University of Coimbra from peripheral venous blood vials. The blood samples\n4\nwere collected after an overnight fasting. The fasting blood was centrifuged (2500\ng) at 4\u000eC and stored at -80\u000eC for biochemical determinations of serum glucose levels\n(mg/dL), insulin levels (\u0016U/mL), and serum values of leptin (ng/mL), adiponectin\n(\u0016g/mL), resistin (ng/mL), and chemokine monocyte chemoattractant Protein 1\n(MCP-1, (pg/dL)). An Homeostasis Model Assessment (HOMA) index that mea-\nsures insulin resistance was calculated with the information of the fasting insulin\nlevel (\u0016U/mL) and fasting glucose level (mmol/L).\nThe information of the UHCC was extended with data of relative risks of breast\ncancer by age obtained from the Global Burden of Disease (GBD) Study 2019 (Vos\net al., 2020) and the relative risks of breast cancer associated to body mass index\n(BMI) from the dose-response meta-analysis of of Liu et al. (2018). The GBD Study\n2019 was coordinated by the Institute for Health Metrics and Evaluation, who esti-\nmated the burden of diseases, injuries, and risk factors for 204 countries, territories\nand selected subnational locations worldwide. The GBD database contains infor-\nmation of relative risks of cancer for high BMI (BMI \u0015 25), by age and sex. The\ndose-response meta-analysis of Liu et al. (2018) was based on 12 prospective cohort\nstudies comprising 22,728,674 participants. The results of Liu et al. (2018) show\nthat every 5 kg/m2 increase in BMI corresponds to a 2% increase in breast cancer\nrisk in women, with di\u000berential results for premenopausal women, for which higher\nBMI could be a protective factor in breast cancer risk (Figure 1). Table 1 shows the\ndescriptive statistics of the complete dataset used in this study; this is, the origi-\nnal UHCC data that was extended with relative risks (RRs) from publicy available\ndatabases and studies.\n2.2\nMethods\nExperiments using k-fold Monte Carlo cross-validation were conducted to evaluate\nthe ability that machine learning and deep learning classi\fers have to di\u000berentiate\n5\nTable 1: Descriptive statistics of the database\nmean\nstd.dev.\nmin\nmax\nAge (years)\n57.30\n16.11\n24\n89\nBMI\n27.58\n5.02\n18.37\n38.58\nGlucose (mg/dL)\n97.79\n22.53\n60.00\n201.00\nInsulin (\u0016U/mL)\n10.01\n10.07\n2.43\n58.46\nHOMA\n2.69\n3.64\n0.47\n25.05\nLeptin (ng/mL)\n26.62\n19.18\n4.31\n90.28\nAdiponectin (\u0016g/mL)\n10.18\n6.84\n1.66\n38.04\nResistin (ng/mL)\n14.73\n12.39\n3.21\n82.10\nRRs (Liu et al., 2018)\n1.51\n0.48\n0.40\n2.44\nRRs GBD (center)\n1.01\n0.10\n0.89\n1.09\nRRs GBD (lower)\n0.97\n0.08\n0.87\n1.04\nRRs GBD (upper)\n1.05\n0.11\n0.91\n1.14\nHigh BMI (binary)\n0.34\n0.47\n0\n1\nObesity (binary)\n0.32\n0.47\n0\n1\nbetween patients with and without cancer, based on demographic and anthropo-\nmetric information, as well as biomarkers and relative risks in relation to age and\nbody mass index.\nFeature selection with the SULOV algorithm was applied to\ndetermine the optimal set of predictors for identifying breast cancer.\nDeep learning is a machine learning approach based on multiple layers of arti-\n\fcial neural networks that are densely-connected. Each layer transforms the input\ndata from the previous layer into a new representation trough non-linear functions\nconnected by synaptic weights (Shen et al., 2017). This allows the deep learning\nmodel to learn both locally and in the inter-relationships of the whole data, through\na hierarchical structure (Haque and Neubert, 2020). As deep learning can handle\nimbalanced, heterogeneous, and high dimensional data, and is robust to changes\nin the input data due its multiple hidden layers, it is at the center of arti\fcial in-\ntelligence and is increasingly being used to mine large and complex relationships\nhidden in biomedical data (Dash et al., 2022; Baldi, 2018). Previous applications of\ndeep learning in biomedical science include image reconstruction and the automated\ninterpretation of downstream images in biomedical optics (Tian et al., 2021), seg-\n6\nFigure 1: Subgroup meta-analysis of the association between BMI increment (per\n\fve units) and breast cancer risk, by menopausal status. Reproduced from Liu\net al. (2018).\nmentation of medical images in diseased and healthy regions (Haque and Neubert,\n2020; Isensee et al., 2021), photoacoustic imaging of chromophores (Grohl et al.,\n2021), gene expression (He et al., 2020), protein structure prediction (Torrisi et al.,\n2020), brain machine interfaces (Bozhkov and Georgieva, 2020), and clinical lan-\nguage processing (Ionescu, 2020). The deep learning architectures applied in this\nstudy have recti\fed networks and L1 and L2 regularization in the kernel, bias and\nactivation functions of the dense hidden layers.\nA recursive minimum redundancy maximum relevance (MRMR) algorithm of\nSULOV-gradient boosting was applied for feature selection (Ram\u0013\u0010rez-Gallego et al.,\n2017). Feature selection is the process of reducing the number of input variables\n7\nwhen developing a predictive model (Brownlee, 2020). Feature selection is a pre-\nprocessing step that improves model performance by identifying the variables that\nare the most relevant to the prediction task, consequentially removing irrelevant\nand redundant variables from the set of potential predictors. Irrelevant features are\nthose that can be removed without a\u000becting learning performance, while redundant\nfeatures are correlated features that are individually relevant, but due to their co-\npresence the removal of one of them does not a\u000bect learning performance (Liu and\nMotoda, 2007). MRMR \fnds the minimal-optimal subset of features through the\nselection of highly predictive but uncorrelated features. The algorithm starts cal-\nculating the mutual information score of all the pairs of highly correlated variables\nand then selects the ones with the highest Information scores and least correlation\nwith each other. This \frst step is called the SULOV (Searching for Uncorrelated\nList Of Variables) algorithm. In the second step, XGBoost is used to repeatedly\n\fnd the best features to predict the target variable in a test sample using the model\nestimated in the train sample with the variables selected with SULOV in step 1.\nXGBoost is a regularized gradient boosting algorithm based on boosted tree en-\nsembles (Chen and Guestrin, 2016) that has proven to be highly successful solving\na vast array of predictive problems due to its ability to handle the bias-variance\ntrade-o\u000b (Nielsen, 2016). In biomedical science, the MRMR algorithm has been\nused before for the feature selection of temporal gene expression data (Ding and\nPeng, 2005; Radovic et al., 2017).\nThe performance of the machine learning and deep learning classi\fers was eval-\nuated using the Area Under the Receiver Operating Characteristic Curve (AUC).\nThe performance of the deep learning algorithm|measured by AUC|was com-\npared against the AUC of seven machine learning algorithms: XGBoost, stochastic\ngradient, support vector machines, random forests, neural networks, naive Bayes\nand logistic regression. AUC measures the ability of the model to distinguish be-\n8\ntween positive and negative classes; in this case, the presence of breast cancer\n(positive class) or the absence of breast cancer (negative class). AUC ranges be-\ntween 0 and 1, with a value of 1 indicating a perfect classi\fer and a value of 0.5\nindicating a classi\fer no better than random guessing. AUC is particularly useful\nwhen the distribution of classes in the target variable is imbalanced, because in\nthe presence of unbalanced class distribution, a model could achieve high accuracy\nby simply predicting the majority class most of the time. AUC is a better metric\nin these cases because it takes into account both the true positive rate and the\nfalse positive rate of the predictive model. The AUC of the machine learning and\ndeep learning algorithms was evaluated through Monte Carlo experiments based\non a k-fold cross-validation that splits the data in k-train and k-test samples. The\nmachine learning and deep learning classi\fers are estimated with the data of the\ntrain sample, and the predictive ability of the models is tested in the test sample\nthat was not used to estimate the algorithms.\n3\nResults\n3.1\nFeature selection with SULOV-gradient boosting\nTable 2 shows the results of selecting the best predictors of breast cancer with the\nSULOV algorithm. The recursive MRMR-SULOV algorithm was implemented for\nvalues of the correlation threshold \u001a of features for values of \u001a between \u001a = 0:01\nand \u001a = 0:99, in order to mitigate the impact of di\u000berent correlation values on the\nselection of optimal predictors and produce results that are robust to the choice of\nthe correlation threshold between variables. The variables that were selected more\nfrequently by the SULOV algorithm are age, resistin, the upper values of the relative\nrisks of breast cancer published by the GBD database, glucose, adiponectin, high\nBMI, MCP-1,leptin, the relative risks of breast cancer of Liu et al. (2018), obesity\n9\nand insulin levels in the blood samples (Table 2). These are the less correlated\nvariables and at the same time the most relevant features selected by the MRMR\nSULOV-gradient boosting. A previous independent study based on fuzzy neural\nnetworks (Silva Ara\u0013ujo et al., 2019) and stochastic vector machines (Patr\u0013\u0010cio et al.,\n2018) also found resistin, glucose and age relevant for breast cancer prediction.\nAge is considered a particularly relevant risk factor for breast cancer since the\ndiagnosis of this neoplastic disease is most frequently found in women in menopausal\ntransition and less frequently found in women below 45 years of age (Kami\u0013nska et al.,\n2015). Even for premenopausal women, previous studies (Kresovich et al., 2019)\nhave found that each 5-year acceleration in biological age corresponds with a 15%\nincrease in breast cancer risk.\nIn relation to the biomarkers selected by the SULOV algorithm|resistin, adiponectin,\nand glucose|, both the low serum adiponectin levels and high resistin levels were\nfound to be associated with increased breast cancer risk previously (Kang et al.,\n2007).\nResistin has been signi\fcantly associated with tumor and in\rammatory\nmarkers, cancer stage, tumor size, grade and lymph node invasion (Dalamaga et al.,\n2013), since resistin facilitates breast cancer progression via TLR4-mediated in-\nduction of mesenchymal phenotypes and stemness properties (Wang et al., 2018).\nMoreover, circulating resistin associated with the presence of breast cancer in a\ndose{response manner appears to have adiposity-independent roles in breast car-\ncinogenesis (Sun et al., 2010). There is also evidence that glucose and other factors\nrelated to glucose metabolism, such as insulin and insulin-like growth-factors, may\ncontribute to breast cancer development, in pre and post menopausal women (Sieri\net al., 2012), because malignant cells extensively use glucose for proliferation (Muti\net al., 2002).\nIn contrast, the homeostasis model assessment index (HOMA) is\nfrequently excluded from the set of features by the SULOV algorithm due to its\nlow relevance and high correlation with other features. This result is expected and\n10\nsuggests that the SULOV-gradient boosting algorithm properly excludes redundant\nfeatures, because HOMA is a measure of insulin resistance measurement that is cal-\nculated as a combination of fasting insuline and glucose levels and was found also\nto be correlated with BMI in previous studies (Tim\u0013oteo et al., 2014).\nTable 2: Recursive MRMR feature selection with SULOV-gradient boosting\nFrequency\nmin \u001a\nmean \u001a\nstd.dev. \u001a\nAge (years)\n97\n0.00\n0.49\n0.28\nResistin (ng/mL)\n90\n0.00\n0.51\n0.28\nRRs GBD (upper)\n77\n0.05\n0.55\n0.27\nGlucose (mg/dL)\n76\n0.21\n0.59\n0.22\nAdiponectin (\u0016g/mL)\n75\n0.23\n0.60\n0.22\nHigh BMI (binary)\n65\n0.27\n0.64\n0.20\nMCP-1 (pg/dL)\n65\n0.26\n0.65\n0.19\nLeptin (ng/mL)\n64\n0.30\n0.65\n0.19\nRRs (Liu et al., 2018)\n59\n0.37\n0.68\n0.17\nObesity (binary)\n59\n0.11\n0.55\n0.28\nInsulin (\u0016U/mL)\n33\n0.05\n0.53\n0.26\nBMI\n30\n0.62\n0.81\n0.11\nHOMA\n29\n0.69\n0.83\n0.09\nRRs GBD (center)\n8\n0.86\n0.90\n0.04\nRRs GBD (lower)\n8\n0.21\n0.81\n0.25\n3.2\nMachine learning and deep learning results\nThe best predictors selected by the SULOV algorithm were used in the deep learn-\ning and machine learning algorithms. In the deep learning algorithm, a sigmoid\nactivation function was used for the output layer of the neural networks, due to\nthe binary nature of the target variable (presence or not of breast cancer). The\noptimization of the deep learning model was performed with adaptive moment es-\ntimation (Kingma and Ba, 2014) during 3 \u0002 102 epochs, with a batch size equal to\n1\u000210, using a binary cross-entropy loss function. Grid search was applied to choose\nthe type of activation function, the number of hidden layers, and the number of\nnodes in the hidden layers of the neural networks. The highest predictive power\n11\nwas obtained with a recti\fed linear activation function (ReLU) in the input layer,\nfour hidden layers with 1\u0002102 nodes, a L1-L2 regularizer in the kernel function and\na L2 regularizer for the bias and the activation functions of the hidden units. The\nbetter performance of ReLU activation functions compared to tangent-hyperbolic\nor (S)eLU activations functions (Clevert et al., 2015; Klambauer et al., 2017) was\nalso expected, since the use of piece-wise linear hidden units based on the ReLU\nactivation functions is considered a major algorithmic change that improved the\nperformance of feed-forward networks (Goodfellow et al., 2017) and reduced the\ncomputational burden of calculating the exponential function in activation func-\ntions (Glorot et al., 2011).\nTable 3 and Figure 2 show the results of predicting the presence of breast can-\ncer with machine learning and deep learning algorithms. On average, the highest\npredictive ability to di\u000berentiate between women with and without breast cancer is\nobtained with deep learning. The deep learning algorithm has on average an AUC\nequal to 87%, with a 95% con\fdence interval between 82% and 91% (Table 3).\nSupport vector machines, in turn, have a lower average AUC (83%) with a wider\ncon\fdence interval (95% CI = [68%, 95%]), and neural networks with a simple ar-\nchitecture have an average AUC of 82%, also with a wider con\fdence interval (95%\nCI = [67%, 95%]). Compared to the traditional machine learning algorithms, the\ndeep learning algorithms also have the lowest predictive uncertainty, measured by\nthe standard deviation and the percentiles of the distribution of the AUC obtained\nwith the k-fold Monte Carlo experiments (Table 3). The lowest dispersion of the\nAUC (Figure 2) is obtained with the deep learning algorithm (AUC standard devi-\nation = 0.0345), followed by support vector machines (AUC standard deviation =\n0.0711) and neural networks (AUC standard deviation = 0.0720). This last results\nshows the high precision of predictions obtained with deep learning compared to\nmachine learning.\n12\nFigure 2: AUC of machine learning and deep learning classi\fers in the Monte Carlo\ncross-validation\nTable 3: AUC of the machine learningand deep learning algorithms\nModel\nmean\nstd.dev.\np2.5\np97.5\nDeep learning\n0.8699\n0.0345\n0.8190\n0.9138\nSupport vector machines\n0.8344\n0.0711\n0.6768\n0.9527\nNeural network\n0.8232\n0.0720\n0.6667\n0.9476\nLogistic regression\n0.8078\n0.0741\n0.6569\n0.9334\nXGBoost\n0.7834\n0.0755\n0.6263\n0.9191\nRandom forest\n0.7763\n0.0804\n0.6035\n0.9192\nNaive bayes\n0.7504\n0.0869\n0.5686\n0.9001\nStochastic gradient\n0.6861\n0.0860\n0.5120\n0.8553\n13\n4\nDiscussion\nBreast cancer is a prevalent form of cancer among women, with early detection being\ncrucial for survival. The screening of breast cancer is typically performed through\nmethods such as mammograms, ultrasound, magnetic resonance imaging (MRI),\nself-examination, or examination by a clinician. Advances in deep learning have\nled to the development of algorithms that can detect anomalies related to breast\ncancer in images obtained from patients, particularly for the segmentation and\nclassi\fcation of normal and abnormal breast tissue from thermograms (Mohamed\net al., 2022; Torres-Galv\u0013an et al., 2019).\nOur study explored the application of deep learning for pre-screening breast\ncancer. We applied machine learning and deep learning to observational data that\ncontains demographic and anthropometric information of cancer patients and a\ncontrol group of healthy women, in addition to biological markers obtained from\nroutine blood samples and relative risks of cancer obtained from publicly available\ndatabases published by international studies. We found that deep learning algo-\nrithms have the highest predictive ability to distinguish between women with and\nwithout breast cancer. Deep learning also has the lowest uncertainty|the highest\nprecision|in its predictions compared to machine learning.\nOur \fndings indicate that pre-screening cancer with deep learning algorithms\no\u000bers a non-invasive, radiation-free, and a\u000bordable alternative for the early detec-\ntion of breast cancer. A medical recommendation system of pre-screening based on\ndeep learning can aid in the early detection of mass anomalies that may not yet\nbe detectable through self-examination or have not yet caused symptoms, but are\nat a stage where they are easier to treat. This is particularly relevant for breast\ncancer, as previous studies have shown that women tend to have an already de-\nveloped metastatic breast cancer when they are \frst diagnosed, and they have a\npoor prognosis regardless of their menopausal status (Kang et al., 2007). Addition-\n14\nally, pre-screening breast cancer could reduce the risks associated with traditional\nscreening methods, such as false positive test results and unnecessary tests that are\nexpensive, invasive, time-consuming, and may cause anxiety in patients (Lerman\net al., 1991; Mathioudakis et al., 2019).\nThe integration of deep learning algorithms for cancer pre-screening in medical\nrecommendation systems can guide the frequency and follow-up of radiographic\nimaging and tissue testing, particularly in developing countries, where access to\ntraditional cancer screening and medical personnel is limited for low-income pop-\nulations in rural areas, making breast cancer a leading cause of death due to late\ndetection (Kakileti et al., 2020). Future studies should investigate the potential\nof increasing the predictive ability of deep-learning algorithms by incorporating\nadditional cancer risk factors, such as those associated with smoking and alcohol\nconsumption, since a recent analysis of the impact of 34 risk factors for 23 cancer\ntypes suggests that smoking, alcohol use, and high BMI are the leading contributors\nfor 4.45 million cancer deaths (44.4% of all cancer deaths) globally in 2019 (Tran\net al., 2022).\nReferences\nLouise Wilkinson and Toral Gathani. Understanding breast cancer as a global health\nconcern. The British Journal of Radiology, 95(1130):20211033, 2022.\nJuan Carlos Torres-Galv\u0013an, Edgar Guevara, and Francisco Javier Gonz\u0013alez. Com-\nparison of deep learning architectures for pre-screening of breast cancer thermo-\ngrams. In 2019 Photonics North (PN), pages 1{2. IEEE, 2019.\nTaye Girma Debelee, Friedhelm Schwenker, Achim Ibenthal, and Dereje Yohannes.\n15\nSurvey of deep learning in breast cancer image analysis. Evolving Systems, 11\n(1):143{163, 2020.\nKeping Yu, Liang Tan, Long Lin, Xiaofan Cheng, Zhang Yi, and Takuro Sato. Deep-\nlearning-empowered breast cancer auxiliary diagnosis for 5gb remote e-health.\nIEEE Wireless Communications, 28(3):54{61, 2021.\nLi-Qiang Zhou, Xing-Long Wu, Shu-Yan Huang, Ge-Ge Wu, Hua-Rong Ye, Qi Wei,\nLing-Yun Bao, You-Bin Deng, Xing-Rui Li, Xin-Wu Cui, et al. Lymph node\nmetastasis prediction from primary breast cancer us images using deep learning.\nRadiology, 294(1):19{28, 2020.\nJing Zheng, Denan Lin, Zhongjun Gao, Shuang Wang, Mingjie He, and Jipeng Fan.\nDeep learning assisted e\u000ecient adaboost algorithm for breast cancer detection\nand early diagnosis. IEEE Access, 8:96946{96954, 2020.\nJun Bai, Russell Posner, Tianyu Wang, Cli\u000bord Yang, and Sheida Nabavi. Ap-\nplying deep learning in digital breast tomosynthesis for automatic breast cancer\ndetection: A review. Medical image analysis, 71:102049, 2021.\nAdam Yala, Constance Lehman, Tal Schuster, Tally Portnoi, and Regina Barzi-\nlay. A deep learning mammography-based model for improved breast cancer risk\nprediction. Radiology, 292(1):60{66, 2019.\nNikhil Naik, Ali Madani, Andre Esteva, Nitish Shirish Keskar, Michael F Press,\nDaniel Ruderman, David B Agus, and Richard Socher. Deep learning-enabled\nbreast cancer hormonal receptor status determination from base-level h&e stains.\nNature communications, 11(1):1{8, 2020.\nNaresh Khuriwal and Nidhi Mishra. Breast cancer diagnosis using deep learning\nalgorithm.\nIn 2018 International Conference on Advances in Computing,\n16\nCommunication Control and Networking (ICACCCN), pages 98{103. IEEE,\n2018.\nW Nick Street, William H Wolberg, and Olvi L Mangasarian.\nNuclear feature\nextraction for breast tumor diagnosis.\nIn Biomedical image processing and\nbiomedical visualization, volume 1905, pages 861{870. SPIE, 1993.\nJoana Crisostomo, Paulo Matafome, Daniela Santos-Silva, Ana L Gomes, Manuel\nGomes, Miguel Patr\u0013\u0010cio, Liliana Letra, Ana B Sarmento-Ribeiro, Lelita San-\ntos, and Raquel Sei\u0018ca. Hyperresistinemia and metabolic dysregulation: a risky\ncrosstalk in obese breast cancer. Endocrine, 53(2):433{442, 2016.\nJK Lake, C Power, and TJ Cole. Women's reproductive health: the role of body\nmass index in early and adult life.\nInternational journal of obesity, 21(6):\n432{438, 1997.\nJonnathan G Santill\u0013an-Ben\u0013\u0010tez, Hugo Mendieta-Zer\u0013on, Leobardo M G\u0013omez-Oliv\u0013an,\nJuan J Torres-Ju\u0013arez, Juan M Gonz\u0013alez-Ba~nales, Lorena V Hern\u0013andez-Pe~na, and\nAngel Ord\u0013o~nez-Quiroz. The tetrad bmi, leptin, leptin/adiponectin (l/a) ratio and\nca 15-3 are reliable biomarkers of breast cancer. Journal of clinical laboratory\nanalysis, 27(1):12{20, 2013.\nMaria Dalamaga,\nGeorge Sotiropoulos,\nKonstantinos Karmaniolas,\nNicolaos\nPelekanos, Evangelia Papadavid, and Antigoni Lekka.\nSerum resistin:\na\nbiomarker of breast cancer in postmenopausal women? association with clini-\ncopathological characteristics, tumor markers, in\rammatory and metabolic pa-\nrameters. Clinical biochemistry, 46(7-8):584{590, 2013.\nTheo Vos, Stephen S Lim, Cristiana Abbafati, Kaja M Abbas, Mohammad Abbasi,\nMitra Abbasifard, Mohsen Abbasi-Kangevari, Hedayat Abbastabar, Foad Abd-\nAllah, Ahmed Abdelalim, et al. Global burden of 369 diseases and injuries in 204\n17\ncountries and territories, 1990{2019: a systematic analysis for the global burden\nof disease study 2019. The Lancet, 396(10258):1204{1222, 2020.\nKang Liu, Weining Zhang, Zhiming Dai, Meng Wang, Tian Tian, Xinghan Liu,\nHuafeng Kang, Haitao Guan, Shuqun Zhang, and Zhijun Dai. Association be-\ntween body mass index and breast cancer risk: Evidence based on a dose{response\nmeta-analysis. Cancer management and research, 10:143, 2018.\nMiguel Patr\u0013\u0010cio, Jos\u0013e Pereira, Joana Cris\u0013ostomo, Paulo Matafome, Manuel Gomes,\nRaquel Sei\u0018ca, and Francisco Caramelo. Using resistin, glucose, age and bmi to\npredict the presence of breast cancer. BMC cancer, 18(1):1{8, 2018.\nDinggang Shen, Guorong Wu, and Heung-Il Suk. Deep learning in medical image\nanalysis. Annual review of biomedical engineering, 19:221, 2017.\nIntisar Rizwan I Haque and Jeremiah Neubert. Deep learning approaches to biomed-\nical image segmentation. Informatics in Medicine Unlocked, 18:100297, 2020.\nSujata Dash, Subhendu Kumar Pani, Joel JPC Rodrigues, and Babita Majhi. Deep\nLearning, Machine Learning and IoT in Biomedical and Health Informatics:\nTechniques and Applications. CRC Press, 2022.\nPierre Baldi. Deep learning in biomedical data science. Annual review of biomed-\nical data science, 1:181{205, 2018.\nLei Tian, Brady Hunt, Muyinatu A Lediju Bell, Ji Yi, Jason T Smith, Marien\nOchoa, Xavier Intes, and Nicholas J Durr. Deep learning in biomedical optics.\nLasers in Surgery and Medicine, 53(6):748{775, 2021.\nFabian Isensee, Paul F Jaeger, Simon AA Kohl, Jens Petersen, and Klaus H Maier-\nHein.\nnnu-net: a self-con\fguring method for deep learning-based biomedical\nimage segmentation. Nature methods, 18(2):203{211, 2021.\n18\nJanek Grohl, Melanie Schellenberg, Kris Dreher, and Lena Maier-Hein. Deep learn-\ning for biomedical photoacoustic imaging: A review. Photoacoustics, 22:100241,\n2021.\nBryan He, Ludvig Bergenstr\u0017ahle, Linnea Stenbeck, Abubakar Abid, Alma Anders-\nson, \u0017Ake Borg, Jonas Maaskola, Joakim Lundeberg, and James Zou. Integrating\nspatial gene expression and breast tumour morphology via deep learning. Nature\nbiomedical engineering, 4(8):827{834, 2020.\nMirko Torrisi, Gianluca Pollastri, and Quan Le. Deep learning methods in protein\nstructure prediction. Computational and Structural Biotechnology Journal,\n18:1301{1310, 2020.\nLachezar Bozhkov and Petia Georgieva. Deep learning models for brain machine\ninterfaces. Annals of Mathematics and Arti\fcial Intelligence, 88(11):1175{\n1190, 2020.\nDaniela Ionescu.\nDeep learning algorithms and big health care data in clinical\nnatural language processing. Linguistic and Philosophical Investigations, 19:\n86{92, 2020.\nSergio Ram\u0013\u0010rez-Gallego, Iago Lastra, David Mart\u0013\u0010nez-Rego, Ver\u0013onica Bol\u0013on-\nCanedo, Jos\u0013e Manuel Ben\u0013\u0010tez, Francisco Herrera, and Amparo Alonso-Betanzos.\nFast-mrmr: Fast minimum redundancy maximum relevance algorithm for high-\ndimensional big data.\nInternational Journal of Intelligent Systems, 32(2):\n134{152, 2017.\nJason Brownlee. Data preparation for machine learning: data cleaning, feature\nselection, and data transforms in Python. Machine Learning Mastery, 2020.\nHuan Liu and Hiroshi Motoda. Computational methods of feature selection. CRC\nPress, 2007.\n19\nTianqi Chen and Carlos Guestrin. Xgboost: A scalable tree boosting system. In\nProceedings of the 22nd acm sigkdd international conference on knowledge\ndiscovery and data mining, pages 785{794, 2016.\nDidrik Nielsen. Tree boosting with xgboost-why does xgboost win \\every\" machine\nlearning competition? Master's thesis, NTNU, 2016.\nChris Ding and Hanchuan Peng. Minimum redundancy feature selection from mi-\ncroarray gene expression data. Journal of bioinformatics and computational\nbiology, 3(02):185{205, 2005.\nMilos Radovic, Mohamed Ghalwash, Nenad Filipovic, and Zoran Obradovic. Min-\nimum redundancy maximum relevance feature selection approach for temporal\ngene expression data. BMC bioinformatics, 18(1):1{14, 2017.\nVin\u0013\u0010cius Jonathan Silva Ara\u0013ujo, Augusto Junio Guimar~aes, Paulo Vitor de Cam-\npos Souza, Thiago Silva Rezende, and Vanessa Souza Ara\u0013ujo.\nUsing resistin,\nglucose, age and bmi and pruning fuzzy neural network for the construction\nof expert systems in the prediction of breast cancer. Machine Learning and\nKnowledge Extraction, 1(1):466{482, 2019.\nMarzena Kami\u0013nska, Tomasz Ciszewski, Karolina  Lopacka-Szatan, Pawe l Miot la,\nand El_zbieta Staros lawska. Breast cancer risk factors. Menopause Review, 14\n(3):196{202, 2015.\nJacob K Kresovich, Zongli Xu, Katie M O'Brien, Clarice R Weinberg, Dale P San-\ndler, and Jack A Taylor. Methylation-based biological age and breast cancer risk.\nJNCI: Journal of the National Cancer Institute, 111(10):1051{1058, 2019.\nJee-Hyun Kang, Byung-Yeon Yu, and Dae-Sung Youn.\nRelationship of serum\nadiponectin and resistin levels with breast cancer risk. Journal of Korean med-\nical science, 22(1):117{121, 2007.\n20\nCH Wang, PJ Wang, YC Hsieh, S Lo, YC Lee, YC Chen, CH Tsai, WC Chiu,\nS Chu-Sung Hu, CW Lu, et al. Resistin facilitates breast cancer progression via\ntlr4-mediated induction of mesenchymal phenotypes and stemness properties.\nOncogene, 37(5):589{600, 2018.\nChien-An Sun, Mei-Hsuan Wu, Chi-Hong Chu, Yu-Ching Chou, Giu-Cheng Hsu,\nTsan Yang, Wan-Yun Chou, Cheng-Ping Yu, and Jyh-Cherng Yu. Adipocytokine\nresistin and breast cancer risk. Breast cancer research and treatment, 123(3):\n869{876, 2010.\nSabina Sieri, Paola Muti, Agnoli Claudia, Franco Berrino, Valeria Pala, Sara Grioni,\nCarlo Alberto Abagnato, Giovanni Blandino, Paolo Contiero, Holger J Schune-\nmann, et al. Prospective study on the role of glucose metabolism in breast cancer\noccurrence. International journal of cancer, 130(4):921{929, 2012.\nPaola Muti, Teresa Quattrin, Brydon JB Grant, Vittorio Krogh, Andrea Micheli,\nHolger J Schunemann, Malathi Ram, Jo L Freudenheim, Sabina Sieri, Maurizio\nTrevisan, et al. Fasting glucose is a risk factor for breast cancer: a prospective\nstudy.\nCancer Epidemiology Biomarkers & Prevention, 11(11):1361{1368,\n2002.\nAna Teresa Tim\u0013oteo, Fernando Miranda, Miguel Mota Carmo, and Rui Cruz Fer-\nreira. Optimal cut-o\u000b value for homeostasis model assessment (homa) index of\ninsulin-resistance in a population of patients admitted electively in a portuguese\ncardiology ward. Acta medica portuguesa, 27(4):473{479, 2014.\nDiederik P Kingma and Jimmy Ba. Adam: A method for stochastic optimization.\narXiv preprint arXiv:1412.6980, 2014.\nDjork-Arn\u0013e Clevert, Thomas Unterthiner, and Sepp Hochreiter. Fast and accu-\n21\nrate deep network learning by exponential linear units (elus). arXiv preprint\narXiv:1511.07289, 2015.\nGunter Klambauer, Thomas Unterthiner, Andreas Mayr, and Sepp Hochreiter. Self-\nnormalizing neural networks. Advances in neural information processing sys-\ntems, 30, 2017.\nIan Goodfellow, Yoshua Bengio, and Aaron Courville. Deep learning (adaptive\ncomputation and machine learning series). Cambridge Massachusetts, 2017.\nXavier Glorot, Antoine Bordes, and Yoshua Bengio. Deep sparse recti\fer neural\nnetworks. In Proceedings of the fourteenth international conference on arti\f-\ncial intelligence and statistics, pages 315{323. JMLR Workshop and Conference\nProceedings, 2011.\nEsraa A Mohamed, Essam A Rashed, Tarek Gaber, and Omar Karam. Deep learning\nmodel for fully automated breast cancer detection system from thermograms.\nPloS one, 17(1):e0262349, 2022.\nCaryn Lerman, Bruce Trock, Barbara K Rimer, Christopher Jepson, David Brody,\nand Alice Boyce. Psychological side e\u000bects of breast cancer screening. Health\npsychology, 10(4):259, 1991.\nAlexander G Mathioudakis,\nMinna Salakari,\nLiisa Pylkkanen,\nZuleika Saz-\nParkinson, Anke Bramesfeld, Silvia Deandrea, Donata Lerda, Luciana Neamtiu,\nHector Pardo-Hernandez, Ivan Sol\u0012a, et al. Systematic review on women's val-\nues and preferences concerning breast cancer screening and diagnostic services.\nPsycho-Oncology, 28(5):939{947, 2019.\nSiva Teja Kakileti, Himanshu J Madhu, Geetha Manjunath, Leonard Wee, Andre\nDekker, and Sudhakar Sampangi. Personalized risk prediction for breast can-\n22\ncer pre-screening using arti\fcial intelligence and thermal radiomics. Arti\fcial\nIntelligence in Medicine, 105:101854, 2020.\nKhanh Bao Tran, Justin J Lang, Kelly Compton, Rixing Xu, Alistair R Acheson,\nHannah Jacqueline Henrikson, Jonathan M Kocarnik, Louise Penberthy, Amirali\nAali, Qamar Abbas, et al. The global burden of cancer attributable to risk factors,\n2010{19: a systematic analysis for the global burden of disease study 2019. The\nLancet, 400(10352):563{591, 2022.\n23\n",
  "categories": [
    "stat.ML",
    "cs.LG"
  ],
  "published": "2023-02-05",
  "updated": "2023-02-05"
}