{
  "id": "http://arxiv.org/abs/2303.16310v1",
  "title": "Crime Prediction Using Machine Learning and Deep Learning: A Systematic Review and Future Directions",
  "authors": [
    "Varun Mandalapu",
    "Lavanya Elluri",
    "Piyush Vyas",
    "Nirmalya Roy"
  ],
  "abstract": "Predicting crime using machine learning and deep learning techniques has\ngained considerable attention from researchers in recent years, focusing on\nidentifying patterns and trends in crime occurrences. This review paper\nexamines over 150 articles to explore the various machine learning and deep\nlearning algorithms applied to predict crime. The study provides access to the\ndatasets used for crime prediction by researchers and analyzes prominent\napproaches applied in machine learning and deep learning algorithms to predict\ncrime, offering insights into different trends and factors related to criminal\nactivities. Additionally, the paper highlights potential gaps and future\ndirections that can enhance the accuracy of crime prediction. Finally, the\ncomprehensive overview of research discussed in this paper on crime prediction\nusing machine learning and deep learning approaches serves as a valuable\nreference for researchers in this field. By gaining a deeper understanding of\ncrime prediction techniques, law enforcement agencies can develop strategies to\nprevent and respond to criminal activities more effectively.",
  "text": "Crime Prediction Using Machine Learning\nand Deep Learning: A Systematic Review\nand Future Directions\nVarun Mandalapu1*†, Lavanya Elluri2†, Piyush Vyas2†\nand Nirmalya Roy1\n1*Information Systems, University of Maryland Baltimore\nCounty, 1000 Hilltop Cir, Baltimore, 21250, MD, USA.\n2Computer Information Systems, Texas A&M University -\nCentral Texas, 1001 Leadership Pl, Killeen, 76549, TX, USA.\n*Corresponding author(s). E-mail(s): varunm1@umbc.edu;\nContributing authors: elluri@tamuct.edu;\npiyush.vyas@tamuct.edu; nroy@umbc.edu;\n†These authors contributed equally to this work.\nAbstract\nPredicting crime using machine learning and deep learning techniques\nhas gained considerable attention from researchers in recent years, focus-\ning on identifying patterns and trends in crime occurrences. This review\npaper examines over 150 articles to explore the various machine learn-\ning and deep learning algorithms applied to predict crime. The study\nprovides access to the datasets used for crime prediction by researchers\nand analyzes prominent approaches applied in machine learning and\ndeep learning algorithms to predict crime, oﬀering insights into dif-\nferent trends and factors related to criminal activities. Additionally,\nthe paper highlights potential gaps and future directions that can\nenhance the accuracy of crime prediction. Finally, the comprehensive\noverview of research discussed in this paper on crime prediction using\nmachine learning and deep learning approaches serves as a valuable ref-\nerence for researchers in this ﬁeld. By gaining a deeper understanding\nof crime prediction techniques, law enforcement agencies can develop\nstrategies to prevent and respond to criminal activities more eﬀectively.\nKeywords: crime prediction, crime datasets, deep learning, machine learning.\n1\narXiv:2303.16310v1  [cs.LG]  28 Mar 2023\n2\n1 Introduction\nCrime prediction is a complex problem requiring advanced analytical tools\nto eﬀectively address the gaps in existing detection mechanisms. With the\nincreasing availability of crime data and through the advancement of existing\ntechnology, researchers were provided with a unique opportunity to study and\nresearch crime detection using machine learning and deep learning methodolo-\ngies. Based on the recent advances in this ﬁeld [1][2][3], this article will explore\ncurrent trends in machine learning and deep learning for crime prediction and\ndiscuss how these cutting-edge technologies are being used to detect crimi-\nnal activities, predict crime patterns, and prevent crime. Our primary goal is\nto provide a comprehensive overview of recent advancements in this ﬁeld and\ncontribute to future research eﬀorts.\nMachine learning is a subset of artiﬁcial intelligence that uses statistical\nmodels and algorithms to analyze and make predictions based on data. On the\nother hand, deep learning is a subset of machine learning that uses artiﬁcial\nneural networks with multiple layers to model complex relationships between\ninputs and outputs [4]. Both machine learning and deep learning technologies\nhave the potential to be applied to the problem of crime prediction in many\nways.\nMachine learning algorithms have been utilized in crime prediction to ana-\nlyze crime data and predict future crime patterns. For example, algorithms like\ndecision trees, random forests, and support vector machines have been trained\non crime data from speciﬁc cities to predict crime patterns accurately [5].\nApart from predicting crime patterns, these algorithms can provide valuable\ninsights into crime trends and patterns. These capabilities allow for deploying\nresources and tactics to combat crime eﬀectively. Additionally, machine learn-\ning algorithms can also be used to identify correlations between crime incidents\nand various environmental and demographic factors such as location, weather,\nand time of day [6]. This information can be used to develop crime prediction\nand prevention strategies suitable to a given community’s speciﬁc needs.\nPredictive policing is also a signiﬁcant application of machine learning for\ncrime prediction [7]. Predictive policing refers to using data and analytics to\ninform law enforcement eﬀorts and reduce crime. Machine learning algorithms\ncan be used to analyze crime data from a speciﬁc geographic area, such as a city\nor neighborhood, to identify crime hotspots and predict future crime incidents.\nThis information can then be used to direct policing resources to areas where\nthey are most needed, increasing the eﬀectiveness of law enforcement eﬀorts.\nDeep learning algorithms, such as convolution and recurrent neural net-\nworks, have also shown promise in crime prediction. These algorithms have\nbeen trained on crime data with either a spatial or temporal component to\naccurately predict crime patterns in speciﬁc cities. For example, deep learning\nalgorithms have been used to analyze crime data, including the time, location,\nand type of crime incidents [8]. This information is used to create a predictive\nmodel that can be used to identify potential crime hotspots and predict future\ncrime incidents.\n3\nAnother application of deep learning in crime prediction is computer vision\nand video analysis. This technology has been used to analyze video footage\nfrom surveillance cameras to detect and classify criminal activities, such as\nvandalism, theft, and assault [1]. The advanced deep learning models are also\nintegrated with drones and other aerial technologies to provide new opportu-\nnities to monitor and respond to criminal activities. These algorithms have\nalso been used to analyze crime data from multiple sources, including crime\nreports, social media, and police records, providing a more comprehensive view\nof criminal activities [9]. By automating this process, deep learning algorithms\nhave the potential to enhance the ability to identify and respond to crime in\nreal-time, providing a crucial tool in the ﬁght against criminal activity.\nDespite the promise of machine learning and deep learning for crime pre-\ndiction, several challenges must be addressed. One of the biggest challenges\nis the availability of high-quality crime data. Crime data can be diﬃcult to\nobtain, and the available data may need to be completed or reliable. Addi-\ntionally, collecting and using crime data is associated with privacy and ethical\nconcerns. These challenges must be addressed to fully realize the potential of\nmachine learning and deep learning for crime prediction. Another challenge is\nthe interpretability of machine learning and deep learning models. These mod-\nels can be challenging to understand and interpret, limiting their usefulness\nin decision-making. To eﬀectively apply these models to the problem of crime\nprediction, it is vital to develop interpretable models that can provide clear\nexplanations of their predictions.\nMoreover, the recent advancements in machine learning and deep learning\nfor crime prediction show great promise in addressing this complex problem\n[10]. However, signiﬁcant challenges remain, and much work is still needed to\nrealize these technologies’ potential fully. This research article provides a com-\nprehensive overview of recent trends in this ﬁeld and oﬀers insights into the\npotential applications of machine learning and deep learning for crime predic-\ntion. By highlighting the potential of these technologies and the challenges that\nmust be addressed, this research article contributes to the broader research\ncommunity. It advances our understanding of the role of machine learning\nand deep learning in crime prediction. Hence, the key contributions of this\nwork are as follows:- ﬁrst, this paper provides the amalgamation of existing\nstudies that utilized state-of-the-art machine learning and deep learning-based\napproaches in the realm of detecting neighborhood crime. Thereby extending\nthe fathomable literature knowledge base. Second, this paper eliminates the\nlimitation of the scarcity of potential datasets availability. We have highlighted\ndistinct publicly available datasets related to neighborhood crime prediction\nthat existing studies have utilized. Thereby archiving the data resources for\nfuture scholars. Third, this work drafted future research directions to elimi-\nnate the existing research gaps in neighborhood crimes. Thereby reasonably\nproviding future research objectives/questions to the research community to\npursue further.\n4\n2 Research Methodology\nThe primary research aims to ﬁnd various eﬃcient algorithms for predicting\nneighborhood crimes. In our previous work [6], we used statistical analysis to\npredict the crimes in Newyork city. Our paper got good attention from the\nresearchers, so we wanted to look for the eﬃcient machine learning and deep\nlearning approaches used in this area. We have followed a systematic approach\nto select the papers for this review. As part of this research, we have considered\nthe papers from multiple databases related to predicting crime.\nFor this review, we have considered all the primarily used terms in the\npapers focused on predicting crimes. To include all the possible alternative\nwords of each term, we have used “*” as a wild character for IEEE and ACM\ndatabases so that it contains zero or more characters after the string. The main\ntarget of this review is to check for all the existing research works to predict\ncrime. In addition, we want to help the research community by identifying the\ndiﬀerent datasets used to apply the algorithms. Irrelevant studies are removed\nby applying multiple ﬁlters to our search queries. We also selected 30 papers to\nbe part of the main text based on relevance and novelty, and 20 more papers are\nadded in the appendix section A1. In this survey, we have used a combination\nof an automated and manual search shown in Figure 1. In the initial stages, we\nfocused on using the automatic digital search. In the ﬁnal step, we manually\nread the entire paper to select a set of documents in machine learning and\ndeep learning areas.\nFirstly, we have identiﬁed the key terms to create the queries. We then\nused those keywords to construct the various research database-related queries\nbased on respective syntax. Below are the queries used to explore IEEE, Science\nDirect, and ACM databases.\nIEEE query:\n((“Document Title”: “crime*”) AND (“Document Title”: “predic*” OR\n“Document Title”: “detec*” OR “Document Title”: “recogni*” OR “Doc-\nument Title”: “machine learning” OR “Document Title”:“deep learning”\nOR “Document Title”:“clustering” OR “Document Title”:“natural language\nprocessing”))\nScience Direct Query:\n(“crime”) AND ( “prediction” OR “detection” OR “recognition” OR\n“machine learning” OR “deep learning” OR “clustering” OR “natural lan-\nguage processing”)\nACM Query:\n“query”: { Fulltext:((“crime*”) AND ( “predic*” OR “detec*” OR\n“recogni*” “machine learning” OR “deep learning” OR “clustering” OR\n“natural language processing”)) }\n2.1 Data Collection\nWe focused on looking into individual research libraries rather than search-\ning in google scholar. Because google scholar will have data from all these\n5\nFig. 1 Steps involved for typical crime detection\ndatabases, there could be duplicates. Below are the database library homepage\nlinks where the research works were extracted using the keywords mentioned\nin search queries. Initially, we searched using all the metadata attributes avail-\nable on each database. Next, we applied the ﬁlters only on the full-text papers.\nAs we noticed that the number of documents is still high, we applied the ﬁlter\non the index terms used in the article as the results will be more relevant. We\nhave more than 450 papers from all the databases at this stage. Finally, in the\nlast step, we applied the ﬁlter on the document title, where the total number\nof papers was 157.\na) Science-Direct Elsevier (https://www.sciencedirect. com)\nb) ACM (DL) Digital Library (https://dl.acm.org)\nc) IEEE Xplore Access Digital Library (https://ieeexplore. ieee.org)\nFig. 2 Research paper selection methodology\n6\nAfter applying the automated ﬁlters as shown in Figure 2, all the authors\nmanually divided the work and read the papers to select the ﬁnal set. For the\nselection, we mainly looked into the essential elements like the focus or objec-\ntive of the article, datasets that authors have used, algorithms applied, and\nthe accuracy rates. The focus of this survey is not only to help the commu-\nnity know the various algorithms applied but also to let them know about the\ndatasets they can use to apply the novel algorithms and get the results for\ntheir research.\n3 Literature Analysis\n3.1 Pre-assessment Literature Analysis\nAn analysis of collected literature data from the distinct research databases\nis essential [11] to receive information regarding the growth of an adopted\nresearch domain, scope across the research community, and popularity among\nthe existing researchers. Thus, we have performed a detailed analysis of the\ncollected literature data. We did pre-analysis and post-analysis, wherein pre-\nanalysis comprises the exploration of initially collected literature ( i.e., the\nresearch papers that were collected immediately after performing our search\nquery), and post-analysis comprises the investigation of those study’s data\nthat were ﬁnally selected after applying selection criteria. Although we have\nexhumed the two renowned research databases, IEEE and Science Direct,\nlately, it has been observed that Science direct discontinued the search result\nextraction. Hence following analytical charts are based on IEEE databases\nﬁndings. Figure 3 shows the research publication trends in neighborhood crime\nFig. 3 Research publication trends from 2018-2022\nfrom 2018 to 2022 (i.e., the last ﬁve years). It showed upward trends from 2018\nto 2021 and downward trends during 2022. The years 2020 and 2021 are the\napexes of COVID-19, which could be why existing researchers have utilized\nthat time to explore more neighborhood crime research.\n7\nFigure 4 indicates the distribution of article page counts for the neighbor-\nhood crime research. The majority of articles (i.e., 46) comprise ﬁve pages.\nThis may be because many researchers have published their work in confer-\nences and symposiums rather than journals. Figure 4 depicts that very few\narticles comprise more than ten pages. Since conferences, seminars, workshops,\nand symposiums allowed the presentation of abstracts and short papers, this\nFigure 4 also depicts the 1,2,3 page-long articles.\nFig. 4 Distribution of article’s page counts\nFig. 5 Distribution of article’s citations\nTo assess the popularity of the neighborhood crime research articles, we\nhave also performed the citation analysis shown in Figure 5. Wherein the con-\nference papers have gained more citations (60) than the other journals (10\ncitations), chapter (1 citation), seminar (0 citations), symposium (3 citations),\nand workshop (o citation) articles in the neighborhood crime area, this may\nbe because this area is less popular among the researchers. Figure 6, shows\nthe distribution of neighborhood crime-related articles published in various\n8\nFig. 6 Distribution of research articles at various venues\nvenues. Wherein this ﬁgure depicts the venue name (e.g., conference, journal,\netcetera), number of papers (i..e, in numeric value-1,7..), and percentage of\npublished articles (i.e., 1%, 82%,..). Here, the majority of papers have been\npublished in the conferences than the other venues like journals, workshops,\nsymposiums, and seminars. In the neighborhood crime area, 82% of the arti-\ncles were published in conferences, followed by 9% in the journal, 4% in the\nsymposium, 3% in book chapters,1% in seminars, and 1% in workshops.\n3.2 Post-assessment Literature Analysis\nTo enhance the understanding of the neighborhood crime domain in com-\nbination with our above-cited selection criteria, we have also performed the\npost-assessment literature analysis because this is the crux of our literature\nsurvey to fulﬁll our identiﬁed objectives. We have created a word cloud for\nNeighborhood crime-related papers to fathom further the selected papers’\nunderlying key concepts or themes. A word cloud often called a tag cloud, is a\ngraphic depiction of the terms that appear the most frequently in a given text.\nEach word’s magnitude in the word cloud reﬂects how frequently it appears in\nthe text. Word clouds are frequently employed in literature reviews to swiftly\npinpoint the key themes or topics within a sizable body of material. Addition-\nally, they can be used to compare various texts and ﬁnd trends and patterns\nin the data [12]\nFigure 7 shows the word cloud for the neighborhood crime-related selected\narticles wherein many crime-related key terms have emerged as trends in the\nexisting studies. “crime”, “criminal”, “policing”, “enforcement”, and “secu-\nrity” are the words that indicate the emphasis of researchers on the sub-areas\n9\nFig. 7 Word cloud on selected articles\nFig. 8 Distribution of neighborhood crime-related selected article’s technique types\nof crime detection. Moreover, “prediction”, ”algorithms”, and “techniques”\nare the words that indicate the aim of the existing studies. This word cloud\nis aligned with our selection criteria and objectives that further validate our\nﬁnal set of selected articles for this literature review study.\nFigure 8 shows the Distribution of neighborhood crime-related selected arti-\ncle’s technique types among Science Direct and IEEE databases, respectively.\nAs shown in the Figure 8, among the neighborhood crime-related articles,\nmachine learning (ML), the combination of machine learning and deep learning\n10\n(DL), and the combination of machine learning and natural language process-\ning (NLP), the combination of DL and NLP, and DL are the majorly used AI\ntechnique type. In the neighborhood crime domain – 67% of articles have used\nML, 21% have used DL, 8% have used the combination of ML and DL, 2%\nhave used the combination of DL and NLP, and 2% have used the combina-\ntion of ML and NLP. It has been observed that machine learning techniques\nare popular in the neighborhood crime area.\nFigure 9 shows the distribution of neighborhood crime-related selected arti-\ncle’s technique classes among Science Direct and IEEE databases. As shown\nin Figure ??, among the neighborhood crime-related articles, the classiﬁcation\ntask is the prime focus utilizing various ML and DL-related techniques. In the\nneighborhood crime domain – 63% of articles have focused on the classiﬁca-\ntion task, 29% have focused on the regression tasks, 6% have focused on the\nclustering task, and 2% of the studies have utilized the combination of classi-\nﬁcation and clustering. It has been observed that the Classiﬁcation task is the\nprime focus of the studies on neighborhood crime.\nFig. 9 distribution of neighborhood crime-related selected article’s technique’s classes\nFigure 10 shows the Distribution of neighborhood Crime related selected\narticle’s Technique classes Versus technique Type among Science Direct and\nIEEE databases. Figure 10 answers the question- what AI Technique is used\nfor which technique classes (classiﬁcation, clustering, and regression)? Herein\nall ﬁve techniques (ML, DL, DL+NLP, ML+NLP, and ML+DL) have been\nused for the classiﬁcation task whereas, for clustering and the combination\nof clustering and classiﬁcation, the ML is solely used. In neighborhood crime\narticles NLP is also used for classiﬁcation and regression tasks in addition to\nML and DL. For the classiﬁcation and regression tasks ML and DL both have\nbeen used.\n11\nFig. 10 Distribution of neighborhood Crime related selected article’s Technique classes\nVersus technique Type\n4 Crime Prediction Process & Datasets\nCrime prediction using machine and deep learning involves several major steps\nas shown in Figure 11. The ﬁrst step is data collection, which involves gathering\nrelevant data such as crime statistics, demographics, and weather patterns.\nThe next step is data preprocessing, which includes cleaning and transforming\nthe data into a usable format. After data preprocessing, the data is split into\ntraining and testing sets for model development and evaluation. The next\nstep is feature engineering, which involves selecting relevant features from the\ndata that can be used to train the model. Once the features are selected,\nvarious machine and deep learning algorithms can be applied to the data for\ntraining and prediction purposes. Finally, the trained models are evaluated\nusing various performance metrics to assess their accuracy and eﬀectiveness in\npredicting crime. The results can be used to support decision-making in law\nenforcement and crime prevention eﬀorts.\nFig. 11 Architecture ﬂow of crime prediction\n12\nTable 1: Crime detection papers with data science algorithms\nDataset Links\nType of\nData\nCountry -\nLocality\nhttps://data.gov.in/resource/incidence-crime-\ncommitted-against-women-india-during-2001-\n2012\n[13]\nCrime\nIndia\nhttps://indore.mppolice.gov.in/ [14]\nCrime\nIndia - Madhya\nPradesh\nhttps://ncrb.gov.in/en/node/3721\n[15][3][14][16][17]\nCrime\nIndia\nhttps://data.gov.in/catalogs [15][18]\nCrime\nIndia\nhttps://www.kaggle.com/datasets\n/murderaccountability/homicide-reports [19]\nCrime\nUnites States\nhttps://geodash.vpd.ca/opendata/ [20]\nCrime\nCanada -\nVancouver\nhttps://plenar.io/explore/ [21][22]\nCrime -\nSpatio\nTemporal\nUnites States -\nChicago\nhttps://data.cityofchicago.org/ [23][24]\n[25][26][27][28][29]\nCrime\nUnites States -\nChicago\nhttps://datasf.org/opendata/[30] [27]\nCrime\nUnited States -\nSan Francisco\nhttps://data.london.gov.uk/dataset/ [31]\nCrime\nUnited\nKingdom -\nLondon\nhttps://br-city.survey.okfn.org/place/rn.html\n[32]\nCrime\nBrazil - Natal\nhttps://opendata.cityofnewyork.us/data/\n[29][33][26][28][34][22][6]\nCrime\nUnited States -\nNewyork\nwww.twitter.com [35][36][37]\nSocial\nMedia\nGlobal -\nTwitter\nhttps://www.kaggle.com/competitions\n/sf-crime/data [17]\nCrime\nUnited States -\nSan Francisco\nhttps://data.lacity.org/ [38][28]\nCrime\nUnited States -\nLos Angeles\nhttps://dasci.es/transferencia/open-\ndata/24705/\n[39]\nCrime-\nWeapons\nGlobal\nhttps://www.gdeltproject.org [40]\nCrime\nGlobal\nwww.foursquare.com [28]\nGeospatial\nUnites States\nhttps://www.nyc.gov/taxi [28]\nTaxi\nUnited States -\nNewyork\n13\nhttps://www.wunderground.com/weather\n/api [28]\nWeather\nGlobal\nhttps://www.icpsr.umich.edu/web\n/NACJD/studies/3355/datadocumentation\n[41]\nCrime\nUnited States\nhttps://roc-ng.github.io/XD-Violence/ [42]\nCrime -\nVideo\nGlobal\nwww.facebook.com [37]\nSocial\nMedia\nGlobal -\nFacebook\nhttps://datasus.saude.gov.br/ [43]\nHealth\nBrazil\nhttps://www.phillypolice.com/crime-maps-\nstats/\n[44]\nCrime -\nSpatio\nTemporal\nUnites States -\nPhiladelphia\nhttps://mapstyle.withgoogle.com/ [44]\nGeospatial\nGlobal\nhttps://www.mapbox.com/ [44]\nGeospatial\nGlobal\nhttps://data.police.uk/data/ [45]\nCrime\nUnited\nKingdom\nhttps://polisen.se/en/services-and-\npermits/police-record-extracts/\n[46]\nCrime\nSweden\nhttps://www.openu.ac.il/home/hassner\n/data/violentﬂows/ [47]\nCrime -\nVideo\nGlobal\nAs shown in Table 1, there have been many datasets used in crime detection\nand prediction research articles. One example is the Chicago Crime Dataset,\nwhich contains data on crimes reported in the Chicago area. This dataset has\nbeen used to create models that predict the likelihood of speciﬁc types of crimes\noccurring in diﬀerent areas of the city. Another dataset used in crime prediction\nresearch is the London Crime Dataset, which contains data on crimes reported\nin London city. This dataset has been used to create models that predict the\nlikelihood of crimes occurring in speciﬁc areas and their relationship to the\nsocio-economic factors of people based on their geo-locations in the area.\nOther datasets commonly used in crime detection and prediction research\ninclude the Los Angeles Crime Dataset, the New York City (NYC) Crime\nDataset, and the Philadelphia Crime Dataset. These datasets contain infor-\nmation on crimes reported in their respective cities and have been used to\ncreate models that predict the likelihood of speciﬁc types of crimes occurring\nin diﬀerent areas. In addition to these, there are also global datasets that focus\non CCTV video footage, types of aggression, and weapons for real-time crime\npredictions.\nOverall, these datasets provide valuable information for researchers to build\ncrime prediction models that could help law enforcement agencies prevent\nand respond to criminal activities more eﬀectively. The location and access to\ndatasets used by research articles surveyed in this paper are listed in Table 1.\n14\n5 Crime Prediction using Machine Learning\ntechniques\nTraditional machine learning models have proven to be eﬀective for crime\nprediction. Various types of models such as decision trees, support vector\nmachines, logistic regression, and random forests have been utilized to analyze\ncrime data and identify patterns that can be used to predict criminal activity.\nUnlike deep learning, which relies on large amounts of data and complex neu-\nral networks, traditional machine learning models require fewer data points\nand are easier to interpret. For example, a logistic regression model can be\nused to predict the likelihood of a certain type of crime occurring based on\nfactors such as time of day, location, and demographics of the area. A decision\ntree model can be used to identify the most important factors that contribute\nto the occurrence of a particular crime. Random Forest (RF) models can be\nused to analyze a wide range of features and make predictions about crime\npatterns. In addition to these techniques, traditional machine learning mod-\nels can also be used for anomaly detection and outlier analysis in crime data.\nBy identifying unusual patterns or outliers in the data, law enforcement agen-\ncies can detect potential criminal activity and take action to prevent it. In the\nbelow sections 5.0.1 and 5.0.2, we discuss the latest research on using machine\nlearning model-based regression and classiﬁcation for crime prediction.\n5.0.1 Machine Learning based Regression Methods for\nCrime Prediction\nSeveral crime detection scenarios are predicted using regression techniques as\nshown in 2. Researchers mainly focused on prevalent crimes like motorcycle\nrobbery, losing property, and crimes in urban areas. Numerous factors may\ndrive the boom in motorcycle robberies. For example, population growth and\ndensity, commuting conduct, bike usage, etc. These situations are problems\nfor the police to govern and screen regularly since it requires forecasting and\nprobabilities of robbery in a precise term. A novel method is proposed in the\nresearch study [48]; the authors created an application to predict motorcycle\nrobbery with a technique to consider outside consequences using ARIMAX –\nTFM with a single input. The accuracy of ARIMAX is measured using Mean\nAbsolute Percentage Error (MAPE) and Root Mean Squared Error (RMSE),\nand the scores are 32.30 and 6.68.\nRapid urbanization is a compelling challenge connected to city management\nand services. Cites with higher crime rates are diﬃcult to manage public safety.\nTo reduce crimes, new technologies are relieving police departments to access\nvast amounts of crime data to identify underlying trends and patterns. These\ntechnologies have doubtlessly grown the eﬃcient deployment of police assets\nwithin a given region and ultimately guide greater powerful crime prevention.\nResearchers have worked on predictive models to use these datasets and predict\ncrimes. Study [22], provides a technique primarily based on spatial analysis and\nauto-regressive fashions to automatically locate excessive-hazard crime areas\n15\nin city areas and reliably forecast crime tendencies in each area. Experiments\nare performed on real-world datasets gathered in New York City and Chicago.\nAnother study [49], compared multiple techniques to predict the crimes in\nvarious areas of a metropolis. This research explored three predictive models:\nlinear regression, logistic regression, and gradient boosting. The authors uti-\nlized feature selection techniques to select essential predictors. By applying\nfeature selection methods, there is an improvement in accuracy scored, and\nit helped to avoid model overﬁtting. After comparing the results of all four\nmodels, the authors found that the gradient boosting technique outperformed,\nproven to be the best method to predict the crime rate in the urban area.\nIn another study [50], authors have looked at the crimes in Brazil, which\nhave increased rapidly in recent times. Numerous predictive solutions use intel-\nligent systems to identify when will a criminal oﬀense will arise, which lets\npolice send to those areas that are in danger. As part of their research, the\nauthors looked into four machine-learning approaches for identifying where\na criminal oﬀense will arise in Fortaleza, Brazil. Their results indicate that\neasy algorithms are eﬃcient in predicting crime. Also, they have seen that the\nDecision Tree and Bagging Regressor strategies obtained quality prediction\noutcomes.\nAs mentioned above, numerous linear models are there to predict crime\nthrough the correlations between urban metrics and crime. However, due to\nmulticollinearity and nonGaussian distributions in urban attributes, we usu-\nally tend to make controversial conclusions on these attributes to predict crime.\nEnsemble-based machine learning algorithms can deal with such problems ade-\nquately. In the research work [43], authors applied random forest regressor to\npredict the crime and quantify the impact of urban attributes on homicides.\nTheir approach has 97% accuracy in crime prediction, and the signiﬁcance of\ncity indicators is clustered and ranked equally. Their research identiﬁes the\nrank of urban indicators based on their signiﬁcance in predicting crime. As\nper their results, unemployment and illiteracy are the essential variables for\ndepicting homicides in Brazilian towns.\nTable 2: Crime detection using machine learning regression tech-\nniques\nMethodology\nML Algo-\nrithms\nDataset\nPerformance\nARIMAX method is used to\npredict the time series data\nfrom theft cases that aﬀected\nthe number of motorcycles. [48]\nARIMAX\nalgorithm\nCity of\nYogyakarta\nRMSE - 6.68\n16\nCrime data is used to detect\nand map crime-dense region\n(CDR) in NYC and Chicago,\nthen ARIMA is applied on\nthese crime hotspots. [22]\nARIMA,\nRandom\nForest\n(RF),\nRepTree\nand ZeroR\nChicago\nCrimes -\n2001 to\npresent, New\nYork City\nCrimes:,\n2006 to\n2016\n2016 RMSE\nfor Area -\n143.73, CDR\n1 - 57.8,\nCDR2 -\n29.85 & CDR\n3 - 16.19\nClustering is used to\nunderstand distribution across\ncity and then cluster are used\nto predict the number of\ncrimes per location. [49]\nLinear\nregression\n(LR), LoR\nand\nGradient\nboosting.\nSaint-\nPetersburg\nRussia\nCrime\n(2014 -\n2017)\nR-Square -\n0.9\nFour machine learning\nmethods are applied to predict\nthe location of where a crime,\nmore speciﬁcally, where a crime\nof robbery will occur. [50]\nRF,\nBagging,\nDT, Extra\ntree\nCity of\nFortaleza\ndata\nRMSE -\n0.00231\nRandom forest regressor is\nused to predict crime and\nquantify the inﬂuence of\nurban. Results showed that\nunemployment and literacy\nare the two major indicators of\ncrimes. [43]\nRandom\nForest\nRegressor\nDepart-\nment of\nInformatics\nof the\nBrazilian\nPublic\nHealth\nSystem —\nDATASUS.\nUpto 97%\nAccuracy,\nAdjusted R\nsquare 80%\non average.\n5.0.2 Machine Learning based Classiﬁcation Methods for\nCrime Prediction\nTraditional regression techniques can successfully check the variables’ signiﬁ-\ncance but, they must be more reliable for crime prediction. In many research\nworks [31][32][33] mentioned in section 5.0.2, authors have proven that machine\nlearning models eﬀectively predict crimes. Still, they could be more eﬃ-\ncient in identifying which variables are signiﬁcant in predicting crimes. We\nfurther examined the classiﬁcation techniques to predict diﬀerent criminal\nincidents like analyzing the criminal reports as shown in Table 3. Studying\nthose reviews for crime prediction enables regulatory authorities to deal with\ncrime prevention strategies. However, collecting these reviews personally and\ndetermining their crime types is challenging. In one study [51] authors have\ncreated a novel approach, an incremental classiﬁer that learns the new data\nand dynamically predicts the results. In this research [51], they have utilized\n17\nthe Bi-objective Particle Swarm Optimization technique to develop an eﬃ-\ncient incremental classiﬁer for dynamically classifying and predicting crime\nreports. Crime reports from various countries have been collected from online\nnewspapers to measure the performance of their classiﬁer. Also, they evalu-\nated the results manually with unprejudiced police witness narrative crime\nreports. They tested their approach on four datasets to measure their model’s\nstatistical signiﬁcance.\nTable 3: Crime detection using machine learning classiﬁcation\ntechniques\nMethodology\nML Algo-\nrithms\nDataset\nPerformance\nOVR-XGBoost: One Vs Rest\nOVO-XGBoost: One Vs One.\nThe primary diﬀerence is\nbased on how the dataset is\norganized for classiﬁcation. [52]\nXGBoost\nbased\nalgorithms\nH City\nChina:\n(2019)\nAggregate\nAccuracy -\n85%\nApplying particle swarm\noptimization-based classiﬁer\nand a rules engine to classify\ncrime reports. [51]\nMultiple\nclassiﬁca-\ntion\nalgorithms\nUSA, India\n& UAE\ncrime\narticles\n(2007 -\n2017)\nAggregate\nAccuracy -\n79%\n17 spatiotemporal variables\nwere used to train and test the\nXGBoost algorithm, and then\nSHAP is used to explain the\nmodel predictions. [53]\nXGboost\nmodel\nZG City, in\nSoutheast\nChina.\n(2017 to\n2020 ).\nAccuracy -\n89% & AUC\n- 0.586\nRandom under and over\nsampling techniques are used\nto evaluate multiple\nalgorithms. [54]\nLogistic\nRegression\n(LoR), RF,\nXGBoost\nand\nLightGBM\nDanish\nnational\npsychiatric\npatient\nregister,\n(474\ncrime).\nF1 Score -\n76%\nGraph theory based. Decision\ntrees and heuristics are used\nfor feature selection and an\nensemble classiﬁer is applied.\n[55]\nMultiple\nclassiﬁca-\ntion\nalgorithms\nUSA, UAE\n& India\nCrime\nArticles\n(2008 -\n2016)\nAggregate F1\nScore - 88%\n18\nIdentify if the crime is spread\nuniformly according to\npopulation density or whether\nspeciﬁc socio-economic\nattributes account for\nincreased or decreased crime.\n[31]\nVisual\nAnalysis\nLondon\ncrime\ndataset\nAggregate\nAccuracy -\n97%\nFollows an algorithm-as-a-\nservice architecture (AaaS),\nproviding insights into existing\npublic safety systems and\nplatforms. [32]\nK Nearest\nNeighbor\n(KNN)\nCrime\nendogenous\ndata\nsources\nAggregate\nAccuracy -\n90%\nPrediction of crime in\nneighborhoods of New York\ncity using spatial sata analysis.\n[33]\nXGBOOST,\nRF and\nSVM\nNew York\ncrime data\nAggregate\nAccuracy -\n52%\nEADT approach is used for\nInterpretable and Accurate\nCrime Prediction. [41]\nDecision\nTree (DT)\nPennsylva-\nnia state\nprisons\nAggregate\nAccuracy -\n77.6%\nTraditional data science steps\nare used to cluster crimes and\nthen predict using\nclassiﬁcation modeling\nmethods. [16]\nK-Means\nNational\nCrime\nRecords\nBureau\n(India)\nAggregate\nAccuracy -\n78%\nAnother research [52], focuses on predicting crime using the XGBoost algo-\nrithm. Based on the records of theft instances in H city, they developed an\noptimized decomposition and fusion method based on XGBoost and applied\nmulti-class classiﬁcation models like OVR-XGBoost and OVO-XGBoost. As\nthe theft datasets have diﬀerent classes, they have utilized the SMOTENN\nalgorithm to process and make data the dataset balanced. Their results show\nthat OVR-XGBoost and OVO-XGBoost models’ prediction accuracy is better\nthan the baseline XGBoost models. In the study [53], the authors have selected\n17 variables for crime prediction, and the XGBoost algorithm is adopted to\ntrain the prediction model. A post hoc interpretable approach, Shapley addi-\ntive explanation (SHAP), is used to parent the contribution of person variables.\nSHAP, a post hoc interpretable method, is used to determine the signiﬁcance\nof individual variables. Among all 17 variables used in this research, the per-\ncentage of the non-neighborhood population and the populace aged 25–44\ncontribute greater than diﬀerent variables in predicting crime. The higher the\nambient population of elderly 25–44 in the vicinity, the more public crimes.\nThe authors have also validated the SHAP values to demonstrate each vari-\nable’s contribution to the crime prediction across the experimental ﬁndings.\n19\nThese outcomes of the neighborhood techniques can assist the police in identi-\nfying the most important factors.At the same time, the global model identiﬁes\nthe essential features of the entire region.\nAnother research [54] focuses on predicting crime during or after psy-\nchiatric care. As modern threat-evaluation equipment is time-consuming to\nadminister and oﬀers constrained accuracy, this research looked to expand a\npredictive model designed to discover psychiatric patients liable to commit the\ncrime. The authors utilized the longitudinal nice of the aﬀected Danish person\nregistries, recognizing the 45.720 adult patients who had connected with the\npsychiatric system in 2014, of which 474 committed crimes leading to a foren-\nsic psychiatric treatment direction after discharge. Authors have used four\ngadget studying models (Random Forest, Logistic Regression, XGBoost, and\nLightGBM) over various sociodemographic, judicial, and psychiatric variables.\nTheir model identiﬁed 47% of future forensic psychiatric patients, making cor-\nrect predictions in 57% of samples. This research demonstrates how a clinically\nuseful preliminary risk assessment is achieved using machine learning classi-\nﬁcation techniques. Their research helps to ﬂag possible forensic psychiatric\npatients while in contact with the general psychiatric system, which allows\nearly intervention initiatives to be activated.\nAnother research work [55] presents a graph-based ensemble classiﬁcation\napproach for predicting crime reports better than traditional classiﬁers. Crime\nreports are graphically modeled to locate the maximal independent subset\nof features, and then they use decision tree classiﬁers on this set. Extensive\nexperiments are performed to compare the overall performance of the proposed\napproach on numerous crime data sets. The developed ensemble classiﬁca-\ntion model demonstrated better performance. Apart from predicting crime,\nresearchers [41][42] also focused on interpreting crime-related predictions. This\nwill lead to a better understanding of what impacts crime detection.\n5.1 Crime Prediction using Deep Learning techniques\nDeep learning has become a popular method for crime prediction in recent\nyears. The studies included in the reference research articles use a range of\ndeep learning algorithms, such as convolution neural networks (CNN), deep\nneural networks, and sentiment analysis, to analyze various types of data,\nincluding text, images, audio, and social media. These algorithms are capable\nof detecting patterns and anomalies in the data that can indicate criminal\nactivity. One of the key strengths of deep learning is its ability to handle large\nand complex datasets, making it well-suited to the task of crime prediction.\nFor example, image analysis algorithms can detect threatening objects in crime\nscenes and predict the likelihood of a crime occurring. Text mining techniques\ncan be used to analyze crime-related tweets and make predictions about crime\npatterns. In addition, deep learning algorithms can detect anomalies in crime\ndata in smart cities, which could indicate the presence of criminal activity.\nResearchers used these techniques to tackle both regression and classiﬁcation\nproblems in crime prediction as detailed in the below sections.\n20\n5.1.1 Deep Learning based Regression Methods for Crime\nPrediction\nDeep learning algorithms in regression analysis are used as a tool for crime\nprediction to identify the factors most strongly associated with crime and\nuse these relationships to make predictions about future crime patterns. The\nresearch articles in this area highlight the strengths of regression in model-\ning the relationship between multiple variables, including crime data, weather\ndata, demographic data, social media data, and location data. A common\ntheme among these research articles shown in Table 4 are the use of regression\ncombined with deep learning techniques, such as convolution neural net-\nworks, recurrent neural networks, attention mechanisms, and sequential fusion\nmodels, to improve the accuracy of crime prediction.\nIn research focusing on theft crime prediction [25], the authors use regres-\nsion to model the relationship between theft crime data, demographic data,\nand weather data. The regression model adopts two deep learning models,\na Long Short-Term Memory (LSTM) network and a Spatio-Temporal Graph\nConvolutional Network (ST-GCN), to predict the likelihood of theft crimes in\nurban communities. The regression model can incorporate external informa-\ntion, such as weather data, which can inﬂuence crime patterns. The LSTM\nand ST-GCN models capture the temporal and spatial dependencies in the\ndata, respectively. In another article [27], the authors use regression to model\nthe relationship between crime data, weather data, and social media data. The\nregression model is part of a more comprehensive, multi-module approach that\nuses attention mechanisms and sequential fusion models to predict the likeli-\nhood of crimes. This framework consists of four sub-modules, where the initial\ntwo modules adopt St-BiLSTM and ATTN-LSTM to process temporal and\nspatial features. Finally, two fusion models are used to abstract the data and\nmake crime predictions on Chicago and San Francisco crime datasets.\nIn another research focused on using spatiotemporal data [38], the authors\nuse convolutional neural networks to develop a regression model on publicly\navailable crime data in Los Angeles. The regression model is part of a more\nextensive, mixed spatiotemporal neural network that is designed to make real-\ntime predictions about the likelihood of crimes. The authors claim that using\nregression in combination with the diverse spatiotemporal neural network\nresults in improved accuracy and real-time performance. Another research [28]\nthat applies crime risk prediction across diﬀerent cities uses regression to model\nthe relationship between crime data and demographic data from other cities.\nThe regression model is part of an unsupervised domain adaptation technique\ndesigned to predict the likelihood of crimes in new cities. The authors claim\nthat using regression in combination with the unsupervised domain adaptation\ntechnique results in improved accuracy in crime prediction. A recent research\narticle [56] applied machine learning and deep learning methods to crime data\nfrom Xiaogan, a medium-sized city in China, to predict crime hourly. The mod-\nels use weather, holiday, time slot ID, and Day of week information to extract\n21\nTable 4 Crime detection using deep learning regression techniques\nMethodology\nDL Algorithm\nDataset\nPerfor-\nmance\nA Graph Convolution\nnetwork in combination\nwith ST-ResNet is used to\nperform spatiotemporal\nanalysis and then LSTM is\nused to detect crimes in\neach community. GBDT is\nused to combine outputs of\nGCN and LSTM. [25]\nLong Short Term\nMemory (LSTM)\nin combination\nwith Spatio\nTemporal Graph\nConvolution\nNetwork\n(ST-GCN) and\nGradient\nBoosting Tree\nChicago\nCrime Data\n(2001 - 2020)\nR-Squared\n- 0.84\nDeveloped Attention-LSTM\nto process categorical-\ntemporal data and Stacked\nBidirectional LSTM model\nto process spatial\ninformation. The two were\nfused using feature and\ndecision-level fusion. [27]\nATTN-LSTM,\nSt-Bi-LSTM,\nFusion Models\nSan Francisco\nand Chicago\nCrime Data\n(2004 to\n2017)\nAggre-\ngated\nR-Squared\n> 0.90\nLA Crime data is separated\ninto block-wise information\nbased on the hour of the\nday, area, and city. These\nblocks are used to train\nCNN model.[38]\nMixed Spatio\nTemporal Neural\nNetwork based\non CNN\nLos Angeles\nCrime Data\nRMSE -\n0.22\nA model framework based\non three phases i.e.,\nintercity similar-grid\nmatching, auxiliary features\nconstruction, and crime risk\nprediction using a dense\nCNN-based unsupervised\ndomain adaptation. [28]\nCNN based on\nunsupervised\ndomain\nadaptation model\n(UDAC)\nNew York\nCity,\nChicago, and\nLos Angeles\nCrime,\nweather and\ntaxi Data\n(2015)\nRMSE -\n0.62\nWeather, holiday, time slot\nID, and Day of the week for\nspatial dependency and\nGRU-based features for\nTemporal dependencies to\npredict a number of\nincidents in diﬀerent\nlocations. [56]\nLoR, Support\nVector Regressor,\nRF, GRU, Deep\nCrime and\nT-GCN\nXiaogan, data\n(2016). New\nYork City\ndata (2014).\nAdditionally\nPOI, Urban\nanomaly and\nWeather data\nare used.\nAccuracy\nXiaogan\nDataset -\n54%, NYC\nDataset -\n61%\n22\nspatial dependency (distance graph, poi similarity, and crime similarity). Tem-\nporal dependencies captured using GRU are used to predict the number of\nincidents in diﬀerent locations.\nThese research articles highlight the versatility of regression as a tool that\ncan be integrated with other techniques to enhance the performance of crime\nprediction models. Another commonality among the papers is the use of regres-\nsion to model the relationship between crime data and other variables, such as\nweather and demographic data, to incorporate external information that may\ninﬂuence crime patterns. This allows for the creation of more comprehensive\nand accurate models of crime patterns. In summary, the ﬁve research papers\ndemonstrate the strengths of regression as a tool for crime prediction, including\nits ability to model the relationship between multiple variables, its versatil-\nity in being integrated with other techniques, and its ability to incorporate\nexternal information that may inﬂuence crime patterns.\n5.1.2 Deep Learning based Classiﬁcation Methods for Crime\nPrediction\nDeep learning algorithms are trained on large amounts of data to classify\ninstances into various categories. This makes them ideal for solving classiﬁca-\ntion problems in crime detection. Deep learning models can accurately organize\ncriminal activity and detect criminal intent by analyzing vast amounts of data,\nincluding images, audio, text, and social media data. For example, image-based\ndata can provide detailed information about crime scenes, including the pres-\nence of weapons and other objects that may indicate criminal intent. Similarly,\naudio-based data can provide valuable insights into the tone and context of a\nconversation, helping to identify potential illegal activities. Another advantage\nof deep learning for classiﬁcation problems in crime detection is the ability to\nidentify hidden patterns in the data that traditional methods may miss. For\nexample, deep neural networks can be trained to analyze crime-related tweets,\nuncovering patterns that indicate a potentially criminal act. The results of\ndeep learning models in crime detection have been awe-inspiring. The papers\nreviewed under deep learning classiﬁcation are listed in Table 5\nIn crime-related classiﬁcation, two main types of deep learning algorithms\nare used: Convolutional Neural Networks (CNN) and Recurrent Neural Net-\nworks (RNN). CNN’s are commonly used in image-based classiﬁcation tasks,\nincluding crime scene prediction. In the research article focusing on crime scene\ndata [58], CNNs are trained to detect threatening objects in crime scenes,\nsuch as weapons. This allows the model to comprehensively analyze the crime\nscene, including the presence of things that may indicate criminal intent. On\nthe other hand, RNN’s are commonly used to study temporal patterns in data.\nIn a research article focusing on crime prediction based on behavioral tracking\n[39], the authors use a combination of deep learning algorithms, including CNN\nand RNN, to analyze behavioral tracking data and motion analysis data. The\nstudy shows that this approach can eﬀectively predict criminal activities, such\nas theft and robbery, by analyzing patterns in the behavior and movements\n23\nTable 5 Crime detection using deep learning classiﬁcation techniques\nMethodology\nDL Algorithm\nDataset\nPerfor-\nmance\nR-CNN algorithm is adopted\ndetect multiple objects\nrelevant to crime in real time\nvideos and images. [57]\nVGGNET19 based\non Fast RCNN &\nRCNN\nYoutube and\nGoogle Videos\n& Images\nTrain\nAccuracy\n- 100%\nCNN is used to extract\nfeatures from CCTV images\nto predict crime scene objects.\n[58]\nCNN\n2000 Images of\nweapons and\nblood scenes\nAccuracy -\n90.2%\nClassify object or person in\nvideo feed and track abnormal\nactivity using Deep CNN\n(DCNN) and Recurrent\nNeural Network (RNN). [59]\nDCNN and RNN\n1 Million video\nstreams\n[Karpathy]\nMean\nSquared\nError\n(MSE) -\n1.38e −10\nExtract tweet data and\nprocess text to identify text\nkeywords that are relevant to\nweapons used for crime or\ncriminal activity. [35]\nCNN, KNN, NB,\nSupport Vector\nMachine (SVM),\nDT and RF\nSaudi Arabia\ntweets (2017 -\n2021).\nAccuracy -\n79%\nLive CCTV data is used to\ndetect faces and weapons\nusing CNN- GRU model. [39]\nRNN, Gradient\nRecurrent Unit\n(GRU) and LSTM.\nCAVIAR\nDataset\nAccuracy -\n95.97%\nPreprocess crime data to\nextract features and train\nboth traditional and Deep\nLearning models to predict\ncrime region and type. [40]\nTraditional ML\nclassiﬁers and\nArtiﬁcial Neural\nNetwork (ANN)\nSaudi Arabia\n(2018 - 2020)\nAccuracy\nfor Crime\nType - 99%\n& Crime\nRegion -\n81%\nAudio data is used to extract\nMel-Frequency Cepstrum\nCoeﬃcients from sound waves\nand a CNN-RNN classiﬁer is\ndeployed & text data, features\nare extracted for BERT. Both\nmodels are combined by\nfusion model. [42]\nCNN & BERT\nXD-Violence\nAudio & Video\nData\nAccuracy -\n85.63%\nTwitter data is processed by\nkeyword ﬁltering and labeled.\nThe features vectors are\ngenerated to be inputted into\nmodels for training. [37]\nSVM and ANN\n100000 Tweets\n(January 2020)\nAccuracy -\n90.3%\nVideo data is used to extract\nspatio temporal features and\ngestures to train DRNN for\nclassiﬁcation (Hostility &\nViolence). [47]\nDeep\nReinforcement\nNeural Network\n(DRNN)\nCrowd\nViolence,\nUCSD and\nViolent Flow\nData.\nAggregate\nF1 score -\n78%\nDeep Learning and Machine\nlearning models are applied to\npredict diﬀerent types of\ncrime and their relation to\nweather in Newyork city. [6]\nSVM, LR, DT,\nRF, CNN, RNN,\nLSTM and GRU\n2018 NYPD\nand Weather\ndata\nAccuracy -\n99%\n24\nof individuals in a given area. In the research articles [35] focusing on social\nmedia data, Artiﬁcial Neural Networks are trained on crime-related text data\nto predict the likelihood of a crime occurring. These models analyze the con-\ntext and tone of the text data to classify patterns that may indicate criminal\nactivity.\nIn addition to the articles mentioned above, several other research stud-\nies [57][40][6] have also used deep learning techniques for crime prediction and\nclassiﬁcation. These studies demonstrate the versatility of deep learning algo-\nrithms in crime-related classiﬁcation tasks, as they can be applied to a wide\nrange of data types, including images, text, audio, and social media data. For\nexample, research focusing on crime anomaly detection [59] uses deep learning\nalgorithms, including Autoencoders and CNN, to analyze crime patterns in\nsmart cities. The study shows that this approach can eﬀectively detect unusual\ncrime patterns, which may indicate the presence of criminal activity. In another\nstudy focusing on audio and text data [42], the authors use a multimodal deep\nlearning model based on CNN and BERT that considers both audio and text\ndata to classify crime-related events. This model is advantageous when audio\ndata, such as 911 calls, is available and can provide a complete picture of the\ncrime event.\nThese research articles including multiple other studies [37][47] highlight\nthat deep learning algorithms, including CNN and RNN, have successfully\napplied to various data types for crime prediction and classiﬁcation. These\nstudies demonstrate the versatility of deep learning algorithms in this ﬁeld and\nprovide valuable insights into the factors contributing to criminal activity. By\nleveraging the strengths of these models, law enforcement agencies can gain\na more comprehensive understanding of criminal activity and take proactive\nmeasures to prevent crime from occurring.\n6 Discussion and future work\nThe application of machine learning and deep learning algorithms to predict\nor detect crime has shown great promise in addressing this complex problem.\nBy utilizing vast datasets and advanced algorithms, these technologies can\npotentially improve the accuracy and eﬀectiveness of crime prediction models.\nHowever, despite the advances in this ﬁeld, there are still signiﬁcant gaps\nin our understanding of how these technologies can be eﬀectively applied to\nthe problem of crime prediction. In this section, we will discuss the potential\nbeneﬁts of machine learning and deep learning algorithms for crime prediction\nand the existing research gaps that need to be addressed in future research.\nOne of the major advantages of machine learning and deep learning algo-\nrithms for crime prediction is the ability to analyze large datasets and identify\npatterns in criminal activity or behavior. The ability of these algorithms to pro-\ncess vast amounts of data, including social media and other online sources, can\nprovide valuable insights into criminal activities that are yet to be committed.\nFurthermore, deep learning algorithms like CNN and RNNs have been used to\n25\nanalyze video footage from security cameras. This capability provides a more\naccurate and eﬃcient means of detecting criminal activities. Another major\nbeneﬁt of machine learning and deep learning for crime prediction is the ability\nto develop real-time prediction models. These models can be used to analyze\ncrime data in real-time and to predict future crime incidents. This supports\nlaw enforcement agencies to act quickly if a criminal activity is being commit-\nted. Additionally, integrating decentralized machine learning algorithms with\nwearable technology, such as body cameras and smartwatches, provides new\nopportunities to collect and analyze data related to criminal activities.\nEven though machine learning and deep learning algorithms support eﬀec-\ntive crime prediction, there are still some signiﬁcant challenges that need to\nbe addressed. One of the major challenges in this area is the need for inter-\npretable models that can provide clear explanations of their predictions. This\nis particularly important in the context of crime prediction, as incorrect pre-\ndictions might lead to serious consequences for individuals and communities.\nApart from the existing model-based explanation methods, it is also impor-\ntant to incorporate causal based explanations that focus on cause and eﬀect\nrelationship between crime patterns and relevant feature variables. Another\nchallenge that needs to be addressed is the need for more accurate and reli-\nable data. In order to eﬀectively apply machine learning and deep learning for\ncrime prediction, it is important to have access to high-quality and up-to-date\ncrime data. As this study showed that many earlier researchers took advantage\nof data related to demographics, whether outside of crime-relevant datasets,\nthere is a need to develop algorithms that can accurately handle data from\nmultiple sources and integrate it into a single predictive model.\nAnother signiﬁcant area of focus should be to research more on the ethical\nimplications of using machine learning and deep learning for crime prediction.\nAs these technologies are used to predict individuals and communities, it is\nimportant to ensure that they do not perpetuate existing biases or lead to\ndiscrimination. Furthermore, there is a need for more research on the privacy\nimplications of using these technologies for crime prediction, this included but\nnot limited to the potential risks of data breaches and the misuse of personal\ninformation. Another signiﬁcant gap in the existing research is the need for\nmore research studies on the eﬀectiveness of machine learning and deep learn-\ning for crime prediction in the real world. While these technologies have shown\ngreat promise in this area, there is a need for more rigorous evaluations of their\naccuracy and eﬀectiveness in real-world scenarios. Additionally, there is a need\nfor more research on the scalability of these technologies and the challenges\nassociated with their implementation in large-scale systems.\nIn conclusion, machine learning and deep learning methodologies have the\npotential to transform the ﬁeld of crime prediction by providing more accu-\nrate and eﬀective methods for predicting criminal activities. However, in order\nto fully realize the potential of these technologies, it is important to address\nthe existing research gaps and challenges, including the need for interpretable\nmodels, accurate and reliable data, ethical considerations, and more rigorous\n26\nevaluations of their accuracy and eﬀectiveness. By addressing these gaps, we\ncan advance our understanding of the role of machine learning and deep learn-\ning algorithms in crime prediction and contribute to the development of more\neﬀective and eﬃcient policing strategies.\nTable 6 Future Research Directions\nConcept Areas and Research Questions\nFeature-Oriented\n1. How do visual features (e.g., images/videos) aﬀect (i.e., positively or negatively) the\ncrime identiﬁcation?\n2. How do audio features (e.g., voiceover, call recordings) aﬀect (i.e., positively or\nnegatively) the crime identiﬁcation?\n3. How do Textual features (e.g., investigating notes, complaint statements, crime\ninterviews) aﬀect (i.e., positively or negatively) the crime identiﬁcation?\n4. What are the visual features to be considered to detect neighborhood crime?\n5. What are the Audio features to be considered to detect neighborhood crime?\nTechnique-Oriented\n1. Are there any reinforcement learning techniques available to detect neighborhood crime?\n2. Are there any transfer learning techniques available to detect neighborhood crime?\n3. Are there any generative adversarial neural network techniques available to detect\nneighborhood crime?\nAs a future research goal and agenda, we have illustrated a range of\nprospective research directions in the area of neighborhood crime based on the\nimportance and also current lack of focus in the areas. From Table 6, future\nresearchers may want to address concerns like - ”Are there any reinforcement\nlearning techniques available to detect the neighborhood crime?”, and What\nare the visual features to be considered to detect the neighborhood crime?\nThe relevant datasets are available for such identiﬁed future research ques-\ntions; such data may be utilized to accomplish the goal of early recognition of\nneighborhood crime.\nThe presented literature base and futuristic research goals oﬀer a number\nof elements to direct future studies and thus theoretically support the eﬀort to\nidentify neighborhood crimes. Our systematic review oﬀers a thorough grasp of\nthe characteristics and methods used by earlier research to recognize and detect\ncrimes. In addition, we have outlined 8 more research questions that fall into\nthe categories of technique-oriented questions and feature-oriented questions\nin Table 6. Practically speaking, this systematic review serves as a guide for\nvarious researchers, practitioners, ﬁrst responders, and crime analysts, to take\ninto account the studied features and techniques to eﬀectively understand and\ndetect the crimes that, in part, foster the eﬀort for early crime detection.\n27\n7 Conclusion\nThe complexity of crimes has increased along with technological development,\ncreating diﬃcult problems for law enforcement. Researchers’ interest in utiliz-\ning machine learning and deep learning to predict crime has increased recently,\nwith an emphasis on ﬁnding patterns and trends in crime occurrences. In order\nto analyze the various machine learning and deep learning algorithms used in\npredicting crime, this paper looks at more than 150 articles. We have signiﬁ-\ncantly studied the selected 51 articles to extract the essence of utilized various\nML and DL techniques along with the publicly available datasets. The use of\nmachine learning and deep learning algorithms to anticipate or identify crim-\ninal activity has shown signiﬁcant promise in resolving the crime detection\nproblem. These advances may help to increase the precision and eﬃcacy of\ncrime prediction models by leveraging large datasets and sophisticated algo-\nrithms. Although there is a lack of literary wisdom on how these technologies\ncan be used to solve the problem of crime prediction, despite the advance-\nments in this sector. Thus our ﬁndings help to understand the implications\nof various ML and DL techniques. Also, our mentioned datasets and future\ndirections will help the existing research community to pursue their research\nin the area of crime prediction.\nDeclarations\n• Conﬂict of interest\nThe authors of this article have no conﬂict of interest to declare.\n28\nAppendix A\nAdditional papers on crime\ndetection using Machine\nLearning and Deep Learning\nTable A1: Crime detection papers with data science algorithms\nMethod\nAlgorithms\nApplied\nData Set\nPerformance\nApplied six diﬀerent types of\nmachine learning algorithms\nusing similar characteristics on\ncrime data. [13]\nNB,\nCART,\nKNN, LoR\nand SVM\n2001 to\n2012 with\nmore than\n2,00,000\nrecords\nAggregate\nAccuracy -\n30%\nK-nearest neighbor algorithm\nis applied to predcit the crime.\n[14]\nKNN\nPolice\nwebsite of a\ncity Indore\nin Madhya\nPradesh\nAggregate\nAccuracy -\n99.51%\nStatistical modeling\napproaches are applied to\npredict the crime rate of a\nparticular district of India\nusing the previous year’s\nstatistics. [15]\nWeighted\nMoving\nAverage,\nFunctional\nCoeﬃcient\nRegression\nand\nArithmetic\nGeometric\nProgression\nCrimes in\nIndia 2001\n- 2013\nBetween the\nrange 85%\nand 90%\nPredicts the description of the\nperpetrator using algorithms\nlike Multilinear Regression, K\nnearest neighbors, and Neural\nNetwork. [19]\nKNN\nSan\nFrancisco\nHomicide\ndataset\n(1981-\n2014)\n91.6%\nMachine-Learning predictive\nmodels, K-nearest neighbor,\nand boosted decision trees are\nimplemented to predict crime.\n[20]\nKNN and\nboosted\ndecision\ntree\nVancouver\ncrime data\nfor the last\n15 years\nAccuracy\nbetween 39%\nto 44%\n29\nSpatial analysis and\nauto-regressive models to\ndetect high-risk crime regions\nin urban areas and reliably\nforecast crime trends in each\nregion. [21]\nAssociation\nrule mining\n, classiﬁca-\ntion, and\nclustering\nChicago\nMean\nAbsolute\nError (MAE)\n- 11.5\nAn auto-regressed temporal\nand a feature-based inter-area\nspatial correlation are applied\nto measure such patterns for\ncrime prediction. [23]\nGaussian\nProcess\nRegressor,\nRF, Auto\nRegression\nMoving\nAverage,\nLinear\nRegression\nand\nClustered\nContinuous\nCondi-\ntional\nRandom\nField\nChicago\nfrom Jan. 1\n2013 to\nJan. 1\n2016.\nAggregate\nRMSE - 3.1\nExperimented with\npolynomial, auto-regressive,\nand support vector regression\nmethods and found that the\nquality of support vector\nregression signiﬁcantly\noutperforms other\napproaches.[24]\nPolyno-\nmial,\nauto-\nregressive\nand sup-\nport vector\nregression\nDiﬀerent\nregions in\nCity of\nChicago\nRMSE- 0-10\nfor most\ncrimes\nRepresentative covariates from\nthe nonhistorical crime data\nare added to the prediction\nmodel to explore the changes\nin the result accuracy of crime\nprediction. [30]\nRandom\nForest\nCrime data\nset in San\nFrancisco\nDemo, POI,\nDI - 1.18\n30\nSpatio-Temporal Crime\nHot-Spots detection based on\nclustering method. [34]\nHierarchi-\ncal\nDensity-\nbased\nspatial\nclustering\nof applica-\ntions with\nnoise\n(HDB-\nSCAN)\nNYC\nApprox 10\nsec for cluster\nCheck crime rate based on\ntext mining on social media\nusing a logistic regression\nalgorithm. [37]\nLogistic\nRegression\nTwitter &\nFacebook\nAggregate\nAccuracy -\n90%\nLatitude and Longitude are\nused by KNN. In addition,\nDate is used by the naive\nbayes algorithm for classifying\ncrime type. [45]\nKNN &\nNaive\nBayes (NB)\nUK crime\ndata (2015\nto 2017).\nAccuracy -\n70 to 80%\nA Text-mining approach for\ncrime tweets in Saudi Arabia.\n[35]\nCNN,\nKNN, NB,\nSGD,\nSVM, DT\nand RF\nTweets\nAggregate\nAccuracy -\n79%\nPresents an empirical analysis\nof machine learning algorithms\nfor crime prediction using\nstacked generalization, which\nis an ensemble approach. [18]\nDT, RF,\nSVM and\nKNN\n2001-2015\nCrime\nDataset in\nIndia\nAccuracy -\n99.5%\nProposes using auto-regression\ntechniques for predicting crime\nin a city using time series\ndata. [60]\nARIMA\nand Gener-\nalized\nLinear\nModel\nCrime\nData set\nfrom India\nNot\nQuantiﬁed\nProposes a Spatial-Temporal\nSelf-Supervised Hypergraph\nLearning framework (ST-HSL)\nto tackle the label scarcity\nissue in crime prediction. [26]\nST-\nHSLARIMA,\nSVM,\nSTResNet,\nDCRNN,\nSTGCN\nand GWN\nNYC and\nChicago\nCrime data\nMAE 0.79\nfor robbery\n31\nProposes an artiﬁcial neural\nnetwork (ANN) based\napproach for detecting\ncrime-related posts on\nTwitter. [36]\nNeural\nNetwork\nand SVM\nTweets\nAccuracy -\n90.33%\nMachine learning algorithms\nto predict crimes that\nendanger public health and\naim to improve the eﬃciency\nof crime prevention. [61]\nSVM and\nRandom\nForest\nRecords of\ncrimes\nagainst\npublic\nhealth in a\nchinese city\nfrom\nJanuary 1,\n2018 to\nOctober\n31, 2018.\nNot\nQuantiﬁed\nDevelop scalable predictive\nmodels for violent oﬀending\nfollowing (12 to 24 months\npost-discharge) discharge from\nsecure psychiatric hospitals.\n[46]\nCox\nRegression\n2248\nindividuals\ndischarged\nfrom\nSwedish\npsychiatric\nhospitals\nbetween\n1992 and\n2013\nAggregate\nConcordance\nIndex 0.73\nApplication of two diﬀerent\nmachine learning classiﬁer\nmodels on a rich collection of\nreal-world forensic casework\nimages of drug-related\noﬀenses. [62]\nSVM with\nBag of\nVisual\nwords and\nTree-CNN\nAustralian\nFederal\nPolice\nillicit drug\ndatabase.\n97287\nimages\nTrue positive\nrate - 89.17%\nInvestigates the HDBSCAN to\ndetect the hot spots that have\na higher risk of crime\noccurrence and Seasonal\nAuto-Regressive Integrated\nMoving Average (SARIMA) is\nexploited in each dense crime\nregion to predict the number\nof crime incidents in the future\nwith spatial and temporal\ninformation. [29]\nHDBSCAN\nand\nSARIMA\nNYC\ncrimes 2008\nto 2017.\nAggregate\nMAE - 11.7\n32\nREFERENCES\nReferences\n[1] Shah, N., Bhagat, N. & Shah, M. Crime forecasting: a machine learning\nand computer vision approach to crime prediction and prevention. Visual\nComputing for Industry, Biomedicine, and Art 4, 1–14 (2021) .\n[2] Chun, S. A. et al. Crime prediction model using deep neural networks,\n512–514 (2019).\n[3] Kshatri, S. S. et al. An empirical analysis of machine learning algorithms\nfor crime prediction using stacked generalization: An ensemble approach.\nIEEE Access 9, 67488–67500 (2021) .\n[4] Janiesch, C., Zschech, P. & Heinrich, K.\nMachine learning and deep\nlearning. Electronic Markets 31 (3), 685–695 (2021) .\n[5] Raza, D. M. & Victor, D. B. Data mining and region prediction based on\ncrime using random forest, 980–987 (IEEE, 2021).\n[6] Elluri, L., Mandalapu, V. & Roy, N. Developing machine learning based\npredictive models for smart policing, 198–204 (IEEE, 2019).\n[7] Meijer, A. & Wessels, M.\nPredictive policing: Review of beneﬁts and\ndrawbacks. International Journal of Public Administration 42 (12), 1031–\n1039 (2019) .\n[8] Hossain, S., Abtahee, A., Kashem, I., Hoque, M. M. & Sarker, I. H. Crime\nprediction using spatio-temporal data, 277–289 (Springer, 2020).\n[9] Saraiva, M., Matijoˇsaitien˙e, I., Mishra, S. & Amante, A. Crime prediction\nand monitoring in porto, portugal, using machine learning, spatial and\ntext analytics. ISPRS International Journal of Geo-Information 11 (7),\n400 (2022) .\n[10] Kounadi, O., Ristea, A., Araujo, A. & Leitner, M. A systematic review\non spatial crime forecasting. Crime science 9, 1–22 (2020) .\n[11] Morrisey, L. J. in Bibliometric and bibliographic analysis in an era of\nelectronic scholarly communication 149–160 (Routledge, 2013).\n[12] Hofmann, M. & Chisholm, A. Text mining and visualization: Case studies\nusing open-source tools Vol. 40 (CRC Press, 2016).\n[13] Tamilarasi, P. & Rani, R. U. Diagnosis of crime rate against women using\nk-fold cross validation through machine learning, 1034–1038 (IEEE, 2020).\n[14] Kumar, A., Verma, A., Shinde, G., Sukhdeve, Y. & Lal, N.\nCrime\nprediction using k-nearest neighboring algorithm, 1–4 (IEEE, 2020).\n[15] Agarwal, S., Yadav, L. & Thakur, M. K.\nCrime prediction based on\nstatistical models, 1–3 (IEEE, 2018).\n[16] Bandekar, S. R. & Vijayalakshmi, C.\nDesign and analysis of machine\nlearning algorithms for the reduction of crime rates in india. Procedia\nComputer Science 172, 122–127 (2020) .\n[17] Sangani, A., Sampat, C. & Pinjarkar, V. Crime prediction and analysis\n(2019).\n[18] Sivanagaleela, B. & Rajesh, S. Crime analysis and prediction using fuzzy\nc-means algorithm, 595–599 (IEEE, 2019).\n[19] Shermila, A. M., Bellarmine, A. B. & Santiago, N. Crime data analysis\nand prediction of perpetrator identity using machine learning approach,\nREFERENCES\n33\n107–114 (IEEE, 2018).\n[20] Kim, S., Joshi, P., Kalsi, P. S. & Taheri, P.\nCrime analysis through\nmachine learning, 415–420 (IEEE, 2018).\n[21] Catlett, C., Cesario, E., Talia, D. & Vinci, A. A data-driven approach for\nspatio-temporal crime predictions in smart cities, 17–24 (IEEE, 2018).\n[22] Catlett, C., Cesario, E., Talia, D. & Vinci, A.\nSpatio-temporal crime\npredictions in smart cities: A data-driven approach and experiments.\nPervasive and Mobile Computing 53, 62–74 (2019) .\n[23] Yi, F., Yu, Z., Zhuang, F., Zhang, X. & Xiong, H. An integrated model\nfor crime prediction using temporal and spatial factors, 1386–1391 (IEEE,\n2018).\n[24] Dash, S. K., Safro, I. & Srinivasamurthy, R. S. Spatio-temporal prediction\nof crimes using network analytic approach, 1912–1917 (IEEE, 2018).\n[25] Han, X., Hu, X., Wu, H., Shen, B. & Wu, J. Risk prediction of theft\ncrimes in urban communities: an integrated model of lstm and st-gcn.\nIEEE Access 8, 217222–217230 (2020) .\n[26] Li, Z., Huang, C., Xia, L., Xu, Y. & Pei, J. Spatial-temporal hypergraph\nself-supervised learning for crime prediction, 2984–2996 (IEEE, 2022).\n[27] Tasnim, N., Imam, I. T. & Hashem, M. A novel multi-module approach to\npredict crime based on multivariate spatio-temporal data using attention\nand sequential fusion model. IEEE Access 10, 48009–48030 (2022) .\n[28] Zhou, B. et al. Unsupervised domain adaptation for crime risk prediction\nacross cities. IEEE Transactions on Computational Social Systems (2022)\n.\n[29] Butt, U. M. et al. Spatio-temporal crime predictions by leveraging arti-\nﬁcial intelligence for citizens security in smart cities.\nIEEE Access 9,\n47516–47529 (2021) .\n[30] Yao, S. et al.\nPrediction of crime hotspots based on spatial factors of\nrandom forest, 811–815 (IEEE, 2020).\n[31] Sathiyanarayanan, M., Junejo, A. K. & Fadahunsi, O. Visual analysis of\npredictive policing to improve crime investigation, 197–203 (IEEE, 2019).\n[32] Ara´ujo, A., Cacho, N., Bezerra, L., Vieira, C. & Borges, J. Towards a\ncrime hotspot detection framework for patrol planning, 1256–1263 (IEEE,\n2018).\n[33] Almuhanna, A. A., Alrehili, M. M., Alsubhi, S. H. & Syed, L. Prediction\nof crime in neighbourhoods of new york city using spatial data analysis,\n23–30 (IEEE, 2021).\n[34] Baqir, A., ul Rehman, S., Malik, S., ul Mustafa, F. & Ahmad, U. Eval-\nuating the performance of hierarchical clustering algorithms to detect\nspatio-temporal crime hot-spots, 1–5 (IEEE, 2020).\n[35] Algefes, A., Aldossari, N., Masmoudi, F. & Kariri, E.\nA text-mining\napproach for crime tweets in saudi arabia: from analysis to prediction,\n109–114 (IEEE, 2022).\n[36] Sandagiri, S., Kumara, B. & Kuhaneswaran, B. Detecting crime related\ntwitter posts using artiﬁcial neural networks based approach, 5–10 (IEEE,\n34\nREFERENCES\n2020).\n[37] Permana, M. A., Thohir, M. I., Mantoro, T. & Ayu, M. A. Crime rate\ndetection based on text mining on social media using logistic regression\nalgorithm, 1–6 (IEEE, 2021).\n[38] Zhou, X., Wang, X., Brown, G., Wang, C. & Chin, P.\nMixed spatio-\ntemporal neural networks on real-time prediction of crimes, 1749–1754\n(IEEE, 2021).\n[39] Shenoy, R., Yadav, D., Lakhotiya, H. & Sisodia, J. An intelligent frame-\nwork for crime prediction using behavioural tracking and motion analysis,\n1–6 (IEEE, 2022).\n[40] Aldossari, N., Algefes, A., Masmoudi, F. & Kariri, E.\nData science\napproach for crime analysis and prediction: Saudi arabia use-case, 20–25\n(IEEE, 2022).\n[41] Ma, Y., Nakamura, K., Lee, E.-J. & Bhattacharyya, S. S.\nEadtc: An\napproach to interpretable and accurate crime prediction, 170–177 (IEEE,\n2022).\n[42] Boukabous, M. & Azizi, M. Multimodal sentiment analysis using audio\nand text for crime detection, 1–5 (IEEE, 2022).\n[43] Alves, L. G., Ribeiro, H. V. & Rodrigues, F. A. Crime prediction through\nurban metrics and statistical learning. Physica A: Statistical Mechanics\nand its Applications 505, 435–443 (2018) .\n[44] He, J. & Zheng, H. Prediction of crime rate in urban neighborhoods based\non machine learning. Engineering Applications of Artiﬁcial Intelligence\n106, 104460 (2021) .\n[45] ToppiReddy, H. K. R., Saini, B. & Mahajan, G. Crime prediction & mon-\nitoring framework based on spatial analysis. Procedia computer science\n132, 696–705 (2018) .\n[46] Wolf, A. et al. Prediction of violent crime on discharge from secure psy-\nchiatric hospitals: A clinical prediction rule (fovox). European psychiatry\n47, 88–93 (2018) .\n[47] Sahay, K. B. et al. A real time crime scene intelligent video surveillance\nsystems in violence detection framework using deep learning techniques.\nComputers and Electrical Engineering 103, 108319 (2022) .\n[48] Utomo, P. E. P. et al. Prediction the crime motorcycles of theft using\narimax-tfm with single input, 1–7 (IEEE, 2018).\n[49] Ingilevich, V. & Ivanov, S. Crime rate prediction in the urban environment\nusing social factors. Procedia Computer Science 136, 472–478 (2018) .\n[50] da Silva, A. R. C., de Paula J´unior, I. C., da Silva, T. L. C., de Macˆedo,\nJ. A. F. & Silva, W. C. P. Prediction of crime location in a brazilian city\nusing regression techniques, 331–336 (IEEE, 2020).\n[51] Das, P., Das, A. K., Nayak, J., Pelusi, D. & Ding, W. Incremental clas-\nsiﬁer in crime prediction using bi-objective particle swarm optimization.\nInformation Sciences 562, 279–303 (2021) .\n[52] Yan, Z., Chen, H., Dong, X., Zhou, K. & Xu, Z. Research on prediction of\nmulti-class theft crimes by an optimized decomposition and fusion method\nREFERENCES\n35\nbased on xgboost. Expert Systems with Applications 207, 117943 (2022) .\n[53] Zhang, X. et al. Interpretable machine learning models for crime pre-\ndiction. Computers, Environment and Urban Systems 94, 101789 (2022)\n.\n[54] Trinhammer, M., Merrild, A. H., Lotz, J. & Makransky, G. Predicting\ncrime during or after psychiatric care: Evaluating machine learning for\nrisk assessment using the danish patient registries. Journal of psychiatric\nresearch 152, 194–200 (2022) .\n[55] Das, A. K. & Das, P. Graph based ensemble classiﬁcation for crime report\nprediction. Applied Soft Computing 125, 109215 (2022) .\n[56] Liang, W., Wang, Y., Tao, H. & Cao, J. Towards hour-level crime pre-\ndiction: A neural attentive framework with spatial–temporal-categorical\nfusion. Neurocomputing 486, 286–297 (2022) .\n[57] Navalgund, U. V. & Priyadharshini, K. Crime intention detection system\nusing deep learning, 1–6 (IEEE, 2018).\n[58] Nakib, M., Khan, R. T., Hasan, M. S. & Uddin, J. Crime scene prediction\nby detecting threatening objects using convolutional neural network, 1–4\n(IEEE, 2018).\n[59] Chackravarthy, S., Schmitt, S. & Yang, L.\nIntelligent crime anomaly\ndetection in smart cities using deep learning, 399–404 (IEEE, 2018).\n[60] Yadav, R. & Sheoran, S. K.\nCrime prediction using auto regression\ntechniques for time series data, 1–5 (IEEE, 2018).\n[61] Wang, H. & Ma, S. Preventing crimes against public health with artiﬁcial\nintelligence and machine learning capabilities. Socio-Economic Planning\nSciences 80, 101043 (2022) .\n[62] Abraham, J., Ng, R., Morelato, M., Tahtouh, M. & Roux, C. Automati-\ncally classifying crime scene images using machine learning methodologies.\nForensic Science International: Digital Investigation 39, 301273 (2021) .\n",
  "categories": [
    "cs.LG",
    "cs.AI",
    "cs.CV",
    "cs.CY",
    "cs.DB"
  ],
  "published": "2023-03-28",
  "updated": "2023-03-28"
}