{
  "id": "http://arxiv.org/abs/2303.16767v2",
  "title": "A Novel Patent Similarity Measurement Methodology: Semantic Distance and Technological Distance",
  "authors": [
    "Yongmin Yoo",
    "Cheonkam Jeong",
    "Sanguk Gim",
    "Junwon Lee",
    "Zachary Schimke",
    "Deaho Seo"
  ],
  "abstract": "Patent similarity analysis plays a crucial role in evaluating the risk of\npatent infringement. Nonetheless, this analysis is predominantly conducted\nmanually by legal experts, often resulting in a time-consuming process. Recent\nadvances in natural language processing technology offer a promising avenue for\nautomating this process. However, methods for measuring similarity between\npatents still rely on experts manually classifying patents. Due to the recent\ndevelopment of artificial intelligence technology, a lot of research is being\nconducted focusing on the semantic similarity of patents using natural language\nprocessing technology. However, it is difficult to accurately analyze patent\ndata, which are legal documents representing complex technologies, using\nexisting natural language processing technologies. To address these\nlimitations, we propose a hybrid methodology that takes into account\nbibliographic similarity, measures the similarity between patents by\nconsidering the semantic similarity of patents, the technical similarity\nbetween patents, and the bibliographic information of patents. Using natural\nlanguage processing techniques, we measure semantic similarity based on patent\ntext and calculate technical similarity through the degree of coexistence of\nInternational patent classification (IPC) codes. The similarity of\nbibliographic information of a patent is calculated using the special\ncharacteristics of the patent: citation information, inventor information, and\nassignee information. We propose a model that assigns reasonable weights to\neach similarity method considered. With the help of experts, we performed\nmanual similarity evaluations on 420 pairs and evaluated the performance of our\nmodel based on this data. We have empirically shown that our method outperforms\nrecent natural language processing techniques.",
  "text": "A Novel Patent Similarity Measurement Methodology:\nSemantic Distance and Technological Distance\nYongmin Yooa, Cheonkam Jeongb, Sanguk Gimc, Junwon Leed, Zachary Schimkee, Deaho\nSeof,∗\naDepartment of Computer Science, University of Auckland, Auckland, New Zealand\nbDepartment of Linguistics, University of Arizona, Arizona, Tucson, United States\nc SR Universe, Seoul, Republic of Korea\nd Royal Melbourne Institute of Technology, Melbourne, Australia\neJames E. Rogers College of Law, University of Arizona, Tucson, Arizona, United States\nfSchool of Information, Yonsei University, Seoul, Republic of Korea\nAbstract\nPatent similarity analysis plays a crucial role in evaluating the risk of patent infringement.\nNonetheless, this analysis is predominantly conducted manually by legal experts, often re-\nsulting in a time-consuming process. Recent advances in natural language processing tech-\nnology offer a promising avenue for automating this process. However, methods for measur-\ning similarity between patents still rely on experts manually classifying patents. Due to the\nrecent development of artificial intelligence technology, a lot of research is being conducted\nfocusing on the semantic similarity of patents using natural language processing technol-\nogy. However, it is difficult to accurately analyze patent data, which are legal documents\nrepresenting complex technologies, using existing natural language processing technologies.\nTo address these limitations, we propose a hybrid methodology that takes into account bib-\nliographic similarity, measures the similarity between patents by considering the semantic\nsimilarity of patents, the technical similarity between patents, and the bibliographic in-\nformation of patents. Using natural language processing techniques, we measure semantic\nsimilarity based on patent text and calculate technical similarity through the degree of co-\nexistence of International patent classification (IPC) codes. The similarity of bibliographic\ninformation of a patent is calculated using the special characteristics of the patent: citation\ninformation, inventor information, and assignee information. We propose a model that as-\nsigns reasonable weights to each similarity method considered. With the help of experts, we\nperformed manual similarity evaluations on 420 pairs and evaluated the performance of our\nmodel based on this data. We have empirically shown that our method outperforms recent\nnatural language processing techniques.\nKeywords:\nPatent Similarity, Patent Analysis, Document Similarity, Natural Language\nProcessing, Technological Management\n∗Corresponding author.\nEmail addresses: yooyongmin91@gmail.com (Yongmin Yoo), cheonkamjeong@arizona.edu\nDecember 4, 2023\narXiv:2303.16767v2  [cs.IR]  1 Dec 2023\n1. Introduction\nPatents, a major form of intellectual property rights, give inventors the legal right to\nprotect their inventions for a limited period of time against infringement by others making,\nusing, or selling the invention without permission.[1] Due to the rapid development of tech-\nnology, the number of patents files each year has increased significantly. Additionally, due to\nthe development of convergence studies, the format of the technology itself is often a combi-\nnation of various technologies rather than a single technology, making the technology itself\nvery complex and very complex and difficult to understand. For this reason, patent anal-\nysis, which analyzes a large number of complex patents using various techniques and tools\nto discover insights from patents, is becoming increasingly important.[2] Establish a patent\nroad map and plan strategies through patent analysis[3, 4], predict emerging technologies\nto predict future technologies[5, 6], or determine how much opportunity a technology has\nthrough technological opportunity detection. Analyzing patents, such as detection[7, 8] or\npatent valuation[9], has a lot of value.\nPatent similarity measurement is one of the fundamental components of patent analysis.\nThis is because it can detect the risk of patent infringement, prevent plagiarism, and evaluate\nwhether the invention meets the criteria for novelty and innovation.[10] A patent document\nis different from ordinary documents because it is a document made up of legal terms that\ndescribe a unique technology. Additionally, a patent is a special document consisting of\nspecial bibliographic information such as title, abstract, inventor, references, international\npatent classification, and assignee. Therefore, analyzing patent documents and measuring\nthe similarity between patents is a very challenging task.\nResearch measuring the similarity of past patents has been conducted steadily for a long\ntime. Numerous researchers have proposed methods to measure patent similarity in various\naspects. A study proposed a method to measure the similarity between patents considering\nthe technical aspects of the patent.[1, 11–15] Some studies also proposed to measure the sim-\nilarity of patents by considering the bibliographic information of the patent[16–20], and a\nstudy that proposed a method to measure similarity between patents considering the seman-\ntic aspects of patents[21–24], there are many methods to measure the similarity of patents.\nHowever, each method has its own limitations. Studies that measure patent similarity by\nconsidering the technical aspects of patents mainly consider the IPC code of the patent. The\nIPC code for patents is a hierarchical classification system of language-independent symbols\nfor patent classification, covering all areas of technology. It is the hierarchical structure that\nmakes IPC codes suitable for measuring patent similarity. However, IPC is an ambiguous\nclassification system in that it relies heavily on existing technologies and their combinations\nwhen defining new and emerging technologies, which can lead to significant uncertainty.[25]\nTherefore, if the similarity of patents is measured based only on unreliable IPC codes, it\nmay lead to inaccurate results in measuring patent similarity.\nStudies that measure patent similarity by considering bibliographic information of\npatents mainly consider patent citation information. In addition, it is a good source that\n(Cheonkam Jeong), worj2uk@gmail.com (Sanguk Gim), asdl0320@gmail.com (Junwon Lee),\nzackschimke@arizona.edu (Zachary Schimke), seo_daeho@naver.com (Deaho Seo)\nDecember 4, 2023\ncitation information can serve as a proxy to assess measurement patent similarity with bib-\nliographic coupling network or co-citation network.[18, 26]Patent Citation Analysis is easy\nto use and very simple. Additionally, similarity measurement through citations sometimes\nshows powerful performance. However, there are two major limitations. (1)Due to cita-\ntion hysteresis, new patents tend to be cited less than existing patents.[1] (2)Some patent\ndatabases may provide inaccurate citation information.[27] Therefore, if patent similarity\nis measured considering only the bibliographic information of the patent, it may lead to\ninaccurate results in measuring patent similarity.\nStudies that measure patent similarity by considering the semantic aspects of patents\nmainly consider the content aspects of patents. In the past, research[4, 28, 29] mainly mea-\nsured patent similarity using text mining techniques such as keyword extraction. However,\nthis has the limitation of being highly dependent on the inventor’s keyword selection and\nlanguage style. Recently, due to the tremendous advancement in natural language process-\ning technology, studies [30, 31] have been proposed to measure patent similarity using deep\nlearning models. Thanks to the rapid development and high accuracy of natural language\nprocessing using deep learning, patent datasets also show high accuracy. However, it has\nthe disadvantage of not considering the characteristics of the patent. In particular, since\npatents often describe complex scientific technologies, a complete semantic analysis of the\ndomain is not possible. For example, special symbols such as chemical formulas are not easy\nto analyze using a natural language processing model using deep learning.\nTo overcome this problem, unlike previous studies, this paper proposes an approach to\nmeasure the similarity between patents by considering not only deep learning methods but\nalso characteristics of patents. The aspect that considers the technical aspect of a patent is\nto conduct research on the degree of technology overlap by considering the IPC code. The\naspects that consider bibliographic information include not only citation information but\nalso information on the assignee and inventor of the patent. Lastly, in terms of considering\nthe semantic aspect, we consider the transformer model and LLM model, which are cur-\nrently showing the best performance in natural language processing and select the model\nwith the best performance. We then propose an optimized formula based on the model\nthat assigns reasonable weights to each similarity method considered above. We used the\nPearson coefficient and Spearman coefficient as evaluation metrics to compare and measure\nthe performance of the proposed model with a widely used natural language processing\nmodel. Our model showed better performance than traditional deep learning methods such\nas CNN, LSTM, and Bi-LSTM, and the recently most popular large language model BERT\nand LLaMa2 models.\nThe rest of this paper is organized as follows. Section 2 briefly reviews related work,\nour methodology for measuring patent similarities is described in more detail in Section\n3. Then, a case study is conducted to demonstrate the advantages of this methodology in\nSection 4. Then Result in Section 5 and discussion in Section 6. The last section concludes\nthis contribution.\nDecember 4, 2023\n2. Literature research\nIn the literature research part, methods for measuring patent similarity were described\nfrom three perspectives. This section describes the research have done previously.\n2.1. Technological Similarity\nMeasuring technical similarity between patents is a method of measuring similarity based\non the technical similarity between patents. Numerous studies have been conducted in the\npast to measure technical similarities between patents. Leydesdorff et al. studied US patents\n(USPTO) based on the International Patent Classification Code (IPC code). They proposed\na method of measuring similarity based on IPC codes when analyzing data.[11] Yuan Fu et\nal. Additionally, patent similarity analysis was conducted based on IPC. In particular, the\nsimilarity of groups competing in patent technology was compared and analyzed based on\npatent classification codes.[31] Eisinger et al.\nalso conducted an analysis using IPC. In\nthis study, they recognized the limitations of searching for patents and proposed a search\nsystem using IPC codes to overcome them.[15] Yan et al,. proposed a technological distance\nmeasurement method for patent mapping. A method of finding the optimal method was\nproposed through comparative analysis using 12 similarity measurement methods based on\ntechnological similarity.[14]\n2.2. Bibliography Similarity\nMeasuring patent similarity through bibliographic information is a method of measuring\npatent similarity using the characteristics of a special document called a patent. Unlike\nother documents, a patent is a document that contains special elements such as title, ab-\nstract, claims, citation information, inventor, assignee, and IPC code. In general, similarities\nbetween patents is measured using patent citation information. Choi et al,. proposed a sys-\ntem that recommends patents after measuring the similarity between two patents through\nanalysis of citation relationships between patents.[16] He proposed a method to measure\nthe similarity between two patents by considering the forward citations of each patent. Ro-\ndriguez et al,. proposed a vector space model to analyze citation similarity between patents.\nA patent similarity measurement method was proposed based on the idea that citation re-\nlationships expressed as vectors are easy to analyze for patents with similar structures.[18]\nA study by Chen et al. proposed a method of measuring the similarity between patents\nby confirming that there is a technical connection between each patent in patent citations\nand analyzing the similarity between patents through this.[17] He started with the idea that\npatents may be technically identical if they cite the same patent or are cited by the same\npatents.\n2.3. Semantic Similarity\nMeasuring patent similarity through semantic similarity goes beyond simple analysis of\nthe outside of the text and identifies patent similarity through understanding the meaning\ninside the text. Vowinckel et al,. proposed a method to analyze the similarity of characters\nthrough vectorization of patent characters. The SEARCHFORMER they developed is a\nDecember 4, 2023\ntransformer-based model that proposes a method of identifying and analyzing the similarity\nof newly invented patents by using existing patent documents rather than comparing simi-\nlarity between patent documents.[21] Siddharth et al. propose a semantic similarity analysis\nmethod for patents that focuses on natural language processing and embedding. This is\nused for patent classification and proposes a method of measuring patent similarity based\non the similarity measurement standard used in the analysis [22] Liu et al,. proposed a\npatent similarity analysis method based on subject classification and semantic similarity by\nfinding classification and semantic similarity using the title and abstract of the patent.[24]\nThe study by Sinha et al. proposed a method to measure patent similarity based on the\nsimilarity of patent concepts rather than word matching analysis. In particular, a method\nwas proposed to consider the contextual meaning of the entire patent content rather than\nthe fragmentary use of words, phrases, and frequencies.[30]\n3. Methodology\nOur method considers three aspects to measure patent similarity which are the technical,\nbibliographic, and semantic aspects of the patent. We then propose an optimized patent\nsimilarity measurement method based on a model that assigns reasonable weights to each\nsimilarity method considered above.\n3.1. Technological Similarity\nFigure 1: Model architecture for the technological similarity measurement\nDecember 4, 2023\nWe first consider technical aspects to measure patent similarity.\nSimilarity between\npatents is measured using international classification codes that classify patents by tech-\nnology. The IPC code is a code that classifies detailed technologies and has a five-level\nhierarchical structure consisting of class, subclass, main group, and subgroup. Since it is\nvery difficult to match all five levels, we check whether there is a match up to the main\ngroup, that is, the top three levels of the hierarchy. In other words, if the class, subclass,\nand main group are the same, it is considered a matching technology. Afterwards, we use\nthe Jaccard coefficient of the IPC code to calculate the technical similarity between two\npatents with a score between 0 and 1. Technological Similarity model architecture is shown\nin Figure1 and Eq (1).\nTechnological Similarity = Jaccard (IPC(PatentA, PatentB))\n(1)\n3.2. Bibliography Similarity\nFigure 2: Model Architecture for the Citation Similarity\nWe are considering a method, using the bibliographic information of patents to mea-\nsure patent similarity. We measure the similarity between patents using citation informa-\ntion, inventor information, and assignee information, which are special elements of patents.\nFirst, we measure the similarity between patents using citation information between patents.\nPatent citations use backward citation information in which my patent cites other patents.\nIn the case of a backward citation, it refers to a document submitted or cited by the examiner\nor applicant during the examination of the relevant patent application.[31] We start from\nDecember 4, 2023\nthe idea that patents that cite the same patent may be technologically similar. Therefore,\nwe measure the degree of citation of the two patents as shown in the Eq (2) below.\nCitation Similarity = Jaccard (Backward Citation(PatentA, PatentB))\n(2)\nFigure 3: Model Architecture for the Bibliography Similarity\nSecond, we propose a method to measure the similarity of patents using inventor informa-\ntion and assignee information. It starts with the idea that two patents will be technologically\nsimilar if they come from the same inventor. Additionally, we start with the idea that if the\nacquired company is the same, it may be technologically similar. In the case of inventors,\nthe areas in which an individual can invent are very limited, so if a patent is applied for\nby the same inventor, 5percent weight is given to the number of matching inventors. In the\ncase of an assignee, there may be a technical connection between the transferred patents,\nbut since patents of various technologies are often considered, a weight of 3percent is given\nwhen the patent has the same assignee. The two equations are in Eq (3) and Eq (4) below.\nInventor Similarity = number of Inventors × 0.05\n(3)\nAssignee Similarity = number of Assignee × 0.03\n(4)\nDecember 4, 2023\nIf the number of inventor value is 0, the value is entered as 1 in the equation below.\nSimilarly, if the number of Assignee value is 0, it is entered as the value 1 in the equation\nbelow. The final equation for bibliographic similarity follows Eq (5) below.\nBibliography Similarity = Jaccard (BackwardCitation(PatentA, PatentB))\n×(number of inventors × 0.05) × (number of assignees × 0.03)\n(5)\n3.3. Semantic Similarity\nFigure 4: Model Architecture for the Semantic Similarity\nTo measure patent similarity, we consider the semantic features of patents. We measure\nthe similarity between patents using Llama2, which is the method with the best performance\namong natural language processing techniques.[32] Llama2 is a Large Language Model(LLM)\nreleased by Meta in July 2023 and has more parameters than existing language models.\nLlama2 has sizes of 7B, 13B, 34B, and 70B, and in this study, Llama2 7B was used due to\nlimitations in computing resources.\n3.4. Hybrid similarity\nWe will derive the most optimized formula by hybridizing the technical similarity of\nthe previously proposed patent, similarity using bibliographic information, and semantic\nsimilarity. We propose an optimization method that weights the similarity through technical\nsimilarity and bibliographic information based on semantic similarity. We use actual data\nDecember 4, 2023\nto find the optimal values of n and m that can produce the best performance. Our final\nequation follows the basic Eq (6) below.\nProposed Method = Semantic Similarity ×\n\u0012Technological Similarity\nn\n+ 1\n\u0013\n×\n\u0012Bibliography Similarity\nm\n+ 1\n\u0013\n(6)\n4. Experiment\nIn this section provides the dataset, evaluation method, and experimental results. In\ntraining the models, we use Python version 3.10.9 and Pytorch version 1.13.1 from Seoul,\nKorea. The computer specifications used in the experiment are as follows: 4 GeForce RTX\n2080Ti and 16 Intel(R) Core(TM) i7-9800X CPU @ 3.80GHz.\n4.1. Dataset\nGoogle patent is a platform where patents from 2016 to 2020 granted by United States\nPatent and Trademark Office are provided. Of them, Artificial Intelligence Patent Dataset\n[33] are adopted for this research. Using Google patent, we randomly extract 420 pairs\npatents from 2019 to 2020, with which we perform expert validation.\nThe expert panel consists of three scientists, each of whom has expertise in Data An-\nalytics, Data Mining, and Artificial Intelligence, respectively. Before asking them to rate\nthe patents, we set a guideline for rating, following advice by the author Zachery Schimke,\na Juris Doctor candidate, who specializes in Patent at the University of Arizona. To be\nspecific, we adopt a seven-scale rating scheme; it consists of the five odd numbers between\n0 and 10, to which 0 and 10 are also added as exceptional cases. Then, we establish five\ncriteria: Area, Task or Purpose, Methodology, and Application. Depending on the number\nof the overlapping criteria, rating scores are given, as described inTable 1.\nTable 1: Criteria for patent rating\nScore\nCriterion\n0\nTotally different\n1\n1 similar property\n3\n2 similar properties\n5\n3 similar properties\n7\n3 similar properties & 1 somewhat similar property\n9\n4 similar properties, but not the same\n10\nExactly same\nFollowing the guideline, each rater assesses how semantically similar two patents are\nsolely based on patent abstracts with titles. In order to ensure reliability, we winnow out\nDecember 4, 2023\nthe data based on a variance analysis and then ask the author Zachery Schimkem, a law\nexpert, to rate them. As described inTable 2, we calculate Distance and then set Threshold\nas 8. If Distance is larger than Threshold, we separately store the data for Law expert rating;\notherwise, we calculate the mean score.\nTable 2: Data rating flow\nLaw expert rating :\nAsking a law expert to rate patents\nif scores rated by the expert panel\nhave huge discrepancies\nµ = (r1 + r2 + r3)/3\nDistance = (µ −r1)2 + (µ −r2)2 + (µ −r3)2\nThreshold = 8\nif Distance ≥Threshold :\nreturn Law expert rating\nelse :\nScore = ( r1 + r2 + r3)/3\nOut of 420 pairs of the patents, 85 pairs turn out to be the cases for Law expert rating.\nAfter obtaining the 85 pairs rated by the law expert, we combine them with the remaining\ndata, totaling 420 pairs. The mean score of the data is 1.844 with the standard deviation\nof 1.882.\nFor the analysis of the technical similarity, we utilize IPC codes in the patent documents.\nAs described in 3.2., we adopt the three-depth structure, meaning that we use the code up\nto sub-class. For instance, if a patent consists of G06F40/30, G06F40/40, and G06F40/56\ncodes, we regard the patent as having one IPC code, rather than three. Accordingly, we\npreprocess the codes. The total number of patents is 840, ranging from 1 to 6. The mean\nnumber of IPC codes per patent is 1.602 with a standard deviation of 0.812, as illustrated\nin Figure 7.\n4.2. Evaluation metrics\nWe use Pearson’s correlation coefficient and Spearman’s one as indicators to evaluate the\nexperimental results. Pearson’s correlation coefficient is a measure of the linear correlation\nbetween two variables. Pearson’s correlation coefficient is calculated by Eq (7).\nr =\nn (P xy) −(P x) (P y)\np\n[n P x2 −(P x)2] ∗[n P y2 −(P y)2]\n(7)\nOn the other hand, the Spearman’s correlation coefficient is a method of calculating the\ncorrelation coefficient using the rank of two values rather than the actual value to calculate\nDecember 4, 2023\nFigure 5: Frequency of patents depending on the number of IPC codes per patent\nthe correlation coefficient. Spearman’s correlation coefficient is obtained byEquation (8).\nr = 1 −6 P D2\nn(n −1)\n(8)\n5. Result\nIn this section, We will explain the process of finding the optimal value when hybridizing\nthe three methods. Afterwards, the experimental results will be explained.\n5.1. Hybrid method Optimizing\nTo obtain the weight value in Eq (6), we calculated technical similarity, similarity using\nbibliographic information, and semantic similarity and then found the optimized value. First,\nin terms of technical similarity, we find the value of n that maximizes Eq (9) below.\nProposed Method = Semantic Similarity ×\n\u0012Technological Similarity\nn\n+ 1\n\u0013\n(9)\nWe found that it is optimized when the value of n among numbers from 1 to 100 is 9.\nSecond, in terms of similarity using bibliographic information, we find the value of m that\nmaximizes Eq (10) below.\nProposed Method = Semantic Similarity ×\n\u0012Bibliography Similarity\nm\n+ 1\n\u0013\n(10)\nWe found that it is optimized when the value of m among numbers from 1 to 100 is 8.\nTherefore, the final Eq (11) of the equation we propose is as follows.\nDecember 4, 2023\nFigure 6: Optimizing process of semantic similarity and technological similarity\nFigure 7: Optimizing process of semantic similarity and bibliography similarity\nDecember 4, 2023\nProposed Method = Semantic Similarity ×\n\u0012Technological Similarity\n9\n+ 1\n\u0013\n×\n\u0012Bibliography Similarity\n8\n+ 1\n\u0013\n(11)\n5.2. Result\nWe compared the performance of our proposed model with natural language processing\nmodels. We evaluated the performance of three traditional deep learning models, BERT, a\ntransformer-based model, a model that considers BERT and technical aspects together, and\nLlama2 model, a representative LLM model, and our model through Pearson coefficient and\nSpearman coefficient.\nTable 3: Model performance\nModel\nPearson\nSpearman\nCNN\n0.1189\n0.1362\nLSTM\n0.0655\n0.0642\nBi-LSTM\n0.1648\n0.1669\nBERT\n0.4612\n0.5246\nLlaMA2\n0.5946\n0.6450\nProposed model\n0.6342\n0.6453\n6. Discussion\nWe propose a hybrid method to measure bibliographic and technical information simi-\nlarity as well as semantic similarity. The experimental results show that the proposed model\nhas the best performance among the seven models in Table 3. This emphasizes the need\nto integrate not only semantic similarity but also bibliographic information and technical\ninformation similarity when measuring patent similarity. The proposed method can be an\neffective starting tool for inventions at an early stage by solving a very large problem in\npatent analysis. Many applied studies can be performed using the proposed method. For\nexample, you can respond to the patent troll that has been making headlines recently. Ad-\nditionally, plagiarism between patents can be analyzed semantically and technically through\nthe proposed similarity measure. It is also possible to identify technology trends by deriving\na patent roadmap based on similar patents. Although ours is the best performing model\nthat currently exists, its accuracy is still very low. Therefore, we need to discuss ways to\nfurther improve performance. When measuring technical similarity, you should also con-\nsider the question of how deep the IPC code should be considered. Also, it is necessary to\nconsider the depth of citation when using bibliographic information. If there is a citation of\nmore than 3 depth, there is a high probability that the same technology will be used, so it\nis necessary to think about giving additional points.\nDecember 4, 2023\n7. Conclusion\nAs one of the basic components of patent analysis, patent similarity measurement can\nnot only efficiently derive technical information, but also detect patent infringement risks\nand evaluate whether inventions meet novelty and innovation criteria. In a rapidly changing\nworld, methods for measuring similarity between patents still rely on manual classification\nby experts, with only very important data that must be performed accurately and quickly.\nA large amount of natural language data measures the similarity between two documents\nusing only natural language processing techniques. However, since patents are documents\nrepresenting technology made up of legal terms, it is difficult to measure similarity using only\nnatural language processing techniques. Therefore, we proposed a method to measure the\nsimilarity between patents using the bibliographic information and technical information of\npatents as well as natural language processing techniques using the special data characteris-\ntics of patents. The effectiveness of the proposed method was verified through experimental\nresults. Our study has scientific significance in that the proposed model showed superior\nperformance to methods using only natural language processing techniques.\nDeclaration of competing interest\nThe authors declare no conflict of interest.\nFunding\nThis work was supported in part by the Business Agency, South Korea under Grant\nCY220049.\nAcknowledgements\nThe authors acknowledge the helpful comments and suggestions by the anonymous reviewers\nand the guest editor.\nAuthor Contributions are as follows: Conceptualization, Y.Y.; methodology, Y.Y; valida-\ntion, S.G., C.J., Y.Y.; formal analysis, S.G., Y.Y; dataset, C.J., Z.S.; Experiment, Y.Y,\nS.G; writing—original draft preparation, Y.Y., J.L; writing—review and editing, C.J., Y.Y;\nvisualization, S.G., Y.Y; supervision, Y.Y, D.S; All authors have read and agreed to the\npublished version of the manuscript.\nReferences\n[1] X. An, J. Li, S. Xu, L. Chen, W. Sun, An improved patent similarity measurement based on entities\nand semantic relations, Journal of Informetrics 15 (2) (2021) 101135.\n[2] A. Abbas, L. Zhang, S. U. Khan, A literature review on the state-of-the-art in patent analysis, World\nPatent Information 37 (2014) 3–13.\n[3] X. Yu, B. Zhang, Obtaining advantages from technology revolution: A patent roadmap for competition\nanalysis and strategy planning, Technological Forecasting and Social Change 145 (2019) 273–283.\nDecember 4, 2023\n[4] S. Choi, H. Kim, J. Yoon, K. Kim, J. Y. Lee, An sao-based text-mining approach for technology\nroadmapping using patent information, R&D Management 43 (1) (2013) 52–74.\n[5] J. Joung, K. Kim, Monitoring emerging technologies for technology planning using technical keyword\nbased analysis from patent data, Technological Forecasting and Social Change 114 (2017) 281–292.\n[6] C. Lee, O. Kwon, M. Kim, D. Kwon, Early identification of emerging technologies: A machine learning\napproach using multiple patent indicators, Technological Forecasting and Social Change 127 (2018)\n291–303.\n[7] J. Yoon, H. Park, W. Seo, J.-M. Lee, B.-y. Coh, J. Kim, Technology opportunity discovery (tod) from\nexisting technologies and products: A function-based tod framework, Technological Forecasting and\nSocial Change 100 (2015) 153–167.\n[8] J. Yoon, K. Kim, Detecting signals of new technological opportunities using semantic patent analysis\nand outlier detection, Scientometrics 90 (2) (2012) 445–461.\n[9] A. J. Trappey, C. V. Trappey, U. H. Govindarajan, J. J. Sun, Patent value analysis using deep learn-\ning models—the case of iot technology mining for the manufacturing industry, IEEE Transactions on\nEngineering Management 68 (5) (2019) 1334–1346.\n[10] X. Wang, H. Ren, Y. Chen, Y. Liu, Y. Qiao, Y. Huang, Measuring patent similarity with sao semantic\nanalysis, Scientometrics 121 (2019) 1–23.\n[11] L. Leydesdorff, D. Kushnir, I. Rafols, Interactive overlay maps for us patent (uspto) data based on\ninternational patent classification (ipc), Scientometrics 98 (2014) 1583–1599.\n[12] D. S. Hain, R. Jurowetzki, T. Buchmann, P. Wolf, A text-embedding-based approach to measur-\ning patent-to-patent technological similarity, Technological Forecasting and Social Change 177 (2022)\n121559.\n[13] Y. Park, J. Yoon, Application technology opportunity discovery from technology portfolios: Use of\npatent classification and collaborative filtering, Technological Forecasting and Social Change 118 (2017)\n170–183.\n[14] B. Yan, J. Luo, Measuring technological distance for patent mapping, Journal of the Association for\nInformation Science and Technology 68 (2) (2017) 423–437.\n[15] D. Eisinger, G. Tsatsaronis, M. Bundschus, U. Wieneke, M. Schroeder, Automated patent categoriza-\ntion and guided patent search using ipc as inspired by mesh and pubmed, in: Journal of biomedical\nsemantics, Vol. 4, Springer, 2013, pp. 1–23.\n[16] J. Choi, J. Lee, J. Yoon, S. Jang, J. Kim, S. Choi, A two-stage deep learning-based system for patent\ncitation recommendation, Scientometrics 127 (11) (2022) 6615–6636.\n[17] L. Chen, Do patent citations indicate knowledge linkage? the evidence from text similarities between\npatents and their citations, Journal of Informetrics 11 (1) (2017) 63–79.\n[18] A. Rodriguez, B. Kim, M. Turkoz, J.-M. Lee, B.-Y. Coh, M. K. Jeong, New multi-stage similarity\nmeasure for calculation of pairwise patent similarity in a patent citation network, Scientometrics 103\n(2015) 565–581.\n[19] A. Rodriguez, A. Tosyali, B. Kim, J. Choi, J.-M. Lee, B.-Y. Coh, M. K. Jeong, Patent clustering\nand outlier ranking methodologies for attributed patent citation networks for technology opportunity\ndiscovery, IEEE Transactions on Engineering Management 63 (4) (2016) 426–437.\n[20] P. Sharma, R. Tripathi, Patent citation: A technique for measuring the knowledge flow of information\nand innovation, World Patent Information 51 (2017) 31–42.\n[21] K. Vowinckel, V. D. Hähnke, Searchformer: Semantic patent embeddings by siamese transformers for\nprior art search, World Patent Information 73 (2023) 102192.\n[22] L. Siddharth, G. Li, J. Luo, Enhancing patent retrieval using text and knowledge graph embeddings:\na technical note, Journal of Engineering Design 33 (8-9) (2022) 670–683.\n[23] X. Ni, A. Samet, D. Cavallucci, Similarity-based approach for inventive design solutions assistance,\nJournal of Intelligent Manufacturing (2021) 1–18.\n[24] X. Liu, Y. Wan, X. Liu, J. Zhang, A patent recommendation algorithm based on topic classification\nand semantic similarity, in: 2021 International Conference on Wireless Communications and Smart\nGrid (ICWCSG), IEEE, 2021, pp. 289–292.\nDecember 4, 2023\n[25] Y. Zhang, L. Shang, L. Huang, A. L. Porter, G. Zhang, J. Lu, D. Zhu, A hybrid similarity measure\nmethod for patent portfolio analysis, Journal of Informetrics 10 (4) (2016) 1108–1130.\n[26] S. Xu, J. Liu, D. Zhai, X. An, Z. Wang, H. Pang, Overlapping thematic structures extraction with\nmixed-membership stochastic blockmodel, Scientometrics 117 (2018) 61–84.\n[27] J. Yoon, K. Kim, Identifying rapidly evolving technological trends for r&d planning using sao-based\nsemantic patent networks, Scientometrics 88 (1) (2011) 213–228.\n[28] S. Arts, B. Cassiman, J. C. Gomez, Text matching to measure patent similarity, Strategic Management\nJournal 39 (1) (2018) 62–84.\n[29] H. Park, K. Kim, S. Choi, J. Yoon, A patent intelligence system for strategic technology planning,\nExpert Systems with Applications 40 (7) (2013) 2373–2390.\n[30] M. Schneider, Guidelines for bias-free writing, PbD Thesis, Indiana University, Bloomington, IN (1995).\n[31] J. O. Lanjouw, M. Schankerman, Patent quality and research productivity: Measuring innovation with\nmultiple indicators, The economic journal 114 (495) (2004) 441–465.\n[32] H. Touvron, L. Martin, K. Stone, P. Albert, A. Almahairi, Y. Babaei, N. Bashlykov, S. Batra,\nP. Bhargava, S. Bhosale, et al., Llama 2: Open foundation and fine-tuned chat models, arXiv preprint\narXiv:2307.09288 (2023).\n[33] A. V. Giczy, N. A. Pairolero, A. A. Toole, Identifying artificial intelligence (ai) invention: A novel ai\npatent dataset, The Journal of Technology Transfer 47 (2) (2022) 476–505.\nAuthor biography\nYongmin Yoo was born in 1991 in Busan, Republic of Korea. He received\na master’s degree in Industrial Engineering from Inha university, Korea.\nHe is currently a PhD candidate in University of Auckland, New Zealand.\nHe has experience working as a Natural Language Processing researcher at\nNHN, one of the biggest companies in Korea.\nHis research interests are\nin Technological Management, Data Mining, especially Text Mining, Deep\nLearning, Machine Learning and Natural Language Processing.\nCheonkam Jeong was born in 1990 in Seoul, Republic of Korea.\nShe\nearned both B.A. and M.A. degrees in English Linguistics from Hankuk\n(Korea) University of Foreign Studies in Seoul. She is currently a PhD can-\ndidate in Linguistics at the University of Arizona in the United States. She\nalso holds a M.S. degree in Human Language Technology, which was earned\nen route to her PhD. She has experience working as a Natural Language\nProcessing Engineer and Speech Specialist for several projects, one of which\nis sponsored by the U.S. Defense Advanced Research Projects Agency. Her research interests\nlie in Natural Language Processing and Automatic Speech Recognition/Synthesis.\nDecember 4, 2023\nSanguk Gim was born in 1991 in Changwon, Republic of Korea. He re-\nceived a bachelor’s degree in Psychology from Kyungnam University. He\nworked as a Data Analyst at NHN Diquest. He currently works at SR Uni-\nverse as a Deep Learning Engineer.\nHis research interests are in deep learning, machine learning and natural\nlanguage processing.\nJunwon Lee was born in 1988 in Gangwon, Republic of Korea. He received\na bachelor’s degree in Business Administration from Kookmin University.\nHe is currently studying for a master’s degree in Data Science at Royal\nMelbourne Institute of Technology, Melbourne, Australia. He has experience\nworking as a Field Incident Statistical Data Analyst at Group Renault, one\nof the biggest vehicle companies. His research interests include Data Mining,\nmore specifically Text mining.\nZachary Schimke was born in California in the United States.\nHe\nearned his B.S. in Mechanical Engineering from California State University\nNorthridge. He is currently a J.D. candidate at the University of Arizona\nJames E. Rogers College of Law. He has been a member of the School’s\nMock Trial and Patent Moot court teams. He is interested in Intellectual\nProperty as well as Patent Prosecution and Litigation.\nDeaho Seo was born in 1991 in Seoul, Republic of Korea. He received a B.S\ndegree in Information Systems and a M.S degree in Industrial Engineering\nfrom Hanyang University. He is a Ph.D candidate in School of Information,\nat Yonsei University. He has experience working as a Big Data rSsearcher\nat the Korea Advanced Institute of Science and Technology and the Korea\nElectronics Technology Institute. Currently, he is serving as the CEO of\nElesther.\nHis research interests include Text Mining, Vision-based Anomaly Detection,\nStart Factory, and E-commerce solution. He received the Best Young Entrepreneur Award\nfrom the Ministry of SMEs and Startups in Korea. He has published 8 books related to\nartificial intelligence and big data.\nDecember 4, 2023\n",
  "categories": [
    "cs.IR",
    "cs.AI",
    "cs.SI"
  ],
  "published": "2023-03-23",
  "updated": "2023-12-01"
}