{
  "id": "http://arxiv.org/abs/2304.11276v1",
  "title": "The Role of AI in Human-AI Creative Writing for Hong Kong Secondary Students",
  "authors": [
    "Hengky Susanto",
    "David James Woo",
    "Kai Guo"
  ],
  "abstract": "The recent advancement in Natural Language Processing (NLP) capability has\nled to the development of language models (e.g., ChatGPT) that is capable of\ngenerating human-like language. In this study, we explore how language models\ncan be utilized to help the ideation aspect of creative writing. Our empirical\nfindings show that language models play different roles in helping student\nwriters to be more creative, such as the role of a collaborator, a provocateur,\netc",
  "text": "THE ROLE OF AI IN HUMAN-AI CREATIVE WRITING \nThe manuscript has been published in International Council of Teachers of English (ICTE) Newsletter \n(Spring 2023). \n1\nThe Role of AI in Human-AI Creative Writing for Hong Kong \nSecondary Students \n \nHengky Susanto a, b, David James Woo c, and Kai Guo d \na University of Massachusetts Lowell Department of Computer Science, USA \nb Department of Science and Environmental Studies, The Education University of Hong Kong, Hong Kong, \nChina \nc Precious Blood Secondary School, Hong Kong, China \nd Faculty of Education, The University of Hong Kong, Hong Kong, China \n \n \nAbstract -- The recent advancement in Natural \nLanguage Processing (NLP) capability has led to \nthe development of language models (e.g., \nChatGPT) that is capable of generating human-\nlike language. In this study, we explore how \nlanguage models can be utilized to help the \nideation aspect of creative writing. Our empirical \nfindings show that language models play \ndifferent roles in helping student writers to be \nmore creative, such as the role of a collaborator, \na provocateur, etc.  \nKeywords: AI, NLP, creative writing, nature language \ngenerator \n \n1. Introduction \nSince the release of ChatGPT, this text \ngenerator \napplication \nwith \nartificial \nintelligence (AI) capability has taken the \nworld by storm because of its ability to \ngenerate human-like text. For this reason, this \napplication has raised many concerns among \neducators for its capability to facilitate \nacademic dishonesty, such as students using \nChatGPT to generate essays for assignments. \nHowever, at the same time, we also recognize \nits potential to be used for good, such as \nhelping non-native English speakers to \nenhance creative writing in English. \n2. Data Collection \nTo realize AI's capability to generate human-\nlike text as a learning tool, we first built and \nprototyped AI-based sentence generator tools \nusing free and open-source Natural Language \nProcessing (NLP) based libraries available \nfor the Python programing language, such as \nautoregressive language models (Radford et \nal., 2019) on which ChatGPT is based. In \nother words, our tools are capable of \ngenerating human-like, English language text \nat word, sentence and paragraph levels. \nImportantly, \nwe \nlaunched \nan \nEnglish \nlanguage creative writing contest for Hong \nKong secondary school students. Prior to the \ncompetition, students were given a workshop \nsession to learn about short story writing as \nwell as training on how to use the tools. Then, \nparticipating students utilized the tools to \nfacilitate idea generation for their creative \nwriting. Each student wrote a short story \nusing a mix of their own sentences and AI \ngenerated sentences together. At the end of \nthe competition, we asked the participating \nstudents to complete a post-contest survey.   \n3. Analysis Methodology \nWe analyzed students’ stories to address if \nand how the AI-based tools had helped the \ncreative aspect of students in completing \nTHE ROLE OF AI IN HUMAN-AI CREATIVE WRITING \nThe manuscript has been published in International Council of Teachers of English (ICTE) Newsletter \n(Spring 2023). \n2\ntheir task of writing a short story. To address \nthese questions, we employed a framework \ncomprising four categories of creativity \nproposed by Kaufman and Beghetto (2009). \nIn this “four C” model: “big C” refers to a \nlevel creativity leading to extraordinary \nachievements (for example, winning a Nobel \nPrize); “pro-C” refers to creativity at a \nprofessional level (for example, designer, \nprofessional \nmusician, \njournalist, \netc.), \n“little-C” is everyday creativity (for example, \ncooking, fixing broken items, etc.) or hobbies, \nand “mini-C” is creativity that are useful for \nlearning purposes (for example, identifying \nthe rules and constraints of a given domain \nlike math, music, writing, etc.). In our \nanalysis, we focus on the “mini-C” in the \ncontext of AI text generator contributions to \nstudents’ performance in creative writing. \nAt a fine-grain level, we analyzed the \nposition where AI-generated sentences were \nplaced within a basic paragraph structure, \ncomprising a topic sentence, supporting \ndetails, and a concluding sentence. This \nanalytical framework gave us specific \ninformation of how the AI-generated text has \ncontributed to the student’s writing process. \nFor example, the first sentence in a paragraph \nis often used to state the main idea or topic of \nthe paragraph. Thus, when a student decides \nto place the generated text in the beginning of \na paragraph, this is an indication that the \ngenerated text is used to trigger new ideas to \nbuild the storyline. At a broader level, we \nlooked at which paragraphs within a story use \nmore AI-generated sentences.  \n \n4. Findings and Discussion \nThrough analysis of the student’s writings \nfrom the competition, we observed that many \nof the students used AI-generated sentences \nfor their opening sentence of the first \nparagraph. This is an important finding \nbecause this indicates the AI text generator is \nused to give them a quicker or guided head \nstart. Secondly, AI-generated sentences are \nfrequently found in the beginning of a \nparagraph. For example, in some short stories, \na significant number of the paragraphs began \nwith AI-generated sentences. From these \nobservations, we may conclude that students \nfind the tools most useful to trigger new ideas \nto develop the story further. Our analysis of \npost-contest surveys affirmed this conclusion. \nFor example, the students found the tools \nhelpful in providing them with ideas as they \nwere writing their story. In sum, by using the \ntools to generate text for the beginning of the \nparagraphs, these students found the tools \nuseful for invoking new ideas or to find \ninspiration to develop the story plot.  \nFurthermore, we investigated the role(s) of \nthe tools in co-authoring the short story. To \nrealize this, we analyzed the surveys to \nunderstand the nature of student interactions \nwith the AI-based tools. We observed that \nsome students only selected the sentence or \nwords that fit her story narrative. These \nobservations suggest that the AI text \ngenerator plays the role of a “partner” in \nhelping them generate new ideas and develop \nthe story, which is also an approach to be \nmore creative (Osborn, 1963). One student \nmentioned in the survey that, “I chose the \nsentence generator to get ideas...to make my \nstory more interesting.” The student explored \nand “compared which tools would make the \nwriting better.” Similarly, some students \nfound the tools to be useful in helping them \nto locate words that express their thoughts \nmore accurately. Another student said, “First \nI would think of a single sentence about the \nwriting which is incomplete, then I would put \nit into the generator and let it do its work.” \nThis student used the tools to “find the words \nwhich make the writing better.”  \nOn the other hand, the AI-based sentence \ngenerator tools may play the role of a \nprovocateur, generating ideas which may not \nbe directly or obviously aligned with the \noriginal storyline. A student found it \nTHE ROLE OF AI IN HUMAN-AI CREATIVE WRITING \nThe manuscript has been published in International Council of Teachers of English (ICTE) Newsletter \n(Spring 2023). \n3\nchallenging to integrate the sentences \ngenerated by the tools into her storyline. In \nthe survey, this student wrote, “It’s difficult \nto write with my own words and the AI’s \nwords because if you have the story planned, \nthe AI might switch it up a bit, sometimes it \nmight help give you new ideas but I have a \nstrict plan with how I want the story to go…” \nIn this case, the student collaboration with the \nAI text generator can be an experience of \nforced association (Osborn, 1963), which is a \ncreative technique pairing random ideas \ntogether to provoke novel solutions. This \ntechnique is widely practiced to achieve \ninnovative solutions to certain problems.  \n \n5. Conclusion \nTo conclude, our empirical findings indicate \nthat students can utilize AI-based sentence \ngenerator tools like ChatGPT to trigger ideas \nto further develop a story. They also indicate \nthat different students can utilize the text \ngenerator differently in helping them to be \nmore creative in their writing, perhaps \ndepending on the student’s English language \nability. For some students, the tools are more \nof a partner, while for other students the tools \nhave played the role of a provocateur.   \nThese insights are crucial for our future work \nof using the AI-based sentence generator \ntools for learning and teaching creative \nwriting. We envision teachers can use these \ntools to specify the outputs from the language \nmodels to fit their teaching objectives and the \ndesired learning outcomes. In other words, \nthe teacher could customize the type and \nextent of help students get from the language \nmodels based on factors such as students’ \ngrade level, writing techniques, etc. Using \ntools in these ways may alleviate educators’ \nconcerns for AI-based sentence generator \ntools’ capability to facilitate academic \ndishonesty.  \n \nReferences \nOsborn, A.F. (1963). Applied imagination: \nPrinciples and procedures of creative \nproblem \nsolving. \n \nNew \nYork, \nNew \nYork: Charles Scribner's Sons. \n  \nKaufman, J. C., & Beghetto, R. A. (2009). \nBeyond big and little: The four c model of \ncreativity. Review of General Psychology, \n13(1), 1–12. \n  \nRadford, A., Wu, J., Child, R., Luan, D., \nAmodei, D., & Sutskever, I. (2019). \nLanguage \nModels \nare \nUnsupervised \nMultitask \nLearners. \nhttps://www.semanticscholar.org/paper/Lan\nguage-Models-are-Unsupervised-Multitask-\nLearners-Radford-\nWu/9405cc0d6169988371b2755e573cc2865\n0d14dfe  \n \n",
  "categories": [
    "cs.CL"
  ],
  "published": "2023-04-21",
  "updated": "2023-04-21"
}