{
  "id": "http://arxiv.org/abs/2304.02746v1",
  "title": "Sejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia: Tinjauan tentang sejarah, perkembangan teknologi, dan aplikasi NLP dalam bahasa Indonesia",
  "authors": [
    "Mukhlis Amien"
  ],
  "abstract": "This study provides an overview of the history of the development of Natural\nLanguage Processing (NLP) in the context of the Indonesian language, with a\nfocus on the basic technologies, methods, and practical applications that have\nbeen developed. This review covers developments in basic NLP technologies such\nas stemming, part-of-speech tagging, and related methods; practical\napplications in cross-language information retrieval systems, information\nextraction, and sentiment analysis; and methods and techniques used in\nIndonesian language NLP research, such as machine learning, statistics-based\nmachine translation, and conflict-based approaches. This study also explores\nthe application of NLP in Indonesian language industry and research and\nidentifies challenges and opportunities in Indonesian language NLP research and\ndevelopment. Recommendations for future Indonesian language NLP research and\ndevelopment include developing more efficient methods and technologies,\nexpanding NLP applications, increasing sustainability, further research into\nthe potential of NLP, and promoting interdisciplinary collaboration. It is\nhoped that this review will help researchers, practitioners, and the government\nto understand the development of Indonesian language NLP and identify\nopportunities for further research and development.",
  "text": "arXiv:2304.02746v1  [cs.CL]  28 Mar 2023\nSEJARAH DAN PERKEMBANGAN TEKNIK NATURAL LANGUAGE\nPROCESSING (NLP) BAHASA INDONESIA: TINJAUAN TENTANG\nSEJARAH, PERKEMBANGAN TEKNOLOGI, DAN APLIKASI NLP\nDALAM BAHASA INDONESIA\nMukhlis Amien\nSTIKI\nMalang\namien@stiki.ac.id\nABSTRACT\nThis study provides an overview of the history of the development of Natural Language Processing\n(NLP) in the context of the Indonesian language, with a focus on the basic technologies, meth-\nods, and practical applications that have been developed. This review covers developments in basic\nNLP technologies such as stemming, part-of-speech tagging, and related methods; practical applica-\ntions in cross-languageinformation retrieval systems, information extraction, and sentiment analysis;\nand methods and techniques used in Indonesian language NLP research, such as machine learning,\nstatistics-based machine translation, and conﬂict-based approaches. This study also explores the\napplication of NLP in Indonesian language industry and research and identiﬁes challenges and op-\nportunities in Indonesian language NLP research and development. Recommendations for future\nIndonesian language NLP research and development include developing more efﬁcient methods\nand technologies, expanding NLP applications, increasing sustainability, further research into the\npotential of NLP, and promoting interdisciplinary collaboration. It is hoped that this review will\nhelp researchers, practitioners, and the government to understand the development of Indonesian\nlanguage NLP and identify opportunities for further research and development.\nKeywords Indonesian NLP · Low Resource Language · Natural Language Processing · Survey of Indonesian NLP\n1\nPendahuluan\nPemrosesan Bahasa Alami (Natural Language Processing/NLP) telah menjadi bidang yang menarik dalam ilmu kom-\nputer dan kecerdasan buatan, yang memungkinkan komputer untuk memahami dan mengolah teks manusia dalam\nberbagai bahasa. Salah satu bahasa yang telah menarik perhatian peneliti adalah bahasa Indonesia, yang merupakan\nbahasa resmi negara dengan jumlah penduduk terbesar keempat di dunia. Dalam paper ini, kami akan mengulas\nsejarah dan perkembangan NLP dalam bahasa Indonesia, mulai dari teknologi dasar hingga aplikasi praktisnya.\nSeiring dengan perkembangan teknologi NLP, penelitian dalam bahasa Indonesia juga telah berkembang. Beberapa\nstudi awal meliputi pekerjaan Adriani et al. (2007) [1], yang mengusulkan pendekatan \"conﬁx-stripping\" untuk stem-\nming dalam bahasa Indonesia. Pada tahun 2014, Dinakaramani et al. [2], Kurniawan et al. (2018) [3] mengembangkan\npendekatan pembelajaran mesin untuk membangun sistem penanda part of speech (POS) dalam bahasa Indonesia.\nDalam beberapa tahun terakhir, aplikasi praktis NLP dalam bahasa Indonesia juga telah berkembang pesat. Sebagai\ncontoh, Sholikah et al. (2022) [4] mengimplementasikan sistem pencarian informasi lintas bahasa Indonesia-Inggris,\nIndonesia-Arab menggunakan terjemahan mesin berbasis statistik. Selain itu, Andriani et al. (2008) [5] menyajikan\ntinjauan umum tentang penelitian NLP dalam bahasa Indonesia, mencakup berbagai teknik dan aplikasi.\nSejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia\nDinakaramani et al. (2019) [6] menyelidiki kemajuan penelitian NLP dalam bahasa Indonesia serta aplikasi praktisnya\ndalam berbagai industri. Studi tersebut menyoroti pentingnya penelitian NLP dalam konteks bahasa Indonesia, yang\nmencakup penguasaan bahasa, ekstraksi informasi, dan analisis sentimen.\nMelalui tinjauan ini, kami berharap untuk memberikan gambaran umum tentang perkembangan dan pencapaian pent-\ning dalam NLP bahasa Indonesia. Dengan memahami sejarah dan kemajuan dalam bidang ini, kita dapat mengidenti-\nﬁkasi tantangan dan peluang yang ada dalam penelitian dan pengembangan NLP bahasa Indonesia di masa depan.\n1.1\nLatar belakang dan motivasi penelitian\nPemrosesan Bahasa Alami (NLP) merupakan cabang ilmu yang memungkinkan komputer untuk memahami, mengo-\nlah, dan menghasilkan teks dalam bahasa manusia. Perkembangan teknologi dalam beberapa dekade terakhir telah\nmemungkinkan kemajuan signiﬁkan dalam penelitian dan pengembangan NLP. Bahasa Indonesia, sebagai bahasa\nresmi di negara dengan jumlah penduduk terbesar keempat di dunia, menjadi subjek yang penting dalam penelitian\nNLP.\nLatar belakang penelitian ini melibatkan berbagai faktor. Pertama, bahasa Indonesia memiliki ciri khas yang unik jika\ndibandingkan dengan bahasa lain, termasuk struktur, morfologi, dan sintaksis. Kedua, peningkatan jumlah penutur\nbahasa Indonesia dan pertumbuhan ekonomi di Indonesia menuntut peningkatan teknologi dan aplikasi yang men-\ndukung pemrosesan bahasa alami dalam bahasa Indonesia. Ketiga, perkembangan teknologi digital dan internet telah\nmenciptakan sejumlah besar data teks dalam bahasa Indonesia yang perlu dianalisis dan diproses.\nMotivasi utama di balik penelitian ini adalah untuk menyediakan tinjauan komprehensif tentang sejarah dan perkem-\nbangan NLP bahasa Indonesia, termasuk teknologi dasar, metode, dan aplikasi praktis yang telah dikembangkan. Tin-\njauan ini akan menjadi sumber informasi bagi para peneliti, praktisi, dan pemerintah yang tertarik untuk memahami\nperkembangan NLP bahasa Indonesia dan mengidentiﬁkasi tantangan serta peluang yang ada dalam penelitian dan\npengembangan NLP bahasa Indonesia.\nDengan memahami latar belakang dan motivasi penelitian ini, kita dapat lebih memahami pentingnya mempelajari\nsejarah dan perkembangan NLP bahasa Indonesia serta mengidentiﬁkasi potensi aplikasi dan tantangan yang mungkin\ndihadapi dalam penelitian dan pengembangan NLP bahasa Indonesia.\n1.2\nTujuan dan Lingkup Penelitian\nTujuan utama penelitian ini adalah untuk menyajikan tinjauan komprehensif tentang sejarah, perkembangan teknologi,\ndan aplikasi NLP dalam konteks bahasa Indonesia. Dalam mencapai tujuan ini, penelitian ini akan mencakup beberapa\naspek penting terkait NLP bahasa Indonesia, termasuk:\n• Menyajikan gambaran umum mengenai teknologi dasar yang telah dikembangkan dalam penelitian NLP\nbahasa Indonesia, seperti stemming, part-of-speech tagging, dan metode lain yang relevan.\n• Menyelidiki aplikasi praktis NLP bahasa Indonesia yang telah diimplementasikan dalam industri dan peneli-\ntian, seperti sistem pencarian informasi lintas bahasa, ekstraksi informasi, analisis sentimen, dan lainnya.\n• Menggali metode dan teknik yang digunakan dalam penelitian NLP bahasa Indonesia, termasuk pembelajaran\nmesin, terjemahan mesin berbasis statistik, pendekatan berbasis konﬁks, dan lainnya.\n• Menyoroti aplikasi NLP dalam industri dan penelitian bahasa Indonesia, seperti penguasaan bahasa, ekstraksi\ninformasi, analisis sentimen, dan aplikasi lainnya.\n• Mengidentiﬁkasi tantangan dan peluang yang ada dalam penelitian dan pengembangan NLP bahasa Indone-\nsia, termasuk isu-isu terkait bahasa dan budaya, keberlanjutan penelitian dan pengembangan, serta kolaborasi\nantara peneliti, industri, dan pemerintah.\nLingkup penelitian ini mencakup sejarah dan perkembangan NLP bahasa Indonesia dari awal hingga saat ini, dengan\nfokus pada teknologi dasar, metode, dan aplikasi praktis yang telah dikembangkan. Penelitian ini tidak akan memba-\nhas secara detail mengenai algoritma atau teknik pemrograman yang digunakan dalam pengembangan metode NLP\ntersebut, namun akan memberikan referensi kepada sumber-sumber yang relevan bagi pembaca yang tertarik untuk\nmempelajari lebih lanjut tentang topik tersebut.\n2\nSejarah Perkembangan NLP Bahasa Indonesia\nSejarah perkembangan NLP bahasa Indonesia mencakup beberapa tahapan penting dalam evolusi teknologi dan ap-\nlikasinya. Dalam bab ini, kita akan membahas perkembangan teknologi dasar NLP dan aplikasi praktis yang telah\n2\nSejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia\nTable 1: Teknologi Dasar NLP untuk Bahasa Indonesia\nTeknologi\nDeskripsi\nStemming\nPenghilangan imbuhan untuk mendapatkan kata dasar\nPart-of-speech tagging\nPenandaan kelas kata dalam suatu kalimat (misal: kata benda, kata kerja)\nNamed Entity Recognition\nPengenalan entitas bernama seperti nama orang, organisasi, atau lokasi\nSentiment Analysis\nAnalisis sentimen atau emosi dalam teks\nWord Sense Disambiguation\nPenentuan makna kata dalam konteks kalimat\nSyntactic Parsing\nAnalisis struktur sintaksis dalam kalimat\nSemantic Role Labeling\nPenandaan peran semantik elemen dalam kalimat\ndihasilkan oleh penelitian NLP bahasa Indonesia. Tabel 1 menggambarkan beberapa teknologi dasar NLP yang telah\ndikembangkan untuk bahasa Indonesia, termasuk stemming, part-of-speech tagging, dan metode terkait. Penelitian\nini telah membuka jalan bagi berbagai aplikasi praktis yang membantu meningkatkan pemahaman kita tentang bahasa\nIndonesia dan memungkinkan mesin untuk berinteraksi lebih eﬁsien dengan teks dan data berbahasa Indonesia.\n2.1\nTeknologi Dasar NLP\nTeknologi dasar NLP bahasa Indonesia mencakup beberapa metode dan pendekatan yang telah dikembangkan oleh\npara peneliti sepanjang waktu. Dua contoh utama adalah:\n• Stemming: Adriani et al.\n(2007) [1] mengusulkan pendekatan conﬁx-stripping untuk stemming bahasa\nIndonesia. Pendekatan ini bertujuan untuk mengurangi kata ke bentuk dasarnya dengan menghilangkan\nimbuhan (awalan, sisipan, dan akhiran). Stemming adalah langkah penting dalam banyak aplikasi NLP,\nseperti pencarian informasi dan analisis sentimen, karena membantu mengurangi kompleksitas data teks dan\nmeningkatkan eﬁsiensi pemrosesan.\n• Part-of-speech tagging: Dinakaramani et al.\n(2014) [2], Kurniawan et al.\n(2018) [3] mengembangkan\npendekatan pembelajaran mesin untuk membangun sistem penanda part-of-speech (POS) bahasa Indonesia.\nPenanda POS bertujuan untuk mengidentiﬁkasi kategori gramatikal dari setiap kata dalam teks, seperti kata\nbenda, kata kerja, kata sifat, dan lainnya. Informasi POS ini berguna dalam berbagai aplikasi NLP, seperti\npemrosesan sintaksis dan analisis semantik.\n2.2\nAplikasi Praktis NLP\nTable 2: Aplikasi Praktis NLP untuk Bahasa Indonesia\nNo.\nAplikasi Praktis NLP\nKeterangan\nReferensi\n1\nSistem pencarian informasi lintas bahasa\nMeningkatkan pencarian dokumen berba-\nhasa Indonesia\n[4]\n2\nEkstraksi informasi\nMengidentiﬁkasi entitas dan hubungan\ndalam teks\n[6]\n3\nAnalisis sentimen\nKlasiﬁkasi opini dan emosi dalam teks\n[7],\n[8],\n[9],\n[10],\n[11], [12], [13], [14],\n[15], [16]\nSelama beberapa dekade terakhir, berbagai aplikasi praktis NLP bahasa Indonesia telah dikembangkan dan diimple-\nmentasikan dalam penelitian dan industri. Beberapa contoh termasuk sistem pencarian informasi lintas bahasa, ek-\nstraksi informasi, dan analisis sentimen, seperti yang dijelaskan dalam Tabel 2. Dalam bab ini, kita akan membahas\nperkembangan teknologi dasar NLP dan aplikasi praktis yang telah dihasilkan oleh penelitian NLP bahasa Indonesia,\nserta menjelajahi bagaimana aplikasi-aplikasi ini telah mempengaruhi dan meningkatkan pengolahan bahasa alami\ndalam berbagai sektor.\n• Sistem pencarian informasi lintas bahasa: Sholikah et al. (2022) [4] mengimplementasikan sistem pencarian\ninformasi lintas bahasa Indonesia-Inggris, Indonesia-Arab menggunakan terjemahan mesin berbasis statistik.\nSistem ini memungkinkan pengguna untuk mencari informasi dalam bahasa Indonesia dan menerima hasil\ndalam bahasa Inggris, dan sebaliknya, meningkatkan aksesibilitas informasi bagi penutur kedua bahasa.\n• Ekstraksi informasi dan analisis sentimen: Seperti pada tabel 2 ada banyak penelitian tentang topik ini yang\nmenyajikan tinjauan penelitian NLP bahasa Indonesia yang mencakup teknik dan aplikasi seperti ekstraksi\n3\nSejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia\ninformasi dan analisis sentimen. Ekstraksi informasi melibatkan identiﬁkasi dan penggalian informasi pent-\ning dari teks, seperti entitas yang diberi nama, hubungan, dan peristiwa. Analisis sentimen, di sisi lain, fokus\npada penggalian opini, emosi, dan penilaian dari teks.\n• Dinakaramani et al. (2019) [6] menyelidiki kemajuan penelitian NLP bahasa Indonesia dan aplikasi prak-\ntisnya dalam industri. Studi ini menyoroti penelitian NLP dalam konteks bahasa Indonesia yang mencakup\npenguasaan bahasa, ekstraksi informasi, analisis sentimen, dan aplikasi lainnya.\n3\nMetode dan Teknik NLP Bahasa Indonesia\nBerbagai metode dan teknik telah dikembangkan dan diaplikasikan dalam penelitian NLP bahasa Indonesia. Dalam\nbagian ini, kita akan membahas beberapa metode dan teknik utama yang telah digunakan dalam penelitian NLP bahasa\nIndonesia.\nTable 3: Metode dan Teknik NLP untuk Bahasa Indonesia\nNo.\nMetode dan Teknik\nReferensi\n1\nPembelajaran Mesin\n[2], [3]\n2\nTerjemahan Mesin Berbasis Statistik /SMT\n(Statistical Machine Translation)\n[17] [18] [19][20]\n3\nTerjemahan\nMesin\nBerbasis\nNeural\nNet/NMT (Neural Machine Translation)\n[16] [21]\n4\nPendekatan Berbasis Konﬁks\n[1] [5]\n3.1\nPembelajaran Mesin\nPembelajaran mesin merupakan pendekatan yang penting dalam penelitian NLP bahasa Indonesia. Dinakaramani et al.\n(2014) [2], Kurniawan et al. (2018) [3] menggabungkan pendekatan pembelajaran mesin dalam pengembangan sistem\npenanda part-of-speech (POS) bahasa Indonesia. Metode pembelajaran mesin memungkinkan sistem untuk belajar\ndari data teks yang telah dianotasi, sehingga meningkatkan kinerja sistem dalam mengidentiﬁkasi kategori gramatikal\nkata dalam teks baru. Selain itu, pembelajaran mesin juga digunakan dalam pengembangan sistem ekstraksi informasi,\nanalisis sentimen, dan berbagai aplikasi NLP lainnya.\n3.2\nTerjemahan Mesin Berbasis Statistik\nTerjemahan mesin berbasis statistik merupakan pendekatan yang efektif dalam sistem terjemahan antar bahasa. Seperti\npada tabel 3 beberapa peneliti mengimplementasikan terjemahan mesin berbasis statistik dalam sistem pencarian in-\nformasi lintas bahasa Indonesia-Inggris. Pendekatan ini melibatkan pembelajaran model probabilitas dari data teks\nparalel (teks dalam dua bahasa yang telah diterjemahkan secara manual) untuk menghasilkan terjemahan yang aku-\nrat dari teks sumber ke teks target. Terjemahan mesin berbasis statistik telah menunjukkan kinerja yang baik dalam\naplikasi NLP bahasa Indonesia dan bahasa lainnya.\n3.3\nTerjemahan Berbasis NMT\nTerjemahan mesin berbasis Neural Machine Translation (NMT) merupakan pendekatan terbaru dalam sistem terjema-\nhan mesin. Pendekatan ini melibatkan penggunaan jaringan saraf untuk mempelajari model terjemahan dari data teks\nparalel (Bahasa Inggris-Indonesia). Seperti pada tabel 3 penelitian dibidang ini telah menunjukkan bahwa pendekatan\nterjemahan berbasis NMT memiliki kinerja yang lebih baik dibandingkan dengan pendekatan berbasis statistik pada\ntugas terjemahan Bahasa Inggris-Indonesia. Pendekatan terjemahan berbasis NMT telah menunjukkan kinerja yang\nbaik dalam beberapa aplikasi NLP bahasa Indonesia, seperti tugas pemodelan bahasa dan pemrosesan wacana.\n3.4\nPendekatan Berbasis Konﬁks\nPendekatan berbasis konﬁks telah digunakan dalam penelitian NLP bahasa Indonesia untuk mengatasi tantangan yang\nterkait dengan struktur morfologi bahasa. Adriani et al. (2007) [1] mengusulkan pendekatan conﬁx-stripping un-\ntuk stemming bahasa Indonesia. Pendekatan ini melibatkan identiﬁkasi dan penghapusan imbuhan (awalan, sisipan,\ndan akhiran) dari kata untuk mengurangi kata ke bentuk dasarnya. Pendekatan berbasis konﬁks telah digunakan\ndalam berbagai aplikasi NLP bahasa Indonesia, seperti sistem pencarian informasi dan analisis sentimen, untuk\nmeningkatkan eﬁsiensi pemrosesan teks dan mengurangi kompleksitas data.\n4\nSejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia\n4\nAplikasi NLP dalam Industri dan Penelitian Bahasa Indonesia\nAplikasi NLP telah membantu dalam mengatasi berbagai tantangan dalam pemrosesan teks bahasa Indonesia dan telah\ndiimplementasikan dalam industri dan penelitian. Berikut ini beberapa contoh aplikasi NLP dalam konteks bahasa\nIndonesia:\n4.1\nPenguasaan Bahasa\nDinakaramani et al. (2019) menyelidiki kemajuan dalam penelitian NLP bahasa Indonesia dan aplikasi praktisnya\ndalam industri. Salah satu aplikasi yang ditemukan adalah dalam bidang penguasaan bahasa. NLP digunakan untuk\nmembantu pemahaman teks bahasa Indonesia dan untuk menghasilkan teks yang lebih baik dalam bahasa tersebut.\nBeberapa teknologi yang dikembangkan dalam konteks ini meliputi sistem pengecekan ejaan, tata bahasa, dan mesin\nterjemahan.\n4.2\nEkstraksi Informasi\nRakhmawati (2012) menyajikan tinjauan penelitian NLP bahasa Indonesia yang mencakup teknik dan aplikasi ek-\nstraksi informasi. Ekstraksi informasi melibatkan pengidentiﬁkasian dan penggalian informasi yang relevan dari teks\nyang tidak terstruktur. Beberapa aplikasi dalam konteks ini meliputi sistem pencarian informasi, pengenalan entitas\nbernama, dan sistem rekomendasi. Teknologi ini telah digunakan dalam berbagai sektor industri, seperti perbankan,\npemerintahan, dan media.\n4.3\nAnalisis Sentimen\nDinakaramani et al. (2019) juga menyoroti penelitian NLP bahasa Indonesia dalam analisis sentimen. Analisis sen-\ntimen adalah teknik yang digunakan untuk mengidentiﬁkasi dan mengkategorikan opini, emosi, dan sikap yang diek-\nspresikan dalam teks. Aplikasi analisis sentimen dalam konteks bahasa Indonesia meliputi penilaian produk, layanan\npelanggan, dan pemantauan opini publik di media sosial. Beberapa metode yang telah digunakan untuk analisis senti-\nmen dalam bahasa Indonesia meliputi pembelajaran mesin dan pendekatan berbasis kamus.\n5\nTantangan dan Peluang Penelitian Pengembangan NLP Bahasa Indonesia\nMeskipun telah ada kemajuan dalam penelitian dan pengembangan NLP untuk bahasa Indonesia, masih banyak tan-\ntangan dan peluang yang dapat dijelajahi. Berikut ini beberapa tantangan dan peluang dalam konteks NLP bahasa\nIndonesia:\n5.1\nIsu-isu terkait Bahasa dan Budaya\nSalah satu tantangan utama dalam pengembangan NLP bahasa Indonesia adalah mengatasi isu-isu terkait bahasa dan\nbudaya. Bahasa Indonesia memiliki struktur morfologi, sintaksis, dan semantik yang unik, yang memerlukan pen-\ndekatan khusus dalam pengembangan teknologi NLP. Selain itu, variasi bahasa dan dialek yang digunakan di berbagai\ndaerah di Indonesia juga menambah kompleksitas dalam penelitian dan pengembangan NLP.\n5.2\nKeberlanjutan Penelitian dan Pengembangan\nKeberlanjutan penelitian dan pengembangan NLP untuk bahasa Indonesia sangat penting untuk memastikan bahwa\nteknologi ini dapat terus diperbarui dan ditingkatkan. Hal ini mencakup pengembangan korpus data dan sumber daya\nlinguistik, serta peningkatan kolaborasi antara peneliti, industri, dan pemerintah. Penelitian dan pengembangan yang\nberkelanjutan juga akan membantu dalam mengatasi tantangan yang muncul seiring dengan perubahan teknologi dan\nkebutuhan pasar.\n5.3\nKolaborasi antara Peneliti, Industri, dan Pemerintah\nKolaborasi antara peneliti, industri, dan pemerintah sangat penting untuk memastikan bahwa teknologi NLP bahasa\nIndonesia dapat dikembangkan dan diimplementasikan dengan sukses. Kolaborasi ini akan memungkinkan peneliti\nuntuk memahami kebutuhan industri dan pemerintah, serta membantu dalam pengembangan solusi NLP yang inovatif\ndan efektif. Selain itu, kolaborasi ini akan membantu dalam penyebaran teknologi NLP di berbagai sektor dan dalam\nmeningkatkan kesadaran tentang pentingnya NLP dalam konteks bahasa Indonesia.\n5\nSejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia\n6\nKesimpulan\n6.1\nRingkasan Temuan Utama:\nStudi ini telah memberikan tinjauan tentang sejarah perkembangan NLP untuk bahasa Indonesia, dengan fokus pada\nteknologi dasar, metode, dan aplikasi praktis yang telah dikembangkan. Beberapa temuan utama dari tinjauan ini\nmeliputi:\n• Perkembangan teknologi dasar NLP untuk bahasa Indonesia, seperti stemming, part-of-speech tagging, dan\nmetode lainnya, yang telah menjadi dasar bagi aplikasi NLP yang lebih kompleks.\n• Aplikasi praktis NLP dalam konteks bahasa Indonesia, seperti sistem pencarian informasi lintas bahasa, ek-\nstraksi informasi, dan analisis sentimen.\n• Metode dan teknik yang digunakan dalam penelitian NLP bahasa Indonesia, termasuk pembelajaran mesin,\nterjemahan mesin berbasis statistik, dan pendekatan berbasis konﬁks.\n• Aplikasi NLP dalam industri dan penelitian bahasa Indonesia, termasuk penguasaan bahasa, ekstraksi infor-\nmasi, dan analisis sentimen.\nTantangan dan peluang dalam penelitian dan pengembangan NLP untuk bahasa Indonesia, termasuk isu-isu terkait\nbahasa dan budaya, keberlanjutan penelitian dan pengembangan, serta kolaborasi antara peneliti, industri, dan pemer-\nintah.\n6.2\nImplikasi dan Rekomendasi untuk Penelitian dan Pengembangan NLP Bahasa Indonesia di Masa Depan:\nBerdasarkan temuan ini, beberapa implikasi dan rekomendasi untuk penelitian dan pengembangan NLP bahasa In-\ndonesia di masa depan meliputi:\n• Mengembangkan metode dan teknologi NLP yang lebih eﬁsien dan efektif yang dapat mengatasi tantangan\nyang unik dari bahasa dan budaya Indonesia.\n• Memperluas aplikasi NLP untuk mencakup berbagai sektor dan industri, seperti pemerintahan, pendidikan,\ndan layanan kesehatan, untuk memaksimalkan dampak positif teknologi ini.\n• Meningkatkan keberlanjutan penelitian dan pengembangan NLP bahasa Indonesia melalui pengembangan\nkorpus data dan sumber daya linguistik yang lebih luas, serta melalui kolaborasi yang lebih erat antara peneliti,\nindustri, dan pemerintah.\n• Melakukan lebih banyak penelitian untuk menggali potensi NLP dalam konteks bahasa Indonesia, seperti\ndalam pemrosesan bahasa ganda atau multibahasa, dan eksplorasi interaksi antara NLP dan teknologi lain,\nseperti pengenalan suara atau teknologi visual.\n• Mempromosikan penelitian interdisipliner dan kolaborasi untuk mengatasi tantangan yang kompleks dan\nmenciptakan solusi inovatif dalam pengembangan NLP bahasa Indonesia.\nDengan mempertimbangkan implikasi dan rekomendasi ini, diharapkan penelitian dan pengembangan NLP bahasa\nIndonesia akan terus berkembang dan memberikan manfaat yang signiﬁkan bagi masyarakat dan industri di masa\ndepan.\nReferences\n[1] Mirna Adriani, Jelita Asian, Bobby Nazief, Seyed MM Tahaghoghi, and Hugh E Williams. Stemming indonesian:\nA conﬁx-stripping approach. ACM Transactions on Asian Language Information Processing (TALIP), 6(4):1–33,\n2007.\n[2] Arawinda Dinakaramani, Fam Rashel, Andry Luthﬁ, and Ruli Manurung. Designing an indonesian part of speech\ntagset and manually tagged indonesian corpus. In 2014 International Conference on Asian Language Processing\n(IALP), pages 66–69, 2014.\n[3] Kemal Kurniawan and Alham Fikri Aji. Toward a standardized and more accurate indonesian part-of-speech\ntagging. In 2018 International Conference on Asian Language Processing (IALP), pages 303–307. IEEE, 2018.\n[4] Rizka W Sholikah, Agus Z Ariﬁn, Chastine Fatichah, and Ayu Purwarianti. Multi task learning with general\nvector space for cross-lingual semantic relation detection. Journal of King Saud University-Computer and Infor-\nmation Sciences, 34(5):2161–2169, 2022.\n6\nSejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia\n[5] Mirna Adriani and Ruli Manurung. A survey of bahasa indonesia nlp research conducted at the university of\nindonesia. In Proceedings of the 2nd International MALINDO Workshop, pages 12–13. Citeseer, 2008.\n[6] Arawinda Dinakaramani and Totok Suhardijanto. Building a web-based application for language resources in\nindonesia. In Journal of Physics: Conference Series, volume 1192, page 012022. IOP Publishing, 2019.\n[7] Fajri Koto and Gemala Y. Rahmaningtyas. Inset lexicon: Evaluation of a word list for indonesian sentiment\nanalysis in microblogs. In 2017 International Conference on Asian Language Processing (IALP), pages 391–\n394, 2017.\n[8] Ichwanul Muslim Karo Karo, Mohd Farhan Md Fudzee, Shahreen Kasim, and Azizul Azhar Ramli. Sentiment\nanalysis in karonese tweet using machine learning. Indonesian Journal of Electrical Engineering and Informatics\n(IJEEI), 10(1):219–231, 2022.\n[9] Arﬁnda Ilmania, Abdurrahman, Samuel Cahyawijaya, and Ayu Purwarianti. Aspect detection and sentiment\nclassiﬁcation using deep neural network for indonesian aspect-based sentiment analysis. In 2018 International\nConference on Asian Language Processing (IALP), pages 62–67, 2018.\n[10] Annisa Nurul Azhar, Masayu Leylia Khodra, and Arie Pratama Sutiono. Multi-label aspect categorization with\nconvolutional neural networks and extreme gradient boosting. In 2019 International Conference on Electrical\nEngineering and Informatics (ICEEI), pages 35–40, 2019.\n[11] Fajri Koto and Ikhwan Koto. Towards computational linguistics in Minangkabau language: Studies on sentiment\nanalysis and machine translation. In Proceedings of the 34th Paciﬁc Asia Conference on Language, Information\nand Computation, pages 138–148, Hanoi, Vietnam, October 2020. Association for Computational Linguistics.\n[12] Fajri Koto, Afshin Rahimi, Jey Han Lau, and Timothy Baldwin. IndoLEM and IndoBERT: A benchmark dataset\nand pre-trained language model for Indonesian NLP. In Proceedings of the 28th International Conference on\nComputational Linguistics, pages 757–770, Barcelona, Spain (Online), December 2020. International Committee\non Computational Linguistics.\n[13] Ayu Purwarianti and Ida Ayu Putu Ari Crisdayanti. Improving bi-lstm performance for indonesian sentiment\nanalysis using paragraph vector. In 2019 International Conference of Advanced Informatics: Concepts, Theory\nand Applications (ICAICTA), pages 1–5, 2019.\n[14] C Tho, Y Heryadi, L Lukas, and A Wibowo. Code-mixed sentiment analysis of indonesian language and javanese\nlanguage using lexicon based approach. Journal of Physics: Conference Series, 1869(1):012084, apr 2021.\n[15] Wilson Wongso, David Samuel Setiawan, and Derwin Suhartono. Causal and masked language modeling of\njavanese language using transformer-based architectures. In 2021 International Conference on Advanced Com-\nputer Science and Information Systems (ICACSIS), pages 1–7, 2021.\n[16] Genta Indra Winata, Alham Fikri Aji, Samuel Cahyawijaya, Rahmad Mahendra, Fajri Koto, Ade Romadhony,\nKemal Kurniawan, David Moeljadi, Radityo Eko Prasojo, Pascale Fung, Timothy Baldwin, Jey Han Lau, Rico\nSennrich, and Sebastian Ruder. Nusax: Multilingual parallel sentiment dataset for 10 indonesian local languages,\n2022.\n[17] Zaenal Abidin, I Ahmad, et al. Effect of mono corpus quantity on statistical machine translation indonesian–\nlampung dialect of nyo. In Journal of Physics: Conference Series, volume 1751, page 012036. IOP Publishing,\n2021.\n[18] Mohammad Anugrah Sulaeman and Ayu Purwarianti. Development of indonesian-japanese statistical machine\ntranslation using lemma translation and additional post-process. In 2015 International conference on electrical\nengineering and informatics (ICEEI), pages 54–58. IEEE, 2015.\n[19] HS Simon and Ayu Purwarianti. Experiments on indonesian-japanese statistical machine translation. In 2013\nIEEE international conference on computational intelligence and cybernetics (CYBERNETICSCOM), pages 80–\n84. IEEE, 2013.\n[20] Permata Permata and Zaenal Abidin. Statistical machine translation pada bahasa lampung dialek api ke bahasa\nindonesia. Jurnal Media Informatika Budidarma, 4(3):519–528, 2020.\n[21] Samuel Cahyawijaya, Genta Indra Winata, Bryan Wilie, Karissa Vincentio, Xiaohong Li, Adhiguna Kuncoro, Se-\nbastian Ruder, Zhi Yuan Lim, Syafri Bahar, Masayu Leylia Khodra, Ayu Purwarianti, and Pascale Fung. Indonlg:\nBenchmark and resources for evaluating indonesian natural language generation, 2021.\n7\n",
  "categories": [
    "cs.CL",
    "68T50",
    "I.2.7"
  ],
  "published": "2023-03-28",
  "updated": "2023-03-28"
}