{
  "id": "http://arxiv.org/abs/2306.09737v2",
  "title": "Using Natural Language Processing and Networks to Automate Structured Literature Reviews: An Application to Farmers Climate Change Adaptation",
  "authors": [
    "Sofia Gil-Clavel",
    "Tatiana Filatova"
  ],
  "abstract": "The fast-growing number of research articles makes it problematic for\nscholars to keep track of the new findings related to their areas of expertise.\nFurthermore, linking knowledge across disciplines in rapidly developing fields\nbecomes challenging for complex topics like climate change that demand\ninterdisciplinary solutions. At the same time, the rise of Black Box types of\ntext summarization makes it difficult to understand how text relationships are\nbuilt, let alone relate to existing theories conceptualizing cause-effect\nrelationships and permitting hypothesizing. This work aims to sensibly use\nNatural Language Processing by extracting variables relations and synthesizing\ntheir findings using networks while relating to key concepts dominant in\nrelevant disciplines. As an example, we apply our methodology to the analysis\nof farmers' adaptation to climate change. For this, we perform a Natural\nLanguage Processing analysis of publications returned by Scopus in August 2022.\nResults show that the use of Natural Language Processing together with networks\nin a descriptive manner offers a fast and interpretable way to synthesize\nliterature review findings as long as researchers back up results with theory.",
  "text": "Using Natural Language Processing and\nNetworks to Automate Structured Literature\nReviews: An Application to Farmers Climate\nChange Adaptation\nSofia Gil-Clavel1[0000−0003−4707−849X] and\nTatiana Filatova1[0000−0002−3546−6930]\nFaculty of Technology, Policy and Management,\nDelft University of Technology, The Netherlands\n{B.S.GilClavel,T.Filatova}@tudelft.nl\nAbstract. The fast-growing number of research articles makes it prob-\nlematic for scholars to keep track of the new findings related to their areas\nof expertise. Furthermore, linking knowledge across disciplines in rapidly\ndeveloping fields becomes challenging for complex topics like climate\nchange that demand interdisciplinary solutions. The rise of machine-\nlearning-supported text analysis has been instrumental in processing\nthousands of articles. Yet, how text relationships are built remains a\nBlack-Box for domain experts, making it difficult to relate connected\nconcepts to existing theories conceptualizing cause-effect relationships\nand permitting hypothesis building and testing. This paper presents an\napproach to sensibly use Natural Language Processing by extracting vari-\nable relations and synthesizing their findings using networks while relat-\ning to key concepts dominant in relevant disciplines. As an example,\nwe apply our methodology to analyze farmers’ adaptation to climate\nchange and compare the results with mainstream text summarization\nmethods. Furthermore, we validate our methodology by asking experts\nto score and compare the outcomes. Results show that using Natural\nLanguage Processing and networks descriptively offer an interpretable\nway to synthesize literature review findings that outperform mainstream\ntext summarization methods. This methodology gives not only the direc-\ntion and the frequency of the association between the words but also the\nfrequency the word appears in the articles, which is instrumental when\nperforming literature reviews.\nKeywords: Natural Language Processing · Networks · Literature Re-\nview · Interpretative\n1\nIntroduction\nThe fast expansion of research articles hinders researchers from keeping track of\nthe emerging findings in their areas of expertise [51]. While systematic literature\nreviews are labor-intensive, the median time for them to go outdated is 5.5 years\narXiv:2306.09737v2  [cs.CL]  3 Jul 2024\n2\nS. Gil-Clavel and T. Filatova\n[72]. Given the current pace of publishing, it is increasingly challenging to cover\nthe escalating pool of articles and to monitor the latest developments in a par-\nticular field. Automated content analysis [62] and extractive text summarization\nsystems [21] have been argued as key tools to support literature synthesis and\nto keep track of research trends.\nAutomated content analysis for literature reviews commonly aims to map\ntext into topics using the articles’ abstracts. Nunez-Mir et al. [62] show how\nautomated content analysis can synthesize big volumes of literature’s abstracts\nfrom ecology and evolutionary biology. In the climate change domain, Creutzig\net al. [26] use machine learning and experts evaluations to map key messages\nrelevant to climate change mitigation using around 100,000 articles’ abstracts\nrelated to demand-side mitigation. Regarding climate change adaptation, Nalau\net al. [56] use the abstracts and metadata from around 7000 articles to map the\nevolution of climate change adaptation science across time.\nText summarization systems are normally used for more in-depth literature\nreviews that use the full articles’ text. In this context, a summarization system\ntakes a predefined set of documents and generates a summary, which can be ex-\ntractive (the system extracts and ranks the sentences from the original text), ab-\nstractive (the system extracts knowledge from the original text and reconstructs\nthem into a new piece), or hybrid (combines both approaches by rewriting a\nsummary of the sentences chose with the extractive approach) [49,80,12]. Wang\net al. [80] offers a systematic review of the different methodologies for Electronic\nHealth Records and biomedical literature summarizations. Based on their sys-\ntematic review, 83% of the articles analyzed used at least the full text as input.\nAs summary output, 81% of the articles adopted an extractive approach, while\n17% of the articles used an abstractive approach – the remaining 2% compared\nboth outputs.\nHowever, automated content analysis and extractive text summarization sys-\ntems stem from machine learning and deep learning methodologies. These ap-\nproaches are often referred to as a ‘Black-Box’ because they make it difficult to\ntheorize based on their results and to understand how text relationships are built\n[17,67]. As they tend to rank and re-organize the text, they hinder interpretation\nby domain expert. On the one hand, this hinders the understanding of the role\nof the extracted piece in the sentence and possible causal relationships explained\nin the text [49,80]. On the other hand, they might contain redundant informa-\ntion, which may result in a deficiency of information [49,80,12]. Furthermore,\nthese methodologies can be opaque [49,22], in terms of what text features the\nalgorithm relied on to perform classifications. This leads to calls to stop using\nBlack-Box methodologies in favor of interpretable algorithms [67] grounded in\ntheory and that use tailored databases, as opposed to trained over all the data\nfound in the web [17].\nIn this work, we argue that using Natural Language Processing (NLP) de-\nscriptively (as opposed to predictively) offers interpretable methodologies to per-\nform literature reviews when the results are sensibly visualized using networks.\nNLP is a range of computational techniques whose main goal is to provide ma-\nUsing NLP and Networks for Literature Reviews\n3\nchines with the capability to understand natural language by understanding its\nsemantics. This means that “the machine understand[s] not just the statisti-\ncal properties but also the meaning and context of, say, a certain word” [46,\np.2]. At the same time, in its simplest form, a network is a collection of points\n(nodes) joined together in pairs by lines (edges). In research, many systems can\nbe represented as networks, for example, the internet, social interactions, and\ncollections of computers. Network analysis can uncover system patterns through\ntheir different structures, properties, and metrics [60].\nThe combination of NLP and networks to summarize text is not new. In\ntheir pioneering work, Shojania et al. [72] use NLP and networks to generate vi-\nsual overviews of unstructured text from novels and blogs to investigate different\nresearch questions, such as “Who was involved in the debate about competing\nscientific ideas?” In more recent work, Sofoluwe et al. [73] use NLP and networks\nto provide insights on policy and scientific discourse around Sustainable Devel-\nopment Goals. In their network, they use NLP to identify topics in the text and\nthen build the network using nodes to represent the topics and edge weights to\nrepresent the cosine similarity between the topics. However, to our knowledge,\nnetworks have not been used to generate visual overviews of articles’ findings to\nperform literature reviews.\nIn this work, we propose a methodology based on NLP and network visual-\nization to summarize articles’ findings in a descriptive and interpretable man-\nner. In the rest of the article, first, we introduce our NLP-supported literature\nreview algorithm. Second, we demonstrate its utility by applying it to an arti-\ncles’ database about farmers’ climate change adaptation. Third, we explain the\nlogic behind the network visualization and use it to visualize the results from\nthe NLP-supported literature review. Fourth, we compare and validate the algo-\nrithm against results from text summarization systems by asking climate change\nexperts to score the outcomes. Lastly, we draw the conclusions and finalize with\nthe limitations and future work.\n2\nMethodology\nThis section introduces our NLP-supported literature review algorithm while\napplying it to the articles’ database. The articles’ database focuses on drivers of\nfarmers’ adaptation to climate change. In the literature, there are some reviews\non what the agricultural farmers’ adaptation measures are [10,15,70] and what\nmotivates farmers to adapt [28]. Therefore, we apply our methodology to 43 of\nthe 47 articles1 used by Dang et al. [28] for their Literature Review (Table 4,\nAppendix A). This way, we can use Dang’s et al. [28]’s findings as our gold stan-\ndard when comparing and validating the results from our methodology against\nsummarization methods.\n1 We did not have access to or could not find four of the articles.\n4\nS. Gil-Clavel and T. Filatova\n2.1\nGeneral Overview of the Algorithm\nWe build upon Bui et al. [21] extractive text summarization system to perform\nthe NLP-supported systematic literature review. In this work, we followed Bui’s\net al. [21] first six steps and, at the end, introduced four new ones (Fig. 1): 1) PDF\nText Extraction; 2) Text Classification and Filtering; 3) Text Normalization; 4)\nIMRAD Context Detection; 5) Sentence Segmentation; 6) Sentence Filtering;\n7) Findings Extraction; 8) Sentences Split; 9) Verbs Categorization; and 10)\nNetwork Visualization. In the following paragraphs, we further explain each step\nfrom Fig. 1 while using the data from our application as an example.\nFig. 1: Flow chart diagram presenting our algorithm based on Bui et al. [21].\nBoxes with bold text signal the novel steps added in the framework presented\nhere.\nFirst, PDF Text Extraction, as the name hints, transforms the pdf file into\nplain text. For this, we used the Python package pdfminer.six [41]. The result\nof this step is a data frame where the rows are the articles, and the columns are\nthe articles’ names and their cleaned plain text. Second, Text Classification and\nFiltering categorizes the extracted information into title, abstract, body text,\nsemi-structure, and metadata. For this, we transformed the articles’ metadata\n(doi, title, abstract, authors, etc.) into a data frame where the rows are the\narticles and the columns are the articles’ metadata values by article. Then, we\nmerged this with the cleaned plain text database from the previous step. This\nresulted in a single database with all the metadata and text by article.\nThird, Text Normalization means transforming the text into canonical form.\nFor this, we cleaned the data using regular expressions to remove: non-ASCII\ncharacters, URLs, and in-text references, such as “(NAME, YEAR)” and “et al.\nUsing NLP and Networks for Literature Reviews\n5\n(YEAR).” We also used regular expressions to remove all the strings that referred\nto the journal’s information and copyrights. Besides this, we used the Spacy\ncomponent AbbreviationDetector, from the scispacy package [45], and the\npython package neuralcoref [1]. AbbreviationDetector detects and expands\nall text abbreviations and neuralcoref substitutes any ambiguous expressions,\nsuch as pronouns, with the real-world entities they are referring to. Fourth,\nIMRAD Context Detection assigns text snippets into standard scientific articles’\ncategories named IMRAD. IMRAD stands for Introduction, Methods, Results,\nand Discussion [75]. For this, we implemented an algorithm to split the articles’\ncleaned plain text into the IMRAD categories. Each of these sections was saved\nas a new independent column in the database.\nFifth, Sentence Segmentation involves tokenizing the sentences’ elements.\nHere, we used the python package spaCy [76] to tokenize the sentences and to\nextract the Parts-Of-Speech of each of the articles’ sections. Specifically, we used\nthe scispacy model en core sci lg [59]. Sentence Filtering involves filtering\nout irrelevant information. In our work, this translated into keeping the columns\nabstract, findings, conclusions, and discussions, from which we will extract all\nthe sentences where the findings are referred to, as explained in step seven.\nSteps seven to ten comprise the contribution of this work (Fig. 2). Step seven\ncorresponds to Findings Identification. For this, we used Bidirectional Encoder\nRepresentations from Transformers (BERT) sentence embedding [32,31], which\ntransforms each sentence into a numerical vector that later could be classified\nas part of the article’s findings by comparing them against the embedding from\nthree different prompts2. From here, we classified a sentence as a finding if it had\nan average dot-product equal to or bigger than 0.5, implying the sentences are\nsimilar. Step eight corresponds to Sentences Split. It detects the subject and ob-\njects connected by the verbs (Figure 3a). For this, we used the Parts-Of-Speech\nreturned in step five. Once the sentences are split into three parts (i.e., subject,\nverb, and object), we homogenize and simplify the information. Homogenizing\nmeans that any time we found subjects or objects that conveyed the same by\nmeans of permuting the words, e.g. “climate change adaptation” or “adaptation\nclimate change”, then those sections would be set to the permutation that ap-\npeared more often in the findings. Simplifying refers to extracting the subject’s\nand object’s words that are more likely to be the central information. For exam-\nple, after all the steps, a sentence would be “well access market extension help\nafrican farmer adapt climate change”, this sentence would be split into: subject–\n“well access market extension”; verb– “help”; and object– “african farmer adapt\nclimate change”. The subject and object central terms would be “access mar-\nket” and “adapt climate change”, respectively. Therefore, to extract the central\nterms, we built a function to find the more likely words to appear and to appear\ntogether with other words. For this, we use TfidfVectorizer from the package\nsklearn [2]. Homogenizing and simplifying are important because, otherwise,\n2 1) What are the factors associated with adaptation?; 2) What are the drivers of\nadaptation?; and 3) What are the constraints of adaptation?\n6\nS. Gil-Clavel and T. Filatova\nthe network visualization consists of too many different nodes that are difficult\nto read and interpret.\nFig. 2: Workflow chart diagram\nFor step nine, Verbs Categorization, we built a dictionary of the verbs com-\nmonly used in describing findings. We created a sorted database with all the\nverbs found in the sentences from step six. Afterward, we read a random sam-\nple of ten sentences for each verb to categorize the verb as positive, negative,\nneutral, dependent, or none. Positive means that the verb denotes a positive\nrelation, e.g., increase, improve, enhance. Negative refers to a verb that denotes\na negative association, e.g., reduce, prevent, constrain. Neutral denotes an undi-\nrected association, for example, relate, link, associate. Dependent refers to those\nverbs that require more information to indicate a possible association and di-\nrection. For example, “have” could denote a positive association if the following\nwords contain the word positive (e.g., have a positive correlation) and a nega-\ntive association if the following words contain the word negative (e.g., have a\nnegative association). Other verbs in this category are affect, influence, show,\netc. However, we assign the verb’s sign as positive or negative once these verbs\nare identified based on the extra information. Finally, none refers to those verbs\nthat do not denote an association between the words, such as adopt, cope, and\nimplement. Appendix B shows the complete list of verbs categorized as positive,\nnegative, and dependent.\nFinally, step ten corresponds to Network Visualization. Our implicit assump-\ntion is that the findings can be plotted as directed weighted graphs easily in-\nUsing NLP and Networks for Literature Reviews\n7\nterpreted as possible associations depending on the verb. For this, we dropped\nout the sentences linked by verbs in the None category. Researchers in the social\nsciences tend to use vocabulary very carefully, as their results may not denote\ncausation but correlation [37]. Therefore, it is advisable to interpret their results\nas associations instead of causations. For example, Figure 3a can be translated\ninto the graph plotted in Figure 3b. In Figure 3b, the sign corresponds to the\nrelation between the words based on the verb: +: positively associated; +/-:\nneutrally associated; and -: negatively associated. In the following section, we\nfurther elaborate on the network visualization.\n(a) Example sentence of variables rela-\ntions\n(b) Variables translation into a directed\nweighted graph.\nFig. 3: Example of a sentence transformation into directed network.\n2.2\nAesthetics of the Network Visualization\nFor all the networks, we propose the following aesthetics. First, the words\nare arranged in concentric circles where the central words denote terms that\nhave the highest node degree. To place the nodes in concentric circles, we only\nconsidered whether the word appears in at least one finding sentence of each\narticle. However, we did not add up the frequency it appears in the article (i.e.,\nby article, its maximum value is one). Suppose there are n articles and p words\nin the database, then the nodes’ degree (D) would be given by Equation 1. In\nEquation 1, I{.} denotes the indicator function, which returns 1 when the word\nWj appears in the findings sentences of article Ai and 0 in any other case.\nD(Wj) =\nX\ni\nI{Ai(Wj)}\ni=[1,n]; j=[1,p]\n(1)\nSecond, the edge weight denotes the weighted frequency the words appeared\nrelated in the findings. To measure the edge weight, we use the ratio of the\nnumber of times the relationship between the words appeared in one article and\nthen added up these ratios for all the articles. The edge weight (EW) would be\ngiven by Equation 2. In Equation 2, Ai,f(Wk, Wl) is 1 when there is a finding\n8\nS. Gil-Clavel and T. Filatova\nsentence (f) that associates words Wk and Wl of article i and 0 in any other case.\nEW(Wk, Wl) =\nP\ni\nP\nf Ai,f (Wk,Wl)\nP\nf\nP\nj1\nP\nj2 Ai,f (Wj1,Wj2)\nD(Wk, Wl)\nwith D(Wk, Wl) =\nX\ni\nI{Ai(Wk,Wl)}\n(2)\nwhere i = [1, n]; j1, j2 = [1, p]; f ∈{Ai findings}.\nThird, the edge color shows the most frequent weighted verb sign linking\nthe words. This is measured by the ratio of the number of times the verb sign\nappeared in the relation between the words in one article divided by the number\nof times the verb sign appeared between the words in all the articles. The verb\nsign (V S) would be given by Equation 3. In Equation 3, Ai(s, Wk, Wl) is 1\nwhen there is a finding sentence that associates words Wk and Wl by the sign\nand 0 in any other case.\nEW(s, Wk, Wl) =\nP\ni\nP\nf Ai,f (s,Wk,Wl)\nP\nf\nP\nj1\nP\nj2 Ai,f (s,Wj1,Wj2)\nD(Wk, Wl)\n(3)\nwhere i = [1, n]; j1, j2 = [1, p]; f ∈{Ai findings}.\nFinally, the color assigned to the node denotes the cluster to which it belongs.\nHowever, the color of the verb sign could be applied to the node, when one node\nis the source or target of all the other nodes. In this case the visualization would\nnot show the edges. The following section shows how these aesthetics help with\nthe interpretability of the NLP-supported literature review.\n3\nNetwork Visualization of NLP-supported Findings vs.\nText Summarization Systems\nThis section aims to show how networks simplify the interpretation of the rela-\ntionships between the extracted concepts while showing more information than\nresults obtained using text summarization systems. It does so by using the results\nfrom Dang’s et al. [28] literature review as the gold standard when comparing the\nresults from our network against the results from text summarization systems.\nFor this, we apply our methodology and the text summarization systems to 91%\nof the articles analyzed by Dang et al. [28] (Table 4, Appendix A). Specifically,\nwe use the text from the articles’ abstracts, analysis, conclusions, and discussion.\nFor the summarization, we also use the sentences from which the network visu-\nalization is created, in other words, the sentences use in step eight described in\nsection 2.1 General Overview of the Algorithm. This makes both methodologies\ncomparable.\nUsing NLP and Networks for Literature Reviews\n9\n3.1\nNetwork Visualization of NLP-supported Findings\nFig. 4 shows the clustered network of nodes that target nodes containing the\nregular expressions associated with farmers’ climate change adaptation. In Fig.\n4, the centers of the main clusters are “adaptation climate change”, “adaptation\nmeasure”, “adaptation strategy”, “climate adaptation”, “farmer adaptation”,\n“adaptation climate change”, and “use adaptation measure”. Those centers re-\nflect the main topics of the clusters.\nBased on the degree (Eq. 1) and edge weights (Eq. 2) definitions, we inter-\npret Fig. 4 in the following way. If we focus on the cluster “adaptation climate\nchange”, we see that the terms that appear more often across articles (among\nothers) are “effect climate change” and “crop”. In contrast, “non farm income”\nand “soil conservation” appear less often. The terms that appear more often\nconnected (based on the edge weight) are “indigenous knowledge financial” and\n“adaptation climate change”, which are positively associated.\nHowever, as we aim to show and describe all the factors associated with\nfarmers’ adaptation to climate change, we have decided to uncluster the network\nand rename all the targeted nodes as “climate change adaptation” (Fig. 5). This\nway, the color of the nodes reflects the edge color (i.e., the color of the most\ncommon association: positive “+”, neutral “+/-”, or negative “-”) between the\nnodes and the central term (“climate change adaptation”). This eases the reading\nof the results.\nIn the next paragraphs, we describe the nodes that, according to our knowl-\nedge, can be considered as socio-economic factors and those nodes that resem-\nble climate change motivators according to other fields (such as psychology)\n[18]. As Fig. 5 shows, the factors that are positively associated with farmers’\nclimate change adaptation are, in descending order relative to their degree: cli-\nmate change, extension service, education, access credit, information climate\nchange, government policy, age household head, farming experience, effect cli-\nmate change, risk, social capital, adaptive capacity community, agricultural\nextension service, family size, knowledge, access technology, gender household\nhead, household size, farmer analytical capacity, labor force, migration labor,\nlocal state institution, involvement state institution, social institution, access\nextension, soil conservation, context, network, access market, fertilizer subsidy\nscheme, soil fertility, livestock size, age, information, technology, household size,\nyoung respondent, knowledge climate change, land ownership, gender, indige-\nnous knowledge financial, farm income, perception climate change, and decision\nmaking process.\nThe factors that are neutrally associated with farmers’ climate change adap-\ntation are policy, cooperation farm level, adaptive capacity, institutional struc-\nture, effect climate, farm level practice, technological development, weather, food\nsecurity, ownership, and government. Finally, the negatively associated factors\nare distance to market, credit, forecasting, migration household, employment,\nand government support.\n10\nS. Gil-Clavel and T. Filatova\nFig. 4: Clustered networks of nodes that target nodes containing the word “adap-\ntation”.\n3.2\nText Summarization Systems\nPerforming Literature Reviews using text summarization methods have two dif-\nficulties. First, text summarization methods perform well on short texts, such as\nblog posts and news [49], but not in long texts, such as articles. It is more dif-\nficult to summarise long text because readers tend to be interested on different\nsections of the work [49]. This means that researchers need to train the models\nbased on their own necessities. Therefore, in this section, we used the sentences\nfrom which the network visualization was created, i.e. we focus on the articles’\nfindings.\nUsing NLP and Networks for Literature Reviews\n11\nFig. 5: The complete network of all terms associated with farmers’ climate change\nadaptation in the processed literature.\nThe second difficulty stems from the amount of articles that need to be\nsummarise. For this, researchers have proposed some methodologies to summa-\nrize text that comes from more than one source. These are commonly called\nMulti-Document Summarization [79,23,24]. These methodologies normally rely\non clustering the documents to later summarize each cluster using either extrac-\ntive or abstractive summarization methods [79,23,24]. However, in our case, we\ndecided to cluster the sentences instead of the documents and then summarize\nthose clusters. This is a better strategy when summarising content for the lit-\nerature reviews, as the sentences may refer to different findings (e.g., how age\nassociates with farmers’ climate change adaptation).\nTo perform the text summarization, we use extractive, abstractive, and hy-\nbrid methods on the 43 articles’ findings sentences that were considered when\ncreating the Network Visualization of NLP-supported Findings. The sentences\n12\nS. Gil-Clavel and T. Filatova\nwere clustered into 18 groups using the Non-Negative Matrix Factorization from\nthe SciKit-Learn package [52]. We decided on the number of clusters and clus-\nterization method by reading the sentences in those clusters and checking how\ncohesive the groups were. To summarize the sentences, we used the Python\npackages sumy [14] and transformers [35].\nThe summarization methods used are the following. For the text extractive\nsummarization, we used the Text Rank and Lex Rank methods [40], as they\nare among the most promising and efficient extractive summarization methods\n[33]. For this, we constrained the output to at most 2 sentences per cluster (the\nsummaries are available in Appendix C).\nFor the abstractive summarization, we decided to use the Bidirectional\nAuto-Regressive Transformers (BART) and the Pretraining with Extracted\nGap-Sentences for Abstractive Summarization (PEGASUS) methodologies, as\nthey are the ones reported to achieve the best results [40]. For each method, we\nused either the full cluster’s sentences or the most relevant sentences according\nto the aforementioned extractive methodologies. The latter was necessary\nbecause the abstractive summarization systems have an upper bound on the\nlength of text passed to summarize [35]. So, whenever the text length was\nlonger than the upper bound, we used the extractive system to choose 75% of\nthe most important sentences in the articles’ findings (this was necessary to\nforce the algorithm to rank the sentences). Then, we concatenated the number\nof sentences necessary so that the upper bound was not reached for each of the\nabstractive summarization systems (the summaries are available in Appendix\nC).\nAs a quantitative measure of the similarity of these summaries and Dang’s\net al. [28] findings, we use the mean of the different ROUGE measures (Ta-\nble 1). The different ROUGE measures evaluate the quality of the summaries\nby counting the unit overlap between the summaries and the reference sum-\nmary [53]. Table 1 shows that, on average, the methods BART-TextRank and\nTextRank have similar performance when compared to Dang’s et al. [28] find-\nings, while BART-LexRank differs by one percentage point. Whilst, LexRank,\npegasus-TextRank, and pegasus-LexRank performed worse.\nTable 1: Rouge metrics and their mean for the different summarization systems.\nSummarization\nrouge1 rouge2 rougeL rougeLsum mean\nMethod\n1 LexRank\n0.38\n0.11\n0.15\n0.15\n0.20\n2 TextRank\n0.44\n0.12\n0.17\n0.17\n0.23\n3 BART-LexRank\n0.45\n0.12\n0.16\n0.16\n0.22\n4 BART-TextRank\n0.45\n0.13\n0.17\n0.17\n0.23\n5 pegasus-LexRank\n0.35\n0.12\n0.15\n0.15\n0.19\n6 pegasus-TextRank\n0.35\n0.12\n0.15\n0.15\n0.19\nUsing NLP and Networks for Literature Reviews\n13\n3.3\nHuman Comparison of Both Methodologies\nIn this section, we analyze whether the Network Visualization of NLP-supported\nFindings better captures farmers’ factors associated with climate change adapta-\ntion compared to Text Summarization Systems. To do so, we rely on two metrics\napplied to the network and the summarization systems: 1) their quality to sum-\nmarise the articles’ findings; and 2) their ability to capture the same results as\nDang’s et al. [28]. For this, we asked six PhD students, that have knowledge\non the climate change literature, to read Dang’s et al. [28] findings and then\ngrade the quality of the network and the summaries (Table 2) and their ability\nto capture the same findings as Dang’s et al. [28] (Table 3). For the former, the\nstudents were asked to give a score between 0 to 10, where 0 represents not under-\nstandable and 10 perfectly understandable. For the latter, the students marked\nwhether Dang’s et al. [28] findings were present in the network and summaries\n(Table 3).\nTable 2 shows the mean and variance of the students’ scores. In Table 2, the\nNetwork Visualization had the highest average score and the smaller variance.\nThis means that compared to the summarization results, the Network Visualiza-\ntion is easier to read. However, as the Network Visualization scored 6.7 (when\nthe maximum is 10), this also means that the Network Visualization needs to\nbe improved if we want to ease its readability.\nTable 2: Quality of the results according to students’ scores.\nMethod\nMean Variance\nNetwork Visualization\n6.7\n0.2\nSummarization\nLexRank\n5.4\n3.8\nTextRank\n3.6\n2.3\nBART-LexRank\n5.4\n4.3\nBART-TextRank\n4.6\n2.8\npegasus-TextRank\n4.2\n1.7\npegasus-LexRank\n5.4\n3.3\nTable 3 shows whether the factors included in Dang’s et al. [28] literature\nreview are connected in the Network Visualization of NLP-supported Findings\nand whether they are mentioned in the Text Summarization Systems based on\nthe students results. Table 3 also shows whether the direction of the association\n(Sign) is the same as the one found by Dang et al. [28]. From the 30 factors\nassociated with farmers’ adaptation to climate change, our methodology cap-\ntured (19/30) 61% of the factors, from which 79% had the correct association\nwith farmers’ adaptation to climate change. In the case of the summarization\nsystems, on average, they captured 46% of the factors with an average of 76%\ncorrect associations. Based on these results, using our methodology, we were\nbetter able to come up with similar conclusions as Dang et al. [28] compared to\nsummarization systems.\n14\nS. Gil-Clavel and T. Filatova\n4\nConclusions\nThis article proposed an interpretable NLP algorithm and descriptive visual-\nizations to summarize articles’ findings when performing systematic literature\nreviews. Our approach aimed to avoid using Black-Box algorithms and opaque\nmachine learning methodologies to extract and synthesize information. On the\none hand, our method shows that the use of tailored verb dictionaries helps to\ninterpret the results shown in the networks. On the other hand, sensible visual-\nizations of the results also facilitate synthesizing the information. Furthermore,\naccording to study participatants, our methodology performs better than ex-\ntractive, abstractive, and hybrid summarization methods.\nOur methodology, Network Visualization of NLP-supported Findings, was\nable to outperform summarization methods because it eases the identification\nand visualization of the variables that are more often connected in the articles.\nThis is because of their network location: the closer to the center, the bigger the\nnode degree. For example, in Figure 5, factors like access to credit, extension\nservice, and education are more likely to be referred to as farmers’ adapta-\ntion factors in the articles. In contrast, perception climate change, indigenous\nknowledge, and gender appear less often. So, the visualization gives not only the\ndirection and the frequency of the association between the words but also the\nfrequency the word appears in the articles relative to others, which is something\nthat is lost when using summarization methods.\nHowever, results derived from this methodology are intended to help re-\nsearchers synthesize information from large amounts of articles. Even though\nresults interpretation should be made cautiously and always based on previous\nknowledge, this methodology can help researchers keep track of the findings from\ntheir areas of expertise.\n5\nLimitations and Future Work\nOur work has some limitations that we would like to acknowledge. Compared to\nmachine learning, our methodology requires that researchers subjectively classify\nthe verbs found in sentence samples as conveying positive, negative, or neutral\nassociations between words. However, we do not believe this to be a problem as\nlong as researchers openly share the dictionary they used when implementing this\nalgorithm. Furthermore, as the results are descriptive, everything can be tracked\ndown to check why some words show specific associations and to which article the\nrelations belong. Another limitation is that we based our network visualizations\non categorical definitions of the signs: the sign that appeared most frequently.\nThis definition has the limitation of not considering that some variables might\nhave very close percentages of associated positive, negative, and neutral verbs.\nFuture work can explore the possibility of showing signs’ colors in terms of\ncontinuous variables.\nUsing NLP and Networks for Literature Reviews\n15\nTable 3: Comparison of results obtained using the Network Visualization of NLP-\nsupported Findings and the Text Summarization.\nLiterature\nNetwork\nLexRank\nTextRank\nBART-LR\nBART-TR PEGASUS-LR PEGASUS-TR\nReview\n(LR)\n(TR)\nFactor Association Factor Sign Factor Sign Factor Sign Factor Sign Factor Sign Factor\nSign\nFactor\nSign\n1\nAge\n+/-\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n2\nYoung Age\n+\n3\nOld Age\n-\n4\nGender\n+/-\n✓\n5\nMale\n+\n6\nFemale\n-\n7\nEducation\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n8\nHousehold Size\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n9\nIncome\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n10\nAgricultural Extension\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n11\nCredit\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n12\nInformation\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n13\nInformation Climate Change\n-\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n14\nInformation Climate\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n15\nTechnology\n+\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n16 Institutional Arrangements on Land\n+\n✓\n✓\n✓\n✓\n✓\n✓\n17\nNon-Governmental Organizations\n+\n✓\n✓\n18\nState Institutions\n+/-\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n19\nGovernment\n-\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n20\nNorms\n-\n✓\n21\nSocio-Cultural\n-\n✓\n✓\n✓\n✓\n22\nClimate Change Concern\n+\n✓\n✓\n✓\n✓\n23\nClimate Change Denial\n-\n24\nPerceived Risk\n+/-\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n✓\n25\nPerceived Effectiveness\n+/-\n✓\n✓\n✓\n✓\n✓\n✓\n26\nMaladaptation\n+/-\n27\nPerceived Peer Pressure\n+/-\n28\nPerceived Prices Increase\n+/-\n29\nHuman Cognition\n+\n✓\n✓\n30\nScepticism\n-\n✓\n✓\nCorrect\nTotal\n21\n14\n12\n11\n12\n10\n13\n12\n14\n13\n12\n9\n11\n9\n%\n61% 79%* 45% 79%* 42% 62%* 48% 73%* 52% 75%* 42%\n77%*\n45%\n93%*\n* Percentage of factors with correct sign from those found in the results.\n16\nS. Gil-Clavel and T. Filatova\nFunding: This work was supported by the Netherlands Organization for\nScientific Research NWO VIDI grant number 191015.\nCode Availability: The codes to replicate this work will be available upon\npublication of the article at: (https://github.com/SC3-TUD) upon publication\nof the article.\nReferences\n1. neuralcoref · spaCy Universe, https://spacy.io/universe/project/neuralcoref\n2. scikit-learn: A set of python modules for machine learning and data mining, http:\n//scikit-learn.org\n3. Adaptation to Climate Change by Smallholder Farmers in Tanzania. Economic\nResearch Southern Africa (2012). https://doi.org/10.4324/9781315149776\n4. Abid,\nM.,\nSchilling,\nJ.,\nScheffran,\nJ.,\nZulfiqar,\nF.:\nClimate\nchange\nvul-\nnerability, adaptation and risk perceptions at farm level in Punjab, Pak-\nistan.\nScience\nof\nThe\nTotal\nEnvironment\n547,\n447–460\n(Mar\n2016).\nhttps://doi.org/10.1016/j.scitotenv.2015.11.125, https://linkinghub.elsevier.\ncom/retrieve/pii/S0048969715311086\n5. Alam, K.: Farmers’ adaptation to water scarcity in drought-prone environments:\nA case study of Rajshahi District, Bangladesh. Agricultural Water Management\n148, 196–206 (Jan 2015). https://doi.org/10.1016/j.agwat.2014.10.011, https://\nlinkinghub.elsevier.com/retrieve/pii/S037837741400331X\n6. Antwi-Agyei, P., Dougill, A.J., Stringer, L.C.: Barriers to climate change\nadaptation:\nevidence\nfrom\nnortheast\nGhana\nin\nthe\ncontext\nof\na\nsys-\ntematic\nliterature\nreview.\nClimate\nand\nDevelopment\n7(4),\n297–309\n(Aug\n2015). https://doi.org/10.1080/17565529.2014.951013, http://www.tandfonline.\ncom/doi/full/10.1080/17565529.2014.951013\n7. Anyoha, N.O., Nnadi, F.N., Chikaire, J., Echetama, J.A., Utazi, C.O., Ihenacho,\nR.A.: Socio-economic factors influencing climate change adaptation among crop\nfarmers in Umuahia South Area of Abia State, Nigeria (2013)\n8. Arbuckle, J.G., Morton, L.W., Hobbs, J.: Farmer beliefs and concerns about cli-\nmate change and attitudes toward adaptation and mitigation: Evidence from Iowa.\nClimatic Change 118(3-4), 551–563 (Jun 2013). https://doi.org/10.1007/s10584-\n013-0700-0, http://link.springer.com/10.1007/s10584-013-0700-0\n9. Arimi, K.S.: Determinants of climate change adaptation strategies used by fish\nfarmers in Epe Local Government Area of Lagos State, Nigeria: Determinants of\nfish farmers’ climate change adaptation. Journal of the Science of Food and Agri-\nculture 94(7), 1470–1476 (May 2014). https://doi.org/10.1002/jsfa.6452, https:\n//onlinelibrary.wiley.com/doi/10.1002/jsfa.6452\n10. Bahinipati, C.S., Kumar, V., Viswanathan, P.K.: An evidence-based system-\natic review on farmers’ adaptation strategies in India. Food Security 13(2),\n399–418 (Apr 2021). https://doi.org/10.1007/s12571-020-01139-3, https://link.\nspringer.com/10.1007/s12571-020-01139-3\n11. Balew, S., Agwata, J., Anyango, S.: Determinants of Adoption Choices of Climate\nChange Adaptation Strategies in Crop Production by Small Scale Farmers in Some\nRegions of Central Ethiopia (2014)\n12. Batista, J., Ferreira, R., Tomaz, H., Ferreira, R., Dueire Lins, R., Simske,\nS., Silva, G., Riss, M.: A Quantitative and Qualitative Assessment of Auto-\nmatic Text Summarization Systems. In: Proceedings of the 2015 ACM Sym-\nposium on Document Engineering. pp. 65–68. ACM, Lausanne Switzerland\nUsing NLP and Networks for Literature Reviews\n17\n(Sep 2015). https://doi.org/10.1145/2682571.2797081, https://dl.acm.org/doi/\n10.1145/2682571.2797081\n13. Baudoin, M.A.: Enhancing climate change adaptation in Africa assessing the role of\nlocal institutions in Southern Benin. Climate and Development 6(2), 122–131 (Apr\n2014). https://doi.org/10.1080/17565529.2013.844677, http://www.tandfonline.\ncom/doi/abs/10.1080/17565529.2013.844677\n14. Belica, M.: sumy: Module for automatic summarization of text documents and\nHTML pages., https://github.com/miso-belica/sumy\n15. Below, T., Artner, A., Siebert, R., Sieber, S.: Micro-level Practices to Adapt to\nClimate Change for African Small-scale Farmers (2010)\n16. Below, T.B., Mutabazi, K.D., Kirschke, D., Franke, C., Sieber, S., Siebert, R.,\nTscherning, K.: Can farmers’ adaptation to climate change be explained by\nsocio-economic household-level variables? Global Environmental Change 22(1),\n223–235 (Feb 2012). https://doi.org/10.1016/j.gloenvcha.2011.11.012, https://\nlinkinghub.elsevier.com/retrieve/pii/S0959378011001993\n17. Bender,\nE.M.,\nGebru,\nT.,\nMcMillan-Major,\nA.,\nShmitchell,\nS.:\nOn\nthe\nDangers\nof\nStochastic\nParrots:\nCan\nLanguage\nModels\nBe\nToo\nBig?\nIn:\nProceedings\nof\nthe\n2021\nACM\nConference\non\nFairness,\nAccountability,\nand Transparency. pp. 610–623. ACM, Virtual Event Canada (Mar 2021).\nhttps://doi.org/10.1145/3442188.3445922,\nhttps://dl.acm.org/doi/10.1145/\n3442188.3445922\n18. Berrang-Ford, L., Siders, A.R., Lesnikowski, A., Fischer, A.P., Callaghan, M.W.,\nHaddaway, N.R., Mach, K.J., Araos, M., Shah, M.A.R., Wannewitz, M., Doshi,\nD., Leiter, T., Matavel, C., Musah-Surugu, J.I., Wong-Parodi, G., Antwi-Agyei,\nP., Ajibade, I., Chauhan, N., Kakenmaster, W., Grady, C., Chalastani, V.I., Ja-\ngannathan, K., Galappaththi, E.K., Sitati, A., Scarpa, G., Totin, E., Davis, K.,\nHamilton, N.C., Kirchhoff, C.J., Kumar, P., Pentz, B., Simpson, N.P., Theokritoff,\nE., Deryng, D., Reckien, D., Zavaleta-Cortijo, C., Ulibarri, N., Segnon, A.C.,\nKhavhagali, V., Shang, Y., Zvobgo, L., Zommers, Z., Xu, J., Williams, P.A.,\nCanosa, I.V., van Maanen, N., van Bavel, B., van Aalst, M., Turek-Hankins,\nL.L., Trivedi, H., Trisos, C.H., Thomas, A., Thakur, S., Templeman, S., Stringer,\nL.C., Sotnik, G., Sjostrom, K.D., Singh, C., Si˜na, M.Z., Shukla, R., Sardans,\nJ., Salubi, E.A., Safaee Chalkasra, L.S., Ruiz-D´ıaz, R., Richards, C., Pokharel,\nP., Petzold, J., Penuelas, J., Pelaez Avila, J., Murillo, J.B.P., Ouni, S., Nie-\nmann, J., Nielsen, M., New, M., Nayna Schwerdtle, P., Nagle Alverio, G., Mullin,\nC.A., Mullenite, J., Mosurska, A., Morecroft, M.D., Minx, J.C., Maskell, G.,\nNunbogu, A.M., Magnan, A.K., Lwasa, S., Lukas-Sithole, M., Lissner, T., Lil-\nford, O., Koller, S.F., Jurjonas, M., Joe, E.T., Huynh, L.T.M., Hill, A., Her-\nnandez, R.R., Hegde, G., Hawxwell, T., Harper, S., Harden, A., Haasnoot, M.,\nGilmore, E.A., Gichuki, L., Gatt, A., Garschagen, M., Ford, J.D., Forbes, A.,\nFarrell, A.D., Enquist, C.A.F., Elliott, S., Duncan, E., Coughlan de Perez, E.,\nCoggins, S., Chen, T., Campbell, D., Browne, K.E., Bowen, K.J., Biesbroek,\nR., Bhatt, I.D., Bezner Kerr, R., Barr, S.L., Baker, E., Austin, S.E., Arotoma-\nRojas, I., Anderson, C., Ajaz, W., Agrawal, T., Abu, T.Z.: A systematic global\nstocktake of evidence on human adaptation to climate change. Nature Climate\nChange 11(11), 989–1000 (Nov 2021). https://doi.org/10.1038/s41558-021-01170-\ny, https://www.nature.com/articles/s41558-021-01170-y\n19. Biggs,\nE.M.,\nTompkins,\nE.L.,\nAllen,\nJ.,\nMoon,\nC.,\nAllen,\nR.:\nAgri-\ncultural\nadaptation\nto\nclimate\nchange:\nobservations\nfrom\nthe\nMid-\nHills\nof\nNepal.\nClimate\nand\nDevelopment\n5(2),\n165–173\n(Apr\n2013).\n18\nS. Gil-Clavel and T. Filatova\nhttps://doi.org/10.1080/17565529.2013.789791,\nhttp://www.tandfonline.\ncom/doi/abs/10.1080/17565529.2013.789791\n20. Bryan,\nE.,\nDeressa,\nT.T.,\nGbetibouo,\nG.A.,\nRingler,\nC.:\nAdaptation\nto\nclimate\nchange\nin\nEthiopia\nand\nSouth\nAfrica:\noptions\nand\ncon-\nstraints.\nEnvironmental\nScience\n&\nPolicy\n12(4),\n413–426\n(Jun\n2009).\nhttps://doi.org/10.1016/j.envsci.2008.11.002,\nhttps://linkinghub.elsevier.\ncom/retrieve/pii/S1462901108001263\n21. Bui, D.D.A., Del Fiol, G., Hurdle, J.F., Jonnalagadda, S.: Extractive text\nsummarization system to aid data extraction from full text in systematic\nreview\ndevelopment.\nJournal\nof\nBiomedical\nInformatics\n64,\n265–272\n(Dec\n2016). https://doi.org/10.1016/j.jbi.2016.10.014, https://linkinghub.elsevier.\ncom/retrieve/pii/S1532046416301514\n22. Burrell, J.: How the machine ‘thinks’: Understanding opacity in machine\nlearning algorithms. Big Data & Society 3(1), 205395171562251 (Jun 2016).\nhttps://doi.org/10.1177/2053951715622512, http://journals.sagepub.com/doi/\n10.1177/2053951715622512\n23. Cao, Z., Li, W., Li, S., Wei, F.: Improving Multi-Document Summarization via\nText Classification. Proceedings of the AAAI Conference on Artificial Intelligence\n31(1) (Feb 2017). https://doi.org/10.1609/aaai.v31i1.10955, https://ojs.aaai.\norg/index.php/AAAI/article/view/10955\n24. Cao,\nZ.,\nWei,\nF.,\nDong,\nL.,\nLi,\nS.,\nZhou,\nM.:\nRanking\nwith\nRecursive\nNeural\nNetworks\nand\nIts\nApplication\nto\nMulti-Document\nSummarization.\nProceedings of the AAAI Conference on Artificial Intelligence 29(1) (Feb\n2015). https://doi.org/10.1609/aaai.v29i1.9490, https://ojs.aaai.org/index.\nphp/AAAI/article/view/9490\n25. Como´e, H., Siegrist, M.: Relevant drivers of farmers’ decision behavior regard-\ning their adaptation to climate change: a case study of two regions in Cˆote\nd’Ivoire. Mitigation and Adaptation Strategies for Global Change 20(2), 179–199\n(Feb 2015). https://doi.org/10.1007/s11027-013-9486-7, http://link.springer.\ncom/10.1007/s11027-013-9486-7\n26. Creutzig, F., Callaghan, M., Ramakrishnan, A., Javaid, A., Niamir, L., Minx,\nJ., M¨uller-Hansen, F., Sovacool, B., Afroz, Z., Andor, M., Antal, M., Court,\nV., Das, N., D´ıaz-Jos´e, J., D¨obbe, F., Figueroa, M.J., Gouldson, A., Haberl,\nH., Hook, A., Ivanova, D., Lamb, W.F., Ma¨ızi, N., Mata, ´E., Nielsen, K.S.,\nOnyige, C.D., Reisch, L.A., Roy, J., Scheelbeek, P., Sethi, M., Some, S., Sor-\nrell, S., Tessier, M., Urmee, T., Vir´ag, D., Wan, C., Wiedenhofer, D., Wilson,\nC.: Reviewing the scope and thematic focus of 100 000 publications on en-\nergy consumption, services and social aspects of climate change: a big data ap-\nproach to demand-side mitigation *. Environmental Research Letters 16(3), 033001\n(Mar 2021). https://doi.org/10.1088/1748-9326/abd78b, https://iopscience.\niop.org/article/10.1088/1748-9326/abd78b\n27. Dang, H.L., Li, E., Nuberg, I., Bruwer, J.: Understanding farmers’ adap-\ntation intention to climate change: A structural equation modelling study\nin the Mekong Delta, Vietnam. Environmental Science & Policy 41, 11–22\n(Aug 2014). https://doi.org/10.1016/j.envsci.2014.04.002, https://linkinghub.\nelsevier.com/retrieve/pii/S1462901114000665\n28. Dang, H.L., Li, E., Nuberg, I., Bruwer, J.: Factors influencing the adapta-\ntion of farmers in response to climate change: a review. Climate and Develop-\nment 11(9), 765–774 (Oct 2019). https://doi.org/10.1080/17565529.2018.1562866,\nhttps://www.tandfonline.com/doi/full/10.1080/17565529.2018.1562866\nUsing NLP and Networks for Literature Reviews\n19\n29. Deressa, T.T., Hassan, R.M., Ringler, C.: Perception of and adaptation to climate\nchange by farmers in the Nile basin of Ethiopia. The Journal of Agricultural\nScience 149(1), 23–31 (Feb 2011). https://doi.org/10.1017/S0021859610000687,\nhttps://www.cambridge.org/core/product/identifier/S0021859610000687/\ntype/journal_article\n30. Deressa,\nT.T.,\nHassan,\nR.M.,\nRingler,\nC.,\nAlemu,\nT.,\nYesuf,\nM.:\nDeter-\nminants\nof\nfarmers’\nchoice\nof\nadaptation\nmethods\nto\nclimate\nchange\nin\nthe\nNile\nBasin\nof\nEthiopia.\nGlobal\nEnvironmental\nChange\n19(2),\n248–\n255\n(May\n2009).\nhttps://doi.org/10.1016/j.gloenvcha.2009.01.002,\nhttps://\nlinkinghub.elsevier.com/retrieve/pii/S0959378009000156\n31. Devlin, J., Chang, M.W.: Open Sourcing BERT: State-of-the-Art Pre-training\nfor Natural Language Processin (Nov 2018), http://research.google/blog/\nopen-sourcing-bert-state-of-the-art-pre-training-for-natural-language-processing/\n32. Devlin, J., Chang, M.W., Lee, K., Toutanova, K.: BERT: Pre-training of Deep Bidi-\nrectional Transformers for Language Understanding (May 2019), http://arxiv.\norg/abs/1810.04805, arXiv:1810.04805 [cs]\n33. D’Silva, J., Sharma, U.: Impact of Similarity Measures in Graph-based Au-\ntomatic Text Summarization of Konkani Texts. ACM Transactions on Asian\nand Low-Resource Language Information Processing 22(2), 1–16 (Mar 2023).\nhttps://doi.org/10.1145/3554943, https://dl.acm.org/doi/10.1145/3554943\n34. Esham, M., Garforth, C.: Agricultural adaptation to climate change: insights from\na farming community in Sri Lanka. Mitigation and Adaptation Strategies for Global\nChange 18(5), 535–549 (Jun 2013). https://doi.org/10.1007/s11027-012-9374-6,\nhttp://link.springer.com/10.1007/s11027-012-9374-6\n35. Face, H.: Transformers, https://huggingface.co/docs/transformers/index\n36. Fosu-Mensah, B.Y., Vlek, P.L.G., MacCarthy, D.S.: Farmers’ perception and\nadaptation\nto\nclimate\nchange:\na\ncase\nstudy\nof\nSekyedumase\ndistrict\nin\nGhana. Environment, Development and Sustainability 14(4), 495–505 (Aug\n2012). https://doi.org/10.1007/s10668-012-9339-7, http://link.springer.com/\n10.1007/s10668-012-9339-7\n37. Frankenhuis, W.E., Panchanathan, K., Smaldino, P.E.: Strategic ambiguity\nin the social sciences. Social Psychological Bulletin 18, e9923 (Nov 2023).\nhttps://doi.org/10.32872/spb.9923, https://spb.psychopen.eu/index.php/spb/\narticle/view/9923\n38. Gbetibouo,\nG.A.,\nHassan,\nR.M.,\nRingler,\nC.:\nModelling\nfarmers’\nadap-\ntation\nstrategies\nfor\nclimate\nchange\nand\nvariability:\nThe\ncase\nof\nthe\nLimpopo\nBasin,\nSouth\nAfrica.\nAgrekon\n49(2),\n217–234\n(Jun\n2010).\nhttps://doi.org/10.1080/03031853.2010.491294,\nhttp://www.tandfonline.\ncom/doi/abs/10.1080/03031853.2010.491294\n39. Gebrehiwot, T., van der Veen, A.: Farm Level Adaptation to Climate Change:\nThe Case of Farmer’s in the Ethiopian Highlands. Environmental Manage-\nment 52(1), 29–44 (Jul 2013). https://doi.org/10.1007/s00267-013-0039-3, http:\n//link.springer.com/10.1007/s00267-013-0039-3\n40. Giarelis, N., Mastrokostas, C., Karacapilidis, N.: Abstractive vs. Extractive Sum-\nmarization: An Experimental Review. Applied Sciences 13(13),\n7620 (Jun\n2023). https://doi.org/10.3390/app13137620, https://www.mdpi.com/2076-3417/\n13/13/7620\n41. Guglielmetti, P., Shinyama, Y.: pdfminer.six: PDF parser and analyzer (2022),\nhttps://github.com/pdfminer/pdfminer.six\n42. Hassan, R., Nhemachena, C.: Determinants of African farmers’ strategies for adapt-\ning to climate change: Multinomial choice analysis. AfJARE 2(1) (2008)\n20\nS. Gil-Clavel and T. Filatova\n43. Hisali,\nE.,\nBirungi,\nP.,\nBuyinza,\nF.:\nAdaptation\nto\nclimate\nchange\nin\nUganda: Evidence from micro level data. Global Environmental Change 21(4),\n1245–1261 (Oct 2011). https://doi.org/10.1016/j.gloenvcha.2011.07.005, https:\n//linkinghub.elsevier.com/retrieve/pii/S0959378011001105\n44. Idrisa, Y.: Analysis of Awareness and Adaptation to Climate Change among\nFarmers in the Sahel Savannah Agro-ecological Zone of Borno State, Nigeria.\nBritish Journal of Environment and Climate Change 2(2), 216–226 (Jan 2012).\nhttps://doi.org/10.9734/BJECC/2012/1475, https://journalijecc.com/index.\nphp/IJECC/article/view/176\n45. Intelligence, A.I.f.A.: scispacy: A full SpaCy pipeline and models for scien-\ntific/biomedical documents., https://allenai.github.io/SciSpaCy/\n46. Jain, S.M.: Introduction to Transformers for NLP: With the Hugging Face\nLibrary\nand\nModels\nto\nSolve\nProblems.\nApress,\nBerkeley,\nCA\n(2022).\nhttps://doi.org/10.1007/978-1-4842-8844-3,\nhttps://link.springer.com/10.\n1007/978-1-4842-8844-3\n47. Garc´ıa de Jal´on, S., Silvestri, S., Granados, A., Iglesias, A.: Behavioural\nbarriers in response to climate change in agricultural communities: an ex-\nample\nfrom\nKenya.\nRegional\nEnvironmental\nChange\n15(5),\n851–865\n(Jun\n2015). https://doi.org/10.1007/s10113-014-0676-y, http://link.springer.com/\n10.1007/s10113-014-0676-y\n48. Jones,\nL.,\nBoyd,\nE.:\nExploring\nsocial\nbarriers\nto\nadaptation:\nInsights\nfrom Western Nepal. Global Environmental Change 21(4), 1262–1274 (Oct\n2011).\nhttps://doi.org/10.1016/j.gloenvcha.2011.06.002,\nhttps://linkinghub.\nelsevier.com/retrieve/pii/S0959378011000860\n49. Koh, H.Y., Ju, J., Liu, M., Pan, S.: An Empirical Survey on Long Document\nSummarization: Datasets, Models, and Metrics. ACM Computing Surveys 55(8),\n1–35 (Aug 2023). https://doi.org/10.1145/3545176, https://dl.acm.org/doi/10.\n1145/3545176\n50. Kuehne, G.: How Do Farmers’ Climate Change Beliefs Affect Adaptation\nto\nClimate\nChange?\nSociety\n&\nNatural\nResources\n27(5),\n492–506\n(May\n2014). https://doi.org/10.1080/08941920.2013.861565, http://www.tandfonline.\ncom/doi/abs/10.1080/08941920.2013.861565\n51. Larsen, P.O., von Ins, M.: The rate of growth in scientific publication and the de-\ncline in coverage provided by Science Citation Index. Scientometrics 84(3), 575–603\n(Sep 2010). https://doi.org/10.1007/s11192-010-0202-z, http://link.springer.\ncom/10.1007/s11192-010-0202-z\n52. Learn, S.: Non-Negative Matrix Factorization (NMF), https://scikit-learn/\nstable/modules/generated/sklearn.decomposition.NMF.html\n53. Lin, C.Y.: ROUGE: A Package for Automatic Evaluation of Summaries pp. 74–81\n(2004)\n54. Mandleni, B., Anim, F.D.K.: CLIMATE CHANGE AWARENESS AND DECI-\nSION ON ADAPTATION MEASURES BY LIVESTOCK FARMERS (2011)\n55. Muller, C., Shackleton, S.E.: Perceptions of climate change and barriers to adapta-\ntion amongst commonage and commercial livestock farmers in the semi-arid East-\nern Cape Karoo. African Journal of Range & Forage Science 31(1), 1–12 (Jan\n2014). https://doi.org/10.2989/10220119.2013.845606, http://www.tandfonline.\ncom/doi/full/10.2989/10220119.2013.845606\n56. Nalau, J., Verrall, B.: Mapping the evolution and current trends in cli-\nmate change adaptation science. Climate Risk Management 32, 100290 (2021).\nhttps://doi.org/10.1016/j.crm.2021.100290, https://linkinghub.elsevier.com/\nretrieve/pii/S221209632100019X\nUsing NLP and Networks for Literature Reviews\n21\n57. Ndambiri, H.K., Ritho, C., Mbogoh, S., Muiruri, E.J., Nyangweso, P., Kipsat, M.J.,\nOgada, J.O., Omboto, P.I., Kefa, C., Kubowon, P.C., Cherotwo, F.H.: Assessment\nof Farmers’ Adaptation to the Effects of Climate Change in Kenya: the Case of\nKyuso District. Journal of Economics and Sustainable Development 3(12) (2012)\n58. Neil\nAdger,\nW.:\nSocial\nVulnerability\nto\nClimate\nChange\nand\nExtremes\nin\nCoastal\nVietnam.\nWorld\nDevelopment\n27(2),\n249–269\n(Feb\n1999).\nhttps://doi.org/10.1016/S0305-750X(98)00136-3,\nhttps://linkinghub.\nelsevier.com/retrieve/pii/S0305750X98001363\n59. Neumann, M., King, D., Beltagy, I., Ammar, W.: ScispaCy: Fast and Robust\nModels for Biomedical Natural Language Processing. In: Proceedings of the 18th\nBioNLP Workshop and Shared Task. pp. 319–327. Association for Computa-\ntional Linguistics, Florence, Italy (2019). https://doi.org/10.18653/v1/W19-5034,\nhttps://www.aclweb.org/anthology/W19-5034\n60. Newman, M.E.J.: Networks: An Introduction. Oxford University Press (2017)\n61. Nielsen, J.O., Reenberg, A.: Cultural barriers to climate change adaptation: A\ncase study from Northern Burkina Faso. Global Environmental Change 20(1),\n142–152 (Feb 2010). https://doi.org/10.1016/j.gloenvcha.2009.10.002, https://\nlinkinghub.elsevier.com/retrieve/pii/S0959378009000879\n62. Nunez-Mir, G.C., Iannone, B.V., Pijanowski, B.C., Kong, N., Fei, S.: Au-\ntomated\ncontent\nanalysis:\naddressing\nthe\nbig\nliterature\nchallenge\nin\necol-\nogy\nand\nevolution.\nMethods\nin\nEcology\nand\nEvolution\n7(11),\n1262–1272\n(Nov 2016). https://doi.org/10.1111/2041-210X.12602, https://onlinelibrary.\nwiley.com/doi/10.1111/2041-210X.12602\n63. Othniel\nYila,\nJ.,\nResurreccion,\nB.P.:\nDeterminants\nof\nsmallholder\nfarm-\ners’ adaptation strategies to climate change in the semi arid Nguru Lo-\ncal\nGovernment\nArea,\nNortheastern\nNigeria.\nManagement\nof\nEnviron-\nmental\nQuality:\nAn\nInternational\nJournal\n24(3),\n341–364\n(Apr\n2013).\nhttps://doi.org/10.1108/14777831311322659,\nhttps://www.emerald.com/\ninsight/content/doi/10.1108/14777831311322659/full/html\n64. Oyekale, A., Oladele, O.: Determinants of Climate Change Adaptation among\nCocoa Farmers in Southwest Nigeria. ARPN Journal of Science and Technology\n2(Special Issue) (2012)\n65. Ozor,\nN.:\nDifficulties\nin\nadaptation\nto\nclimate\nchange\nby\nfarmers\nin\nEnugu State, Nigeria. Journal of Agricultural Extension 14(2) (Mar 2011).\nhttps://doi.org/10.4314/jae.v14i2.64127,\nhttp://www.ajol.info/index.php/\njae/article/view/64127\n66. Pauw, P.: The role of perception in subsistence farmer adaptation in Africa: Enrich-\ning the climate finance debate. International Journal of Climate Change Strategies\nand Management 5(3), 267–284 (Jul 2013). https://doi.org/10.1108/IJCCSM-\n03-2012-0014,\nhttps://www.emerald.com/insight/content/doi/10.1108/\nIJCCSM-03-2012-0014/full/html\n67. Rudin, C.: Stop explaining black box machine learning models for high stakes de-\ncisions and use interpretable models instead. Nature Machine Intelligence 1(5),\n206–215 (May 2019). https://doi.org/10.1038/s42256-019-0048-x, https://www.\nnature.com/articles/s42256-019-0048-x\n68. Salau, E., Onuk, E., Ibrahim, A.: Knowledge, Perception and Adaptation\nStrategies to Climate Change among Farmers in Southern Agricultural Zone\nof Nasarawa State, Nigeria. Journal of Agricultural Extension 16(2) (Jan\n2013). https://doi.org/10.4314/jae.v16i2.15, http://www.ajol.info/index.php/\njae/article/view/84561\n22\nS. Gil-Clavel and T. Filatova\n69. Sarker,\nA.R.,\nAlam,\nK.,\nGow,\nJ.:\nAssessing\nthe\ndeterminants\nof\nrice\nfarmers’\nadaptation\nstrategies\nto\nclimate\nchange\nin\nBangladesh.\nInterna-\ntional Journal of Climate Change Strategies and Management 5(4), 382–\n403 (Nov 2013). https://doi.org/10.1108/IJCCSM-06-2012-0033, https://www.\nemerald.com/insight/content/doi/10.1108/IJCCSM-06-2012-0033/full/html\n70. Shaffril,\nH.A.M.,\nKrauss,\nS.E.,\nSamsuddin,\nS.F.:\nA\nsystematic\nre-\nview\non\nAsian’s\nfarmers’\nadaptation\npractices\ntowards\nclimate\nchange.\nScience\nof\nThe\nTotal\nEnvironment\n644,\n683–695\n(Dec\n2018).\nhttps://doi.org/10.1016/j.scitotenv.2018.06.349, https://linkinghub.elsevier.\ncom/retrieve/pii/S0048969718324252\n71. Shiferaw, A.: Smallholder Farmers Adaptation Strategies to Climate Change in\nEthiopia: Evidence from Adola Rede Woreda, Oromia Region (2014)\n72. Shojania,\nK.G.,\nSampson,\nM.,\nAnsari,\nM.T.,\nJi,\nJ.,\nDoucette,\nS.,\nMo-\nher, D.: How Quickly Do Systematic Reviews Go Out of Date? A Sur-\nvival\nAnalysis.\nAnnals\nof\nInternal\nMedicine\n147(4),\n224\n(Aug\n2007).\nhttps://doi.org/10.7326/0003-4819-147-4-200708210-00179, http://annals.org/\narticle.aspx?doi=10.7326/0003-4819-147-4-200708210-00179\n73. Smith, T.B., Vacca, R., Mantegazza, L., Capua, I.: Natural language process-\ning and network analysis provide novel insights on policy and scientific dis-\ncourse around Sustainable Development Goals. Scientific Reports 11(1), 22427\n(Dec 2021). https://doi.org/10.1038/s41598-021-01801-6, https://www.nature.\ncom/articles/s41598-021-01801-6\n74. Sofoluwe, N.A., Tijani, A.A., Baruwa, O.I.: Farmers’ perception and adaptation to\nclimate change in Osun State, Nigeria (2011)\n75. Sollaci, L.B.: The introduction, methods, results, and discussion (IMRAD) struc-\nture: a fifty-year survey. J Med Libr Assoc (2004)\n76. spaCy: spaCy · Industrial-strength Natural Language Processing in Python (2022),\nhttps://spacy.io/\n77. Truelove,\nH.B.,\nCarrico,\nA.R.,\nThabrew,\nL.:\nA\nsocio-psychological\nmodel\nfor\nanalyzing\nclimate\nchange\nadaptation:\nA\ncase\nstudy\nof\nSri\nLankan\npaddy\nfarmers.\nGlobal\nEnvironmental\nChange\n31,\n85–97\n(Mar\n2015).\nhttps://doi.org/10.1016/j.gloenvcha.2014.12.010,\nhttps://linkinghub.\nelsevier.com/retrieve/pii/S0959378015000023\n78. Tucker, C.M., Eakin, H., Castellanos, E.J.: Perceptions of risk and adap-\ntation:\nCoffee\nproducers,\nmarket\nshocks,\nand\nextreme\nweather\nin\nCen-\ntral America and Mexico. Global Environmental Change 20(1), 23–32 (Feb\n2010).\nhttps://doi.org/10.1016/j.gloenvcha.2009.07.006,\nhttps://linkinghub.\nelsevier.com/retrieve/pii/S0959378009000478\n79. Wang, D., Zhu, S., Li, T., Chi, Y., Gong, Y.: Integrating Document Clustering and\nMultidocument Summarization. ACM Transactions on Knowledge Discovery from\nData 5(3), 1–26 (Aug 2011). https://doi.org/10.1145/1993077.1993078, https://\ndl.acm.org/doi/10.1145/1993077.1993078\n80. Wang, M., Wang, M., Yu, F., Yang, Y., Walker, J., Mostafa, J.: A systematic\nreview of automatic text summarization for biomedical literature and EHRs.\nJournal of the American Medical Informatics Association 28(10), 2287–2297\n(Sep 2021). https://doi.org/10.1093/jamia/ocab143, https://academic.oup.com/\njamia/article/28/10/2287/6335523\n81. Wilk, J., Andersson, L., Warburton, M.: Adaptation to climate change and other\nstressors among commercial and small-scale South African farmers. Regional En-\nvironmental Change 13(2), 273–286 (Apr 2013). https://doi.org/10.1007/s10113-\n012-0323-4, http://link.springer.com/10.1007/s10113-012-0323-4\nUsing NLP and Networks for Literature Reviews\n23\n82. Yegbemey, R.N., Yabi, J.A., Tovignan, S.D., Gantoli, G., Haroll Kokoye, S.E.:\nFarmers’ decisions to adapt to climate change under various property rights: A\ncase study of maize farming in northern Benin (West Africa). Land Use Policy\n34, 168–175 (Sep 2013). https://doi.org/10.1016/j.landusepol.2013.03.001, https:\n//linkinghub.elsevier.com/retrieve/pii/S0264837713000471\n24\nS. Gil-Clavel and T. Filatova\nA\nArticles used to build the database\nTable 4: List of articles used in Dang et al. [28] and that form our text database.\nReference\nReference\n1 Abid et al. [4]\n23 Hisali et al. [43]\n2 Adger [58]\n24 Idrisa et al. [44]\n3 Alam [5]\n25 Jones and Boyd [48]\n4 Antwi-Agyei et al. [6]\n26 Komba and Muchwaponda [3]\n5 Anyoha et al. [7]\n27 Kuehne [50]\n6 Arbuckle et al. [8]\n28 Mandleni and Anim [54]\n7 Arimi [9]\n29 Muller and Shackleton [55]\n8 Balew et al. [11]\n30 Ndambiri et al. [57]\n9 Baudoin [13]\n31 Nielsen and Reenberg [61]\n10 Below et al. [16]\n32 Oyekale and Oladele [64]\n11 Biggs et al. [19]\n33 Ozor and Cynthia [65]\n12 Bryan et al. [20]\n34 Pauw [66]\n13 Como´e and Siegrist [25]\n35 Salau et al. [68]\n14 Dang et al. [27]\n36 Sarker et al. [69]\n15 De Jal´on et al. [47]\n37 Shiferaw [71]\n16 Deressa et al. [30]\n38 Sofoluwe et al. [74]\n17 Deressa et al. [29]\n39 Truelove et al. [77]\n18 Esham and Garforth [34]\n40 Tucker et al. [78]\n19 Fosu-Mensah et al. [36]\n41 Wilk et al. [81]\n20 Gbetibouo et al. [38]\n42 Yegbemey et al. [82]\n21 Gebrehiwot and van der Veen [39] 43 Yila and Resurreccion [63]\n22 Hassan and Nhemachena [42]\nUsing NLP and Networks for Literature Reviews\n25\nB\nVerbs Findings Dictionary\nIn this section, we present the list of verbs used in the dictionary. In the lists, the\ndependent verbs were already listed under the categories positive or negative.\n– List of verbs denoting a positive association:\naffect positive\naccelerate\naccess\nachieve\nadapt\nalleviate\naugment\navail\nbe gain\nbe promote\nbe protect\nbe support\nbring\nbuild\ncan transfer\ncombat\ncompensate\ncontribute\ncreate\ndetermine\ndrive\nenable\nenact\nencourage\nenhance\nenrich\nexplain\nfacilitate\nfoster\nfund\ngain\ngalvanize\ngenerate\nhave increase\nhave positive\nhelp\nimprove\nincrease\ninduce\ninfluence positive\ninform\nintensify\nintroduce\njoin\nopt\nperceive positive\nplant\npredict\nprepare\npromote\nprovide\nraise\nrear\nrehabilitate\nreimburse\nrequire\nresolve\nrestore\nscale\nshould include\nshow positive\nspeed\nstrengthen\nsupport\ntackle\ntap\ntrust\nuse positive\nupgrade\n– List of verbs denoting a neutral association:\naccount\nact\naddress\nadjust\nappear\napply\nassociate\nassume\nattribute\nbe\nbe determine\nbe relate\nbe report\nbe root\nchange\ncombine\nconnect\ncontrol\ncorrelate\ndeem\ndiversify\ndominate\nemerge\nengage\nevidence\nevolve\nimpact\nintend\ninvolve\nkeep\nknow\nlink\nmaintain\nmanage\nmediate\nmention\nneed\nneutralize\noffset\npossess\nreach\nreflect\nrelate\nrepresent\nsignify\nstem\nunderstand\n– List of verbs denoting a negative association:\n26\nS. Gil-Clavel and T. Filatova\naffect negative\nconstrain\ndamage\ndecline\ndecompose\ndecrease\nerode\nexacerbate\nfail\nhave negative\nhave prevent\nhinder\nignore\ninfluence negative\nlimit\nminimize\nmitigate\nperceive negative\nprevent\nreduce\nrestrict\nretard\nshow negative\ntradeoff\nuse negative\nweaken\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2023-06-16",
  "updated": "2024-07-03"
}