{
  "id": "http://arxiv.org/abs/2306.13397v1",
  "title": "Higher-order Motif-based Time Series Classification for Forced Oscillation Source Location in Power Grids",
  "authors": [
    "Long Huo",
    "Xin Chen"
  ],
  "abstract": "Time series motifs are used for discovering higher-order structures of time\nseries data. Based on time series motifs, the motif embedding correlation field\n(MECF) is proposed to characterize higher-order temporal structures of\ndynamical system time series. A MECF-based unsupervised learning approach is\napplied in locating the source of the forced oscillation (FO), a periodic\ndisturbance that detrimentally impacts power grids. Locating the FO source is\nimperative for system stability. Compared with the Fourier analysis, the\nMECF-based unsupervised learning is applicable under various FO situations,\nincluding the single FO, FO with resonance, and multiple sources FOs. The\nMECF-based unsupervised learning is a data-driven approach without any prior\nknowledge requirement of system models or typologies. Tests on the UK\nhigh-voltage transmission grid illustrate the effectiveness of MECF-based\nunsupervised learning. In addition, the impacts of coupling strength and\nmeasurement noise on locating the FO source by the MECF-based unsupervised\nlearning are investigated.",
  "text": "arXiv:2306.13397v1  [cs.LG]  23 Jun 2023\nHigher-order Motif-based Time Series\nClassiﬁcation for Forced Oscillation Source\nLocation in Power Grids\nLong Huo1 and Xin Chen1*\n1Center of Nanomaterials for Renewable Energy, State Key Laboratory\nof Electrical Insulation and Power Equipment, School of Electrical\nEngineering, Xi’an Jiaotong University, Xi’an, 710054, Shaanxi, China.\n*Corresponding author(s). E-mail(s): xin.chen.nj@xjtu.edu.cn;\nAbstract\nTime series motifs are used for discovering higher-order structures of time series\ndata. Based on time series motifs, the motif embedding correlation ﬁeld (MECF)\nis proposed to characterize higher-order temporal structures of dynamical sys-\ntem time series. A MECF-based unsupervised learning approach is applied in\nlocating the source of the forced oscillation (FO), a periodic disturbance that\ndetrimentally impacts power grids. Locating the FO source is imperative for sys-\ntem stability. Compared with the Fourier analysis, the MECF-based unsupervised\nlearning is applicable under various FO situations, including the single FO, FO\nwith resonance, and multiple sources FOs. The MECF-based unsupervised learn-\ning is a data-driven approach without any prior knowledge requirement of system\nmodels or typologies. Tests on the UK high-voltage transmission grid illustrate\nthe eﬀectiveness of MECF-based unsupervised learning. In addition, the impacts\nof coupling strength and measurement noise on locating the FO source by the\nMECF-based unsupervised learning are investigated.\nKeywords: Time series analysis, higher-order motif, Forced oscillation, Power grids\n1\nIntroduction\nFor a wide range of spatiotemporal dynamical systems, time series of system states\nare essential for analyzing their inherent dynamics [1–3]. Time series motifs are used\nfor discovering higher-order structures of the time series of system dynamics and have\n1\nproven eﬀective for various tasks, from time series complexity measurement [4] to\nmachine malfunction detection [5]. The time series motifs are smaller segments of the\ntime series with ﬁxed lengths and varying time delays, enabling to extract features of\nthe time series at a mesoscopic scale. Motivated by the basic idea of time series motifs,\na feature extraction approach called the motif embedding correlation ﬁeld (MECF) is\nproposed by leveraging the correlations between pairs of time series motifs. The great\npotential of the proposed approach is demonstrated by the application in locating the\nforced oscillation (FO) source in power grids.\nThe FO is an essential phenomenon in nonlinear dynamical systems, and has\nattracts lots of research interests [6–8]. In power grids, the FO refers to an undesirable\noscillation phenomenon resulting from exogenous periodic perturbations [9]. Several\nFO events have already occurred in diﬀerent regions, including the power grids of\nChina [10], USA [11], and India [12]. The FO could sustain in the range of seconds\nto several hours, leading to detrimental impacts on the system’s stability [13]. To\nmitigate the consequence of FOs, it is critical to pinpoint the source of FOs, which\nis known as the FO source locating problem. Existing works address the FO source\nlocating problem mainly in two ways: model-based methods and data-driven methods.\nThe model-based methods such as energy functions [14, 15], Luenberger observer [16],\ntransfer functions [17], and graph-theoretic approach [18] take the information about\nthe physical model of power grids into account. However, explicit model parameters or\nnetwork typologies are not always available in practical applications [13]. To overcome\nthis limitation, it is more desirable to design data-driven FO source locating methods\nwithout resorting to the underlying physical model [19].\nIn modern power grids, the growing adoption of monitoring technology, such as\nPhasor Measurement Units (PMUs), has led to increased interest in developing data-\ndriven methods for locating the FO source [20]. Among the existing methods, machine\nlearning has gained signiﬁcant attention in recent years due to its powerful general-\nization ability [21–25]. As a data-driven method, machine learning-based FO source\nlocation requires less or no information about the physical model of power grids. Nev-\nertheless, the performance of machine learning-based methods often relies on eﬀective\nfeature selection and extraction [9].\nIn addition, two common challenges need to be considered for locating the FO\nsource. Firstly, the FO can occur under the resonance condition, where the oscillation\ninduced by the FO source resonates with a natural mode of the power system, render-\ning the FO source hard to be distinguished [26]. Secondly, when multiple concurrent\nFOs occur simultaneously at diﬀerent locations in the power grid, all sources need to\nbe accurately located.\nThe rest of the paper is organized as follows. In Sec. 2, the mathematical model\nand diﬀerent situations of FOs in power grids are introduced. The MECF construc-\ntion procedure of complex dynamical networks is given in Sec. 3. The MECF-based\nunsupervised learning approach for locating the FO source is proposed in Sec. 4. The\nnumerical results of locating the FO by the MECF are presented in Sec. 5. Discussions\nare given in Sec.6 and conclusions are drawn in Sec. 7.\n2\n2\nTransient dynamics of FO in power grids\nThe physical nature of a power grid can be coarse-grained and modeled as a coupled\nphase oscillator network [27, 28]. Each node in the network follows the dynamics\nderived from the swing equation in electrical power engineering [29], a, k, a the second-\norder Kuramoto model in physical communities [30]:\nαi\ndωi\ndt + βiωi = Pi −\nN\nX\nj=1\nKij sin (δi −δj)\n(1)\nwhere N represents the number of nodes in the network. The ith node (i = 1, 2, · · · , N)\nis characterized by the power it generates (Pi > 0) or consumes (Pi < 0). Each\nnode rotates at a phase angle δi (t) with an angular speed ωi (t), both of which are\nmeasured under the reference frame Ω= 2π × 50Hz. The parameter αi and βi is the\ninertia coeﬃcient and damping constant of node i, respectively. The coupling strength\nbetween node i and j is represented by Kij.\nTo maintain the stability of a power grid, the damping can dissipate small dis-\nturbances within the grid. However, sustained periodic disturbances such as FOs are\nsometimes diﬃcult to be damped and can lead to instability problems [31]. FOs\noriginate from sinusoidal disturbances, which can be caused by cyclic loads, electri-\ncal oscillations due to controller malfunctions, or mechanical oscillations of generator\nturbines [10]. The FO is mathematically described as:\nηi = γiei cos (2π (fit + ϕi)) + ξi\n(2)\nThe r.h.s. of Eq. 2 includes two terms. The ﬁrst term represents a sinusoidal FO\nwith γi, fi, and ϕi, denoting the amplitude, frequency, and phase of the FO at node\ni. The binary parameter ei = 1 indicates that node i is the source of the FO, while\nei = 0 otherwise. The second term is a zero-mean Gaussian white noise ξi ∼N(0, σ),\nwhere σ is the standard deviation of the noise.\nLinearizing Eq. 1 and combining it with Eq. 2, we can derive the linear stochastic\npower grid model under the FO as:\n˙Y = ΦY + γe cos (ft + ϕ) + ξ\n(3a)\nΦ =\n\u0014\n⃗0\n⃗1\nH−1L −H−1D\n\u0015\n(3b)\nwhere Y = [δ1, δ2, · · · , δN, ω1, ω2, · · · , ωN]T is the vector representing system states\nof the power grid, ξ = [ξ1, ξ2, · · · , ξN]T is the vector of Gaussian white noise, and the\nmatrices H and D are diagonal matrices of inertia coeﬃcients and damping constants,\nrespectively. The Laplacian matrix of the power grid is L, ⃗0, and ⃗1 denotes the vector\nconsisting of all zeros and all ones, respectively. The vector e indicates the source of\nthe FO, i.e., the ith element equals one if the ith node of the power grid is the source\nof FO, and all other elements are zero.\n3\n3\nMECF for complex dynamical networks\nFor a dynamical network system, the time series of system states at all nodes can\nbe denoted as X ∈RN×T = {xi}, where i = 1, 2, · · · , N and t = 1, 2, · · · , T are\nthe indices for nodes and discrete time points, respectively. Considering a power\ngrid with N nodes, the time series of angular speed at node i is denoted as xi =\n[ωi(1), ωi(2), ..., ωi(T )]. To construct the MECF of xi, the following procedure is\nadopted (where xi is represented as x for simplicity). First, the time delay embed-\nding [32] is utilized to extract both dynamical and geometrical properties of x from a\nphase space perspective. The time delay embedding reconstructs the time series with\nembedding dimension m and time delay τ as follows:\nˆx = {ˆx (t) , t = 1, 2, · · ·T −(m −1) τ}\n(4a)\nˆx (t) =\nm\nX\nj=1\nx (t + (j −1) τ)ej\n(4b)\nwhere the vector ej is an unit vector and span an orthogonal coordinate system. For\nexample, if m=3 and τ=2, then\nˆx =\n\n\nx(1)\nx(3)\nx(5)\nx(2)\nx(4)\nx(6)\nx(3)\nx(5)\nx(7)\n...\n...\n...\nx(T −4) x(T −2) X(T )\n\n\n(5)\nNext, the sequence of time series motif of ˆx is deﬁned as\nM n\nd = {M n\nd (s) , s = 1, 2, · · · , T −(m −1) τ −(n −1) d}\n(6a)\nM n\nd (s) = {ˆx (s) , ˆx (s + d) , ˆx (s + 2d) , · · · , ˆx (s + (n −1) d)}\n(6b)\nwhere parameters n and d are the length of a time series motif and the displacement,\nrespectively, s is the start time point of a time series motif M n\nd (s). For example, if\nn=3, d=2, m=3, and τ = 2, then for s = T −(m −1)τ −(n −1)d = T −8, we have\nMn\nd(T −8) =\n\n\nx(T −8) x(T −6) x(T −4)\nx(T −6) x(T −4) x(T −2)\nx(T −4) x(T −2)\nx(T )\n\n\n(7)\nThe motif M n\nd (s) contains high-order local information of the original time series\nx. Rather than analyzing the entire time series, investigating statistical relationships\nbetween diﬀerent time series motifs allows us to ﬁnd mesoscopic features. The sequence\nof statistical relationships between each pair of consecutive time series motifs ˜\nM\nn\nd is\ndeﬁned as\n˜\nM\nn\nd = {φ ⟨M n\nd (s) , M n\nd (s + d)⟩, s = 1, 2, · · · , T −(m −1) τ −nd}\n(8)\n4\nwhere the operation function φ ⟨·⟩calculates the statistical relationships between two\ntime series motifs. The 2D correlation coeﬃcient is employed as the operation function:\nφ ⟨A, B⟩=\nP\ni\nP\nj\n\u0000Aij −¯\nA\n\u0001 \u0000Bij −¯\nB\n\u0001\nrhP\ni\nP\nj\n\u0000Aij −¯\nA\n\u00012i hP\ni\nP\nj\n\u0000Bij −¯\nB\n\u00012i\n(9)\nIn Eq. 9, A and B denote two time series motifs, where Aij and Bij refer to\nthe element at the ith row and jth column of A and B, respectively. The mean of\nthe elements in A and B are denoted as ¯\nA and ¯\nB, respectively. The 2D correlation\ncoeﬃcient ranges from -1 to 1, where a value of 1 represents a strong positive corre-\nlation, -1 represents a strong negative correlation, and 0 indicates no correlation. As\nshown in Eqs. 8 and 9, the correlation between two time series motifs not only varies\nwith diﬀerent starting time points s, but also with diﬀerent displacements d, allowing\nto capture the multi-scale correlation between a pair of series motifs. Speciﬁcally, for\nsmall values of d, the short-range correlation between two close time series motifs is\ncalculated, while for larger values of d, the long-range correlation between two dis-\ntant time series motifs is calculated. The range of possible displacements is given by\n1 < d ⩽dmax, yielding 1 +\nj\nT −(m−1)τ−(n+1)\nn−1\nk\n, where T −(m −1)τ > n. Since the\nlength of the sequence ˜\nM\nn\nd deﬁned in Eq. 8 varies with diﬀerent d, we construct a new\nsequence, denoted as In\nd, to align ˜\nM\nn\nd to the same length. For each displacement d, In\nd\nis initially set to be ˜\nM\nn\nd and then appends with zero recursively until the total length\nof In\nd equals to 2T −2 (m −1) τ −n (1 + dmax), which can be described as follows:\nIn\nd (s) =\n(\nφ ⟨M n\nd (s) , M n\nd (s + d)⟩, if 1 < s ⩽T −(m −1) τ −nd\n0, if T −(m −1) τ −nd < s ⩽2T −2 (m −1) τ −n (1 + dmax)\n(10)\nThe stack of In\nd with d = 1 to d = dmax will form a matrix\nGn =\n\b\nIn\n1 , In\n2 , · · · , In\ndmax\n\t\n(11)\nFinally, the following operation is conducted to generate the MECF\nF n = Gn + `\nG\nn\n(12)\nwhere `\nG\nn is the 180 degrees rotation of Gn, and the matrix F n is deﬁned as the\nMECF of the time series x.\nIn summary, given a time series x, the corresponding MECF F n can be constructed\nby three main procedures shown in Fig. 1. First, the time series x is reconstructed by\nthe time delay embedding as ˆx. Second, the sequence of time series motifs is deﬁned,\nand the 2D correlation between each pair of time series motifs is calculated. Third,\nthe matrix Gn recording the 2D correlations for all pairs of time series motifs is 180\ndegrees rotated as `\nG\nn. The MECF F n is obtained as in Eq. 12.\n5\nFig. 1 MECF construction procedure.\n4\nMECF-based unsupervised learning for FO\nsource location\nThe FO source can be located by the MECF of each node in the power grid. The t-\ndistributed stochastic neighbor embedding (t-SNE)[33] is used to reduce the MECF of\neach node into a two-dimensional embedding. Then, the source of FO can be located\nby ﬁnding the outlier among the two-dimensional embeddings for MECFs of all nodes,\ni.e., the embedding of the FO source is an outlier compared to the embeddings of\nother nodes.\nAn unsupervised clustering is employed to identify the outlier among the embed-\ndings. First, a Euclidean distance matrix L is deﬁned to measure the distance between\neach pair of embeddings. The matrix L is symmetrical, i.e., Li,j = Lj,i, and its ele-\nment Li,j corresponds to the distance between the embeddings of node i and node j,\nwhere i, j = 1, 2, · · · , N and i ̸= j. Speciﬁcally, Li,j =\nq\u0000lx\ni −lx\nj\n\u00012 +\n\u0000ly\ni −ly\nj\n\u00012, where\nlx\ni and lx\nj are the coordinates of the embeddings of nodes i and j, respectively. Next,\nthe average distance from the embedding of each node to the others is calculated as\n˜Li =\n1\nN−1\nPN\nj=1 Lij. All average distances ˜Li belong to the average distance set ˜L, i.e.,\n˜Li ∈˜L for i = 1, 2, ..., N. The empirical distribution of all ˜Li in the average distance\nset ˜L is denoted as p(˜Li). By Chebyshev’s inequality[34], which is applicable to arbi-\ntrary distributions provided they have a known ﬁnite mean and variance, it is known\nthat a randomly selected sample ˜Li from the average distance set ˜L has a very low\nprobability of approximately 4% lying beyond ﬁve standard deviations of the mean of\nthe distribution p(˜Li), denoted as Vp. The outlier is identiﬁed as any embedding with\nthe average distance ˜Li larger than Vp, and the corresponding FO source is located\naccordingly.\n6\n5\nNumerical results\nThe MECF-based unsupervised learning is applied for locating the FO source in the\nUK high-voltage transmission grid shown in Fig. 2. As shown in Fig.2(a), the UK high-\nvoltage transmission grid consists of 120 nodes and 165 edges [35, 36]. The transient\ndynamics of each node is obtained by solving the stochastic power grid model in Eq.\n3. The standard deviation of noise σ = 0.05 and coupling strength Kij = K = 15.\nAccording to Eqs. 4 to 12, the MECF is constructed for the time series of angular\nspeed of each node. The embedding dimension m=3, the time delay τ = 2, the motif\nlength of time series n=3, and the displacement d=2. For each node, the time series\nof angular speed from 0s to 30s are used for constructing the MECF, with a time\nstep of 0.01. The following three diﬀerent FO situations are considered to test the\neﬀectiveness of MECF-based unsupervised learning in locating the FO source:\n• Single FO: Only one single source FO occurs in the power grid, which is the most\ncommon scenario in practical power systems.\n• FO with resonance: resonance is a well-known phenomenon in physics, where an\napplied periodic force with a frequency close to or equal to the natural frequency\nof the system will lead to an increased amplitude of oscillations. Resonance can\noccur when the FO frequency coincides with the natural frequency of a power grid’s\noscillation mode. Usually, the engineering intuition suggests that oscillations near\nthe FO source would be most severe. However, it is counter-intuitive for the FO\nwith resonance, i.e., the oscillation amplitude at the resonator is even larger than\nthat at the FO source. It is worth noting that the FO with resonance poses addi-\ntional challenges in locating the source accurately, as the ampliﬁcation of oscillation\namplitudes at resonator nodes can lead to misleading information.\n• Multiple concurrent FOs: Multiple concurrent FOs involves the occurrence of\nmore than one FO source simultaneously, which locate at diﬀerent nodes in the\npower grid [22]. The amplitude and frequency of each FO source may be diﬀerent,\nmaking it challenging to locate all the sources of multiple concurrent FOs.\nFig.2 (b) to (d) shows angular speeds under the single FO, FO with resonance,\nand multiple concurrent FOs. The single FO is shown in Fig.2(b), where the curve\nin blue and green is the angular speed of the FO source with f = 0.5Hz and a\nrandomly selected node, respectively. The angular speed of the FO source exhibits\na more regular and periodic pattern in comparison to that of the randomly selected\nnode. Fig.2(c) illustrates the FO with resonance. The blue curve is the angular speed\nof the FO source with f = 0.3Hz, while the red curve is the angular speed of the\ncorresponding resonator. The curve in green is the angular speed of a randomly selected\nnode. Although the geographical distance between the FO source and corresponding\nresonator is far, i.e., as shown in Fig. 2(a), the FO source and corresponding resonator\nlocates at the triangle node and black circle node, respectively, the amplitude and\nperiodic pattern of the resonator are similar with the FO source. Fig.2(d) shows the\nmultiple concurrent FOs. The blue and red curves represent the angular speed of two\nFO sources with frequencies of f = 0.4 Hz and f = 0.2 Hz, respectively. The sources\nof these two FOs are situated at the triangle node and the square node as indicated\nin Fig.2(a).\n7\nFig. 2 FOs in the UK high-voltage transmission grid. (a) The topology of the UK high-voltage\ntransmission grid with 120 nodes and 165 edges. (b) Angular speeds of the f = 0.5Hz single FO.\nThe curve in blue and green is the angular speed of the FO source and a randomly selected node,\nrespectively. (c) Angular speeds of the f = 0.3Hz FO with resonance. The curve in blue, red, and\ngreen is the angular speed of the FO source, resonator, and randomly selected node, respectively. (d)\nAngular speeds of multiple concurrent FOs. The curve in blue, red, and green is the angular speed of\nthe FO source with frequency f = 0.4Hz, the FO source with frequency f = 0.2Hz, and a randomly\nselected node, respectively. In (b) to (d), the curves in gray are the angular speeds of other nodes.\nEmbeddings of the MECF are illustrated in Fig. 3 (a) to (c), which are normalized\nwithin the range [0, 1]. Fig. 3 (a) shows embeddings under the single FO, with the\nblue circle indicating the embedding of the FO source. Fig. 3 (b) shows embeddings\nunder the FO with resonance, where the blue solid square and the red square are\nthe embeddings of the FO source and resonator, respectively. Embeddings of multiple\nconcurrent FOs with frequencies of 0.2 Hz and 0.4 Hz are shown in Fig. 3 (c), where\nthe blue solid triangle and the red triangle represent the embedding of the FO source\nwith the frequency of 0.2 Hz and 0.4 Hz, respectively. The gray solid points in Fig.\n3 (a) to (c) represent the embeddings of other nodes excluding the FO source and\nresonator.\nFrom Fig. 3 (a) to (c), it can be found that the embedding of the FO source is\ndistinct from the highly-clustered embeddings of other nodes. In Fig. 3 (a) to (c), the\naverage distance ˜Li of the FO source is 0.7, 0.85, and 0.75, respectively, while the\naverage distance ˜Li of other nodes is approximately 0.2, 0.25, and 0.22, respectively.\nIn other words, the average distance ˜Li of the FO source is at least three times greater\nthan that of other nodes. It is also noteworthy that, in Fig. 3 (b), compared to the\ndistance to the FO source, the embedding of the resonator is closer to the highly-\nclustered embeddings of other nodes.\nFor t-SNE embeddings in Fig. 3 (a) to (c), the empirical distributions of average\ndistances p(˜Li) are shown in Fig. 4 (a) to (c). The gray bars in Fig. 4 illustrate\nthe probability distributions of p(˜Li). The ˜Li corresponding to the FO sources are\nrepresented by the blue line with circles in Fig. 4 (a), the blue line with squares in Fig.\n4 (b), and the blue and red lines with triangles in Fig. 4 (c). The black dashed lines\n8\n0\n0.25 0.5 0.75\n1\n0\n0.25\n0.5\n0.75\n1\n(a) single FO\n0\n0.25 0.5 0.75\n1\n0\n0.25\n0.5\n0.75\n1 (b) FO with resonance\n0\n0.25 0.5 0.75\n1\n0\n0.25\n0.5\n0.75\n1(c) multiple concurrent FOs\nFig. 3 The t-SNE embeddings of MECFs. (a) Embeddings of the single FO. The blue circle indicates\nthe embedding of the FO source. (b) Embeddings of the FO with resonance. The blue solid square and\nred square corresponds to the embedding of the FO source and resonator, respectively. (c) Embeddings\nof multiple concurrent FOs. The blue solid triangle and red triangle shows the embedding of the\nFO source with frequency 0.2 Hz and 0.4 Hz, respectively. The gray dots in (a) to (c) indicate the\nembeddings of other nodes excluding the FO source and resonator.\nin Fig. 4 indicate the Vp. As introduced in Sec. 4, it is worth noting that the ˜Li of\nthe FO source is larger than the Vp, which can be treated as an outlier. Furthermore,\nit can be found that the ˜Li associated with the resonator, as illustrated by the red\nsquare line in Fig. 4 (b), is smaller than the Vp, i.e., the ˜Li of the resonator is not\nan outlier. Hence, the FO source can be located by ﬁnding the outlier even under the\nresonance condition.\n(a) single FO\n0.2 0.4 0.6 0.8\n1\n0\n0.1\n0.2\n0.3\n(b) FO with resonance\n0.2 0.4 0.6 0.8\n1\n0\n0.1\n0.2\n0.3\n(c) multiple concurrent FOs\n0.2 0.4 0.6 0.8\n1\n0\n0.1\n0.2\n0.3\nFig. 4 The empirical distributions p(˜Li) of average distances ˜Li. The gray bars in (a) to (c) represent\nthe p(˜Li). The blue line with circles in (a), the blue line with squares in (b), and the blue and red\nlines with triangles in (c) indicate the ˜Li of FO sources. The red line with squares in (b) represents\nthe resonator. The black dashed lines indicate ﬁve standard deviations of the mean Vp of distributions\np(˜Li).\n6\nDiscussion\n6.1\nComparison: MECF-based unsupervised learning and\nFourier analysis\nThe performance of the MECF and Fourier analysis on locating the FO source are\ncompared. Fig.5 (a) to (d) shows visualizations of MECFs. The colors represent the\ncorrelations of time series motifs calculated by Eq.9, i.e., the colors from black to\nwhite are correlations for pairs of time-series motifs from strongly negative to strongly\n9\npositive. Fig.5 (a) is the visualization of MECF for the FO with the frequency 0.3Hz,\nas shown by the blue curve in Fig. 2 (c). The MECF shows alternatively bright and\ndark zones, reﬂecting that the MECF extracts periodic features from the angular\nspeed time series of the FO source. As introduced in Sec. 3, for each element in the\nMECF, the correlation between a pair of time-series motifs is calculated. When a pair\nof time series motifs are both around the peaks or bottoms of the angular speed time\nseries, the correlation exhibits a strong positive association, indicated by bright zones\nin Fig.5 (a). When one of the time series motifs is around the peak and the other is\naround the bottom of the angular speed time series, the correlation is characterized\nby a strong negative association, shown as dark zones in Fig.5 (a).\nFor the FO with resonance, Fig.5 (b) is the visualization of the MECF of the\nresonator. In comparison to the MECF of the FO source in Fig.5 (a), the distinct\nboundaries between bright and dark zones become slightly stochastic, which is an obvi-\nous feature to distinguish the FO source from the corresponding resonator. Fig. 5 (c)\nand (d) show the MECF of FO source with frequency 0.2Hz and 0.4Hz, respectively.\nIn Fig. 5 (c) and (d), the regular pattern of bright and dark zones can be found, while\nthe number and size of the bright and dark zone are diﬀerent. Fig.5 (e) illustrates\nthe MECF of a randomly selected node. The distribution of bright and dark zones is\nalmost stochastic, making it distinct from MECFs of the FO and resonator.\nThe Fourier analysis, a standard signal processing method, is compared with the\nMECF on locating the FO source. Fig. 5 (f) and Fig. 5 (e) show the results of Fourier\nanalysis. With the Fourier analysis, the FO source can be located by identifying peaks\nof Fourier components within the Fourier spectra. Fig. 5 (f) is the Fourier spectra of\nthe FO situation shown in Fig. 2 (c). The Fourier spectra have been re-scaled within\nthe range [0, 1]. The bars with blue dots, red squares, and green triangles represent\nthe Fourier components of the FO source, the resonator, and a randomly selected\nnode, respectively. The gray bars correspond to other nodes excluding the FO source\nand resonator. From the blue bars in Fig. 5 (f), it can be found that the Fourier\ncomponents for the FO source have a peak around 0.3Hz, rendering it distinguishable\nfrom the Fourier components of other nodes. However, the peaks of the FO source\nand the corresponding resonator overlapped in the vicinity of 0.3Hz. Hence, under the\nresonance condition, the FO source can’t be located by the Fourier analysis. For the\nFourier spectra shown in Fig. 5 (g), two peaks around 0.2Hz and 0.4Hz correspond to\nthe frequencies of two diﬀerent FO sources. The bars with blue dots, red squares, and\ngreen triangles are the Fourier components of the FO source with frequency f = 0.2Hz,\nthe FO source with frequency f = 0.4Hz, and a randomly selected node, respectively.\nIt can be found that the Fourier components of the randomly selected node are highly\noverlapped with the peaks of two FO sources. Hence, under multiple concurrent FOs,\nthe FO source failed to be located by the Fourier analysis.\n6.2\nImpacts of coupling strength and noise\nThe nature of FO in a power grid is a signal propagating on a spatiotemporal sys-\ntem. The propagation of signals are determined by the interplay between the network\ntopology and the interaction dynamics [37] . The topology of a power grid is weighted,\ni.e., the coupling strength indicates the capacity of the transmission line between two\n10\n(a) FO with 0.3 Hz\n1\n0\n-1\n(b) resonator\n(d) FO with 0.4 Hz\n0\n0.5\n1\n(f) FFT of FO with resonance\n0\n0.2\n0.4\n0.6\n0.8\n1\n0\n0.2\n0.4\n0.6\n0.8\n1\n(g) FFT of multiple concurrent FOs\n(c) FO with 0.2 Hz\n(e) a random node\nFig. 5 The MECF and Fourier analysis on locating the FO source in the UK high-voltage transmis-\nsion grid. (a) The MECF of FO source with f = 0.3Hz and (b) the corresponding resonator. (c) and\n(d) The MECFs of multiple concurrent FOs sources with f = 0.2Hz and f = 0.4Hz, respectively. (e)\nThe MECF of a randomly selected node. (f) Fourier analysis of the FO with resonance. (g) Fourier\nanalysis of multiple concurrent FOs. In (f), bars with blue dots, red squares, and green triangles cor-\nrespond to the FO source with f = 0.3Hz, the corresponding resonator, and a randomly selected\nnode. In (g), bars with blue dots, red squares, and green triangles correspond to the FO source with\nf = 0.2Hz, the FO source with f = 0.4Hz, and a randomly selected node. The gray bars correspond\nto the other nodes excluding the FO source and resonator.\nnodes. Meanwhile, the measured data of practical power system dynamics such as\nthe PMU data is inevitably accompanied by noise, and the noise will undermine the\nperformance on locating the FO source[38].\n11\n(a) single FO\n0\n0.1\n0.2\n15\n20\n25\n30\n3\u0000(b) FO with resonance\n0\n0.1\n0.2\n15\n20\n25\n\u0001\u0002\n\u0003\u0004\n(c) resonator\n0\n0.1\n0.2\n15\n20\n25\n\u0005 \u0006\n\u0007 \b\n(d) concurrent FO\n(e) concurrent FO\n0\n0.1\n0.2\n15\n20\n25\n\t\n\u000b\f\n0\n0.1\n0.2\n15\n20\n25\n\r \u000e\n\u000f \u0010\nFig. 6 Locating the FO source under diﬀerent coupling strength K and noise standard deviation σ.\nThe FO source can be correctly located in the power grid with K and σ within green areas. The FO\nsource failed to be located in the power grid with K and σ within red areas. Black dashed lines at\nboundaries of green and red areas indicate the critical values of K and σ. (a) and (b) corresponds\nto the single FO and the FO with resonance, respectively. (c) represents the resonator under the\nresonance condition. (d) and (e) illustrate multiple concurrent FOs.\nThe impacts of coupling strength K and standard deviation of noise σ on locating\nthe FO source by the MECF are shown in Fig. 6. To simplify the analysis, the homo-\ngeneous coupling strength is assumed throughout the network, denoted as Kij = K\nfor all edges (i,j). As shown in Eq. 2, the Gaussian white noise is added to the FO sig-\nnal. The values of K range from 15 to 30, while σ ranges from 0 to 0.3. Fig. 6 (a) to\n(c) correspond to the single FO, FO with resonance, and the corresponding resonator.\nFig. 6 (d) and (e) correspond to multiple concurrent FOs. Using t-SNE embeddings\nof MECFs to locate the FO source relies on the identiﬁcation of outliers, i.e., if the\n˜Li of an embedding exceeds the threshold Vp, it is an outlier and the corresponding\nnode is the FO source. In Fig. 6, values of K and σ in green regions ensure the ˜Li\nof FO source is larger than Vp. Conversely, values of K and σ in red regions result in\nthe ˜Li of FO source being smaller than Vp. Critical values of K and σ are represented\nby dashed black lines at boundaries between the green and red regions. For the power\ngrid with σ and K smaller than critical values, the FO source can be correctly located\nby t-SNE embeddings of MECFs. The critical value of coupling strength in Fig. 6 (a),\n(b), (d), and (e) approximately ranges in K ≈[15, 30]. According to existing litera-\nture [30, 39, 40], the coupling strength in power systems typically ranges from K = 10\nto 22. Therefore, the MECF is adaptable for the typical range of coupling strength in\npower systems. Meanwhile, both experimental tests and theoretical studies show that\n12\nthe noise standard deviation σ in PMU data is usually σ ≈[0, 0.1] [41, 42]. The criti-\ncal value of noise standard deviation σ in Fig. 6 (a), (b), (d), and (e) ranges [0, 0.2],\ncovering the range of noise standard deviation in experimental tests and theoretical\nstudies. Hence, the MECF is adaptable for locating the FO source under measurement\nnoise. In addition, it can be found that only the red region is shown for the resonator\nin Fig. 6 (c). In other words, the ˜Li of the resonator is consistently smaller than the\nVp. Hence, for any coupling strength K and noise standard deviation σ, the resonator\nhas no impact on locating the FO source by the MECF.\n7\nConclusions\nThe MECF is proposed as a novel approach for extracting high-order structures in time\nseries. The MECF reveals high-order structures of time series by analyzing correlations\nbetween time series motifs with diﬀerent displacements and time delays. With the time\nseries of transient dynamics in power grids, the MECF-based unsupervised learning is\napplied as a data-driven classiﬁcation method for locating the FO source. Numerical\nresults on the UK high-voltage transmission grid illustrate that the MECF-based\nunsupervised learning can correctly locate the FO source under situations of the single\nFO, the FO with resonance, and multiple concurrent FOs. Further discussions show\nthat compared with the Fourier analysis, a standard signal processing approach, the\nMECF-based unsupervised learning has better performance in locating the FO source.\nMeanwhile, the MECF-based unsupervised learning is proved eﬀective for a typical\nrange of coupling strengths and measurement noise in power grids.\nThe utility of MECF is anticipated to extend beyond power grids to other dynami-\ncal systems with available data. In addition, the MECF can potentially act as a feature\nengineering tool to improve the classiﬁcation and prediction performance of machine\nlearning tasks, which will be our future studies.\nAcknowledgments.\nThis work was supported in part by the HPC Platform, Xi’an\nJiaotong University. Long Huo acknowledges the China Scholarship Council (CSC)\nscholarship.\nReferences\n[1] Yuan, K., Wu, K., Liu, J.: Is single enough? a joint spatiotemporal feature learning\nframework for multivariate time series prediction. IEEE Transactions on Neural\nNetworks and Learning Systems (2022)\n[2] Severiano, C.A., Silva, P.C.d.L., Cohen, M.W., Guimar˜aes, F.G.: Evolving\nfuzzy time series for spatio-temporal forecasting in renewable energy systems.\nRenewable Energy 171, 764–783 (2021)\n[3] Zeyringer, M., Price, J., Fais, B., Li, P.-H., Sharp, E.: Designing low-carbon power\nsystems for great britain in 2050 that are robust to the spatiotemporal and inter-\nannual variability of weather. Nature Energy 3(5), 395–403 (2018)\n13\n[4] Fadlallah, B., Chen, B., Keil, A., Pr´ıncipe, J.: Weighted-permutation entropy: A\ncomplexity measure for time series incorporating amplitude information. Phys.\nRev. E 87, 022911 (2013)\n[5] Zhang, Y., Gan, F., Chen, X.: Motif diﬀerence ﬁeld: An eﬀective image-based\ntime series classiﬁcation and applications in machine malfunction detection. In:\n2020 IEEE 4th Conference on Energy Internet and Energy System Integration\n(EI2), pp. 3079–3083 (2020)\n[6] Orazov, B., O’Reilly, O.M., Zhou, X.: On forced oscillations of a simple model for\na novel wave energy converter: non-resonant instability, limit cycles, and bounded\noscillations. Nonlinear Dynamics 67, 1135–1146 (2012)\n[7] Inoue, T., Ishida, Y.: Nonlinear forced oscillation in a magnetically levitated sys-\ntem: the eﬀect of the time delay of the electromagnetic force. Nonlinear Dynamics\n52, 103–113 (2008)\n[8] Han, X., Bi, Q.: Eﬀects of amplitude modulation on mixed-mode oscillations in\nthe forced van der pol equation. Nonlinear Dynamics, 1–10 (2023)\n[9] Ghorbaniparvar, M.: Survey on forced oscillations in power system. Journal of\nModern Power Systems and Clean Energy 5(5), 671–682 (2017)\n[10] Ye, H., Liu, Y., Zhang, P., Du, Z.: Analysis and detection of forced oscillation in\npower system. IEEE Transactions on Power Systems 32(2), 1149–1160 (2016)\n[11] Follum, J., Pierre, J.W., Martin, R.: Simultaneous estimation of electromechanical\nmodes and forced oscillations. IEEE Transactions on Power Systems 32(5), 3958–\n3967 (2016)\n[12] Mondal, B., Choudhury, A.K., Viswanadh, M., Barnwal, S., Jain, D.: Application\nof pmu and scada data for estimation of source of forced oscillation. In: 2019 Inter-\nnational Conference on Smart Grid Synchronized Measurements and Analytics\n(SGSMA), pp. 1–7 (2019). IEEE\n[13] Wang, B., Sun, K.: Location methods of oscillation sources in power systems: a\nsurvey. Journal of modern power systems and clean energy 5(2), 151–159 (2017)\n[14] Tang, F., Wang, B., Liao, Q., Pisani, C., Dong, C., Jia, J., Guo, K.: Research\non forced oscillations disturbance source locating through an energy approach.\nInternational Transactions on Electrical Energy Systems 26(1), 192–207 (2016)\n[15] Maslennikov, S., Litvinov, E.: Iso new england experience in locating the source of\noscillations online. IEEE Transactions on Power Systems 36(1), 495–503 (2020)\n[16] Li, S., Luan, M., Gan, D., Wu, D.: A model-based decoupling observer to locate\nforced oscillation sources in mechanical power. International Journal of Electrical\n14\nPower & Energy Systems 103, 127–135 (2018)\n[17] Zhou, N., Ghorbaniparvar, M., Akhlaghi, S.: Locating sources of forced oscilla-\ntions using transfer functions. In: 2017 IEEE Power and Energy Conference at\nIllinois (PECI), pp. 1–8 (2017). IEEE\n[18] Nudell, T.R., Chakrabortty, A.: Graph-theoretic methods for measurement-based\ninput localization in large networked dynamic systems. IEEE Transactions on\nAutomatic Control 60(8), 2114–2128 (2015)\n[19] Huang, T., Freris, N.M., Kumar, P., Xie, L.: Localization of forced oscillations in\nthe power grid under resonance conditions. In: 2018 52nd Annual Conference on\nInformation Sciences and Systems (CISS), pp. 1–5 (2018). IEEE\n[20] Usman, M.U., Faruque, M.O.: Applications of synchrophasor technologies in\npower systems. Journal of Modern Power Systems and Clean Energy 7(2),\n211–226 (2019)\n[21] Meng, Y., Yu, Z., Lu, N., Shi, D.: Time series classiﬁcation for locating forced\noscillation sources. IEEE Transactions on Smart Grid 12(2), 1712–1721 (2020)\n[22] Chevalier, S., Vorobev, P., Turitsyn, K.: A bayesian approach to forced oscilla-\ntion source location given uncertain generator parameters. IEEE Transactions on\nPower Systems 34(2), 1641–1649 (2018)\n[23] Feng, S., Chen, J., Ye, Y., Wu, X., Cui, H., Tang, Y., Lei, J.: A two-stage\ndeep transfer learning for localisation of forced oscillations disturbance source.\nInternational Journal of Electrical Power & Energy Systems 135, 107577 (2022)\n[24] Talukder, S., Liu, S., Wang, H., Zheng, G.: Low-frequency forced oscillation source\nlocation for bulk power systems: A deep learning approach. In: 2021 IEEE Inter-\nnational Conference on Systems, Man, and Cybernetics (SMC), pp. 3499–3404\n(2021). IEEE\n[25] Matar, M., Estevez, P.G., Marchi, P., Messina, F., Elmoudi, R., Wshah, S.:\nTransformer-based deep learning model for forced oscillation localization. Inter-\nnational Journal of Electrical Power & Energy Systems 146, 108805 (2023)\n[26] Huang, T., Freris, N.M., Kumar, P., Xie, L.: A synchrophasor data-driven method\nfor forced oscillation localization under resonance conditions. IEEE Transactions\non Power Systems 35(5), 3927–3939 (2020)\n[27] Anvari, M., Hellmann, F., Zhang, X.: Introduction to focus issue: Dynamics of\nmodern power grids. Chaos: An Interdisciplinary Journal of Nonlinear Science\n30(6), 063140 (2020)\n15\n[28] D¨orﬂer, F., Chertkov, M., Bullo, F.: Synchronization in complex oscillator net-\nworks and smart grids. Proceedings of the National Academy of Sciences 110(6),\n2005–2010 (2013)\n[29] Choi, Y.-P., Li, Z.: Synchronization of nonuniform kuramoto oscillators for power\ngrids with general connectivity and dampings. Nonlinearity 32(2), 559 (2019)\n[30] Filatrella, G., Nielsen, A.H., Pedersen, N.F.: Analysis of a power grid using a\nkuramoto-like model. The European Physical Journal B 61(4), 485–491 (2008)\n[31] Kosterev, D.N., Taylor, C.W., Mittelstadt, W.A.: Model validation for the august\n10, 1996 wscc system outage. IEEE transactions on power systems 14(3), 967–979\n(1999)\n[32] Thiel, M., Romano, M.C., Kurths, J.: Spurious structures in recurrence plots\ninduced by embedding. Nonlinear Dynamics 44, 299–305 (2006)\n[33] Maaten, L., Hinton, G.: Visualizing data using t-sne. Journal of machine learning\nresearch 9(11) (2008)\n[34] Feller, W.: An introduction to probability theory and its applications. Technical\nreport, Wiley series in probability and mathematical statistics, 3rd edn.(Wiley,\nNew York, 1968 (1967)\n[35] Manik, D., Witthaut, D., Sch¨afer, B., Matthiae, M., Sorge, A., Rohden, M.,\nKatifori, E., Timme, M.: Supply networks: Instabilities without overload. The\nEuropean Physical Journal Special Topics 223(12), 2527–2547 (2014)\n[36] Simonsen, I., Buzna, L., Peters, K., Bornholdt, S., Helbing, D.: Transient dynam-\nics increasing network vulnerability to cascading failures. Physical review letters\n100(21), 218701 (2008)\n[37] Hens, C., Harush, U., Haber, S., Cohen, R., Barzel, B.: Spatiotemporal signal\npropagation in complex networks. Nature Physics 15(4), 403–412 (2019)\n[38] Khan, M.A., Pierre, J.W.: Separable estimation of ambient noise spectrum\nin synchrophasor measurements in the presence of forced oscillations. IEEE\nTransactions on Power Systems 35(1), 415–423 (2019)\n[39] Rohden, M., Sorge, A., Witthaut, D., Timme, M.: Impact of network topology\non synchrony of oscillatory power grids. Chaos: An Interdisciplinary Journal of\nNonlinear Science 24(1), 013123 (2014)\n[40] Rohden, M., Sorge, A., Timme, M., Witthaut, D.: Self-organized synchronization\nin decentralized power grids. Physical review letters 109(6), 064101 (2012)\n[41] Brown, M., Biswal, M., Brahma, S., Ranade, S.J., Cao, H.: Characterizing and\nquantifying noise in pmu data. In: 2016 IEEE Power and Energy Society General\n16\nMeeting (PESGM), pp. 1–5 (2016). IEEE\n[42] Zhang, X., Lu, C., Lin, J., Wang, Y.: Experimental test of pmu measurement\nerrors and the impact on load model parameter identiﬁcation. IET Generation,\nTransmission & Distribution 14(20), 4593–4604 (2020)\n17\n",
  "categories": [
    "cs.LG",
    "stat.ME"
  ],
  "published": "2023-06-23",
  "updated": "2023-06-23"
}