{
  "id": "http://arxiv.org/abs/2309.17035v1",
  "title": "Contextualising Levels of Language Resourcedness affecting Digital Processing of Text",
  "authors": [
    "C. Maria Keet",
    "Langa Khumalo"
  ],
  "abstract": "Application domains such as digital humanities and tool like chatbots involve\nsome form of processing natural language, from digitising hardcopies to speech\ngeneration. The language of the content is typically characterised as either a\nlow resource language (LRL) or high resource language (HRL), also known as\nresource-scarce and well-resourced languages, respectively. African languages\nhave been characterized as resource-scarce languages (Bosch et al. 2007;\nPretorius & Bosch 2003; Keet & Khumalo 2014) and English is by far the most\nwell-resourced language. Varied language resources are used to develop software\nsystems for these languages to accomplish a wide range of tasks. In this paper\nwe argue that the dichotomous typology LRL and HRL for all languages is\nproblematic. Through a clear understanding of language resources situated in a\nsociety, a matrix is developed that characterizes languages as Very LRL, LRL,\nRL, HRL and Very HRL. The characterization is based on the typology of\ncontextual features for each category, rather than counting tools, and\nmotivation is provided for each feature and each characterization. The\ncontextualisation of resourcedness, with a focus on African languages in this\npaper, and an increased understanding of where on the scale the language used\nin a project is, may assist in, among others, better planning of research and\nimplementation projects. We thus argue in this paper that the characterization\nof language resources within a given scale in a project is an indispensable\ncomponent particularly in the context of low-resourced languages.",
  "text": "Contextualising Levels of Language Resourcedness affecting Digital Processing \nof Text  \n \nC. Maria Keeta and Langa Khumalob \n \na Department of Computer Science, University of Cape Town, South Africa. \nEmail: mkeet@cs.uct.ac.za.  \nb South African Centre for Digital Language Resources, North-West University, South Africa. \nEmail: langa.khumalo@nwu.ac.za.  \n \n \nAbstract \nApplication domains such as digital humanities and tool like chatbots involve some form of processing \nnatural language, from digitising hardcopies to speech generation. The language of the content is \ntypically characterised as either a low resource language (LRL) or high resource language (HRL), also \nknown as resource-scarce and well-resourced languages, respectively. African languages have been \ncharacterized as resource-scarce languages (Bosch et al. 2007; Pretorius & Bosch 2003; Keet & \nKhumalo 2014) and English is by far the most well-resourced language. Varied language resources are \nused to develop software systems for these languages to accomplish a wide range of tasks. In this paper \nwe argue that the dichotomous typology LRL and HRL for all languages is problematic. Through a \nclear understanding of language resources situated in a society, a matrix is developed that characterizes \nlanguages as Very LRL, LRL, RL, HRL and Very HRL. The characterization is based on the typology \nof contextual features for each category, rather than counting tools, and motivation is provided for each \nfeature and each characterization. The contextualisation of resourcedness, with a focus on African \nlanguages in this paper, and an increased understanding of where on the scale the language used in a \nproject is, may assist in, among others, better planning of research and implementation projects. We \nthus argue in this paper that the characterization of language resources within a given scale in a project \nis an indispensable component particularly in the context of low-resourced languages.   \n \nKeywords: LANGUAGE RESOURCES, LOW-RESOURCED LANGUAGES, CORPORA, HUMAN \nLANGUAGE TECHNOLOGIES, NATURAL LANGUAGE PROCESSING, LANGUAGE AUDITS, \nDIGITIZING RESOURCES. \n \n \n \n1. Introduction \n \nDigital Humanities (DH) projects span a wide range of activities and, notably, also languages. \nAn example is the digitisation project of the notebooks in the |xam and !kun languages \n(Southern Africa) as part of the Llarec projecti . Similar projects take place on other continents, \nsuch as the development of digital tools for the Dongba pictogram language (southern China) \n(Xu, 2023), and Ottoman Turkish (Kirmizialtin and Wrisley, 2022).  Neither language is in the \nsame league as English when it asks for OCR tools for digitization, for instance. In fact, tooling \nfor the languages were minimal to non-existent, hampering faster progress in DH research \nbecause the infrastructure hurdles have to be overcome as well. There has been a litany of terms \nused to describe human languages according to the data resources that they have available for \nthe development of their human language technologies. In the context of African languages, \nterms like under-resourced, resource-scarce, less-resourced, low-resourced, or low resource \nlanguages (LRL) have been used to characterize the lack of data resources, which preclude or \nslow down the development of computer-based and data-driven technologies in these \nlanguages. Furthermore, there is an assumption that all African languages are in the same \ncategory as LRL, while conversely a similar assumption obtains, that English and other \nEuropean languages are high resourced languages (HRL). In this paper we provide a deeper \nunderstanding of this complex phenomenon.  \nThe reference to African languages as LRL (Bosch et al. 2007; Pretorius & Bosch 2003; \nKeet & Khumalo 2014), while to a certain degree accurate, does not necessarily apply the same \nway to all the African languages. To appreciate this complexity, we need to understand what \nlanguage resources entails. From the computational side, the natural language processing \n(NLP) literature refers to LRL as having limited online corpora and computational grammars. \nAlternatively, it is formulated in terms of missing something, e.g., “[…] lacking large \nmonolingual or parallel corpora and/or manually crafted linguistic resources sufficient for \nbuilding statistical NLP applications”ii , as if statistical NLP is the benchmark, or “LRLs can \nbe understood as less studied, resource scarce, less computerized, less privileged, less \ncommonly taught, or low density, among other denomination”iii (Tsvetkov, 2017). Compared \nto what? Less than which other language? For instance, Dutch is a well-resourced, but ‘less’ \ncomputerized, language than English and it has much fewer speakers. Clearly, following these \nmeasures, then every language other than English falls in the ‘less than’ category. These \nindications are coarse-grained and do not assist in categorizing which language is where on the \nspectrum. To that end, several attempts have been made by counting a selection of resources \nand devising a metric for classification, such as counting labelled and unlabelled corpora (Joshi \net al., 2020) and availability of data and tools for a list of NLP tasks (Berment, 2004; Krauwer, \n2003). But is the combination of the number of resources and their availability the only \ndimension of a low resourced language? We argue that it is not. \nThis is sharply illustrated in various half-measured attempts to bridge the gap between \nthe LRL and English. In international collaborations for instance, the attitude is one of “just \nget the translators” to create the parallel corpus between language x and English, or “just get a \nfew students to scan the texts” to create the monolingual corpus and digital library, or “quickly \nlist how adjectives work in your language”, and that stance at times in print as well \n(Hämäläinen, 2021). What transpires on the ground is that, even with money available, there \nmay be insufficient translators available, or they are not specialised in the domain one needs \nthe translations, or they are not translators by training. And when there are enough people for \nscanning text, the ‘best’ OCR software is ‘best’ only for the language it is optimised foriv, \nwhich is not the language being scanned and so the scanned text is riddled with errors. One can \nstart over manually typing it up or find a computer scientist to develop language-optimised \nOCR. This meanwhile has been done for the 11 South African languages (Hocking & \nPuttkammer, 2016) – after the IsiZulu National Corpus development was already delayed due \nto scanning errors (Khumalo, 2021). Both are setbacks and cause further delays in trying to \nclose the gap. For the grammar question, it may require a full literature search and compiling \ncontent from different, often outdated, sources that may not have been tested on a sizable \nnumber of words, rather than the well-resourced languages’ assumption that there is an up-to-\ndate grammar book that only needs to be fetched from the bookshelf and digitised. From the \nforegoing, there are more facets to LRLs than simply not having a lot of digital language \nmaterial.v Put differently: the so-called ‘lived reality’ of working with LRLs is not one of \nsimply missing digitized corpora and grammars.  \nThe imperative exists, therefore, that we should have a comprehensive understanding \nof the language resources. This enables researchers to appreciate what the presence or absence \nof a particular resource entails in the characterization of a particular language. Acknowledged, \nthe characterization of HRLs takes a similar sweeping trend. The assumption that all European \nlanguages are as highly resourced as the English language is flawed, especially in the absence \nof a clear matrix that assist in such a characterization.  \nIn this paper we focus on three key issues regarding LRs: what are really the \ndistinguishing characteristics of LRLs (and, by extension, ‘non-LRLs’), what are the \ncharacteristics of levels of resourced-ness, and which language fits where and why? To answer \nthese questions, we first devised a list of 11 key dimensions for languages and then assessed \nwhich of those applies to which level or resourced-ness. This characterisation provides a more \ncomprehensive understanding of the multi-faceted concept of resourced-ness of a language \nbeyond the counting of speakers, tools, and corpora, with a focus on teasing out the details of \n‘low’ resourcedness.  We then took the classification and tried to allocate all 11 official South \nAfrican languages, as well as several other African languages and languages spoken elsewhere \nin the world. This illustrates the classification is operationalizable and may further assist, e.g., \nlanguage policy planning.  \nSection 2 discusses in more detail the typical descriptions of LRLs used in the literature. \nSection 3.1 of this paper discusses the matrix used for characterizing language resources. \nSection 3.2 analysis the features assigned to the various categories in the characterization of \nlanguages as Very LRL, LRL, RL and HRL. It will be shown that while most (European) \nlanguages are classified as HRL, English is leading as a Very HRL, a characterization that \nhitherto did not exist. We discuss in Section 4 and conclude in Section 5.   \n \n \n2. Related work \n \nIn the fields of natural language processing, computational linguistics, and human language \ntechnologies, i.e., from the computing side, the aforementioned ‘lacking …’ view on LRLs is \noften repeated in various wordings across publications, where research papers adopt such \ndescriptions from survey papers and possibly from online media as wellvi. Besacier et al.’s \nsurvey (2014) describes LRLs as “a language with some of (if not all) the following aspects: \nlack of a unique writing system or stable orthography, limited presence on the web, lack of \nlinguistic expertise, lack of electronic resources for speech and language processing, such as \nmonolingual corpora, bilingual electronic dictionaries, transcribed speech data, pronunciation \ndictionaries, vocabulary lists, etc.”, which is roughly repeated in Ranathunga et al. (2021) and \nfrom both surveys to hundreds of research papers. Besacier et al. based their description on the \nBasic Language Resource Kit (BLARK)vii “as the minimal set of language resources that is \nnecessary to do any precompetitive research and education at all”, described in (Krauwer, \n2003), and a similar approach based on counting resources by Berment (2004). Berment \ndistinguishes between low, medium, and well-resourced, and provides a list of types of \nresources – dictionaries and a range of software applications for multiple NLP task – to assist \ncounting them for a given language, which is then used to compute a value for categorisation \n(pp20-22). Krauwer provides a longer list of language- and speech technology tasks and \nmodules with data and application availability and their importance for the NLP task, such as \nparsing and referent resolution (written language) and prosody and pronunciation lexicon \n(speech) on corpora and information access applications. The availability status of the \nresources collected is then estimated on a 10-point scale and added up so that eventually the \nresourced-ness of languages may be compared.   \nJoshi et al. (2020) took a narrower scope on resourced-ness assessment than Berment \nand Krauwer, by counting the resources available on the ELRA map for labelled dataset, the \nLDC catalog for corpora, and Wikipedia pages as an indication of unlabelled data in order to \ndevise six levels of resourced-ness which is, to the best of our knowledge, the most fine-grained \nlist on resourced-ness of languages. They gave them the descriptive names of the left-behinds \n(n=2191; a.o., Dahalo), scraping-bys (n=222; a.o., Cherokee, Fijian), hopefuls (n=19; a.o., \nisiZulu, Irish), rising stars (n=28; a.o., Indonesian, Afrikaans), the underdog (n=18; a.o., \nRussian, Dutch), and the winners (n=7; a.o., English, Japanese). Given an estimated 7000 \nspoken languages, there would be an implicit 7th category for the remaining 5000, the ‘not even \nconsidered’, behind the left-behinds. Assessing their taxonomyviii, that latter group includes, \namong many, Mpiemo (for which a POS tagger does exist (Hammerstrom et al., 2008)), \nPokomo, and Sanga of the Niger-Congo B (‘Bantu’) family of languages. The latter also \nillustrates a shortcoming of the ‘counting resources’ approach to defining and categorizing \nLRLs: there are always resources that are overlooked, which is due to a range of reasons \ninterfering with the resource collection efforts and how searches for resources are conducted. \nFor instance, multiple languages have several names or spelling variants and their use may be \nburied in a data collection paragraph in the paper when only titles and abstracts are scanned \n(Keet, 2022). Detecting mentions, like Joshi et al. did, will have missed a paper on \nMboshi/Embosi, for the language is listed in their taxonomy only as Mbosi without spelling \nvariants.ix  \nThe approach of counting a selection of resources of LRLs, and, hence, the implicit \nlack of things, is a recurring theme for categorising LRLs, although at times LRLs are \ninformally described slightly more broadly. Hedderich et al. (2021) broadens LRL as an \n“umbrella term” that “covers a spectrum of scenarios with varying resource conditions”, which \ninclude “threatened languages”, languages that are “widely spoken but seldom addressed by \nNLP research”, and “non-standard domains and [NLP] tasks” (Hedderich et al., 2021). Yet, \nthen they narrow it down when teasing out aspects of resourced-ness with their three \ndimensions: of availability of labelled data relevant for the task at hand, of unlabelled language \nor domain-specific text, and of “auxiliary data” such as a relevant knowledge base in the target \nlanguage to enhance the NLP or a machine translation system to generate training data. A key \nobservation is that indeed there are dependencies across NLP tasks and that absence of such \nauxiliaries hampers progress of the intended task. Occasionally there are hints at more features \nof LRLs beyond data and software tools, as in “less studied, resource scarce, less computerized, \nless privileged, less commonly taught, or low density, among other denominations” \n(Magueresse et al. (2020), based on Cieri et al. (2016)), but it is then still narrowed down for \ntheir works to refer to “languages for which statistical methods cannot be directly applied \nbecause of data scarcity.” (Magueresse et al., 2020) or “those that have fewer technologies and \nespecially data sets relative to some measure of their international importance.” (Cieri et al., \n2016). \nWithin the South African context, the characterization that emerges from the two \nHuman Language Technology (HLT) Audits in 2011 and 2018  (Moors et al., 2018; Sharma \nGrover et al., 2011) is the one that refers to African languages (which are LRL) as generally \n“under-resourced” or “lesser resourced”. This is understood to mean that these languages have \ninsufficient resources. The resource types covered in these audits range from the text/speech \ncorpora to speech-to-speech translation systems. The terminology “low resourced” and “under-\nresourced” or “lesser resourced” may seem thus synonymous and therefore used \ninterchangeable, however we prefer the former as it is scalable, while the latter is just a \ncharacterization of “the absence of or lesser than”.  \nIn sum, the literature provides neither a clear definition of what LRLs really are nor \nwhat exactly their characteristics are beyond the ‘lack of’ and ‘less’ resources for computation. \n \n \n3. A more comprehensive view on low resourced languages \n \nWhile it is indeed the case that there are ‘few’ resources for LRLs, the few resources are not \nall alike and the LRLs are embedded in a broader context that makes the efforts of getting out \nof the ‘low resourced’ status also not all alike. Further, it requires a characterisation of its own \nas compared to reducing it to the negation of high-resourced. To this end, we first compiled a \nlist of dimensions of what low resourced and what high or well-resourced entails, which is \ndescribed and illustrated in Section 2.1. Second, we allocate applicable dimensions to a 5-point \nscale from very low to very high resourced and to what extent they apply and operationalise \nthat for a section of languages, which is described in Section 3.2.    \n \n3.1 Dimensions of resourced-ness \n \nThe list of dimensions is summarized in Table 1 and elaborated on in the remainder of this \nsection in that order. The first eight dimensions are described in no order and focus on multiple \nkey aspects and consequences related to LRLs. This then led to the question: ‘what do high, \nand very high resourced languages have that we would like to have for LRLs too?’. Whether \nthat is framed by an individual as envy or a wish list is neither here nor there; the aim here is \nto bring those benefits or features to the fore. They are summarized in features 9-11. We \nelaborate on each one in turn. \nLimited grammar refers to the situation where a limited amount of the grammar is \nknown, the limited documentation available may be outdated, and the few rules known may \nnot have been evaluated on whether they hold generally or always or have exceptions. It also \nincludes the case where there is no grammar reference book for the language in question that \nhas the grammar all in one place, or at least of what it is known, in one place. What this \npractically means is that any grammar feature requires careful investigation through consulting \nvarious scientific literature, textbooks, or colleagues to distill what the rule(s) may be, and a \ncertain amount of testing with sample data to determine whether the candidate rule(s) hold. If \nso, then it is still to be computerized, which may add a new hurdle: a popular academic \nframework such as Universal Dependencies (de Marneffe et al, 2021) may not be readily usable \nor useful for the LRL in question because it relies on the lexicalist paradigm whereas the \nlanguage may need annotations at the sub-word level and therewith new investigation into \nextensions and software support for that, as, e.g., Park et al. (2021) did for St. Lawrence Yupik. \nNo/very limited corpora (<100K tokens) concerns both monolingual and parallel \ncorpora with another language. The most challenging position to start from is when there is \nvery little written text at all. Since the emergence of social media, however, this will be less \nlikely the case, but such data requires more effort to create a corpus from, such as code \nswitching in text messages and privacy issues. When there are texts available in digital format, \nit still has to be put together into a relevant corpus. While this is a relatively easy task, resources \nare needed to carry it out and sustain it: people to do it, funding to pay them, a plan for \nlongevity, and open access to the corpus. Common first steps to putting a corpus together are \nthe freely available bible translations, no matter that they are old translations and in a very \nspecific genre that would typically not be the same as the target genre—when there are no to \nvery limited corpora, one does not worry about genres. An experiment by Ndaba et al. (2016) \nshowed that even training on a tiny corpus of about 20000 tokens from current news items \nalready outperformed a language model trained on the bible in a tool for spellchecking of \nmodern isiZulu. Then there are the OCR issues in digitization, as mentioned in the introduction.  \nLittle basic HLTs. With basic HLTs, we mean entry-level digital support features, such \nas spellcheckers, an autocomplete function for tools like WhatsApp, and an online bi-\ndirectional dictionary between words in the target language and those of a more widely-spoken \none. \nFew people driving the advancement of the language. This is sub-divided into few \nresearchers in languages and linguistics as well as in computer science and engineering that \nhave the language as a research focus, few companies that have people working on the language \ntechnologies or providing language services, and insufficient language teachers at especially \nprimary and secondary schools. The shortage of researchers hinders progress not only in \nlanguage understanding but also in prospects to devise novel algorithms to develop HLTs that \nwork for the language’s peculiarities, since the international tools typically either have to be \nadapted or started from scratch (e.g., Steinberger et al. (2011) and De Pauw and Wachaga \n(2007), among many). Few people in industry, on the other hand, is an indication that the \nlanguage may not be economically profitable even though many people may speak the \nlanguage. The shortage of language teachers in schools brings its own set of challenges, where \nlearners in higher grades may not have their home language as language of teaching and \nlearning, and, more importantly, without the language teachers, they will not learn their mother \ntongue (home language) well. This, in turn, has a knock-on effect on students entering tertiary \neducation, who are then relatively behind in language knowledge, which then means either the \ndegree programme will contain comparatively less advanced content compared to, say, the \nEnglish programme at a university in the UK, USA, Australia, or New Zealand, and thus results \nin a comparatively less-skilled language graduate, or it is comparatively harder due to the need \nto catch up, which would leave fewer student to choose such a degree and more to drop out. \nEither case will again reduce the pool of candidates for academic posts to conduct research into \nthe language or to teach a new generation of language teachers; i.e., it is a vicious circle at best \nand a downward spiral at worst. Additional effects of limited language education are that it \nmakes it harder to recruit competent participants in evaluations for one’s research and sub-\ncompetent evaluators add noise to the development of algorithms to develop the tools that may \nthen need another round of editing. \nLittle/no funding applies to all the dimensions, such as funding to do research into it, \nfunding for offering it as a subject in schools, for teacher training, and for tool development. It \nentails that most advances are made by passionate volunteers, who have different incentive \nmechanisms and may have different preferences on what HLT to invest time in than funders \nmay have. It also affects the longevity of the outputs produced in a project: when the limited \nfunding comes to an end, the tool will likely not be maintained or the domain name not renewed \nand thus the effort will slide into disuse, for someone else to re-do the same or a similar effort \nlater for lack of availability of the preceding outputs. This will keep a language going in circles \nwith basic HLTs, rather than advancing the state of the art. An example can be seen with isiZulu \nspellcheckers: they were developed in the 2000s (De Schrijver and Prinsloo, 2004) but the tool \nand code were never released, then from scratch again as plugin to OpenOfficex but only for \nolder versions (before 4.x) and therewith became defunct in the early 2010s, a stand-alone jar \nfile in 2016 based on new algorithms of (Ndaba et al., 2016) to avoid text editor version rot \nand application lock-in, and again in 2022 by CTexT as a plugin to the Microsoft Office Suite \non the PC onlyxi. \nLimited education. This relates to the previous discussion on few teachers in praxis, but \nhere we refer to specifically the education system itself and the programmes that are available. \nSpecifically, on whether the language is used as language of learning and teaching, on whether \none can take it as a subject at school as an ‘additional language’ subject, and whether it is even \npossible to study it as a degree at a university. For instance, the University of Cape Town only \noffers isiXhosa as a major, but there is no full BA in languages, literature, or linguisticsxii, and \nthe information is provided only in English, which is a similar situation at other South African \nuniversities for other languagesxiii. Compare this to, e.g., studying the minority language Irish \nat Trinity College Dublin, Ireland, where the information page is already in Irishxiv and there \nare two 4-year degree programmes. Related to degree offerings is, perhaps, a first step on \nattitude to languages at a university, where there may be “language centres” to learn multiple \nlanguages at conversational and certificate levels as extracurricular activities; e.g., the small \nuniversity Free University of Bozen-Bolzano’s language centre offers courses in nine \nlanguagesxv and Wageningen University in the Netherlands offers language courses in 15 \nlanguagesxvi. The UCT language centre, in contrast, only offers several versions of Englishxvii; \nthe University of Stellenbosch offers English, Afrikaans, and isiXhosaxviii. For LRLs, even such \noptions thus may be limited to non-existent. \nLimited/no government policy framework. While arguably there is a difference between \nhaving a policy framework for a language and actually implementing it, the state of affairs for \na language is worse if there is no language policy at all. In the South Africa context, the \nConstitution (1996) provides for the development of the 11 official languages in order to \nachieve “parity of esteem” between them. There have been various language policies that have \nbeen promulgated to support this constitutional imperative. However, these have been \ncriticized as “[…] pious articles of faith, without any force nor any effect”xix because of the \nabsence of clear implementation strategies that can translate the spirit and letter of the language \npolicy into a practical action plan that is implemented by schools and tertiary institutions. The \njury is still out on how the Department of Higher Education and Training (DHET) will provide \nfor the implementation of its Revised Language Policy Framework for Public Higher Education \nInstitutions, which took effect in January 2022.  \nMay not have a monolingual dictionary. We distinguish between bi-lingual dictionaries \nto have English/French/Spanish/Portuguese/etc. translations to the LRL vocabulary and the \nrecursiveness of a monolingual dictionary. The latter is seen as a measure of a certain level of \nresource development, status, and use, in that the vocabulary indeed can be explained in the \nlanguage itself rather than having to resort to approximations to a foreign word and the LRL is \nthus rich enough in expressiveness to do so, i.e., to be able to describe one’s language in one’s \nown terms. This, perhaps, also concerns a legacy of colonialism and acting against it: \nindigenous languages were assumed to be not full-fledged languages because a people speaking \nit might have lived ‘primitively’ in the eyes of the coloniser and a monolingual dictionary then \nbecomes a statement of belonging to humanity on par with other peoples. It also requires more \neffort to develop a monolingual dictionary compared to word lists, it entails that there are at \nleast some people driving the language forward, and that there is a notion of standardization of \nthe language and therewith institutionalisation. Note that not having a monolingual dictionary \ndoes not imply that the language is not expressive enough. \nChoice among grammars is the first dimension/feature worded from the perspective of \nbetter resourced languages. This dimension of being able to choose a computational grammar \nfor one’s need or preference includes both choice between grammar paradigms (e.g., \ndependency vs phrase-structure grammars) and within-paradigm amongst specific frameworks, \nlike UD (de Marneffe et al., 2021) versus SUD (Gerdes et al., 2018) dependency grammars. \nLarge corpora, with genres. From an LRL perspective, a corpus of 1 million tokens of \nanything that can be found is impressive; for better researched languages, this would be more \nlike at least 500 million to 1 billion tokens. In addition, they would be large corpora already \nseparated by genre, such as news articles or novels, and there may be geographic distinctions \nfor investigating whether that makes a difference, such as American English vs British English \nor French from France and from Québec in Canada, German in Germany vs German in South \nTyrol in Italy. Such fine-grainedness enhances not only research outputs in corpus linguistics, \nbut also HLTs built from them.  \nLots of tools and choice among tools, on multiple devices and OSs. Unlike the serial \nspellcheckers for isiZulu illustrated above, one rather has an abundance of choice of tools for \nthe same operating system as well as across software, such as not only for MS Word or only \ncopy-paste into a Web app and copying the corrections back in, but they have spelling checking \nembedded in the tools upon installation, regardless the device, and regardless the operating \nsystems. For instance, that it works on both Android and iOS smartphones, on browsers when \nwriting an email in Gmail or a blog post, in the Thunderbird Desktop email application on \nWindows, MacOSX, and Linux or even all platforms, and any popular text editor. In other \nwords: there are multiple tools that offer the same functionality across that spectrum. This also \nincludes choice of tools for NLP tasks, such as the Stanford POS tagger and the POS tagging \nmodule that comes with NLTK, among many. \n \nTable 1. Summary of the dimensions and components thereof, where applicable. \nNumber Topic \nComponent-topic \n1 \nLimited grammar  \n \n2 \nNo/very limited corpora  \n \n3 \nLittle basic HLTs \n \n4 \nFew people \n4a. researchers \n4b. industry \n4c. teachers \n5 \nLittle/no funding \n \n6 \nLimited education \n6a. as LoLT \n6b. as additional language at school \n6c. as degree offerings at university \n7 \nLimited/no government policy \nframework \n \n8 \nMay not have a monolingual dictionary \n \n9 \nChoice among grammars \n \n10 \nLarge corpora, with genres \n \n11 \nLots of tools and choice among tools, on \nmultiple devices and OSs \n \n  \nThe criteria or dimensions characterized above form a matrix that we will use in section 3.2 in \nanalysing the complexity of understanding LRs. We will show in section 3.2 that the \ncharacterization of languages from Very LRL to Very HRLs is based on well worked-out \ncriteria or dimensions, with examples of such languages provided. The characterization Very \nLRL, LRL, RL, High RL and Very HRL moves from a subjective to a more \nscientific/structured/motived criteria.  \n \n \n \n \n3.2 Analysis \n \nThe analysis uses feature-based criteria. The features are assigned to each of the five categories \nVery LRL, LRL, RL, High RL and Very HRL. The 11 official languages of South Africa are \nassigned to categories in 3.2.2 together with other African and global languages. \n \n3.2.1 Matching dimensions to the level of resourced-ness of a language  \nA basic categorization, or levels, of resourced-ness easily adjusts toward a familiar 5-point \nLikert scale version. For resourced-ness of languages, that are first the well-known “very LRL” \nand “LRL”. What comes after is also not one homogeneous group, however, and with an \naveragely resourced language (“RL”) in the middle, the matching other side it is highly or high \nresourced language (“HRL”) and the extreme on that end, a very high resourced language \n(“very HRL”). We assign the features to the five levels as follows: \n• Very LRL: 1, 2, no 3, 4, no 5, 6b, 6c, 7, 8 \n• LRL: 1, 2, basic 3, 4a, 4b, sparse 4c, 5, 6b, 6c, 8 \n• RL: 3, 5, may have one of {9, 10, 11} \n• HRL: some 9, some 10, some 11 \n• Very HRL: 9, 10, 11 \nThis is also visualised in Table 2. What is especially clear from the visualisation, is that the \ndifference between LRL and RL seems to be the largest. ‘Crawling out of the pit’ of relative \ndisadvantage to ‘getting by fine’ may indeed well be the hardest to do, since once the system \nis rolling, it makes it easier to build upon it and move forward faster, but getting it rolling takes \nmore effort.   \n \nWhat also shows is that “Limited LOLT” (6a) turned out not to be a problem. The (very) \nLRLs are used in education, and especially in primary schools, and of course this happens as \nwell in the resourced languages. Reflecting on why it was added, was because the LRL is often \nperceived as lower status and replaced by a colonial language as LOLT especially in higher \ngrades and better schools, but not for all LRLs. Hence, it could not be applied to LRL or very \nLRL as a category, but only to a language specifically. \n \n \nTable 2. Visualisation of the dimensions by level of resourced-ness. X: yes/applies; v: applies \nto a considerable extent i: applies to some extent; blank cell: does not apply.  \n \n1 2 3 \n4 \n5 \n6 \n7 8 9 10 11 \n \n \n \n \na b c  \na b c  \n \n \n \n \nVery LRL x x x x x x x  \nx x x x  \n \n \nLRL \nx x v x x v x  \nx x  \nx  \n \n \nRL \n \n \nx  \n \n \nx  \n \n \n \n \ni \ni \ni \nHRL \n \n \n \n \n \n \n \n \n \n \n \n \nv v \nv \nVery HRL  \n \n \n \n \n \n \n \n \n \n \n \nx x \nx \n \n3.2.2. Categorising languages \n \nWith the aim toward operationalizing the dimensions and levels of resourced-ness and illustrate \nthe categorisations and ‘lived reality’ better, we now turn to examining which language can be \ncategorized where and why. We do this specifically for the 11 official languages of South \nAfrica, several other more or less well-known languages in Africa, and a selection of other \nlanguages in the world for comparison and to provide ample examples in each category. There \nare many ways how such a categorisation can be done, which each have their own \nshortcomings. For instance, one may try to collect all the resources and tools ever developed \nfor the language or only those that are functional (be it assessed or claimed on a paper or open \naccess), or collect papers about resources from a wide range of publication venues. Such \nresource collections and audits have been carried out, including, the HLT audits of South \nAfrican languages resources (Moors et al., 2018; Sharma Grover et al., 2011), the SADilaRxx, \nmasakhanexxi and Lanafricaxxii repositories, and the articles in topic conferences only (Joshi et \nal., 2021). Many advances for African languages do not reach the top conferences, however, \nbe it due to travel and registration costs, target audience whom one wants to know about the \nwork, and possibly also the perceived quality since efforts may be perceived pedestrian when \ncompared to the level of English HLTs that most reviewers are familiar with rather than it being \ncompared to the state of the art for the language under investigation. The HLT audits and the \nSADiLaR repository are limited to South African languages only and only those tools \ndeveloped with SADiLaR funding, masakhane to corpora only, and lanafrica is collecting only \nsince 2022 and does not include tools. That is: relying on only any one source or strategy for \ndata collection to categorise languages on their tooling resourced-ness is going to be \nsubstantially incomplete and therewith distorted. Even if they were to be complete, it then \nwould need to be converted into a scale to measure, and it still would not indicate anything \nabout the broader context and the features of funding, people, or education. Conversely, an \nexpert-based classification using the aforementioned features remains opaque at least in part \ndue to incomplete evidence in that case. Data for the features may be found to substantiate a \ncategorisation value, but some of them have inherently fuzzy boundaries. For instance, \nevidence of teacher shortage can be obtained from a Department of Education, but a teacher \nshortage of 20% is different from a shortage where only 1 in 10 schools offer classes in the \nlanguage to be categorised, but so are 25% and 1 in 9, respectively. It thus serves to refine \nsome of the values for the features to enable a more robust categorisation.        \nMeanwhile, as a preliminary exercise, we use the expert-based approach. For the very LRL \nand official languages in South Africa, we classify Xitsonga, Venda, Sepedi, siSwati, \nisiNdebele, and Sotho as such. Other examples from Africa, among many, are Mboshi and \nMalagasy. The LRL category may be most interesting theoretically. IsiXhosa from South \nAfrica clearly is solidly LRL. Concerning tooling but even more so political clout and lingua \nfranca practices, one might argue for a sort of ‘upper LRL’, which are the “hopefuls scraping \nby” in Joshi et al.’s terminology, being isiZulu and Setswana in South Africa and Kiswahili in \nTanzania and Kenya. They are still LRL but have a few more resources than the likes of \nisiXhosa. As RL, there are Afrikaans and South African English for South Africa, as well as \nPortuguese and Arabic in Africa, and, e.g., Italian internationally. Examples of HRL are Dutch, \nGerman, French, and Mandarin. The only language that is very HRL is English. \n \n \n4. Discussion \n \nThe use of the term low-resourced in the literature has hitherto evidently been problematic. \nThe views adduced from Mika Hämäläinen (2021), that in the NLP literature Chinese (1.2 \nbillion speakers), Arabic (422 million speakers), Bengali (228 million speakers), Japanese (126 \nmillion speakers), Vietnamese (76 million speakers), Dutch (24 million speakers), Sinhala (17 \nmillion speakers) and Finnish (5 million speakers), have had several tasks referred to as low-\nresourced is, at best, based on a subjective personal scale or with English being the benchmark \nacross this great divide. For the term low-resourced to carry any scientific currency in \nappreciation of research and application projects that avail of NLP tasks more generally, and \nindeed in other specialized environments, the exigency exists to define in a scalable way the \nrange of language resources.  \n \nWe have argued for eleven dimensions of resourced-ness in order to address the \nsemantic obfuscation presented by the current use of the term low-resourced. The eleven \ndimensions allowed for the matching of resource characterization onto a 5-level categorization \nof resources toward a familiar 5-point Likert scale: VLRL; LRL, RL, HRL, VHRL as discussed \nin section 3.2.1. These categories provide an answer to the problem raised by Mika Hämäläinen \n(2021), that of lumping all the languages other than English together as LRL, something that \nhe rightly observed as evidently incorrect. LRLs are clearly not a homogenous group, and the \n5-level categorization provided here means that more languages can be allocated into these \ncategories in a more meaningful way. This may also assist with “LRL sessions” at NLP \nconferences, to clarify what experiences and research are asked for, and for authors to position \ntheir contributions more precisely. Likewise, not all projects, be they in digital humanities or \nother fields, will have the same pace of progress due to the different amounts of NLP tasks \nentailed in the overall project, and the prerequisites they assume that have to be met before one \ncan go start investigating research question from, say, sociology or history.  \nThe categories as defined from the eleven dimensions are useful in providing a \nlanguage policy and planning framework for the people responsible for the development of \nlanguages and language technologies that are in the levels VLRL and LRL. The deployment of \nresources and instruments required to develop them can henceforth be based on a scientific \ncriterion, instead of either population demographics alone or discovered tool, corpus, or \nresearch paper-based counting. It has been shown that the fact that a language has fewer \nspeakers (e.g., Finnish) or is an endangered language (e.g., Skolt Sami) (Hämäläinen, 2021) \ndoes not mean that it is a LRL. The categorization will therefore provide government and \nlanguage policy experts a further mechanism in developing more informed language policies \nand more effective language implementation frameworks that address the characteristic \nelements of language category as articulated in the eleven dimensions. Such policies and \nframeworks may need to set feature cut-off points appropriate for their context, such as about \nthe comparative number of language teachers in schools.   \nThe categories also provide a rubric for planners to track the progress in the \ndevelopment of each language through the categories VLRL; LRL; RL; HRL and VHRL. This \nis particularly useful within the South African context, as the South Africa Constitution (1996) \nclearly articulates the commitment to develop all the eleven official languages in order to \nachieve “parity of esteem” between all the eleven official languages. The categorization can \nagain be a useful framework to ascertain the categories of all the official languages, determine \nwhat tools or resources are required for each language and track the progression of the \nlanguages from the low level to higher level of resourced-ness, and whether this has achieved \nthe parity among all of them.   \n \n5. Conclusions \nThe paper proposed a list of features on the broader context of how a language is situated and, \nfrom that, a feature-based classification of resourced-ness of languages. It is based on 11 \nfeatures and the classification was shaped in a 5-point scale, from very low to very high-\nresourced. Unlike a quantitative counting of number of speakers and number of corpora and \ntools, it positions the resourced-ness in a broader context that a language is positioned in.  \nThe broader context of a language affects development of human language technologies \nin numerous ways and its characterisation may contribute to language policy development and \nimplementation, as well as assessment of extant policies on language technology development. \nFurther research might look into, inter alia, the types of resources that are available for each of \nSouth Africa’s official languages and what low-hanging technology and policy development \ncan be targeted for each according to the available resources to strategise to obtain the most \nrealistic and effective output when augmenting the limited resources.  \n \nAcknowledgements \nThis work is based on the research supported in part by the National Research Foundation of \nSouth Africa (Grant Number 120852). \n \n \nReferences \nBerment , V. 2004 Méthodes pour informatiser des langues et des groupes de langues peu dotées. PhD Thesis, J. \nFourier University – Grenoble I, May 2004. https://theses.hal.science/tel-00006313/document  \nBesacier, L., Barnard, E. Karpov, A., Schultz, T. 2014  Automatic Speech Recognition for Under-Resourced \nLanguages: A Survey. Speech communication, 56:85-100. https://doi.org/10.1016/j.specom.2013.07.008  \nBosch, S.E., Jones, J., Pretorius, L., Anderson, W. 2007. Computational morphological analysers and machine \nreadable lexicons for South African Bantu languages. Localisation Focus – The International Journal of \nLocalisation, 6(1): 22-28. \nMoors, C., Calteaux, K., Wilken, I., Gumede, T. 2018. Human Language Technology Audit 2017/8. In: \nProceedings of the Annual Conference of the South African Institute of Computer Scientists and Information \nTechnologists. ACM. pp296-304.  \nCieri, C., Maxwell, M., Strassel, S., Tracey, J. 2016. Selection Criteria for Low Resource Language Programs. \nIn Proceedings of the Tenth International Conference on Language Resources and Evaluation (LREC'16), \npages 4543–4549, Portorož, Slovenia. European Language Resources Association (ELRA). \nGerdes, K., Guillaume, B., Kahane, S., Perrier, G. 2018 SUD or Surface-Syntactic Universal Dependencies: \nAn annotation scheme near-isomorphic to UD. Universal Dependencies Workshop 2018, Nov 2018, Brussels, \nBelgium.  \nHämäläinen, M. 2021. Endangered Languages are not Low-Resourced. Preprints 2021, 2021040113 (doi: \n10.20944/preprints202104.0113.v1).  \nHammarström, H., Thornell, C., Petzell, M., Westerlund, T. 2008. Bootstrapping language description: the \ncase of Mpiemo (Bantu A, Central African Republic). In Proceedings of the Sixth International Conference \non Language Resources and Evaluation (LREC’08). European Language Resources Association (ELRA). \nHedderich, M.A., Lange, L., Adel, H., Strötgen, J., Klakow, D. 2021. A Survey on Recent Approaches for \nNatural Language Processing in Low-Resource Scenarios. In: Proceedings of the 2021 Conference of the \nNorth American Chapter of the Association for Computational Linguistics: Human Language Technologies, \npages 2545–2568 June 6–11, 2021. Association for Computational Linguistics. \nHocking, J., Puttkammer, M. 2016. Optical Character Recognition for South African Languages. Pattern \nRecognition Association of South Africa and Robotics and Mechatronics International Conference (PRASA-\nRobMech 2016). IEEE Xplore, 10.1109/RoboMech.2016.7813139 \nJoshi, P., Santy, S., Budhiraja, A., Bali, K., Choudhury, M. 2020. The state and fate of linguistic diversity and \ninclusion in the NLP world. In: Proceedings of the 58th Annual Meeting of the Association for Computational \nLinguistics, pp6282–6293, Online. Association for Computational Linguistics. \nSharma Grover, A., Van Huyssteen, G., Pretorius, M. 2011. The South African Human Language Technology \nAudit. Language Resources and Evaluation, 45(3): 271-288. \nKeet, C.M., Khumalo, L. 2014. Basics for a grammar engine to verbalize logical theories in isiZulu. In: 8th \nInternational Web Rule Symposium (RuleML'14), A. Bikakis et al. (Eds.). Springer LNCS vol. 8620, 216-225.  \nKhumalo, L. 2021. Corpus development and computational tools for the development of African languages. In \nButhelezi, Z. and Khumalo, L.(Eds). IsiZulu and Social Transformation in Southern Africa. CAL Book Series: \nUniversity of Zululand.  \nKirmizialtin, S., Wrisley, D.J. 2022. Automated transcription of non-Latin script periodicals: a case study in the \nOttoman Turkish Print Archive. Digital Humanities Quarterly, 16(2): 16.2. \nKrauwer, S. 2003. The Basic Language Resource Kit (BLARK) as the First Milestone for the \nLanguage Resources Roadmap. In: Proceedings of the 2003 International Workshop Speech and Computer \nSPECOM-2003, Moscow, Russia, 2003, pp. 8-15. \nMagueresse, A., Carles, V., Heetderks, E. 2020. Low-resource Languages: A Review of Past Work and Future \nChallenges. Arxiv technical report https://arxiv.org/abs/2006.07264  \nMarneffe, M.C. de, Manning, C.D., Nivre, J., Zeman, D. 2021. Universal dependencies. Computational \nLinguistics, 47(2): 255-308.  \nNdaba, B., Suleman, H., Keet, C.M., Khumalo, L. 2016. The effects of a corpus on isizulu spellcheckers based \non n-grams. In: IST-Africa 2016. IIMC International Information Management Corporation. 11-13 May, 2016, \nDurban, South Africa.  \nPark, H.H., Schwartz, L., Tyers, F.M. 2021. Expanding universal dependencies for polysynthetic languages: A \ncase of St. Lawrence island Yupik. In: Proceedings of the First Workshop on Natural Language Processing \nfor Indigenous Languages of the Americas. pp131-142. Association for Computational Linguistics (2021).  \nPauw, G. de, Wagacha, PW. 2007. Bootstrapping morphological analysis of g˜ık˜uy˜u using unsupervised \nmaximum entropy learning. In: Proceedings of the Eighth Annual Conference of the International Speech \nCommunication Association (INTERSPEECH’07), pp1517–1520. ISCA. \nPretorius, L., Bosch, S.E. 2003. Computational aids for Zulu natural language processing. Southern African \nLinguistics and Applied Language Studies, 21(4): 265-282. \nRanathunga, S., Lee, E-S. A., Skenduli, M.P., Shekar, R., Alam, M., Kaur, R. 2021. Neural Machine \nTranslation \nfor \nLow-Resource \nLanguages: \nA \nSurvey. \nArxiv \nTechnical \nReport, \nhttps://arxiv.org/pdf/2106.15115.pdf 29 June 2021. \nSchryver, G.-M. de, Prinsloo, D.J. 2004. Spellcheckers for the South African languages, Part 1: the status quo \nand options for improvement. South African Journal for African Languages, 1: 57-82.  \nSteinberger, R., Ombuya, S., Kabadjov, M., Pouliquen, B., Della Rocca, L., Belyaeva, J., de Paola, M., \nIgnat, C., van der Goot, E. 2011. Expanding a multilingual media monitoring and information extraction tool \nto a new language: Swahili. Language Resources & Evaluation, 45:311–330. \nThe \nConstitution \nof \nthe \nRepublic \nof \nSouth \nAfrica. \n1996. \nhttps://www.gov.za/documents/constitution/constitution-republic-south-africa-1996-1  \nTsvetkov, Y. 2017. Opportunities and challenges in working with low-resource languages. Carnegie Mellon \nUniversity. https://www.cs.cmu.edu/~ytsvetko/jsalt-part1.pdf \nXu, D. 2023. Digital Approaches to understanding Dongba pictograms. International Journal of Digital \nhumanities, 4: 131-146. \n \ni http://lloydbleekcollection.cs.uct.ac.za/  \nii From a Medium article of 2022 by Felix Naumann https://medium.com/neuralspace/low-resource-language-\nwhat-does-it-mean-d067ec85dea5 (last accessed in October 2022), which was likely lifted from Tsvetko’s \nlecture slides of 2017 https://www.cs.cmu.edu/~ytsvetko/jsalt-part1.pdf (slide 26). \niii https://arxiv.org/abs/2006.07264  \n \n \niv Good OCR software does not only try to recognize the characters, but also add probabilities to words and \ncharacters that it is not sure of. This may be ‘fixing’ a string so that it passes a spelling check for the language it \nis optimized for (e.g., changing the isiZulu wena into the English ‘wend’) up to analysis the sentence to choose \namong alternative corrections (e.g., if the sentence misses a verb, then the candidate fixes for the unclear string \nwill select a verb).   \nv The three examples were not merely theoretical, but they have occurred to the authors. \nvi Besides the Medium article (fn 1), see also the “High resource languages vs low resource languages” by Emily \nBender in The Gradient, 14 Sept 2019, https://thegradient.pub/the-benderrule-on-naming-the-languages-we-\nstudy-and-why-it-matters/ (last accessed on 3-1-2023). It only characterizes high resource languages, leaving the \n‘low’ implicit as not having all that. \nvii http://www.blark.org/  \nviii https://microsoft.github.io/linguisticdiversity/assets/lang2tax.txt  \nix The list of detected papers has not been made available by Joshi et al., but by their methodology, it would \nhave missed at least the LREC2018 paper on Mboshi, being Rialland A, Adda-Decker M, Kouarata G-N, Adda \nG, Besacier L, et al. Parallel Corpora in Mboshi (Bantu C25, Congo-Brazzaville). 11th  Language Resources \nand Evaluation Conference (LREC 2018), ELRA, May 2018, Miyazaki, Japan.  \nx http://extensions.openoffice.org/en/project/zulu-spell-checker  \nxi https://sadilar.org/index.php/en/applications/spelling-checkers-for-south-african-languages  \nxii \nhttps://www.uct.ac.za/sites/default/files/content_migration/uct_ac_za/49/files/2022_HUM_UG_Handbook.pdf  \nxiii For instance, the isiZulu majors at the University of KwaZulu-Natal \nhttps://soa.ukzn.ac.za/clustersdisciplines/language-and-literature/isizulu/  \nxiv https://www.tcd.ie/courses/undergraduate/courses/irish-jh/ and \nhttps://www.tcd.ie/courses/undergraduate/courses/early-and-modern-irish/  \nxv https://www.unibz.it/en/services/language-centre/ it offers Arabic, Chinese, English, French, German, Italian, \nLadin, Russian, and Spanish. \nxvi https://www.wur.nl/en/education-programmes/wageningen-into-languages/language-courses.htm It offers \nArabic, Chinese, Dutch, English, French, German, Italian, Japanese, Korean, Norwegian, Portuguese, Russian, \nSwedish, Spanish, and Turkish. \nxvii https://uctlanguagecentre.com/  \nxviii https://languagecentre.sun.ac.za/  \nxix https://www.usaf.ac.za/how-language-scholars-and-activists-are-keeping-multilingualism-on-universities-\ntransformation-agenda/. \nxx https://repo.sadilar.org/  \nxxi https://www.masakhane.io/  \nxxii https://lanfrica.com/  \n",
  "categories": [
    "cs.CL",
    "I.2.7"
  ],
  "published": "2023-09-29",
  "updated": "2023-09-29"
}