{
  "id": "http://arxiv.org/abs/2312.01221v1",
  "title": "Enabling Quantum Natural Language Processing for Hindi Language",
  "authors": [
    "Naman Srivastava",
    "Gaurang Belekar",
    "Sunil Saumya",
    "Aswath Babu H"
  ],
  "abstract": "Quantum Natural Language Processing (QNLP) is taking huge leaps in solving\nthe shortcomings of classical Natural Language Processing (NLP) techniques and\nmoving towards a more \"Explainable\" NLP system. The current literature around\nQNLP focuses primarily on implementing QNLP techniques in sentences in the\nEnglish language. In this paper, we propose to enable the QNLP approach to\nHINDI, which is the third most spoken language in South Asia. We present the\nprocess of building the parameterized quantum circuits required to undertake\nQNLP on Hindi sentences. We use the pregroup representation of Hindi and the\nDisCoCat framework to draw sentence diagrams. Later, we translate these\ndiagrams to Parameterised Quantum Circuits based on Instantaneous Quantum\nPolynomial (IQP) style ansatz. Using these parameterized quantum circuits\nallows one to train grammar and topic-aware sentence classifiers for the Hindi\nLanguage.",
  "text": "Enabling Quantum Natural Language Processing for Hindi Language\nNaman Srivastava\nIIIT Dharwad\nDharwad, India\nsrinaman2@gmail.com\nGaurang Belekar\nIIIT Dharwad\nDharwad, India\nbelekargaurang@gmail.com\nSunil Saumya\nIIIT Dharwad\nDharwad, India\nsunil.saumya@iiitdwd.ac.in\nAswath Babu H.\nIIIT Dharwad\nDharwad, India\naswath@iiitdwd.ac.in\nAbstract\nQuantum\nNatural\nLanguage\nProcessing\n(QNLP) is taking huge leaps in solving the\nshortcomings of classical Natural Language\nProcessing (NLP) techniques and moving\ntowards a more \"Explainable\" NLP system.\nThe current literature around QNLP focuses\nprimarily on implementing QNLP techniques\nin sentences in the English language.\nIn\nthis paper, we propose to enable the QNLP\napproach to HINDI, which is the third most\nspoken language in South Asia. We present the\nprocess of building the parameterized quantum\ncircuits required to undertake QNLP on Hindi\nsentences. We use the pregroup representation\nof Hindi and the DisCoCat framework to draw\nsentence diagrams. Later, we translate these\ndiagrams to Parameterised Quantum Circuits\nbased on Instantaneous Quantum Polynomial\n(IQP) style ansatz. Using these parameterized\nquantum circuits allows one to train grammar\nand topic-aware sentence classifiers for the\nHindi Language.\n1\nIntroduction\nIn the ever-evolving landscape of information tech-\nnology and computational linguistics, Quantum\nNatural Language Processing (QNLP) represents\na groundbreaking paradigm shift at the intersec-\ntion of Quantum Computing and natural language\nunderstanding. As the world delves deeper into\nthe realms of Quantum Mechanics, harnessing the\npower of Quantum Computing to enhance the pro-\ncessing and comprehension of human language\nhas emerged as a promising frontier. QNLP is\na burgeoning field that promises to revolutionize\nhow we interact with and extract knowledge from\ntextual data, opening up new horizons for applica-\ntions ranging from machine translation and senti-\nment analysis to information retrieval and cognitive\ncomputing. The first high-level Python library for\nQNLP was presented in 2021 as an open-source\ntoolkit [8].\nTraditional Natural Language Processing (NLP)\nhas made remarkable strides in automating tasks\nlike text classification, machine translation, and\nsentiment analysis. However, it still grapples with\ninherent limitations, such as the inability to pro-\ncess and comprehend the vast nuances of human\nlanguage efficiently. On the other hand, the model\nthat interprets the Quantum Mechanical Phenom-\nena is found to be equivalent to the model of natural\nlanguage, which entails QNLP to be a quantum na-\ntive of language processing. The processing of\nlinguistic structure can be easily encoded through\na quantum regime, whereas encoding grammar in\nclassical means is very tedious and costly.\nQuantum Computing, on the other hand, lever-\nages the principles of superposition and entangle-\nment, enabling it to handle complex computational\ntasks exponentially faster than classical computers.\nPerforming Natural Language Processing (NLP)\non Hindi text is significant due to the language’s\nvast user base, cultural relevance, and economic\nopportunities. It can offer insights into sentiments,\nopinions, and societal nuances, aids in governance\nand policy analysis, supports content creation and\nlocalization, enhances education, and has appli-\ncations in healthcare, media analysis, linguistic\nresearch, and disaster response.\nIn particular, the QNLP pipeline relies on dia-\ngrammatic representation, wherein it involves first\nparsing an input sentence followed by generating\nits associated string diagram. This diagram serves\nas the basis for constructing a trainable Quantum\nCircuit or a Parameterized Quantum Circuit (PQC).\nThe same method is implemented here for the\ncase of Hindi sentences. This research endeavor\ndelves into the methodology for crafting a Param-\neterized Quantum Circuit from Hindi sentences,\nestablishing a fundamental framework for the de-\nvelopment and training of a Quantum Natural Lan-\nguage Model tailored to the Hindi language. This\nwork is inspired by the recent work on pregroup\narXiv:2312.01221v1  [cs.CL]  2 Dec 2023\nrepresentation of Language [6, 1]. We use the pre-\ngroup grammar formalism discussed by [6] to de-\nfine the word interactions and assign the pregroup\nnotations.\n2\nBackground\n2.1\nQuantum Computing\nQuantum Computing is a field of computing tech-\nnology that uses the principles of Quantum Me-\nchanics to perform certain types of calculations\nmuch faster than traditional computers. In a regu-\nlar computer, information is processed using bits,\nwhich can be either 0 or 1. Quantum Computers,\non the other hand, use quantum bits or \"Qubits\"\ndenoting the combination of both 0 and 1. What\nmakes Qubits special is that they can exist in mul-\ntiple states at once. This ability to exist in multi-\nple states at once, known as superposition, allows\nQuantum Computers to consider many possible so-\nlutions to a problem simultaneously. Additionally,\nqubits can be \"entangled,\" meaning the state of one\nqubit can instantly affect the state of another, irre-\nspective of their physical separation, despite not\nhaving any sort of communication channel. This\nproperty of entanglement enables Quantum Com-\nputers to solve certain complex problems much\nfaster than Classical Computers.\n2.1.1\nDirac Notation\nDirac Notation, also known as bra-ket notation, is a\nmathematical notation commonly used in Quantum\nMechancs and Quantum Computing to represent\nand manipulate quantum states and operations. It\nwas developed by physicist Paul Dirac and provides\na concise and powerful way to describe quantum\nsystems and their transformations:\n1. A quantum state, such as the state of a qubit,\nis represented by a \"ket\" vector, written as |ψ⟩. For\nexample, |0⟩and |1⟩represent the two possible\nstates of a single qubit, where |0⟩corresponds to\nthe binary state 0, and |1⟩corresponds to the binary\nstate 1.\n2. The adjoint (complex conjugate plus trans-\npose) of a ket vector is represented by a \"bra\" vec-\ntor, written as ⟨ψ|. If the ket vector is represented\nby a column vector then the bra would be a row\nvector ensuring the possible matrix multiplication\nthat is analog to the scalar product existing among\nvectors.\n3. The inner product of two quantum states is\ndenoted as ⟨α|β⟩, where |α⟩and |β⟩are ket vectors.\nThis represents the probability that states |α⟩and\n|β⟩alike.\n4. Quantum operators, such as quantum gates,\nare represented by matrices and are often applied\nto quantum states using the ket-bra notation. For\nexample, if you have a gate represented by the\nmatrix U and you want to apply it to a qubit in state\n|ψ⟩, you can write it as U|ψ⟩.\n5. Quantum measurements can be represented\nby projection operators, which are expressed using\nthe outer product of ket and bra. For example, if\nyou want to represent a measurement that projects a\nquantum state onto |0⟩, and the involved projection\noperator is |0⟩⟨0|.\nDirac Notation is especially useful in Quantum\nComputing because it provides a clear and compact\nway to represent and work with quantum states\nand operations. It simplifies complex calculations\nand transformations and makes it easier to express\nquantum algorithms and quantum circuits.\n2.1.2\nQuantum Gates\nQuantum gates are fundamental building blocks in\nQuantum Computing, just like regular logic gates\nare in classical computing. They are used to manip-\nulate and process qubits in a Quantum Computer.\nQuantum gates as tools or instructions that allow\nto change of the state of qubits. These gates per-\nform specific operations on qubits, such as flipping\ntheir state, rotating their orientation, or creating\nentanglement between them. Each quantum gate\nhas a particular purpose, just like different tools in\na toolbox are used for different tasks.\nFor example, you have quantum gates called\nthe X-gate, which is like a switch that flips the\nstate of a qubit from 0 to 1 or vice versa. There’s\nalso the Hadamard gate, which puts a qubit into\na superposition of 0 and 1, allowing it to be in\nboth states simultaneously. Other gates, like the\nCNOT gate, acting together with Hadamard create\nentanglement between two qubits, so that when\none changes, the other does too, no matter how far\napart they are.\n2.2\nQuantum Natural Language Processing\nIn Quantum Computing, the information present\nin qubits is represented in the form of vectors. A\nsimilar approach of using vectors (or vector spaces)\nhas also been used frequently in Natural Language\nProcessing involving Word Embeddings such as\nWord2Vec, and FastText. In recent years, the in-\ntersection of Natural Language Processing (NLP)\nand Quantum Computing has seen notable success,\ngiving rise to a field known as QNLP. This hybrid\ndomain harnesses the potential of Quantum Me-\nchanics to address crucial aspects of language pro-\ncessing, encompassing various NLP tasks. The ex-\nisting approaches within QNLP range from purely\ntheoretical demonstrations of quantum advantage\nto practical implementations of algorithms on quan-\ntum hardware. It has many applications, such as\nmachine translation, text summarization, and chat-\nbot creation. QNLP aims to use Quantum Com-\nputers to solve NLP problems. The goal of QNLP\nis to develop quantum algorithms that can outper-\nform classical algorithms for NLP tasks. To cre-\nate an explainable NLP model, we must include\nthe grammatical and syntax of the language in\nconsideration[9, 4]. To incorporate such proper-\nties of language needs the Distributional Compo-\nsitional Categorical (DisCoCat) model [5, 7, 15].\nRecent works have shown the implementation of\nQNLP techniques on sentence classification tasks\nusing the DisCoCat model [12, 13]\n2.3\nPre Group Grammar\nPregroup grammar, or pregroup formalism, is a\nmathematical approach for analyzing natural lan-\nguage syntax. It is developed by linguist Joachim\nLambek, it offers a more precise and elegant de-\nscription of linguistic structure than traditional\ncontext-free grammars [9, 10] . In this framework,\nwords are linked to abstract algebraic \"types\" rep-\nresenting grammatical information, such as nouns\nand verbs. Rules in pregroup grammar are defined\nas algebraic operations on these types, enabling\nstructured composition of linguistic expressions.\nThis approach efficiently captures linguistic phe-\nnomena, like word order and ambiguity, making it\nvaluable in computational linguistics and linguistic\nformalism. Pregroup grammar focuses on the alge-\nbraic structure within language expressions, attract-\ning research interest in linguistics and computer\nscience. Several languages such as Sanskrit, Ara-\nbic, German, French and Japanese have adopted\npregroup calculus [3, 14]:\nal · a →1 →a · ar\nwhere al and ar denote the left and right adjoint\nof the type of word \"a\" respectively. For example\nin the sentence \"Ram likes School\", subject and\nobject nouns are represented by \"n\" and the verb\n\"likes\" expects a right and left adjoints as these\nnouns. Algebraic calculation of sentence would\nlead to flow out of sentence denoted by \"s\" with\nnl · n →1 →n · nr.\nRam\nlikes\nSchool\nn\nnrsnl\nn\n(1)\nA detailed exploration of the grammatical struc-\ntures and sentence compositions of English and\nHindi reveals a combination of similarities and dis-\nparities. Both languages encompass fundamental\nbuilding blocks such as nouns, verbs, and adjec-\ntives, which serve as the foundational elements for\nconstructing sentences. These shared components\nfacilitate basic communication and comprehension\nacross the two languages. However, where English\nand Hindi diverge is in the inclusion of specific\nlinguistic features that are unique to each language.\nFor instance, Hindi employs a concept known as\n\"Karak,\" which plays a crucial role in assigning\nroles and relationships to different sentence ele-\nments. This is a distinct feature absent in English\nsentence structure. Additionally, tense markers in\nHindi such as \"Hai\", \"Thaa\" etc convey temporal\ninformation differently than their English counter-\nparts, introducing another layer of complexity in\nthe grammatical structure. To facilitate a better\nunderstanding of these differences, Table 1 is pre-\nsented, illustrating the various pregroup notations\nused in both languages and their corresponding\nsentence components.\nSymbol\nMeaning\nπ\nPersonal Pronoun\nn\nNoun Phrase\np\nSimple Predicate\na\nAdjective\no\nObject or Transitive Verb\nk1\nKaraka\nρ\nSambandh\nα\nOptional Auxiliary\nτ\nTense Marker\nTable 1: Pregroup Notations\n2.4\nSentence Diagrams\nSentence diagrams in QNLP are graphical repre-\nsentations that use the principles of Quantum Me-\nchanics to depict the syntactic and semantic struc-\nture of sentences in natural language. Unlike tradi-\ntional sentence diagrams, which typically rely on\nFigure 1: Bra and Ket notations in Sentence Diagram:\nThe quantum state (|ψ⟩) and its effect (operator obtained\nas ⟨ψ| by taking adjoint) is simply 180 degree rotation\nabout the normal axis.\ntree structures to represent grammatical relation-\nships, QNLP sentence diagrams employ quantum-\ninspired principles to model the complexity and\nentanglement of linguistic elements within a sen-\ntence. In QNLP, sentence diagrams, words, or lin-\nguistic units are represented as quantum-like states\n(see Figure 1) or vectors in a high-dimensional\nspace, that is like |ψ⟩= α|0⟩+ β|1⟩. These states\ncan exhibit superposition, entanglement, and other\nquantum properties, allowing for a more nuanced\nrepresentation of the relationships between words\nand their syntactic and semantic roles. The use of\nquantum principles in sentence diagrams can en-\nable more accurate modeling of phenomena like\nword ambiguity, context-dependent meaning, and\nthe interaction between words within a sentence.\nQNLP sentence diagrams are part of the broader\neffort to apply Quantum Computing and quantum-\ninspired techniques to natural language understand-\ning, with the goal of enhancing the processing and\ncomprehension of human language.\n2.5\nQuantum Circuits From Sentence\nDiagrams\nTo train our NLP model using sentence diagrams\nand harness the quantum advantage, it’s essential\nto transform these diagrams into trainable param-\neterised quantum circuits. A specified sequence\nof gates applied to specific wires in a quantum cir-\ncuit is known as \"Ansatz\". To convert a diagram\nto a circuit, we have several methods or ansatz,\nincluding the Instantaneous Quantum Polynomial\n(IQP) ansatz and Matrix Product States (MPS) ap-\nproaches. Additionally, there are hybrid Quantum\nAlgorithms introduced earlier [16], offering fur-\nther options for this transformation. These various\nansatzes provide us with a range of tools to adapt\nsentence diagrams into quantum circuits, ultimately\nenabling us to explore the quantum advantages in\nnatural language processing tasks [17, 11, 2, 12, 8].\n3\nMethodology\nA standard QNLP Pipeline involves the following\nsteps as described in Figure 2:\n• Input Sentence to String Diagram: Using\npregroup grammar of a language we assign the\natomic type to the words and phrases. Then,\nwe use the DisCoCat framework to create\nstring diagrams corresponding to a sentence\nas shown in Figure 2, wherein the words are\nconnected by cup-shaped wires called \"cups\"\nrealized using an entangled pair.\n• Optimising String Diagram: Once the string\ndiagram for a sentence is created, we optimize\nthis diagram by reducing the number of cups\nso that the dimensionality of the words be-\ncomes smaller, here word \"jata\" needs such\ncorrection. This step assists in removing the\nunnecessary complexities in a sentence dia-\ngram.\n• String Diagram to Parametersied Quantum\nCircuit: The transition of String Diagrams to\nParameterised Quantum Circuit (PQC) car-\nried via standard ansatz such as Instantaneous\nQuantum Polynomial Ansatz (IQP) or Matrix\nProducts States (MPS) etc.\n• Building and Training Model: Once the Pa-\nrameterised Quantum Circuits for each sen-\ntence have been built, we can train our predic-\ntion model in a similar manner to how we train\na classical NLP. Each circuit is assigned initial\nparameters and then measured. This measure-\nment output is processed further according to\nthe task at hand, such as comparing with the\nexpected output as part of supervised learning.\nWe use a classical optimizer to modify the pa-\nrameters of the quantum circuits, thus training\nthe model.\n3.1\nThe Sentences\nWe take two simple sentences from the Hindi lan-\nguage to demonstrate how we can build String Dia-\ngrams and Parameterised Quantum Circuits from\nHindi sentences. These two sentences are: - \"Main\nSchool Jata hu\" which translates to \"I go to school\".\nFigure 2: Standard Quantum Natural Language Pipeline\n- \"Mukesh ne Khana khaya\" which translates to\n\"Mukesh ate the food\".\nMain\nSchool\njaata\nhu\nπ\no\norπrsτ l\nτ\n(2)\nMukesh ne\nkhaana\nkhaya\nn\nkl\n1\nk1o\nornrs\n(3)\n3.2\nCreating Sentence Diagram\nUsing the pregroup notations and word connection\nformulated using the pregroup grammar for Hindi,\nwe create the sentence diagrams for the sentences\nmentioned in Sec 3.1. For the Sentence 2 we obtain\nFigure 3. Similarly for Sentence 3 we obtain the\nFigure 4.\nFigure 3: Diagram for Sentence 1, single wired states\nare of type b and multiple wired are of type d.\n3.3\nBuilding the Parameterised Quantum\nCircuit\nQuantum Theory, established as a process the-\nory, employs a diagrammatic language denoted\nby string diagrams. Specifically, in the experi-\nments we consider, we utilize pure quantum theory.\nWithin this context, processes manifest as unitary\noperations or quantum gates associated with cir-\ncuits. The monoidal structure, which facilitates\nFigure 4: Diagram for Sentence 2, single wired states\nare of type b and multiple wired are of type d.\nparallel processes, is represented by the tensor prod-\nuct. Sequential composition mirrors the sequence\nof quantum gates.\nFigure 5: Ansatz for word with single wire\nWires assigned the basic pregroup type b are\nallocated qb qubits. Word-states with a singular\noutput wire obtained from ⟨0|, see Figure 5. To\nprepare these states, we opt for a series of Unitary\ngates representing an Euler decomposition. This\nentails a series of one-qubit unitaries Rz(θ1) to\nRz(θ3), which are a simple rotational matrices ca-\npable of rotating the subjected quantum state vec-\ntors. Word-states with multiple output wires evolve\nfrom multi-qubit states on k qubits where k > 1,\nwhich are structured by an IQP-style circuit, see\nFIgure 6. The word-circuit is divided into d layers.\nEach layer starts with Hadamard gates and then\nconnects every adjacent pair of qubit wires with\na controlled rotational CRz(θ) gate. As all CRz\nFigure 6: Ansatz for word with multiple wire\nFigure 7: Ansatz for \"Cups\" or \"Bell State\"\ngates are commutative, it’s feasible to view them\nas one layer. The Kronecker tensor for n- single\noutput wires of type b are connected to word states\nvia a GHZ state. In essence, the GHZ circuit pro-\nduces the state P2b\na=0 ⊗n\ni=1|bin(a)⟩, where \"bin\"\nis a binary representation. For example n = 2 cor-\nrespond to Bell (Entangled) State |00⟩+ |11⟩.The\npregroup type b is mapped to qb-many nested Bell\neffects (⟨00|+⟨11|), executed as a CNOT, followed\nby a Hadamard gate on the control qubit and post-\nselection on |00⟩as shown in Figure 7.\n4\nDiscussion and Future work\nIn this study, we have delved into the process of\nconstructing trainable parameterized quantum cir-\nFigure 8: PQC for \"Main School Jata hu\", end gates\nare measurements leading to information to classical\nregister \"c\" shown at the bottom.\nFigure 9: PQC for \"Mukesh ne khana khaya\", end gates\nare measurements leading to information to classical\nregister \"c\" shown at the bottom.\ncuits from Hindi sentences, utilizing pre-group\ngrammar and the DisCoCat model. This methodol-\nogy holds significant relevance within the broader\nframework of a versatile QNLP Pipeline. Once we\nsuccessfully create parameterized quantum circuits\nfor a curated dataset comprising Hindi sentences,\nthe next crucial step involves training these circuits\nto develop a proficient QNLP Model. Looking\nforward, our research aspirations encompass an ex-\ntension of this work to devise a nuanced sentence\nclassifier for Hindi sentences, integrating topic and\ncontext awareness through a QNLP approach. We\ndraw inspiration from a study by [13], aiming to\nalign our approach with their advancements in this\ndomain. However, we acknowledge the inherent\ncomplexities lying ahead in this endeavour. Hindi\nexhibits a notably freer word order compared to\nEnglish, presenting a challenge in accommodat-\ning potential restrictions on word order movements\nwithin the construction of the PQC. Addressing and\novercoming these intricacies are essential compo-\nnents of our ongoing and future research, paving\nthe way for a more refined and accurate QNLP\napproach tailored to the nuances of the Hindi lan-\nguage.\n5\nConclusion\nIn conclusion, this paper presents a significant ad-\nvancement in the field of QNLP by extending its\napplications to the Hindi language. By leveraging\nthe pregroup representation of Hindi and the DisCo-\nCat framework, we have successfully designed sen-\ntence diagrams, which are then translated into Pa-\nrameterised Quantum Circuits using the IQP style\nansatz. The resulting parameterised circuits en-\nable the development of grammar-aware and topic-\naware sentence classifiers tailored to the nuances of\nthe Hindi language. This novel approach not only\ncontributes to the growing body of QNLP research\nbut also addresses the need for more explainable\nNLP systems in languages beyond English, which\npromises exciting possibilities for natural language\nunderstanding and processing across diverse lin-\nguistic landscapes.\nReferences\n[1] Mina Abbaszade, Vahid Salari, Seyed Shahin\nMousavi, Mariam Zomorodi, and Xujuan Zhou. 2021.\nApplication of quantum natural language processing\nfor language translation. IEEE Access, 9:130434–\n130448.\n[2] Mina Abbaszadeh, S Shahin Mousavi, and Vahid\nSalari. 2021. Parametrized quantum circuits of syn-\nonymous sentences in quantum natural language pro-\ncessing. arXiv preprint arXiv:2102.02204.\n[3] Kumi Cardinal. 2002. An algebraic study of japanese\ngrammar.\n[4] Noam Chomsky. 2002. Syntactic structures. Mouton\nde Gruyter.\n[5] Bob Coecke, Mehrnoosh Sadrzadeh, and Stephen\nClark. 2010. Mathematical foundations for a com-\npositional distributional model of meaning. arXiv\npreprint arXiv:1003.4394.\n[6] Alok Debnath and Manish Shrivastava. 2019. A pre-\ngroup representation of word order alternation using\nhindi syntax. In Proceedings of the 2019 Conference\nof the North American Chapter of the Association for\nComputational Linguistics: Student Research Work-\nshop, pages 125–135.\n[7] Edward Grefenstette and Mehrnoosh Sadrzadeh.\n2011. Experimental support for a categorical com-\npositional distributional model of meaning. arXiv\npreprint arXiv:1106.4058.\n[8] Dimitri Kartsaklis, Ian Fan, Richie Yeung, Anna\nPearson, Robin Lorenz, Alexis Toumi, Giovanni\nde Felice, Konstantinos Meichanetzidis, Stephen\nClark, and Bob Coecke. 2021. lambeq: An efficient\nhigh-level python library for quantum nlp. arXiv\npreprint arXiv:2110.04236.\n[9] Joachim Lambek. 1958.\nThe mathematics of\nsentence structure.\nThe American Mathematical\nMonthly, 65(3):154–170.\n[10] Joachim Lambek. 1999. Type grammar revisited.\nIn Logical Aspects of Computational Linguistics:\nSecond International Conference, LACL’97 Nancy,\nFrance, September 22-24, 1997 Selected Papers 2,\npages 1–27. Springer.\n[11] Konstantinos Meichanetzidis, Stefano Gogioso,\nGiovanni De Felice, Nicolò Chiappori, Alexis Toumi,\nand Bob Coecke. 2020. Quantum natural language\nprocessing on near-term quantum computers. arXiv\npreprint arXiv:2005.04147.\n[12] Konstantinos Meichanetzidis, Alexis Toumi, Gio-\nvanni de Felice, and Bob Coecke. 2023. Grammar-\naware sentence classification on quantum computers.\nQuantum Machine Intelligence, 5(1):10.\n[13] Maha A Metawei, Mohamed Taher, Hesham El-\nDeeb, and Salwa M Nassar. 2023. A topic-aware\nclassifier based on a hybrid quantum-classical model.\nNeural Computing and Applications, pages 1–10.\n[14] Mehrnoosh Sadrzadeh. 2010. Clitic movement in\npregroup grammar: a cross- linguistic approach. In\nLecture Notes in Artificial Intelligence ‚Proceedings\nof Eighth International Tbilisi Symposium on Lan-\nguage ‚Logic and Computation ‚September 2009.\nLecture Notes in Artificial Intelligence ‚Proceedings\nof Eighth ....\n[15] Mehrnoosh Sadrzadeh, Stephen Clark, and Bob Co-\necke. 2013. The frobenius anatomy of word mean-\nings i: subject and object relative pronouns. Journal\nof Logic and Computation, 23(6):1293–1317.\n[16] Sukin Sim, Peter D Johnson, and Alán Aspuru-\nGuzik. 2019. Expressibility and entangling capa-\nbility of parameterized quantum circuits for hybrid\nquantum-classical algorithms. Advanced Quantum\nTechnologies, 2(12):1900070.\n[17] Jirawat\nTangpanitanon,\nChanatip\nMangkang,\nPradeep Bhadola, Yuichiro Minato, Dimitris G Ange-\nlakis, and Thiparat Chotibut. 2022. Explainable nat-\nural language processing with matrix product states.\nNew Journal of Physics, 24(5):053032.\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2023-12-02",
  "updated": "2023-12-02"
}