{
  "id": "http://arxiv.org/abs/2402.17020v1",
  "title": "Deep Learning Algorithms Used in Intrusion Detection Systems -- A Review",
  "authors": [
    "Richard Kimanzi",
    "Peter Kimanga",
    "Dedan Cherori",
    "Patrick K. Gikunda"
  ],
  "abstract": "The increase in network attacks has necessitated the development of robust\nand efficient intrusion detection systems (IDS) capable of identifying\nmalicious activities in real-time. In the last five years, deep learning\nalgorithms have emerged as powerful tools in this domain, offering enhanced\ndetection capabilities compared to traditional methods. This review paper\nstudies recent advancements in the application of deep learning techniques,\nincluding Convolutional Neural Networks (CNN), Recurrent Neural Networks (RNN),\nDeep Belief Networks (DBN), Deep Neural Networks (DNN), Long Short-Term Memory\n(LSTM), autoencoders (AE), Multi-Layer Perceptrons (MLP), Self-Normalizing\nNetworks (SNN) and hybrid models, within network intrusion detection systems.\nwe delve into the unique architectures, training models, and classification\nmethodologies tailored for network traffic analysis and anomaly detection.\nFurthermore, we analyze the strengths and limitations of each deep learning\napproach in terms of detection accuracy, computational efficiency, scalability,\nand adaptability to evolving threats. Additionally, this paper highlights\nprominent datasets and benchmarking frameworks commonly utilized for evaluating\nthe performance of deep learning-based IDS. This review will provide\nresearchers and industry practitioners with valuable insights into the\nstate-of-the-art deep learning algorithms for enhancing the security framework\nof network environments through intrusion detection.",
  "text": "arXiv:2402.17020v1  [cs.CR]  26 Feb 2024\nDeep Learning Algorithms Used in Intrusion\nDetection Systems - A Review\nRichard Kimanzi1,†, Peter Kimanga1,†, Dedan Cherori1,†,\nPatrick K. Gikunda1,*\n1Department of Computer Science, Dedan Kimathi University of\nTechnology, P.O Box Private Bag - 10143, Nyeri, Kenya.\n*Corresponding author(s). E-mail(s): patrick.gikunda@dkut.ac.ke;\nContributing authors: richard.mutisya23@students.dkut.ac.ke;\npeter.kimanga23@students.dkut.ac.ke;\ndedan.cherori23@students.dkut.ac.ke;\n†These authors contributed equally to this work.\nAbstract\nThe increase in network attacks has necessitated the development of robust and\neﬃcient intrusion detection systems (IDS) capable of identifying malicious activ-\nities in real-time. In the last ﬁve years, deep learning algorithms have emerged\nas powerful tools in this domain, oﬀering enhanced detection capabilities com-\npared to traditional methods. This review paper studies recent advancements in\nthe application of deep learning techniques, including Convolutional Neural Net-\nworks (CNN), Recurrent Neural Networks (RNN), Deep Belief Networks (DBN),\nDeep Neural Networks (DNN), Long Short-Term Memory (LSTM), autoencoders\n(AE), Multi-Layer Perceptrons (MLP), Self-Normalizing Networks (SNN) and\nhybrid models, within network intrusion detection systems. we delve into the\nunique architectures, training models, and classiﬁcation methodologies tailored\nfor network traﬃc analysis and anomaly detection. Furthermore, we analyze\nthe strengths and limitations of each deep learning approach in terms of detec-\ntion accuracy, computational eﬃciency, scalability, and adaptability to evolving\nthreats. Additionally, this paper highlights prominent datasets and benchmarking\nframeworks commonly utilized for evaluating the performance of deep learning-\nbased IDS. This review will provide researchers and industry practitioners with\nvaluable insights into the state-of-the-art deep learning algorithms for enhancing\nthe security framework of network environments through intrusion detection.\nKeywords: Deep Learning Algorithms, Intrusion Detection, Computer Networks,\nSystematic Literature Review\n1\n1 Introduction\nApplication systems and computer networks are essential for eﬀective business pro-\ncesses in today’s quickly evolving technology world. They enable the seamless exchange\nof resources, including data, processing power, storage, and information[1]. As the\nneed for automated systems that can quickly and eﬃciently accomplish organizational\ngoals has grown, so has the use of application systems in networked environments[2].\nAt the same time, privacy and security issues in application systems and networks\nhave become more well-known, highlighting the necessity of strengthening security\ncontrols against the constantly changing threats in today’s cyberspace [3]. Within the\nlarger framework of modern civilization, the Internet is a vital resource that promotes\ninternational communication and information sharing. The Internet is essential for\nexchanging important information among authorities or wirelessly transmitting basic\nphotographs on social media [4]. Even with signiﬁcant progress, persistent problems,\nincluding vulnerability to cyberattacks and diﬃculties enforcing international protec-\ntion rules, exist, necessitating proactive measures on the part of businesses to defend\ntheir interests from possible security breaches and incursions.\nThe need to shield networks from an array of threats, including denial-of-\nservice (DoS) assaults, unauthorized information disclosure, and data manipulation or\ndestruction, is more critical than ever in an era where computer systems are becom-\ning increasingly interconnected. In the realm of modern network security, ensuring\nthe availability, conﬁdentiality, and integrity of vital information systems has become\nparamount [5]. When paired with ﬁrewalls, intrusion detection systems (IDS) are\namong the essential security elements that can eﬀectively handle a wide range of\nsecurity risks [6]. IDS techniques fall into two categories: Network Intrusion Detec-\ntion Systems based on signatures and Anomaly Detection Systems based on anomaly\ndetection. NIDS relies on signatures to identify intrusions and does so by comparing\npatterns across all the data they retrieve. On the other hand, anomaly-based alerts\nfor intrusions detect any appreciable departures from the typical traﬃc pattern in the\nuser behavior being monitored. Consequently, anomaly detection NIDS performs bet-\nter when dealing with new attack patterns, while signature-based NIDS has a higher\ndetection rate for recognized attack types. However, it frequently results in false alarms\nbecause of variations in intruder behavior [4]. Finding abnormal patterns in the system\naudit record might aid in identifying security breaches.\nIn the past ten years, researchers have put forth a variety of Machine Learning\nand Deep Learning techniques to enhance Intrusion Detection Systems’ capacity to\nidentify hostile eﬀorts [7]. One kind of artiﬁcial intelligence technique called machine\nlearning has the potential to extract pertinent facts from massive databases auto-\nmatically. When suﬃcient training data is provided, machine learning-based intrusion\ndetection systems can achieve higher detection levels. Additionally, machine learning-\nbased IDSs are easy to create and implement since they do not heavily rely on domain\nexpertise [7]. One branch of machine learning that can produce very good outcomes\nis called deep learning. Jakhar and Kaur deﬁne Deep Learning as a subset of Machine\nLearning that is applied in computational problem-solving by using models and algo-\nrithms that mimic biological neural networks of the brain. Deep Learning, just like\nthe brain, works by interpreting information, classifying it, and assigning it to various\n2\nclasses [8]. Functionally, Deep Learning incorporates a set of Machine Learning algo-\nrithms that attempt learning using artiﬁcial neural network concepts in multiple levels\nthat correspond to diﬀerent levels of abstraction [9]. Feature representations could be\nlearned using deep learning techniques to transform unprocessed input into ﬁnal out-\nputs. One characteristic of deep learning that sets it apart is its deep structure, which\nconsists of many hidden layers. However, traditional machine learning models have\none or no hidden layer, including the support vector machine (SVM) and k-nearest\nneighbor (KNN) [7]. These conventional machine learning models are frequently called\n”shallow models.”\nDeep learning approaches perform better when working with vast amounts of data\nthan standard machine learning techniques [6]. Nevertheless, there are many barriers\nthat IDS systems must overcome to promptly detect malicious intrusions due to the\nexponential increase in network traﬃc and associated security risks. Deep Learning\nTechniques for Intrusion Detection Systems (IDS) are currently being researched, and\nthere is still more space to advance this technology for eﬀective intrusion detection in\nIDS.\nThis systematic study aims to examine the current algorithms utilized to create\nintrusion detection systems and explain how they have been applied to guarantee\neveryone’s safety in cyberspace. This report will consider the current research from\n2019 to 2023 to achieve this goal. The following research questions will be addressed\nin this work:\n1. Which Deep Learning methods have been employed in IDS in the last ﬁve years?\n2. What is the application area of deep learning algorithms in IDS?\n3. What are the attacks covered by various datasets used in developing Deep Learning\nNetwork Intrusion detection Systems?\nThis paper is organized in the following order. Section two surveys the related\nliterature works regarding the deep learning algorithms used in Intrusion Detection\nSystems. Section three reports the results of performance for the various algorithms.\nSection four gives a conclusion to this paper as well as giving directions for future\nworks.\n2 Related work\nThis section will analyze the various deep learning algorithms based on recent research\nwithin the last ﬁve years. But ﬁrst, we deﬁne Deep Learning as a computing con-\ncept in Machine Learning and Artiﬁcial Intelligence. Deep learning models that have\nbeen applied in Intrusion Detection Systems include Deep Belief Networks (DBNs),\nConvolutional Neural networks (CNNs), Recurrent Neural Networks (RNNs), Long-\nShort-Term-Memory (LSTM), Multilayer Perceptrons (MLPs), autoencoders, Self\nOrganizing Maps (SOMs) [10].\n2.1 Convolutional Neural Networks (CNNs)\nKhan et al. in [11] proposes an Improved CNN Model for network intrusion detection\nthat combines the CNN algorithm and softmax algorithm. This model executes three\n3\nprocesses in its intrusion detection method. First, data pre-processing is carried out\nthrough the conversion of symbolic data to numeric data then normalization is of\nthe data undertaken. Secondly, a CNN model with three hidden layers is used for\ndata training and feature extraction. Finally, the softmax classiﬁer is utilized when\nobtaining the classiﬁcation results. The proposed NIDS is tested using the KDD99\ndata set. The results of the experiment exhibit an improved performance in terms of\nthe accuracy in intrusion detection compared to Support Vector Machines and Deep\nBelief Networks. This accuracy is improved by increasing the number of epochs in the\nproposed model. The proposed model should be tested for its performance against\nnewer state-of-the-art network intrusion algorithms and its applicability in IoT and\nCloud computing where there are large-scale data and sophisticated attacks.\nA novel NIDS is proposed by Liu et al. in [12] that improves intrusion detection by\nemploying CNN combined with Fast Fourier transformation for representation learn-\ning. The proposed method works by converting network traﬃc to an image after the\npreprocessing stage by modeling a visual data transformation representation algo-\nrithm. A CNN classiﬁer i.e. the ResNet50 framework by MathWorks, is then applied\nfor image processing. Image processing for anomaly detection is the core method that\nLiu et al. propose to improve intrusion detection using CNN. The algorithm is tested\nusing the KDDCup’99 dataset. The proposed algorithm shows overall better perfor-\nmance in both binary and multi-class classiﬁcation. It also shows improved accuracy\nwhen compared with other algorithms. However, this algorithm does not detect U2R\nand R2L anomalies since they are very few in the used data set. Furthermore, it is not\ntested against state-of-the-art deep learning algorithms to compare its performance.\nHu et al., built and implemented a Wi-Fi sensing system for detecting intrusion\nemploying Channel State Information (CSI) at the physical layer of a Wi-Fi network\nas a detection signal in [13]. To boost the sensitivity of a passive intrusion detection\nsystem, they used a path decomposition method and Deep learning convolutional\nneural network. CNN was used to enable the computer to learn and identify intrusion\nwithout extracting numerical characteristics. They used Channel State Information\n(CSI) dataset. In four diﬀerent cases or scenarios that they had in their experiment,\nthe average detection accuracy was 98.69% with a single person and 98.91% with\nmultiple participants. They concluded that in comparison to prior methods, IDSDL\ncan detect human movements on non-line of sight (NLOS) pathways more sensitively\nand increase system reliability.\nArun et al. [14] introduced an innovative intrusion detection algorithm designed\nto bolster network security in the wake of escalating thefts and system breaches.\nLeveraging Convolutional Neural Network (CNN), the authors present a high-level\nIntrusion Detection System (IDS) that meticulously examines network abnormalities,\nrepresenting a substantial advancement in information security technology. The study\nemphasizes the pressing need for resilient systems capable of identifying novel attacks\namidst the rapid evolution of networks and technology. By amalgamating machine\nlearning and deep learning algorithms, the proposed IDS focuses on discerning elu-\nsive assault bundles. Signiﬁcantly, the advanced system demonstrated a noteworthy\nenhancement in precision, fortifying its ability to accurately detect intricate attack\npatterns. This study underscores the pivotal role of Intrusion Detection Systems in\n4\nfortifying information security and addressing the surge in cyber threats within the\ndynamic technological landscape (citation28). The speciﬁc network intrusion detec-\ntion techniques and datasets employed in this study is unsw-nb15 Arun et al. [14]\nstudy the escalating occurrences of thefts and system breaches that underscore the\npressing need for advanced security measures. They introduce an innovative approach\nto address this challenge through the deployment of a high-level Intrusion Detec-\ntion System (IDS) incorporating Convolutional Neural Network (CNN) technology.\nBy leveraging machine learning and deep learning algorithms, the IDS aims to detect\nnetwork abnormalities eﬀectively. The primary objective of the study is to identify elu-\nsive attack bundles, enhancing precision in intrusion detection. The proposed system\nexhibits remarkable precision improvements, indicating its eﬃcacy in recognizing intri-\ncate attack patterns. The research emphasizes the signiﬁcance of information security\ntechnology, particularly IDS, in the evolving landscape of network threats. Through\nthe application of high-performance intrusion detection systems, the study demon-\nstrates a proactive approach to identifying and mitigating potential security breaches,\nthereby contributing to the overall enhancement of network security.\nAlissa et al. in [15] address the pressing challenge of cybersecurity in the context of\nthe Internet of Things (IoT), where a multitude of small smart devices transmit vast\namounts of data over the Internet. Recognizing the inherent security ﬂaws in these\nIoT gadgets, exacerbated by the lack of hardware security support, the study focuses\non the development of an innovative solution for lightweight intrusion detection in\nresource-constrained IoT environments. The proposed approach, named Planet Opti-\nmization with Deep Convolutional Neural Network for Lightweight Intrusion Detection\n(PODCNN-LWID), leverages a Deep Convolutional Neural Network (DCNN) for\nintrusion identiﬁcation and integrates Planet Optimization (PO) as a hyperparame-\nter tuning process. The primary goal of PODCNN-LWID is to identify and categorize\nintrusions eﬃciently. The model undergoes two major processes: intrusion identiﬁca-\ntion using DCNN and hyperparameter tuning through PO. Experimental validation\non a benchmark dataset demonstrates the eﬀectiveness of the PODCNN-LWID model,\nshowcasing enhancements over alternative approaches in terms of intrusion detection\nperformance. The study contributes valuable insights into mitigating cybersecurity\nchallenges in resource-constrained IoT environments.\nMan and Sun in [16] proposed a CNN model for network intrusion detection strat-\negy based on residual learning and focal loss. It aimed to enhance network security\nby introducing a novel approach based on residual learning. The techniques employed\ninvolved the implementation of residual connections within the neural network archi-\ntecture using UNSW-NB15 dataset. Its results revealed that residual learning models\nare easier to train, with smaller loss values on training data and higher accuracy rates\non testing data.\n2.2 Deep Belief Networks (DBNs)\nA fuzzy aggregation method for intrusion detection is proposed by Yang et al [17].\nThis system is applicable in the Internet of Things (IoT) and cloud environments\nas well as software-deﬁned networks. This research tries to address the problem of\nlarge data sets in the mentioned environments as well as capturing emerging attacks\n5\nthat are not captured in the training data set by combining the Modiﬁed Density\nPeak Clustering Algorithm (MDPCA)and the Deep Belief Network (DBN) model.\nMDPCA is used in the extraction of similar features from intricate and extensive\nnetwork data then clustering it into various training subsets based on the similarity\nof the network traﬃc. This reduces the complexity of the training subsets. DBN then\nautomatically applies the feature extraction and classiﬁcation module to the training\nsubsets where extraction of sophisticated abstract features is carried out while avoiding\nmanual procedures and heuristic rules. The experimental tests of this proposed IDS\nare carried out using the NSL-KDD and UNSW-NB15 data sets. The results show\noverall best performance when compared to other state-of-the-art models in terms of\naccuracy and detection rate on the UNSW-NB15 except for CASCADE-ANN which\nranks higher than MDPCA-DBN on the False Positive Rate parameter. Further tests\nshow overall best performance when compared to other state-of-the-art models in\nterms of accuracy, detection rate, and false positive rate on the NSL-KDD data set.\nMDPCA-DBN also applies at least two test data sets which produce almost similar\nresults in terms of eﬃciency thus proving its eﬃcacy in solving the stated multi-class\nclassiﬁcation problems. The areas of application are clearly stated as well ranging from\nSoftware-deﬁned networks, to IoT and Cloud Environments.\nThamilarasu and Chawla in [18] identiﬁed a security vulnerability in IoT due to\ntheir large attack surface. They propose a secure, portable, and ready-to-deploy IDS\nsuitable for an IoT environment. The heterogeneous nature of IoT networks makes\nthem susceptible to cyber-attacks[19]. The proposed algorithm forms a DNN using a\nDBN. The ability of DBN to be trained using unsupervised learning allows the DNN to\nbe trained using unsupervised learning which is faster compared to supervised learning.\nIdeally, network virtualization and a DNN binary classiﬁer are employed in detecting\nabnormal traﬃc in an IoT network. Upon testing the proposed model, there is overall\nimproved accuracy over Inverse Weight Clustering in the simulation environment and\nthe testbed. The wormhole attack however performs poorly in the test bed environment\nas compared to the simulation environment. This model is one of the few that have\nbeen tested in a testbed with real IoT network traﬃc with fairly good performance.\nHowever, the study does not state the dataset used in the simulation environment.\n2.3 Autoencoders (AE)\nSandeep Gurung et al. in [20] propose a deep learning intrusion detection system that\nuses a sparse auto-encoder and logistic regression in solving the network intrusion\nproblem. A sparse auto-encoder that has a sparsity constraint is used to train the\nmodel. Logistic regression is then applied in the classiﬁcation phase that results to\na binary classiﬁcation of either a normal user or intruder. The model is trained and\ntested using the NSL-KDD data set. This model results to a higher accuracy rate when\ncompared to Signature-Based Intrusion Detection approaches with reduced chances\nof False Positives and False Negatives. This approach is best applied in real-time\nnetwork monitoring servers although there is no evidence of real-world application of\nthis model.\nTelikani and Gandomi in [21] propose a Cost-sensitive stacked auto-encoders model\nfor intrusion detection in the Internet of Things networks with the aim of solving the\n6\nclass imbalance problem in IDSs. This model works by modifying the cost function\nof a Stacked Auto-Encoder to be more sensitive toward misclassiﬁcation of minority\nclass by reducing the eﬀect of unbalanced data on the performance of intrusion detec-\ntion systems. Batch Normalization method is used to speed up the learning phase\nwhile Softmax classiﬁer, a multi-class version of Logistic Regression, is used in the\nclassiﬁcation of anomalies. Extraction of probabilities for each class is achieved using\ncross-entropy loss. This study uses the KDD cup 99 and NSL-KDD Datasets to train\nat test the proposed model. Experimental results show that it performs better than\nStacked Auto-Encoder (SAE) and Non-symmetric Deep Auto-Encoder (NDAE) in all\nmetrics when tested using both datasets.\nAn IoT intrusion detection system using asymmetric parallel auto-encoder (APAE)\nis proposed by Basati and Faghih in [22] for detecting real-time cyber-attacks in IoT\nnetworks. This study uses the UNSW-NB15, CICIDS2017, and KDDCup99 datasets\nfor training, testing and validating the model. An APAE is ﬁrst trained on a dataset in\nthe proposed model in order to estimate the identity function for the training data. In\norder to estimate the identity function for the training data, an APAE is ﬁrst trained\non a dataset in the suggested model. After that, the ﬁnished model is achieved by\njoining the ﬁrst three components of the learned APAE—the transfer layer, encoder,\nand latent features—with a fully linked classiﬁer layer at the end. Subsequently, the\nﬁnal model is retrained using the training data in order to determine the classiﬁer\nweights and adjust the APAE encoder weights for precise classiﬁcation. The proposed\nAPAE model Slightly better in classiﬁcation compared to other proposed auto encoder\nmodels. It also performs the best classiﬁcation in the minority classes. This study\nachieves a lightweight NIDS suitable for IoT networks and devices which are limited\nin terms of processing power, memory, and energy eﬃciency.\nA study by Kamalov et al. in [23], the authors present an Autoencoder-based\nIntrusion Detection System (IDS) designed for detecting Distributed Denial of Service\n(DDoS) attacks. The algorithm identiﬁes intrusions by ﬂagging anomalous traﬃc ﬂows\nwith higher reconstruction loss. The study utilizes the CSE-CIC-IDS2018 dataset for\nevaluation. The proposed strategy demonstrates superior performance compared to\nbenchmark unsupervised systems in the detection of DDoS attacks.\n2.4 Deep Neural Networks (DNNs)\nA Scalable Hybrid Intrusion Detection System Alertnet (SHIA) is proposed by R.\nVinayakumar et al. in [24]. This approach Employs distributed deep learning with\nDNNs for analyzing and handling large sets of data in real time with the aim of\nsolving the problem of detection and classiﬁcation of unforeseen and unpredictable\ncyber-attacks. This intrusion detection system is modeled using a scalable computing\nframework based on Apache Spark Cluster Computing platform. A System Call trace\nis used for text representation and classiﬁcation of process behaviours. The DNN is\nmodelled using Feed forward Neural (FFN)Network and Multilayer Perceptron (MLP).\nThis paper trains and tests the model with several datasets including KDD Cup 99,\nNSL-KDD, UNSW-NB15, WSN-DS, CICIDS 2017, Kyoto. The test results show over-\nall superior performance than classical machine learning classiﬁer models for NIDs\nand HIDs such RF, SVM, KNN, LR, AB. The experiments using a variety of datasets\n7\nshows the versatility of the model and its ability to work in an environment with large\nscale data. The authors oﬀer the proposed model for use Eﬃcient real-time network\nmonitoring for the network traﬃc and host-level operation such as Malicious host\ndetection.\nA hybrid classiﬁer model for intrusion detection known as Spider Monkey Opti-\nmization and Deep Neural Network (SMO-DNN) is proposed by Khare et al. in [25]. In\nthis study the NSL-KDD and KDD Cup 99 Datasets have been used. At the data pre-\nprocessing stage, data cleansing is done using the Min-Max normalization technique\nthen 1-N encoding is used to achieve consistent and uniﬁed data. The Spider Monkey\nOptimization is utilized for dimensionality reduction after which the reduced dataset\nis split into the Training and testing datasets then forwarded to the Deep Neural Net-\nwork for classiﬁcation which uses the the softmax classiﬁer at the output layer. The\nresulting classiﬁcation is either normal traﬃc or intrusion traﬃc. SMO-DNN is tested\nin comparison with Principal Component Analysis (PCA) PCA-DNN and DNN and\nit exhibits better performance than the two models. PCA is tested as a reduction\nalgorithm with DNN as the classiﬁer. This model is a binary classiﬁer that is applica-\nble in large network. However, the study should have tested the model against other\nstate-of-the-art network intrusion detection algorithms to further prove its eﬃcacy.\nA Transfer Learning for Network Intrusion Detection System (TL-NID) is pro-\nposed by Masum and Shahriar in [26]. This model combines a Deep Neural Network\nfor Classiﬁcation while transfer learning is used for feature extraction. This algo-\nrithm executes two procedures in ﬁnding a solution to the malicious network intrusion\nproblem. Two step method is modelled using the pre-trained VGG-16 for feature\nextraction. Extracted features are then fed into a DNN for classiﬁcation. The sigmoid\nlayer of the DNN carries out binary classiﬁcation. This model is trained and tested\nusing the NSL-KDD dataset. The model is tested against traditional machine learn-\ning models i.e. Support Vector Machines (SVM), Logistic Regression (LR), Decision\nTree (DT), and Random Forest (RF) and its performance is analyzed. The proposed\nmodel exhibits the best Performance in terms of Accuracy, Recall and F1-Score using\nboth KDDTest+ and KDDTest-21 datasets. Decision trees (DT) perform better than\nthe proposed model on Precision and False Alarm Rate using the KDDTest+ dataset.\nSVM performs better than the proposed model on Precision and False alarm rate\nusing the KDDTest-21 dataset.\nKhan et al., in [27] suggested a DNN-based intrusion detection system for MQTT-\nenabled IoT smart systems. The suggested model’s performance was evaluated using\na MQTT-IoT-IDS2020 dataset and another Message Queuing Telemetry Transport\n(MQTT) dataset. The proposed DL-based IDS’s performance with a default learning\nrate and the ADAM optimizer was compared to the performance of conventional ML-\nbased IDSs such as KNN, NB, DT, and RF. The suggested model was further evaluated\nfor binary-class and multi-class attack classiﬁcation with diﬀerent activation functions\nat the output layers. According to the results, the DL-based model for Bi-ﬂow and Uni-\nﬂow featured data reached 99% and 98% accuracy for binary and multi-class attack\nclassiﬁcation, respectively.\n8\nGulia et al. in[28] have made noteworthy strides in advancing network security,\nspeciﬁcally within the domain of cloud computing, by introducing an Intrusion Detec-\ntion System (IDS) that leverages the Group-Artiﬁcial Bee Colony Algorithm (G-ABC)\nalgorithm alongside a Deep Neural Network (DNN). In their study, this innovative\napproach eﬀectively addressed security concerns inherent in cloud computing envi-\nronments, resulting in a commendable 96% detection rate for improved intrusion\ndetection capabilities. Beyond the proposed IDS, the authors conducted an exhaus-\ntive literature review, highlighting various studies on both host-based (HIDS) and\nnetwork-based (NIDS) IDSs, showcasing diverse methodologies, including hybrid mod-\nels, optimization techniques, and robust IDS designs. These collective eﬀorts contribute\nto overcoming challenges such as system complexity and limitations in alert systems.\nThe proposed two-phase framework, combining G-ABC for optimal feature selection\nand DNN for classiﬁcation, not only aims to elevate IDS performance but also demon-\nstrates promising results, solidifying its potential impact on the future of network\nsecurity in cloud environments.\nSyariful et al. [29] delve into the critical domain of cybersecurity within the con-\ntext of the Internet of Things (IoT). As the proliferation of IoT devices continues\nto enhance human lives, it also ampliﬁes the susceptibility of networks to potential\nattacks. Recognizing the inherent vulnerabilities in IoT networks, the study employs\nartiﬁcial intelligence as a proactive measure to safeguard these networks by detecting\nand preventing attacks eﬀectively. The research speciﬁcally focuses on network detec-\ntion utilizing the Deep Neural Network (DNN) algorithm, a sophisticated artiﬁcial\nintelligence technique. The experimentation involved testing on the UNSW Bot-IoT\ndataset, with training data comprising 75% of the overall dataset. Remarkably, the\nDNN algorithm demonstrated exceptional performance, achieving an average detec-\ntion accuracy of 99.999%. Despite the presence of a small validation loss indicative of\noverﬁtting, the study attests to the robust capability of the algorithm in eﬀectively\nidentifying and mitigating attacks in IoT networks.\n2.5 Recurrent Neural Networks (RNNs)\nAshwaq et al., [30] address the escalating vulnerabilities and attacks prevalent in the\nInternet of Things (IoT) environment. As the IoT landscape continues to expand,\nfacilitating the connection of over 20 billion items by 2024, the imperative of secur-\ning this interconnected ecosystem becomes increasingly evident. To address this, the\nresearchers propose a novel approach employing Recurrent Neural Network (RNN)\ndeep learning algorithms for intrusion detection within the IoT environment. The\nstudy utilizes the NSL-KDD dataset for both training and testing purposes. The pro-\nposed RNN model demonstrates notable success, achieving an accuracy of 87% in\ndetecting intrusions. The research underscores the signiﬁcance of leveraging machine\nlearning and deep learning techniques for enhancing security within the evolving IoT\nparadigm. Furthermore, the authors express their commitment to future work, intend-\ning to explore optimization algorithms to further augment the detection accuracy of\ntheir proposed model.\n9\n2.6 Self-Normalizing Neural Networks (SNNs)\nA novel network-based detection system for IoT attacks is modelled by Aldhaheri\net al. in [31]. The BoT-IoT dataset is used with the proposed algorithm combining\nSelf-Normalizing Neural Networks (SNNs) with Dendritic Cell Algorithm (DCA). The\naim is to classify IoT intrusion and minimizing false alarm generation. The proposed\nalgorithm automates and smoothens feature extraction and categorization stage which\nin turn improves the classiﬁcation performance. Features are either classiﬁed as safe\nor dangerous signals using the Self-Normalizing Neural Network (SNN). The proposed\nDeepDCA model exhibits better performance as a classiﬁer compared to other models\nsuch as KNN, NB, MLP and SVM. This model also showed a high detection rate for\nIoT attacks with a high accuracy rate and a low False-Positive Rate. Self-normalization\nNeural Network is a fairly new technique and further studies could be carried out to\nexplore its potential in solving intrusion detection problems and other deep learning\nproblem domains.\n2.7 Multi-Layer Perceptron (MLP)\nLouati and Ktata propose a deep learning based multi agent system for intrusion\ndetection (DL-MFID) in [32]. Data pre-processing is carried out using pre-processor\nagent to achieve numericalization and normalized data. Feature reduction is then\nperformed using an auto-encoder as a reducer agent to select relevant features. Finally\nmulti-class classiﬁcation is done using into 5 classes using two classiﬁer agents i.e.\nMLP and KNN. This model is trained and tested using the KDD cup 99 dataset.\nExperimental results show that this model exhibits the highest accuracy rate of 99.95%\ncompared to other proposed models which used the same dataset. This model Has\nhowever not been applied in real network traﬃc to test its eﬃciency. The approach of\nusing multiagent classiﬁers is a new approach that requires further research to study\nhow it can improve network intrusion detection systems.\nAbdulrahman et al. in [33] addressed the critical issue of securing network sys-\ntems against Distributed Denial of Service (DDoS) attacks by developing two eﬀective\nIntrusion Detection System (IDS) models based on multilayer perceptron neural net-\nworks (MLP). In the ﬁrst model, MLP1, a one-hidden-layer MLP with 38 input nodes,\n11 hidden nodes, and 5 output nodes achieved a remarkable detection accuracy of\n95.6%. Building upon this, the second model, MLP2, enhanced with two hidden lay-\ners, surpassed MLP1, achieving an accuracy 2.2% higher. The study demonstrates\nthe eﬃcacy of MLP-based IDS in accurately classifying diﬀerent request types and\nhighlights the importance of robust models in countering DDoS attacks. The training\nand evaluation were conducted using the NSL-KDD dataset, showcasing the practical\napplication of MLP-based IDS in real-world scenarios\nA multilayer perceptron for network intrusion detection is proposed by Rosay et\nal. in [34] aimed at preventing cyber-attacks in Vehicular IoT networks. This model\nwork by training a multilayer perceptron model that quantiﬁes the beneﬁts of using\ndeep learning strategies in network intrusion detection systems. The CIC-IDS2017\nis used to deﬁne the IDS solution while the CSE-CIC-IDS2018 dataset is used to\nvalidate and test the proposed model. At the pre-processing stage the training Dataset\n10\nis cleaned up to remove imbalances before the dataset is split to three categories\nnamely; Training set – 50%, validation set - 25%, test set - 25%. Feature selection is\nthen carried out to remove irrelevant features before the data normalization is done\nusing the Z-normalization technique. At the experimental level, the model is built\nand trained using python and the tensor ﬂow framework as the deep learning model.\nExperimental results show that the proposed model performs better than traditional\nML models in terms of accuracy with signiﬁcantly low false positive rates. This model\nwas further deployed in a practical system on chip vehicle allowing test to be carried\nout in an embedded system. Several shortcomings were identiﬁed where some attacks\nare underrepresented and some features are not well calculated in both datasets used\nby the model. Testing this model in a real-world scenario means it can be easily\nre-engineered for practical implementation in the automotive industry.\n2.8 Hybrid Algorithms\nSusilo and Sari in [35] evaluate the eﬀectiveness of Random forests, CNN and Multi-\nlayer Perceptrons in IoT Network Intrusion Detection Systems. Their study uses the\nBoT-IoT dataset to for evaluation of intrusion detection. Owing to the heterogeneous\nnature of IoT networks and traﬃc, multi-class classiﬁcation of intrusions was preferred.\nExperimental results show that Random Forests and CNNs perform better than MLP\nin terms of accuracy and Area Under Curve parameters in a multi-class classiﬁcation\nscenario. The study proposes a combination or hybridization of algorithms as future\nstudies in implementing NIDs for IoT environment. It is worth noting that the dataset\nused is speciﬁc to the research problem of intrusion detection in IoT application.\nHowever, the study ought to have considered other datasets in testing the eﬃcacy of\nthe designed models as well as testing them against other state-of-the-art algorithms\nfor Network Intrusion Detection.\nDutta et al. in [36] propose a model for eﬃcient network anomaly detection or\ncyber-attack detection system that employs a stacked ensemble classiﬁer approach.\nThis approach is meant for implementation in an IoT and cloud computing environ-\nment. This study used heterogenous datasets from IoT environments such as IoT-23,\nLITNET-2020 and NetML-2020. Dutta et al. combines DNN with LSTM in a stack\ngeneralization approach for initial classiﬁcation, then uses logistic regression as a meta\nclassiﬁer. The method begins with data preprocessing followed by feature engineer-\ning that uses a Deep Sparse Auto-Encoder. Classiﬁcation as the third step employs\nDNN and LSTM models followed by logistic regression which helps in eliminating\nbiases from training sets. The end result is a binary classiﬁcation results of the data\nas either normal or anomalous. The experimental results shows that the proposed\nstacked ensemble algorithm performs better than state-of-the-art classiﬁers and meta-\nclassiﬁers. The use of three recent datasets that ﬁt the problem domain is an indicator\nthat the model would perform well if implemented in a real-world scenario.\nIn their work titled ”Intrusion Detection System using MLP and Chaotic Neu-\nral Networks”, Shettar et al. [37] propose a hybrid intrusion detection model that\nuses multi-layer perceptron and chaotic neural network to achieve its objective. They\naddressed the challenges in developing a robust Network Intrusion Detection System\n11\n(NIDS) capable of identifying unexpected and impulsive cyber-attacks. While exist-\ning techniques focus on enhancing accuracy, the authors introduced a hybrid model\nintegrating Multilayer Perception (MLP) and chaotic neural networks to simultane-\nously improve accuracy, precision, and notably, the false alarm rate—a critical aspect\noften overlooked in NIDS development. The methodology involved employing MLP\nfor attack detection and chaotic neural networks to speciﬁcally target and reduce false\nalarm rates. The researchers conducted experiments using the KDD Cup’99 bench-\nmark dataset, a widely used standard for intrusion detection evaluations. The results\ndemonstrated that the hybrid approach outperformed the standalone MLP model\nby eﬀectively mitigating false alarm rates while maintaining comparable accuracy,\nprecision, and recall performance. This research contributes to the ﬁeld of intrusion\ndetection by oﬀering a holistic solution that not only enhances the system’s ability to\ndetect cyber-attacks accurately but also addresses the vital issue of minimizing false\nalarms. The ﬁndings suggest that incorporating chaotic neural networks in conjunc-\ntion with MLP can lead to more reliable and eﬃcient NIDS, crucial for maintaining\nthe integrity and security of computer networks in the face of evolving cyber threats.\nAlkahtani and Aldhyani in [38] developed a comprehensive framework system for\ndetecting intrusions based on the IoT environment. The proposed technique was devel-\noped using an IoT ID20dataset attack; a dataset from the IoT infrastructure. To\nidentify the incursion in this framework, three advanced deep learning algorithms were\nused: a convolution neural network (CNN), a long short-term memory (LSTM), and\na hybrid convolution neural network with the long short-term memory (CNN-LSTM)\nmodel. The dimensionality of the network dataset was reduced, and the particle swarm\noptimization method (PSO) was utilized to identify key characteristics from the net-\nwork dataset to improve the suggested system. Deep learning methods were used to\nprocess the collected features. The results revealed that the proposed systems obtained\nthe following levels of accuracy: CNN (96.60%), LSTM (99.82%), and CNN-LSTM\n(98.80%).\nAshiku and Dagli in [39] researched the use of deep learning architectures in the\ndevelopment of an adaptive and resilient network intrusion detection system (IDS)\nto identify and categorize network threats. The emphasis was on CNN with regu-\nlarized multi-layer perceptron to enable customizable IDS with learning power to\nidentify known and unknown network threats. They used UNSW-NB15 dataset. When\ncompared to the results of similar deep learning-based network IDSs, the suggested\ndeep-learning classiﬁcation architecture combined with the semi-dynamic hyperpa-\nrameter tuning approach revealed considerable improvements to multiclass models.\nAccording to the models, their proposed approach achieved an overall accuracy of\n95.4% and 95.6% for pre partitioned and user deﬁned multiclass categorization,\nrespectively.\nMuhuri et al in [40] propose a network intrusion detection system based on RNN\nmodel. They combine Long Short-Term Memory and RNN for classiﬁcation while\nGenetic Algorithm is utilized for optimal feature selection. This model is aimed\nat ensuring high detection rates compared to existing models using the NSL-KDD\ndataset. Optimal feature selection using GA is applied to the LSTM-RNN model to\nremove bias in the classiﬁcation process. This helps in minimizing misclassiﬁcation\n12\nrate, training time as well as maximizing the accuracy of the model. In the proposed\nmodel the original features in the dataset are 122 and thus GA optimizes these features\nto a subset of 99 features. The proposed model LSTM-RNN with GA produced the\nbest performance compared to RF and SVM in both binary and multiclass classiﬁca-\ntion tests. The LSTM-RNN with GA therefore oﬀers signiﬁcant improvement in NIDs\naccuracy and detection rates compared to traditional machine learning approaches.\nThis model is applicable in large dataset environments such a large computer networks\nwith high traﬃc.\nIn their quest to fortify the security of the Internet of Things (IoT), Saﬁet al. [41]\naddress the escalating concern of cyberattacks targeting IoT networks. Recognizing\nthe susceptibility of numerous IoT nodes that process sensitive data, the researchers\npropose a novel Intrusion Detection System (IDS) leveraging a deep-convolutional-\nneural-network (DCNN). The DCNN architecture encompasses two convolutional\nlayers and three fully connected dense layers, aiming to enhance overall performance\nwhile minimizing computational demands. The study conducts rigorous experiments\non the IoTID20 dataset, employing diverse optimization techniques, including Adam,\nAdaMax, and Nadam. Performance evaluation metrics such as accuracy, precision,\nrecall, and F1-score are systematically analyzed. Notably, the proposed DCNN-based\nIDS exhibits superior accuracy and robustness when compared to existing deep\nlearning (DL) and traditional machine learning (ML) techniques. This research con-\ntributes to advancing intrusion detection methodologies tailored for IoT environments,\nproviding an eﬀective shield against evolving cyber threats.\nS Amutha et al. [42] proposed an innovative approach, the NID-Recurrent Neu-\nral Network (RNN), to enhance the eﬃciency of Secure Network Intrusion Detection\nSystems (NIDS). Recognizing the importance of preventing malicious activities and\ncyber-attacks, the study delves into the realm of deep learning, speciﬁcally focusing\non the integration of NID with Long Short-Term Memory (LSTM). Unlike tradi-\ntional machine learning methods that rely on manually crafted features, deep learning\napproaches, including deep neural network (DNN), Convolutional Neural Network\n(CNN), and RNN, are explored for their potential to elevate the performance of\nintrusion detection. The researchers conduct a comprehensive analysis, comparing the\naccuracy and precision of each model, considering binary and multi-class classiﬁcations\non the NSL-KDD dataset. Notably, the results reveal an 8% improvement in accuracy\nfor the proposed NID-RNN approach, outperforming other deep learning algorithms.\nThe RNN model achieves an impressive 99.4% accuracy in classifying attack types,\nshowcasing its eﬃcacy in bolstering network security.\nSunil et al. In [43]this research on intrusion detection systems (IDS), the authors\nintroduced a novel approach by developing a composite model that combines Bidirec-\ntional Recurrent Neural Network (RNN) using Long Short-Term Memory (LSTM) and\nGated Recurrent Unit (GRU). The study utilized the CICIDS2017 dataset for simula-\ntions and evaluation. Notably, the hybrid RNN IDS achieved an outstanding 99.13%\nclassiﬁcation accuracy in predicting network attacks, showcasing the eﬀectiveness of\nthe proposed model. This performance surpassed the accuracy and False Positive\nrate of the Na¨ıve Bayes classiﬁer, highlighting the superiority of the deep learning-\nbased hybrid approach. The model’s eﬃciency was further emphasized by its ability to\n13\nachieve robust results using only 58% of the dataset attributes, demonstrating resource\neﬃciency and practical applicability.\nSydney Mambwe Kasongo in [44], the escalating volume of data transmission in\ncommunication infrastructures prompted the implementation of an Intrusion Detec-\ntion System (IDS) framework utilizing advanced Machine Learning (ML) techniques.\nThe framework employed various Recurrent Neural Networks (RNNs), such as Long-\nShort Term Memory (LSTM), Gated Recurrent Unit (GRU), and Simple RNN, to\nenhance the security of network systems. To address the challenge of low test accu-\nracy in detecting new attacks with increasing feature dimensions, an XGBoost-based\nfeature selection algorithm was integrated into the framework. The evaluation was\nperformed on benchmark datasets, including NSL-KDD and UNSW-NB15, revealing\nsigniﬁcant achievements. For binary classiﬁcation tasks on NSL-KDD, the XGBoost-\nLSTM model demonstrated superior performance with a test accuracy of 88.13%, a\nvalidation accuracy of 99.49%, and a training time of 225.46 seconds. On UNSW-NB15,\nthe XGBoost-Simple-RNN emerged as the most eﬃcient model with a test accuracy\nof 87.07%. For multiclass classiﬁcation, the XGBoost-LSTM achieved a test accuracy\nof 86.93% on NSL-KDD, while the XGBoost-GRU obtained 78.40% on UNSW-NB15.\nThese outcomes underscore the eﬀectiveness of the proposed IDS framework in com-\nparison to existing methods, oﬀering optimal intrusion detection performance in the\nface of evolving cyber threats.\n3 Summary of discussed algorithms\nTable 1 summarizes the methods by each of the intrusion detection mechanisms\ndiscussed in section 2 of literature.\nTable 1: Summary of reviewed Deep Learning Algorithms and methods used in\ntheir implementation\nReference\nDL Algorithm\nProblem\nMethod\n[11]\nCNN\nLow accuracy in intru-\nsion detection.\nCombine convolution and\npooling operations.\n[12]\nCNN\nLow classiﬁcation accu-\nracy\nConversion\nof\nnetwork\ntraﬃc\nto\nan\nimage\nby\nmodeling\na\nvisual\ndata\ntransformation\nRepresentation algorithm\n[13]\nCNN\nPassive intrusion detec-\ntion\nPath\ndecomposition\nmethod\nand\nCNN\nfor\nintrusion detection\n[14]\nCNN\nIDS for system Breaches\nconvolution\nneural\nnet-\nwork for anomaly detec-\ntion techniques\n14\nTable 1: Summary of reviewed Deep Learning Algorithms and methods used in\ntheir implementation\nReference\nDL Algorithm\nProblem\nMethod\n[15]\nDeep CNN\nIDS\nfor\nresource-\nconstrained\nIoT\nDeep CNN as intrusion\nclassiﬁer,\nPlanet\nalgo-\nrithm as hyperparameter\noptimizer\n[16]\nCNN\nEﬃciency\nin\nnetwork\nintrusion detection\nResidual\nlearning\nand\nFocal Loss\n[17]\nDBN\nIDS for cloud & IoT\nenvironment. Emerging\nattacks don’t appear in\nthe training datasets\nFuzzy\naggregation\napproach\n[18]\nDBN\nIoT Security networks\ndue to their large attack\nsurface\nCategorizing network traf-\nﬁc into sessions & investi-\ngating anomalous charac-\nteristics of network activ-\nity\n[20]\nSparse\nAuto-\nEncoder(SAE)\nReal-time network mon-\nitoring and detection of\nnew attacks\nSAE\nfor\nUnsupervised\nFeature learning & logistic\nregression classiﬁer\n[22]\nAPAE\nDetecting\nreal-time\ncyber-attacks\nin\nIoT\nnetworks\nUtilize dilated and stan-\ndard convolutional ﬁlters\nto extract both locally and\nlong-range\ninformation\naround individual values\nin the feature vector\n[23]\nAuto-Encoder\nNetwork\nintrusion\ndetection\nIdentiﬁcation of intrusions\nby\nﬂagging\nanomalous\ntraﬃc ﬂows with higher\nreconstruction loss\n[24]\nDNN\nDetection\nand\nclassi-\nﬁcation\nof\nunforeseen\nand\nunpredictable\ncyber-attacks\nDNN\nthat\nemploys\nFeed\nforward\nNeural\n(FFN)Network\nand\nMultilayer\nPerceptron\n(MLP)\n15\nTable 1: Summary of reviewed Deep Learning Algorithms and methods used in\ntheir implementation\nReference\nDL Algorithm\nProblem\nMethod\n[25]\nDNN & SMO\nNetwork\nIntrusion\nDetection\nmin-max\nnormalization\ntechnique,\n1-N\nencod-\ning, SMO used to reduce\ndimensionality\nof\nthe\ndataset & DNN for binary\nclassiﬁcation.\n[26]\nDNN with Transfer\nlearning\nNetwork\nIntrusion\nDetection\nPre-trained VGG-16 used\nfor feature extraction &\nExtracted features are fed\ninto a DNN for classiﬁca-\ntion Extracted\n[27]\nDNN\nIntrusion\ndetection\nin\nMQTT-enabled\nIoT\nsmart systems\nDeep Learning model IDS\nwith default learning rate\nand ADAM optimizer\n[28]\nDNN, G-ABC\nIntrusion\ndetection\nin\ncloud computing envi-\nronment\nG-ABC for optimal fea-\nture selection, DNN as a\nclassiﬁer\n[29]\nDNN\nIntrusion\ndetection\nin\nIoT environment\nOne\nDimension\nvector,\nfeature reduction, Z-Score\nnormalization\n&\nDNN\nClassiﬁer\n[30]\nRNN\nIntrusion\ndetection\nin\nIoT environment\nDataset splitting, Scalar-\nbased normalization, fea-\nture extraction, classiﬁca-\ntion using RNN\n[31]\nSNN & Deep DCA\nIntrusion detection for\nIoT environment\nSelf-normalizing\nNeural\nNetwork for feature selec-\ntion\n&\ncategorization,\nDendritic Cell Algorithm\nfor classiﬀcation\n[32]\nMLP, KNN, Auto-\nEncoder\nNetwork\nintrusion\ndetection\nDeep learning multi-agent\nsystem\napproach. Auto-\nencoder for feature reduc-\ntion,\nMLP\n&\nKNN\nas\nClassiﬁers\n16\nTable 1: Summary of reviewed Deep Learning Algorithms and methods used in\ntheir implementation\nReference\nDL Algorithm\nProblem\nMethod\n[33]\nMLP\nAccuracy\nin\nNetwork\nintrusion detection\nOne hidden layer MLP,\nTwo hidden layer MLP as\nclassiﬁers, Dataset trained\nwith 100 epochs\n[34]\nMLP\nPrevention\nof\ncyber-\nattacks\nin\nvehicular\nIoT\nDataset cleaned up, split\ndataset\nto\ntest,\nvalida-\ntion\nand\ntraining\nsets,\nfeature\nselection,\nZ-\nnormalization,\ntraining\nmodel\n[35]\nCNN & MLP\nIDS for heterogeneious\nIoT networks\nDeep learning implemen-\ntation method not clear.\nPython and python frame-\nworks i.e. numpy, pandas,\nkeras and tensor ﬂow used\nin experiments.\n[36]\nDNN,\nLSTM\n&\nLogistic regression\nAnomaly\ndetection\nin\nIoT and Cloud environ-\nments\ncombination of DNN with\nLSTM in stack general-\nization approach for ini-\ntial classiﬁcation. logistic\nregression as a meta clas-\nsiﬁer\n[37]\nMLP\n&\nChaotic\nNeural Network\nRobust network intru-\nsion detection system\nMLP for attack detection\nand Chaotic Neural Net-\nwork for reduction of false\nalarm rates\n[38]\nCNN,\nLSTM\n&\nPSO\nIntrusion\ndetection\nin\nIoT environment\nPSO\nfor\ndata\npre-\nprocessing, Hybrid CNN\nand\nLSTM\nused\nfor\nfeature\nselection\nand\nclassiﬁcation.\n[39]\nCNN & MLP\nNetwork\nintrusion\ndetection\nCNN\nwith\nregularized\nMLP,\nsemi-dynamic\nhyperparameter tuning.\n[40]\nLSTM-RNN,\nGenetic Algorithm\n(GA)\nOptimal attack classiﬁ-\ncation for NIDS\nLSTM-RNN\nClassiﬁer\nwith GA feature selection\nArchitecture\n17\nTable 1: Summary of reviewed Deep Learning Algorithms and methods used in\ntheir implementation\nReference\nDL Algorithm\nProblem\nMethod\n[41]\nLSTM\n&\nGated\nRecurrent\nUnit\n(GRU)\nDDoS in IoT\nEliminating the vanishing\ngradient\nproblem\nusing\nLSTM and GRU.\n[42]\nRNN & LSTM\nNetwork\nintrusion\ndetection\nRNN-LSTM\ntrained\nmodel using UNSW-NB18\ndataset.\n[43]\nRNN,\nLSTM\n&\nGRU\nNetwork\nintrusion\ndetection\nFeature\nselection\nand\nbidirectional RNN. LSTM\nsequence for forward pass\n&\nGRU\nsequence\nfor\nbackward pass\n[44]\nRNN,\nLSTM\n&\nGRU\nNetwork\nintrusion\ndetection\ninitial\ndataset\nnormal-\nization, Feature selection\nusing XGBOOST, Train-\ning, validation and testing\nusing Deep Learning algo-\nrithms i.e. RNN, LSTM\nand GRU.\nTable 2: Summary of reviewed Papers and the attacks discussed\nReference\nDataset\nAttacks\n[11]\nKDD99 datasets\nDOS, R2L, U2R, and probe.\n[12]\nNSL-KDD\nDoS, Probe, R2L, U2R.\n[13]\nCSI Data\nMotion Detection\n[14]\nUNSW-NB15\nDoS, Probe, R2L, U2R.\n[15]\nCICIDS2017\ndataset\nBotnet, DoSSlowhttptest, FTP-\nPatator, SSH-Patator, DoSGold-\nenEye, DoSslowloris, Heartbleed,\nPortScan, DDoS, DoSHulk\n[16]\nUNSW-NB15\ndataset\nAnalysis,\nBackdoors,\nDoS,\nExploits,\nFuzzers,\nGeneric,\nRecon, Shellcode, Worms\n[17]\nNSL-KDD\nDoS, Probe, R2L, U2R\n18\nTable 2: Summary of reviewed Papers and the attacks discussed\nReference\nDataset\nAttacks\nUNSW-NB15\ndatasets\nAnalysis,\nBackdoors,\nDoS,\nExploits,\nFuzzers,\nGeneric,\nRecon, Shellcode, Worms\n[18]\nIoT\nnetwork-\ntraﬃc\ndataset\nBlackhole Attack, Opportunis-\ntic Service Attack, Distributed\nDenial-of-Service\n(DDoS)\nAttack,\nSinkhole\nAttack,\nWormhole Attack\n[20]\nNSL-KDD\ndataset\nprotocol used, source address,\ndestination address, the time-\nstamp, services, ﬂag, number of\nfailed logins, number of logins,\netc\n[22]\nUNSW-NB15\nReconnaissance,\nBackdoor,\nDos, Exploit, Analysis, Fuzzers,\nWorms, Shellcode, Generic\nCICIDS2017\nDoS, PortScan, Inﬁltration, Web\nAttack\nKDDCup99\nDoS, Probe, R2L, U2R\n[23]\nCSE-CIC-\nIDS2018\nDDoS\n[24]\nKDDCup 99\nDoS, Probe, R2L, U2R\nNSL-KDD\nDoS, Probe, R2L, U2R\nUNSW-NB15\nReconnaissance,\nBackdoor,\nDos, Exploit, Analysis, Fuzzers,\nWorms, Shellcode, Generic\nWSN-DS\nBlackhole, Grayhole , Flooding,\nScheduling\nCICIDS 2017\nSSH-Patator,\nFTP-Patator,\nDoS, Web, Bot, DDoS, PortScan\nKyoto\nNot speciﬁed\n19\nTable 2: Summary of reviewed Papers and the attacks discussed\nReference\nDataset\nAttacks\nADFA-LD\nAdduser,\nJava-Meterpreter,\nHydra-FTP,\nHydra-SSH,\nMeterpreter, Web-Shell\nADFA-WD\nNot Speciﬁed\n[25]\nNSL-KDD\ndataset\nDoS, Probe, R2L, U2R\n[26]\nNSL-KDD\ndataset\nDoS, Probe, R2L, U2R\n[27]\nMQTT-IoT-\nIDS2020\nBi-ﬂow,Uni-ﬂow Packet-ﬂow\nMQTT dataset\nMan\nin\nthe\nMiddle\n(MitM),\nIntrusion in the network, Denial\nof Services (DoS)\n[28]\nNSL-KDD\ndataset\nDoS, Probe, R2L, U2R\nUNSW-NB15\ndataset\nBackdoor, Dos, Exploit, Worms\n[29]\nUNSW Bot-IoT\ndataset\nDoS, Theft, and Reconnaissance\nattacks\n[30]\nNSL-KDD\ndataset\nDoS, Probe, R2L, U2R\n[31]\nIoT-Bot dataset\nInformation\nTheft,\nReconnais-\nsance, DDoS, DoS\n[32]\nKDD\nCUP99\ndataset\nDoS, Probe, R2L, U2R\n[33]\nNSL-KDD\ndataset\nDoS, Probe, R2L, U2R\n[34]\nCIC-IDS2017\ndata set\nBot,\nDDoS,\nDoS\nGoldenEye,\nDoS\nHulk,\nDoS\nSlowhttptest,\nDoS Slowloris, FTP-PATATOR,\nHeartbleed,Inﬁltration,PortScan,SSH-\nPATATOR,\nWebAttack\nBruteForce,\nWebAttack\nSQL\nInjection, WebAttack XSS\n20\nTable 2: Summary of reviewed Papers and the attacks discussed\nReference\nDataset\nAttacks\nCSE-CIC-\nIDS2018\ndataset\nBot,BruteForce-\nWeb,BruteForce-XSS,\nDDoS\nattack-HOIC,\nDDoS\nattack-LOIC-UDP,\nDDoS\nattack-LOIC-HTTP,\nDoS\nattacks-GoldenEye, DoS attacks-\nHulk, DoS attacks-Slowhttptest,\nDoS\nattacks-Slowloris,\nFTP-\nBruteForce,\nInﬁltration,\nSQL\nInjection, SSH-BruteForce\n[35]\nBoT-IoT\nInformation Theft,\nReconnais-\nsance, DDoS, DoS\n[36]\nIoT-23\nMalware-1-1,Malware-3-\n1,Honeypot-4-1,Honeypot-5-\n1,Honeypot-7-1,Malware-34-\n1,Malware-43-1\nLITNET-2020\nSmurf\n,ICMP-ﬂood,UDP-ﬂood\n,TCP\nSYN-ﬂood,HTTP-\nﬂood,LANDattack,Blaster\nworm,Code\nred\nworm,Spam\nbot’s\ndetection,Reaper\nworm,Scanning/spread,Packet\nfragmentation attack\nNetML-2020\nBening,Artemis,BitCoinMiner,CCleaner\n,Cobalt,Downware,Dridex,\nEmotet,HTBot,MagicHound,MinerTrojan,PUA,Ramnit,\nSal-\nity,Tinba,TrickBot,Trickster,TrojanDownloader\n,Ursnif,WebCompanion\n[37]\nNSL-KDD\nDoS, Probe, R2L, U2R\n[38]\nIoTID20 dataset\nDoS,Mirai\nack\nﬂooding,\nMirai\nHTTP\nﬂooding,Mirai\nUDP\nﬂooding,Scan\nport\nOS,Mirai brute force,Scan host\nport,MITM\n21\nTable 2: Summary of reviewed Papers and the attacks discussed\nReference\nDataset\nAttacks\n[39]\nUNSW-NB15\ndataset\nAnalysis,\nBackdoors,\nDoS,\nExploits,\nFuzzers,Generic,\nRecon, Shellcode, Worms\n[40]\nNSL-KDD\ndataset\nDoS, Probe, R2L, U2R\n[41]\nCombined\nDDoS\nport scan, DDOSIM, goldeneye,\nhulk,\nslowloris,rudy,\nslowread,\nSlowHTTPTest, or LOIC types\nof DDoS attack\nCar hack 2020\nDDoS, Fuzzy, Spoof\n[42]\nUNSW-NB18\ndatasets\nReconnaissance,\nBackdoor,\nDos, Exploit, Analysis, Fuzzers,\nWorms, Shellcode, Generic\n[43]\nCICIDS2017\ndataset\nBot,\nDDoS,\nDoS\nGoldenEye,\nDoS\nHulk,\nDoS\nSlowhttptest,\nDoS Slowloris, FTP-PATATOR,\nHeartbleed,\nInﬁltration,\nPortScan,\nSSH-PATATOR,\nWebAttack BruteForce, WebAt-\ntack SQL Injection, WebAttack\nXSS\n[44]\nNSL-KDD\ndataset\nDoS, Probe, R2L, U2R\nUNSW-NB15\nReconnaissance,\nBackdoor,\nDos, Exploit, Analysis, Fuzzers,\nWorms, Shellcode, Generic\n22\n4 Discussion\nThe thorough examination of intrusion detection systems (IDS) in the attached arti-\ncle highlights an important trend: the sparse use of IDS in the context of the Internet\nof Things (IoT). There is a clear gap in the application of intrusion detection sys-\ntems (IDS) that are speciﬁcally designed for Internet of Things (IoT) contexts, despite\nthe fact that cyber threats are constantly changing and networked environments are\nbecoming more sophisticated. Convolutional neural networks (CNNs), deep belief net-\nworks (DBNs), autoencoders (AE), deep neural networks (DNNs), recurrent neural\nnetworks (RNNs), and self-normalizing neural networks (SNNs) are among the many\ndeep learning models that are widely discussed and used in a variety of contexts,\nincluding cloud computing and targeted attack scenarios like distributed denial of ser-\nvice (DDoS). However, there seems to be less use of these models in the Internet of\nThings (IoT) space.\nIn order to improve the eﬃciency and accuracy of intrusion detection, researchers\nhave shown ingenuity in fusing these deep learning models with cutting-edge algo-\nrithms such as Dendritic Cell Algorithm (DCA), Spider Monkey Optimization (SMO),\nand Group-Artiﬁcial Bee Colony (G-ABC). Nonetheless, the results highlight how\nimportant it is to pay more attention to and investigate IDS designed for IoT applica-\ntions. The underrepresentation of IDS in IoT contexts raises concerns about a potential\ngap in addressing the particular issues presented by IoT networks, despite the abun-\ndance of research concentrated on other domains. This observation points to a need\nfor additional study and development to strengthen IoT environments against new\ncyberthreats and to advance intrusion detection technologies in general inside the\nquickly growing network of linked devices.\n5 Conclusion\nIn this systematic study, we were able to analyze deep learning algorithms that have\nbeen used to develop IDS for the last 5 years i.e 2019-2023. The research aimed to\nexamine the current algorithms utilized to create intrusion detection systems and\nexplain how they have been applied to guarantee everyone’s safety in cyberspace. Some\nof the key things that were considered include the datasets used to come up with the\nalgorithms, what Deep learning algorithms have been used in IDS, the attacks covered\nin the datasets, and the problems that the models developed intended to solve.\nIn future work, it would be of great help to ensure that more studies have been\ndone to come up with better IDS models that can be utilized in the rapidly growing\nIoT ﬁeld to prevent advanced cyber threats.\nReferences\n[1] frontpor: Explore the Importance of Computer Networking | Warwick (2019).\nhttps://www.warwickinc.com/blog/the-importance-of-computer-networking/\nAccessed 2023-12-13\n23\n[2] Abraham, J.A., Bindu, V.R.: Intrusion detection and prevention in networks\nusing machine learning and deep learning approaches: A review. In: 2021 Inter-\nnational Conference on Advancements in Electrical, Electronics, Communication,\nComputing and Automation (ICAECA), pp. 1–4 (2021). https://doi.org/10.1109/\nICAECA52838.2021.9675595\n[3] Song, J.: Preschool cyber security management system based on intelligent agents.\nComputational Intelligence and Neuroscience 2022, 1992429 (2022) https://doi.\norg/10.1155/2022/1992429\n[4] Momand, A., Jan, S.U., Ramzan, N.: A Systematic and Comprehensive Survey of\nRecent Advances in Intrusion Detection Systems Using Machine Learning: Deep\nLearning, Datasets, and Attack Taxonomy. Journal of Sensors 2023, 6048087\n(2023) https://doi.org/10.1155/2023/6048087 . Publisher: Hindawi\n[5] Vinayakumar, R., Alazab, M., Soman, K.P., Poornachandran, P., Al-Nemrat,\nA., Venkatraman, S.: Deep learning approach for intelligent intrusion detection\nsystem. IEEE Access 7, 41525–41550 (2019) https://doi.org/10.1109/ACCESS.\n2019.2895334\n[6] Lansky, J., Ali, S., Mohammadi, M., Majeed, M.K., Karim, S.H.T., Rashidi, S.,\nHosseinzadeh, M., Rahmani, A.M.: Deep learning-based intrusion detection sys-\ntems: A systematic review. IEEE Access 9, 101574–101599 (2021) https://doi.\norg/10.1109/ACCESS.2021.3097247\n[7] Liu, H., Lang, B.: Machine learning and deep learning methods for intrusion\ndetection systems: A survey. Applied Sciences 9(20) (2019) https://doi.org/10.\n3390/app9204396\n[8] Jakhar,\nD.,\nKaur,\nI.:\nArtiﬁcial\nintelligence,\nmachine\nlearning\nand\ndeep\nlearning:\ndeﬁnitions\nand\ndiﬀerences.\nClinical\nand\nExperimental\nDer-\nmatology\n45(1),\n131–132\n(2020)\nhttps://doi.org/10.1111/ced.14029\nhttps://academic.oup.com/ced/article-pdf/45/1/131/46920173/ced0131.pdf\n[9] Deng, L., Yu, D.: Deep learning: Methods and applications. Foundations and\nTrends® in Signal Processing 7(3–4), 197–387 (2014) https://doi.org/10.1561/\n2000000039\n[10] Biswal, A.: Top 10 Deep Learning Algorithms You Should Know in 2023 (2023).\nhttps://www.simplilearn.com/tutorials/deep-learning-tutorial/deep-learning-\nalgorithm Accessed 2023-12-22\n[11] Khan, R.U., Zhang, X., Alazab, M., Kumar, R.: An improved convolutional neural\nnetwork model for intrusion detection in networks. In: 2019 Cybersecurity and\nCyberforensics Conference (CCC), pp. 74–77 (2019). https://doi.org/10.1109/\nCCC.2019.000-6\n24\n[12] Liu, W., Liu, X., Di, X., Qi, H.: A novel network intrusion detection algorithm\nbased on fast fourier transformation. In: 2019 1st International Conference on\nIndustrial Artiﬁcial Intelligence (IAI), pp. 1–6 (2019). https://doi.org/10.1109/\nICIAI.2019.8850770\n[13] Hu, Y., Bai, F., Yang, X., Liu, Y.: Idsdl: a sensitive intrusion detection system\nbased on deep learning. EURASIP Journal on Wireless Communications and\nNetworking 2021(1), 95 (2021) https://doi.org/10.1186/s13638-021-01900-y\n[14] Kumar Silivery, A., Mohan Rao, K.R., Solleti, R.: An advanced intrusion detec-\ntion algorithm for network traﬃc using convolution neural network. In: 2023 Fifth\nInternational Conference on Electrical, Computer and Communication Technolo-\ngies (ICECCT), pp. 01–05 (2023). https://doi.org/10.1109/ICECCT56650.2023.\n10179767\n[15] A. Alissa, K., S. Alrayes, F., Tarmissi, K., Yafoz, A., Alsini, R., Alghushairy, O.,\nOthman, M., Motwakel, A.: Planet optimization with deep convolutional neural\nnetwork for lightweight intrusion detection in resource-constrained iot networks.\nApplied Sciences 12(17) (2022) https://doi.org/10.3390/app12178676\n[16] Man, J., Sun, G.: A residual learning-based network intrusion detection system.\nSecurity and Communication Networks 2021, 5593435 (2021) https://doi.org/10.\n1155/2021/5593435\n[17] Yang, Y., Zheng, K., Wu, C., Niu, X., Yang, Y.: Building an Eﬀective Intru-\nsion Detection System Using the Modiﬁed Density Peak Clustering Algorithm\nand Deep Belief Networks. Applied Sciences 9(2) (2019) https://doi.org/10.3390/\napp9020238\n[18] Thamilarasu, G., Chawla, S.: Towards deep-learning-driven intrusion detec-\ntion for the internet of things. Sensors 19(9) (2019) https://doi.org/10.3390/\ns19091977\n[19] Al-Hadhrami, Y., Hussain, F.K.: DDoS attacks in IoT networks: a comprehensive\nsystematic literature review. World Wide Web 24(3), 971–1001 (2021) https://\ndoi.org/10.1007/s11280-020-00855-2\n[20] Gurung, S., Ghose, M.K., Subedi, A.: Deep learning approach on network\nintrusion detection system using NSL-KDD dataset. International Journal of\nComputer Network and Information Security 11(3), 8–14 (2019) https://doi.org/\n10.5815/ijcnis.2019.03.02 . Publisher: Modern Education and Computer Science\nPress\n[21] Telikani, A., Gandomi, A.H.: Cost-sensitive stacked auto-encoders for intrusion\ndetection in the internet of things. Internet of Things 14, 100122 (2021) https://\ndoi.org/10.1016/j.iot.2019.100122\n25\n[22] Basati, A., Faghih, M.M.: Apae: an iot intrusion detection system using asymmet-\nric parallel auto-encoder. Neural Computing and Applications 35(7), 4813–4833\n(2023) https://doi.org/10.1007/s00521-021-06011-9\n[23] Kamalov, F., Zgheib, R., Leung, H.H., Al-Gindy, A., Moussa, S.: Autoencoder-\nbased intrusion detection system. In: 2021 International Conference on Engi-\nneering and Emerging Technologies (ICEET), pp. 1–5 (2021). https://doi.org/10.\n1109/ICEET53442.2021.9659562\n[24] Vinayakumar, R., Alazab, M., Soman, K.P., Poornachandran, P., Al-Nemrat, A.,\nVenkatraman, S.: Deep Learning Approach for Intelligent Intrusion Detection\nSystem. IEEE Access 7, 41525–41550 (2019) https://doi.org/10.1109/ACCESS.\n2019.2895334\n[25] Khare, N., Devan, P., Chowdhary, C.L., Bhattacharya, S., Singh, G., Singh, S.,\nYoon, B.: SMO-DNN: Spider Monkey Optimization and Deep Neural Network\nHybrid Classiﬁer Model for Intrusion Detection. Electronics 9(4) (2020) https://\ndoi.org/10.3390/electronics9040692\n[26] Masum, M., Shahriar, H.: Tl-nid: Deep neural network with transfer learning for\nnetwork intrusion detection. In: 2020 15th International Conference for Internet\nTechnology and Secured Transactions (ICITST), pp. 1–7 (2020). https://doi.org/\n10.23919/ICITST51030.2020.9351317\n[27] Khan, M.A., Khan, M.A., Jan, S.U., Ahmad, J., Jamal, S.S., Shah, A.A.,\nPitropakis, N., Buchanan, W.J.: A deep learning-based intrusion detection system\nfor mqtt enabled iot. Sensors 21(21) (2021) https://doi.org/10.3390/s21217016\n[28] Gulia, N., Solanki, K., Dalal, S., Dhankhar, A., Dahiya, O., Salmaan, N.U.:\nIntrusion detection system using the g-abc with deep neural network in cloud\nenvironment. Scientiﬁc Programming 2023, 7210034 (2023) https://doi.org/10.\n1155/2023/7210034\n[29] Ikhwan, S., Wibowo, A., Warsito, B.: Intrusion detection using deep neural net-\nwork algorithm on the internet of things. In: 2022 IEEE International Conference\non Communication, Networks and Satellite (COMNETSAT), pp. 84–87 (2022).\nhttps://doi.org/10.1109/COMNETSAT56033.2022.9994499\n[30] Almutairi, A.F., Abdulghani Alshargabi, A.: Using deep learning technique to\nprotect internet network from intrusion in iot environment. In: 2022 2nd Interna-\ntional Conference on Emerging Smart Technologies and Applications (eSmarTA),\npp. 1–6 (2022). https://doi.org/10.1109/eSmarTA56775.2022.9935467\n[31] Aldhaheri, S., Alghazzawi, D., Cheng, L., Alzahrani, B., Al-Barakati, A.: Deep-\nDCA: Novel Network-Based Detection of IoT Attacks Using Artiﬁcial Immune\nSystem. Applied Sciences 10(6) (2020) https://doi.org/10.3390/app10061909\n26\n[32] Louati, F., Ktata, F.B.: A deep learning-based multi-agent system for intrusion\ndetection. SN Applied Sciences 2(4), 675 (2020) https://doi.org/10.1007/s42452-\n020-2414-z\n[33] Mohammed, A.J., Arif, M.H., Ali, A.A.: A multilayer perceptron artiﬁcial neural\nnetwork approach for improving the accuracy of intrusion detection systems. IAES\nInternational Journal of Artiﬁcial Intelligence 9(4), 609 (2020) https://doi.org/\n10.11591/ijai.v9.i4.pp609-615\n[34] Rosay, A., Riou, K., Carlier, F., Leroux, P.: Multi-layer perceptron for network\nintrusion detection. Annals of Telecommunications 77(5), 371–394 (2022) https://\ndoi.org/10.1007/s12243-021-00852-0\n[35] Susilo, B., Sari, R.F.: Intrusion detection in iot networks using deep learning\nalgorithm. Information 11(5) (2020) https://doi.org/10.3390/info11050279\n[36] Dutta, V., Chora´s, M., Pawlicki, M., Kozik, R.: A Deep Learning Ensemble for\nNetwork Anomaly and Cyber-Attack Detection. Sensors 20(16) (2020) https://\ndoi.org/10.3390/s20164583\n[37] Shettar, P., Kachavimath, A.V., Mulla, M.M., G, N.D., Hanchinmani, G.:\nIntrusion detection system using mlp and chaotic neural networks. In: 2021 Inter-\nnational Conference on Computer Communication and Informatics (ICCCI), pp.\n1–4 (2021). https://doi.org/10.1109/ICCCI50826.2021.9457024\n[38] Alkahtani, H., Aldhyani, T.H.H.: Intrusion detection system to advance internet of\nthings infrastructure-based deep learning algorithms. Complexity 2021, 5579851\n(2021) https://doi.org/10.1155/2021/5579851\n[39] Ashiku, L., Dagli, C.: Network intrusion detection system using deep learning.\nProcedia Computer Science 185, 239–247 (2021) https://doi.org/10.1016/j.procs.\n2021.05.025 . Big Data, IoT, and AI for a Smarter Future\n[40] Muhuri, P.S., Chatterjee, P., Yuan, X., Roy, K., Esterline, A.: Using a Long Short-\nTerm Memory Recurrent Neural Network (LSTM-RNN) to Classify Network\nAttacks. Information 11(5) (2020) https://doi.org/10.3390/info11050243\n[41] Ullah, S., Khan, M.A., Ahmad, J., Jamal, S.S., Huma, Z., Hassan, M.T.,\nPitropakis, N., Arshad, Buchanan, W.J.: Hdl-ids: A hybrid deep learning archi-\ntecture for intrusion detection in the internet of vehicles. Sensors 22(4) (2022)\nhttps://doi.org/10.3390/s22041340\n[42] Amutha, S., R, K., R, S., M, K.: Secure network intrusion detection system using\nnid-rnn based deep learning. In: 2022 International Conference on Advances in\nComputing, Communication and Applied Informatics (ACCAI), pp. 1–5 (2022).\nhttps://doi.org/10.1109/ACCAI53970.2022.9752526\n27\n[43] Gautam, S., Henry, A., Zuhair, M., Rashid, M., Javed, A.R., Maddikunta, P.K.R.:\nA composite approach of intrusion detection systems: Hybrid rnn and correlation-\nbased feature optimization. Electronics 11(21) (2022) https://doi.org/10.3390/\nelectronics11213529\n[44] Kasongo, S.M.: A deep learning technique for intrusion detection system using\na recurrent neural networks based framework. Computer Communications 199,\n113–125 (2023) https://doi.org/10.1016/j.comcom.2022.12.010\n28\nThis figure \"DeepNeuralNetwork_Modified_-_40.png\" is available in \"png\"\n format f\nhttp://arxiv.org/ps/2402.17020v1\n",
  "categories": [
    "cs.CR"
  ],
  "published": "2024-02-26",
  "updated": "2024-02-26"
}