{
  "id": "http://arxiv.org/abs/2408.09094v1",
  "title": "Research on color recipe recommendation based on unstructured data using TENN",
  "authors": [
    "Seongsu Jhang",
    "Donghwi Yoo",
    "Jaeyong Kown"
  ],
  "abstract": "Recently, services and business models based on large language models, such\nas OpenAI Chatgpt, Google BARD, and Microsoft copilot, have been introduced,\nand the applications utilizing natural language processing with deep learning\nare increasing, and it is one of the natural language preprocessing methods.\nConversion to machine language through tokenization and processing of\nunstructured data are increasing. Although algorithms that can understand and\napply human language are becoming increasingly sophisticated, it is difficult\nto apply them to processes that rely on human emotions and senses in industries\nthat still mainly deal with standardized data. In particular, in processes\nwhere brightness, saturation, and color information are essential, such as\npainting and injection molding, most small and medium-sized companies,\nexcluding large corporations, rely on the tacit knowledge and sensibility of\ncolor mixers, and even customer companies often present non-standardized\nrequirements. . In this paper, we proposed TENN to infer color recipe based on\nunstructured data with emotional natural language, and demonstrated it.",
  "text": "RESEARCH ON COLOR RECIPE RECOMMENDATION BASED ON\nUNSTRUCTURED DATA USING TENN\nSeongsu Jhang, Donghwi Yoo, Jaeyong Kown\nICT Convergence Research Center\nKETI\nChangwon City, South Gyeongsang Province\n{jss0221, elight, jykwon}@keti.re.kr\nABSTRACT\nRecently, services and business models based on large language models (LLM), such as OpenAI’s\nChat-GPT, Google’s BARD, and Microsoft’s copilot, have been introduced, and the applications\nutilizing natural language processing with deep learning are increasing, and it is one of the natural\nlanguage pre-processing methods. Conversion to machine language through tokenization and process-\ning of unstructured data are increasing. Although algorithms that can understand and apply human\nlanguage are becoming increasingly sophisticated, it is difficult to apply them to processes that rely\non human emotions and senses in industries that still mainly deal with standardized data. In particular,\nin processes where brightness, saturation, and color information are essential, such as painting and\ninjection molding, most small and medium-sized companies, excluding large corporations, rely on\nthe tacit knowledge and sensibility of color mixers, and even customer companies often present\nnon-standardized requirements. . In this paper, we proposed TEDNN(Tokenizing Encoder Deep\nNeural Network to infer color recipe based on unstructured data with emotional natural language,\nand demonstrated it.\nKeywords TENN · Tokenizing · Inference · Emotional data · Color recipe · Recommendation\n1\nIntroduction\nRecently, artificial neural network-based algorithms are being rapidly absorbed into the various industries due to the\nrapid development of hardware like GPU that enables efficient parallel computation. Through this, productivity is\nincreasing at a rapid pace in advanced and manufacturing processes from various perspectives, such as industrial AI\nand autonomous manufacturing. However, the basis for these algorithms and advancements must be preceded by\ndigitalization. As for the development of learning models using big data, SMEs that have not yet prepared the conditions\nare lagging behind global conglomerates. Regarding the tacit knowledge and know-how in the process, data acquisition\nis difficult, which is why the majority of manufacturing companies like SMEs remain at an automation level.\nIn particular, many processes that involve color engineering, such as painting, synthetic resin production, paint\nmanufacturing, and injection molding, heavily rely on the intuition and tacit knowledge of color technicians(color\nengineer), making it challenging to digitize this knowledge. Furthermore, some companies treat this information as\ntrade secrets, making it difficult to enhance efficiency and productivity through digital transformation and AI in their\nprocesses.\nMost related research cases focus on color prediction and recipe inference systems based on structured and stan-\ndardized data using NN(Neural Network)[1, 2, 3]. Also, advanced algorithms like genetic, fuzzy with NN applied to\ninfer the recipe [4, 5, 6, 7] Although standardized and structured data is provided by global raw material suppliers,\nmost SMEs using domestically sourced materials conduct their processes with only unstructured and non-standardized\ninformation due to productivity and cost issues.\nIn this paper, we proposed the model based on Tokenizing Encoder Neural Network (TENN) that can infer color\nrecipes with unstructured data and tacit knowledge, which are not standardized or structured.\narXiv:2408.09094v1  [cs.AI]  17 Aug 2024\n2\nDataset and Model\nIn this study, the RGB Color Codes Chart was used as a sample dataset for color recipe inference in view point of color\nengineering, such as painting, synthetic resin production, paint manufacturing, and injection molding. For data labeling,\nnatural language text data was used as input data for each RGB color code, and the RGB color codes for each color\nwere selected as output data. In this study, the model was trained to recognize emotional information(corpus) within the\ntext data so that it could infer and output the RGB code combination recipes.\nBecause of the security issue and large variance of unstructured data, such as mixing ratio information of pigments\nand paints in SMEs, standardized sample dataset is useful in this study. The RGB color information also included\nsubjective elements such as light, dark, pale, deep, and medium, utilizing RGB code data (composed of numbers ranging\nfrom 0 to 255 in three dimensions) for each color.\nFigure 1: Model architecture\nAs for the model, it requires inference of untrained recipes and unstructured data based on natural language with\nnonlinear data patterns. Therefore, an artificial neural network with robustness and nonlinearity was applied, and\na tokenizing encoder was configured as the pre-processing layer of the neural network. Existing natural language\nprocessing algorithms that have learned emotional information and unstructured data in text form through preprocessing\ntechniques such as tokenization and encoding apply complex structures like LSTM, RNN, and those including T5, GPT,\nBART, and BERT. However, these structures are suitable for large-scale applications and large language models(LLM)\nand leading to issues with efficiency and computing resources when used in this study. There has been some research\non inference systems based on emotional information using tokenization technique[8, 9]. However, there are few cases\nwhere this system has been applied to solve problems related to tacit knowledge scattered throughout the industry. Fig\n2. shows data pre-processed results, each corpus encoded by tokenization(quantization) and matched with RGB color\nrecipe.\nFigure 2: Data pre-processing, RGB color recipe\n2\n3\nExperiments\nThe neural network was trained by normalizing the encoded values obtained through tokenization of the input data.\nTo find the normalization method most suitable for the TENN model, the results of different preprocessing tech-\nniques—MinMaxScaler, MaxAbsScaler, RobustScaler, and StandardScaler— were compared on models with the same\nnumber of layers and nodes. The best method was selected based on accuracy from the learning results. The model\nstructure consists of 12 layers with 38,731 parameters, with the first preprocessing layer performing tokenizing and\nencoding functions. The dataset was divided into training and testing datasets at a ratio of 0.8 to 0.2, respectively, for\nthe experiment.\nIn this study, the Relu(f(x) = max(0, x)) was used as a activation function except MaxAbsScaler because of\nnegative values in learning process. The other activation function was linear activation. In related works [10, 11], the\nactivation function can perform with it’s robustness in case of non-linear systems.\nTable 1: Results by Normalization Method\nMethods\nAcuracy\nMinMaxScaler\n0.79\nMaxAbsScaler\n0.68\nRobustScaler\n0.42\nStandardscaler\n0.73\n4\nResults\nIn this paper, we proposed and validated a color inference model using RGB codes data based on unstructured\ninformation and color information with affective corpus. We utilized a dataset of over 300 samples and confirmed\nthe performance of the TENN. Based on the training unstructured corpus with emotional meanings, we were able to\nidentify patterns of emotional information in the test dataset and verify whether similar patterns could be applied to\nother colors as a results of inference with recommend RGB color codes.\nFigure 3: Model architecture\nBased on the trained model, we input unstructured data in the form of color information and confirmed whether the\nresulting RGB recipes corresponded to similar colors. We calculated Delta E using the most recently defined standard\ncolor difference formula, CIEDE2000. The color distance averaged 73.8(Delta E value) across 30 sample data.\nCIELAB based Delta E is a standard measurement unit created by the Commission Internationale de l’Eclairage (CIE),\nwhich quantifies the difference between two colors and uses Lab color space transform from RGB format. A lower\nDelta E(∆E =\np\n(L1 −L2)2 + (a1 −a2)2 + (b1 −b2)2) value indicates higher accuracy, while a higher Delta E\nvalue signifies a significant discrepancy. Compared to the accuracy levels of 80–85 % from previous studies[7, 8, 9] on\nemotional information inference systems using text data from books, news, etc., our model achieved an accuracy level\napproximately 5% lower. In Fig 4, first color reference name is very light grey, and next one is cocoa brown color, each\nreference and model recommended color can be distinguished by naked eyes. however, view point of inference and\nrecommend system, even it has large value of delta E, it has robustness out of range within training dataset.\n3\nFigure 4: Model architecture\n5\nConclusion\nIn this paper, we proposed and validated a color inference model using RGB codes data based on unstructured\ninformation and color information with affective corpus. We utilized a dataset of over 300 samples and confirmed the\nperformance of the TENN. Also, the fact that tokenizing encoder based NN has robustness with unstructured emotional\ndata showed positive possibility of applying advanced model including LSTM, RNN.\nOur future work involves utilizing pigment and formulation recipe datasets from actual painting processes used by\nSMEs. We plan to apply various algorithms to language models and enhance TENN by overcoming security challenges\nthrough methodologies such as federated learning and data processing with advanced algorithms. Additionally, we aim\nto identify potential client companies and conduct PoC as use cases.\nReferences\n[1] J Spehl, M Wolker, WH Kettler, and J Pelzl. Application of backpropagation nets for color recipe prediction as a\nnonlinear approximation problem. In Proceedings of 1994 IEEE International Conference on Neural Networks\n(ICNN’94), volume 5, pages 3336–3341. IEEE, 1994.\n[2] JM Bishop, MJ Bushnell, A Usher, and S Westland. Genetic optimisation of neural network architectures for\ncolour recipe prediction. In Artificial Neural Nets and Genetic Algorithms: Proceedings of the International\nConference in Innsbruck, Austria, 1993, pages 719–725. Springer, 1993.\n[3] JM Bishop, MJ Bushnell, and Stephen Westland. Application of neural networks to computer recipe prediction.\nColor Research & Application, 16(1):3–9, 1991.\n[4] Himanshu Singh and Yunis Ahmad Lone. Deep neuro-fuzzy systems with python. Apress, Berkeley, 2020.\n[5] Abdulkadir Sengur. Wavelet transform and adaptive neuro-fuzzy inference system for color texture classification.\nExpert Systems with Applications, 34(3):2120–2128, 2008.\n[6] S Gorji Kandi. Color recipe prediction by genetic algorithm. Dyes and Pigments, 74(3):677–683, 2007.\n[7] Akriti Saini, Nishank Bhatia, Bhavya Suri, and Shikha Jain. Emoxract: Domain independent emotion mining\nmodel for unstructured data. In 2014 Seventh International Conference on Contemporary Computing (IC3), pages\n94–98. IEEE, 2014.\n[8] Mohammad Reza Davahli, Waldemar Karwowski, Edgar Gutierrez, Krzysztof Fiok, Grzegorz Wróbel, Redha\nTaiar, and Tareq Ahram. Identification and prediction of human behavior through mining of unstructured textual\ndata. Symmetry, 12(11):1902, 2020.\n[9] Jin-Su Kim. Sentiment prediction using emotion and context information in unstructured documents. Journal of\nConvergence for Information Technology, 10(10):40–46, 2020.\n[10] Seong-Su Jhang, Heung-Jae Lee, Cha-Nyeon Kim, Chan-Ho Song, and Won-Kun Yu. Ann control for damping\nlow-frequency oscillation using deep learning. In 2018 Australasian Universities Power Engineering Conference\n(AUPEC), pages 1–4. IEEE, 2018.\n4\n[11] Seong-Su Jhang and Don Hur. Design of artificial neural network (ann) controller using deep learning to damp\nout inter-area oscillations in power systems. KIIEE· Journal of the Korean Institute of Illuminating and Electrical\nInstallation Engineers (KIIEE), 32(8):23–29, 2018.\n5\n",
  "categories": [
    "cs.AI"
  ],
  "published": "2024-08-17",
  "updated": "2024-08-17"
}