{
  "id": "http://arxiv.org/abs/2409.07975v1",
  "title": "Deep Learning for Personalized Electrocardiogram Diagnosis: A Review",
  "authors": [
    "Cheng Ding",
    "Tianliang Yao",
    "Chenwei Wu",
    "Jianyuan Ni"
  ],
  "abstract": "The electrocardiogram (ECG) remains a fundamental tool in cardiac\ndiagnostics, yet its interpretation traditionally reliant on the expertise of\ncardiologists. The emergence of deep learning has heralded a revolutionary era\nin medical data analysis, particularly in the domain of ECG diagnostics.\nHowever, inter-patient variability prohibit the generalibility of ECG-AI model\ntrained on a population dataset, hence degrade the performance of ECG-AI on\nspecific patient or patient group. Many studies have address this challenge\nusing different deep learning technologies. This comprehensive review\nsystematically synthesizes research from a wide range of studies to provide an\nin-depth examination of cutting-edge deep-learning techniques in personalized\nECG diagnosis. The review outlines a rigorous methodology for the selection of\npertinent scholarly articles and offers a comprehensive overview of deep\nlearning approaches applied to personalized ECG diagnostics. Moreover, the\nchallenges these methods encounter are investigated, along with future research\ndirections, culminating in insights into how the integration of deep learning\ncan transform personalized ECG diagnosis and enhance cardiac care. By\nemphasizing both the strengths and limitations of current methodologies, this\nreview underscores the immense potential of deep learning to refine and\nredefine ECG analysis in clinical practice, paving the way for more accurate,\nefficient, and personalized cardiac diagnostics.",
  "text": "Deep Learning for Personalized Electrocardiogram\nDiagnosis: A Review\nCheng Ding1†, Tianliang Yao2†, Chenwei Wu3, Jianyuan Ni4*\n1Department of Biomedical Engineering, Georgia Institution of\nTechnlogy, Atlanta, United States.\n2Department of Control Science and Engineering, College of Electronics\nand Information Engineering, Tongji University, No. 1239, Siping Road,\n200092, Shanghai, China.\n3Department of Biomedical Engineering, University of Rochester,\nRochester, United States.\n4*Department of Information Technology and Computer Science, Juniata\nCollege, Huntingdon, United States.\n*Corresponding author(s). E-mail(s): jni100@juniata.edu;\nContributing authors: chengding@gatech.edu; 2150248@tongji.edu.cn;\ncwu59@u.rochester.edu;\n†These authors contributed equally to this work.\nAbstract\nThe electrocardiogram (ECG) remains a fundamental tool in cardiac diagnos-\ntics, yet its interpretation traditionally reliant on the expertise of cardiologists.\nThe emergence of deep learning has heralded a revolutionary era in medical data\nanalysis, particularly in the domain of ECG diagnostics. However, inter-patient\nvariability prohibit the generalibility of ECG-AI model trained on a population\ndataset, hence degrade the performance of ECG-AI on specific patient or patient\ngroup. Many studies have address this challenge using different deep learning\ntechnologies. This comprehensive review systematically synthesizes research from\na wide range of studies to provide an in-depth examination of cutting-edge\ndeep-learning techniques in personalized ECG diagnosis. The review outlines a\nrigorous methodology for the selection of pertinent scholarly articles and offers\na comprehensive overview of deep learning approaches applied to personalized\nECG diagnostics. Moreover, the challenges these methods encounter are inves-\ntigated, along with future research directions, culminating in insights into how\nthe integration of deep learning can transform personalized ECG diagnosis and\n1\narXiv:2409.07975v1  [eess.SP]  12 Sep 2024\nenhance cardiac care. By emphasizing both the strengths and limitations of\ncurrent methodologies, this review underscores the immense potential of deep\nlearning to refine and redefine ECG analysis in clinical practice, paving the way\nfor more accurate, efficient, and personalized cardiac diagnostics.\nKeywords: Personalized diagnosis, electrocardiogram (ECG), deep-learning,\nfine-tuning, transfer learning, generative adversarial networks(GANs), diffusion models,\nmeta-learning, domain adaptation, inter-individual variability, healthcare data privacy.\n1 Introduction\nThe electrocardiogram (ECG) remains a cornerstone in the non-invasive assessment\nof cardiac electrophysiological activity, providing critical insights into myocardial\nfunction and overall cardiac health. This diagnostic tool captures the heart’s elec-\ntrical activity, facilitating the diagnosis of a spectrum of cardiovascular diseases,\nincluding arrhythmias, myocardial infarctions, and conduction system disorders [1–\n3]. Traditional interpretation of ECG data, however, depends heavily on the acumen\nof cardiologists. This process is not only time-intensive but also suffers from subjec-\ntive biases and considerable inter-observer variability, which may impact diagnostic\naccuracy [4].\nWith the advent of deep learning, a paradigm shift has occurred in the analysis\nof medical data [5, 6]. Techniques such as convolutional neural networks (CNNs) and\nrecurrent neural networks (RNNs) have ushered in significant advancements, demon-\nstrating superior ability in automated ECG classification and the detection of cardiac\nabnormalities [7, 8]. These deep learning models excel in extracting and learning\ncomplex hierarchies of features from raw ECG signals, effectively decoding intricate\npatterns and temporal dependencies that often elude human experts [3].\nDespite these advancements, most current deep learning approaches have been\ncentered on the development of universal models trained on extensive and diverse\ndatasets [9]. Nonetheless, ECG signals exhibit considerable variability across individ-\nuals, influenced by distinct factors such as age, gender, body mass index, and genetic\npredispositions [10]. The presence of noise, artifacts, and various pathologies further\ncomplicates ECG signal interpretation [11]. Consequently, these universal models may\nnot perform optimally on an individual basis, potentially leading to inaccuracies and\nmisdiagnoses.\nIn response to these limitations, there is an increasing focus on crafting personal-\nized ECG diagnosis strategies tailored to the unique physiological and clinical profile of\neach patient [12]. Personalized ECG diagnostics strive to enhance diagnostic precision\nby customizing models to align closely with the individual’s specific ECG characteris-\ntics and contextual health information [13]. Pioneering work in this area has leveraged\nadvanced deep learning techniques, including transfer learning, domain adaptation,\nand few-shot learning, showing promising results in fostering personalized diagnostic\napproaches.\n2\nThis review conducts a thorough examination of the existing literature on personal-\nized ECG diagnosis leveraging deep learning. It delves into cutting-edge methodologies\nlike fine-tuning, domain adaptation, generative adversarial networks (GANs), diffu-\nsion models, and meta-learning. This synthesis not only highlights the capabilities\nand limitations of these methods but also identifies fertile areas for future inquiry.\nOur goal is to provide a detailed, critical perspective on how deep learning can rev-\nolutionize personalized ECG diagnostics, thereby enhancing the accuracy, efficiency,\nand patient-centricity of cardiac care.\nThe structure of this review is as follows: Section II outlines the search method-\nology employed for literature collection. Section III discusses various deep-learning\ntechniques applied to personalized ECG diagnosis. Section IV explores the challenges\nand future directions in the field. Section V concludes the review, emphasizing the\ntransformative potential of personalized ECG diagnosis in clinical settings.\n2 Search Methodology\nA rigorous search methodology was employed to ensure a comprehensive and system-\natic review of the deep-learning techniques applied to personalized ECG diagnosis.\nThe primary databases used for the literature search included PubMed, IEEE Xplore,\nWeb of Science, and Google Scholar, selected for their extensive coverage of biomed-\nical and engineering research, ensuring a broad and inclusive search. The search was\nconducted over a specified timeframe from January 1, 2020, to May 31, 2024, to\ncapture the most recent advancements in the field. A combination of search terms\nand keywords was utilized, including “Patient-specific ECG,” “Personalized ECG,”\n“Domain adaptation ECG,” “Transfer learning ECG,” “GAN ECG,” “Few-shot learn-\ning ECG,” and “deep-learning ECG,” among others. Boolean operators (AND, OR)\nrefined the search results, ensuring that relevant studies were not overlooked. Specific\ninclusion and exclusion criteria were applied to maintain the relevance and quality\nof the reviewed studies: only peer-reviewed journals and conference articles focused\non deep-learning techniques for ECG diagnosis, studies involving human subjects or\nclinically relevant ECG data, and publications in English were included. Non-peer-\nreviewed articles, studies focusing on non-human ECG data, and articles not directly\nrelated to personalized ECG diagnosis or deep-learning applications were excluded.\nThe initial search yielded a large number of articles, prompting a two-step screen-\ning process: the titles and abstracts of the retrieved articles were screened to identify\nstudies meeting the inclusion criteria, followed by a full-text review of the remaining\narticles to ensure sufficient information on the application of deep-learning techniques\nto personalized ECG diagnosis. For each selected study, key information was extracted,\nincluding study objectives, a description of the deep-learning techniques used, data\nsources and characteristics, methodological details, and main findings. The extracted\ndata were synthesized to provide a comprehensive overview of the current state of\nresearch in personalized ECG diagnosis using deep learning, identifying trends, com-\nmon methodologies, and gaps in the literature. To ensure reliability and validity, a\nquality assessment was conducted based on study design, sample size, methodologi-\ncal rigor, and robustness of findings, critically appraising studies to identify potential\nbiases and limitations.\n3\nWhile the search methodology was designed to be thorough, certain limitations\ninclude the exclusion of non-English articles, reliance on specific databases that\nmay have omitted relevant studies, and the fast-evolving nature of deep-learning\nresearch, which means recent advancements may not be fully captured. Despite these\nlimitations, the methodology employed provides a robust framework for reviewing\nthe application of deep-learning techniques to personalized ECG diagnosis, offering\nvaluable insights into current practices and future directions in this field.\nIden\u0005ﬁca\u0005on of studies via databases and registers\nIden\u0005ﬁca\u0005on\nScreening\nIncluded\nRecords iden\u0005ﬁed from:\nDatabase (n = 202)\nReports sought for retrieval\n(n = 178)\nReports assessed for eligibility\n(n = 160)\nStudies included in review\n(n = 112)\n  Records removed before screeing:\n      Duplicate records removed (n = 3)\n      Records marked as ineligible by automa\u0005on tools (n = 13)\n      Records removed for other reasons (n = 8)\n  Reports excluded:\n      Reason 1 (n = 23): irrelevance to the study topic\n      Reason 2 (n = 18): insuﬃcient methodological quality\n      Reason 3 (n = 7): incomplete data\n  Reports not retrieved (n = 18)\nFig. 1: Preferred reporting items for Systematic Reviews and Meta-Analyses\n(PRISMA) flow diagram showing the number of articles searched and excluded at\neach stage of the literature search after screening titles, abstracts and full texts.\n3 Advanced Deep-Learning Techniques for\nPersonalized ECG Diagnosis\nThis review explores the burgeoning field of personalized electrocardiogram (ECG)\nanalysis, which has been revolutionized by the transformative potential of deep learn-\ning. As illustrated in Figure 2, the key steps involved in this process include: (1) input\nECG data acquisition, (2) application of deep learning models, and (3) implementa-\ntion of personalized techniques. The paper delves into each of these steps, providing a\n4\ncomprehensive overview of the current state-of-the-art techniques and methodologies.\nMoreover, it outlines promising avenues for future research that have the potential\nto further advance this field. By presenting an in-depth exploration of these critical\naspects, this review aims to shed light on the latest developments and future directions\nin personalized ECG analysis driven by deep learning.\nInput ECG Data\nDeep-Learning based Models\nPersonalized ECG\nAdaptation\nTechniques\nGeneration\nTechniques\nFeature Extraction\n......\nindividual\nFig. 2: Schematic overview of deep learning-based models for personalized ECG anal-\nysis.\nHistorically, ECG diagnosis has relied heavily on expert interpretation and labo-\nrious manual feature extraction. However, the advent of sophisticated deep-learning\nmodels is revolutionizing this paradigm. These AI-powered algorithms are increasingly\naugmenting, and in certain instances, supplanting traditional methods, offering the\npotential for tailored diagnostic insights and ultimately, improved patient outcomes\n[14]. This shift towards automated and personalized analysis promises to enhance\ndiagnostic accuracy, streamline clinical workflows, and facilitate the development of\nmore targeted and effective treatment strategies.\nTo achieve truly personalized ECG analysis, this review will further explore several\ncutting-edge techniques. These approaches represent significant advancements in the\nfield, enabling the development of highly customized diagnostic and predictive models\nthat can account for individual variability and potentially unlock new frontiers in\npersonalized cardiovascular medicine.\n3.1 Fine-Tuning\n3.1.1 Tailoring Pre-trained Models for Personalization\nFine-tuning is a pivotal transfer learning technique employed to adapt pre-trained neu-\nral networks for personalized ECG diagnosis [15]. This process enhances the model’s\neffectiveness in capturing both general cardiovascular features and patient-specific\nnuances. Initially, a neural network is trained on a large, diverse dataset, enabling it\nto learn broad patterns and representations [16, 17].\n5\nPersonalized ECG Signal Analysis\nLarge ECG Database \nPretrained Model\nTransfer Learning\nFine Tuning on\nECG Data\nOutput\nPretraining on Large\nDatasets\n......\nFig. 3: Schematic illustration of fine-tuning a pre-trained neural network for person-\nalized ECG diagnosis. The pre-trained network is adapted for patient-specific ECG\ndiagnosis through further training on a smaller dataset, enabling the model to cap-\nture unique electrophysiological patterns and improve diagnostic precision.\nSubsequently, as depicted in Fig. 3, the pre-trained network undergoes fine-tuning,\nwhere it is further trained on a smaller, patient-specific dataset [18]. This step allows\nthe model to adapt and specialize in the unique electrophysiological patterns exhibited\nby individual patients. By fine-tuning the pre-trained model, a balance can be striked\nbetween retaining general cardiovascular knowledge and honing its ability to detect\nsubtle, personalized variations in ECG signals.\nThe fine-tuning process involves updating the weights of the pre-trained model\nbased on the patient-specific dataset. This adaptation enables the model to become\nmore sensitive to the unique characteristics of the patient’s ECG, addressing inter-\npatient variability. As a result, the model’s diagnostic accuracy and precision are\nimproved, leading to more tailored and effective ECG diagnostics. Fine-tuning allows\nfor a seamless transition from general cardiovascular understanding to personalized\nhealthcare solutions.\nBy leveraging pre-trained models and fine-tuning them for specific patients, the\nmodel’s initial broad knowledge is harnessed while its expertise is customized to cater\nto individual needs. This approach enhances the model’s ability to detect anomalies,\npredict cardiovascular events, and provide personalized recommendations.\n6\n3.1.2 Applications of Fine-Tuning Methods in Personalized ECG\nSignal Processing\nFine-tuning methods have become essential in enhancing the performance of person-\nalized ECG signal processing models, enabling them to adapt to individual variations\nin cardiac rhythms. For instance, Ng et al. [19] proposed a personalized atrial fibril-\nlation (AF) detector using a Siamese network, which leverages few-shot learning to\naddress the imbalanced dataset problem during fine-tuning. Similarly, Hu et al. [20]\nexplored the impact of different deep-learning model structures and label mapping\nlengths on personalized transfer learning for single-lead ECG-based sleep apnea detec-\ntion, demonstrating the superiority of a hybrid transformer model. In another study,\nHu et al. [21] introduced a semi-supervised learning approach for low-cost personal-\nized obstructive sleep apnea detection, utilizing a convolutional neural network-based\nauto-encoder to assign pseudo-labels and improve model performance. Hong et al.\n[22] developed a deep-learning model with individualized fine-tuning for dynamic and\nbeat-to-beat blood pressure estimation, showing significant reductions in mean abso-\nlute errors. Suhas et al. [23] presented an end-to-end personalized cuff-less blood\npressure monitoring system using transformers and contrastive loss-based training,\nachieving state-of-the-art performance even with limited subject-specific data. Liu et\nal. [24] introduced ECG-Text Pre-training (ETP) to learn cross-modal representa-\ntions linking ECG signals with textual reports, excelling in zero-shot classification\ntasks. Jia et al. [25] proposed a meta-learning algorithm for personalizing a 1D-CNN\nfor ventricular arrhythmias detection on intracardiac EGMs, achieving improved sen-\nsitivity and specificity. Additionally, Jia et al. [26] incorporated prior knowledge into\nthe fine-tuning process to enhance AF detection accuracy, while Ullah et al. [27] uti-\nlized a pre-trained residual network for automatic premature ventricular contraction\nrecognition, demonstrating high accuracy on imbalanced datasets. These studies col-\nlectively highlight the effectiveness of fine-tuning methods in adapting deep-learning\nmodels to individual patient data, thereby improving the accuracy and reliability of\npersonalized ECG diagnostics.\nHowever, a significant limitation remains in the requirement of manually annotated\nECG signals for fine-tuning, particularly for long-term recordings with substantial\nindividual differences. While pre-training AF detection models on public databases\nand fine-tuning them with a portion of the test data can enhance model generalization,\nthe necessity for manual annotation poses a considerable challenge. This process can\nbe time-consuming and labor-intensive, especially when dealing with extensive and\npersonalized ECG datasets, as highlighted by Ma [28]. Addressing this limitation\nrequires the development of more efficient annotation techniques or the integration\nof semi-supervised and unsupervised learning methods to reduce the dependency on\nextensive manual labeling.\n3.2 Domain Adaptation\n3.2.1 Bridging Data Discrepancies for Better Generalization\nDomain adaptation techniques are crucial for transferring knowledge from a gen-\neral source domain to a specific target domain, such as from a large, heterogeneous\n7\nECG dataset to the personalized ECG data of individual patients. Methods such as\nadversarial training or discrepancy-based approaches are utilized to align the fea-\nture distributions between these domains. By mitigating the discrepancies in data\ndistribution, domain adaptation ensures that the diagnostic model can generalize\neffectively to the unique ECG patterns of different patients, thereby accommodat-\ning inter-patient variability and enhancing the model’s adaptability and accuracy in\npersonalized settings.\nFig. 4 illustrates the concept of domain adaptation for personalized ECG diagnosis.\nThe source domain represents a large, heterogeneous ECG dataset, while the target\ndomain represents the personalized ECG data of an individual patient. By aligning the\nfeature distributions between these domains, domain adaptation enables the model to\ngeneralize effectively to the unique ECG patterns of the target patient, improving its\naccuracy and adaptability in personalized settings.\n3.2.2 Applications of Domain Adaptation Methods in Personalized\nECG Signal Processing\nDomain adaptation methods have been increasingly applied to address the chal-\nlenges of inter-subject variability and domain shifts in personalized ECG signal\nprocessing. He et al. [29] proposed an online cross-subject emotion recognition\napproach using unsupervised domain adaptation (UDA) to handle both inter-subject\nand intra-subject discrepancies in ECG signals, demonstrating significant improve-\nments in classification accuracy and robustness in online scenarios. Wang et al. [30]\nintroduced a Domain-Adaptative ECG Arrhythmia Classification (DAEAC) model\nthat employs convolutional networks and UDA to improve inter-patient heartbeat\nclassification without requiring expert annotations, leveraging cluster-aligning and\ncluster-maintaining losses to enhance feature discriminability and structural infor-\nmation. Similarly, Chen et al. [31] developed a Multi-path Atrous Convolutional\nNetwork (MACN) with cluster-aligning and cluster-separating losses to address perfor-\nmance degradation in inter-patient ECG classification. Yuan and Siyal [32] proposed\na Target-oriented Augmentation Privacy-protection Domain Adaptation (TAPDA)\nframework, utilizing source-free domain adaptation (SFDA) to enhance ECG beat\nclassification while preserving patient privacy. Their method addresses class imbal-\nance by employing data augmentation techniques and a class-balance pseudo-labeling\nstrategy, significantly improving classification performance. Du et al. [33] proposed\na dual-channel network with feature queue technology for atrial fibrillation diagno-\nsis, achieving high precision and recall using unsupervised domain adaptation. Their\ninnovative feature queue technique enables stable and rapid updates of the network,\nleveraging both labeled and unlabeled data effectively. Feng et al. [34] presented an\nunsupervised semantic-aware adaptive feature fusion network (USAFFN) to reduce\ndomain shifts in arrhythmia detection by aligning semantic distributions between\nfeature spaces. Their multi-perspective adaptive feature fusion (MPAFF) module\nextracts informative ECG representations from different angles, improving detection\nperformance and generalization across datasets. These studies collectively highlight\nthe effectiveness of domain adaptation methods in enhancing the generalization and\n8\nDomain 1\nDomain 2\nDomain n\n......\nDomain Shift\nSource Domain\nDomain Adaptation\nCross Domain\nFig. 4: Schematic illustration of domain adaptation for personalized ECG diagnosis.\nThe source domain represents a large, heterogeneous ECG dataset, while the target\ndomain represents the personalized ECG data of an individual patient. Domain adap-\ntation aligns the feature distributions between these domains, enabling the model to\ngeneralize effectively to the unique ECG patterns of the target patient.\nrobustness of personalized ECG diagnostics, addressing the variability and privacy\nconcerns associated with ECG signal processing.\n3.3 Generative Adversarial Networks (GANs)\n3.3.1 Synthesizing Realistic Patient-Specific ECG Data\nGenerative Adversarial Networks (GANs) have emerged as a powerful paradigm\nfor synthesizing highly personalized ECG data. The GAN architecture comprises\ntwo neural networks—a generator and a discriminator—engaged in an adversarial\n9\ntraining process. In the context of personalized ECG analysis, the generator synthe-\nsizes realistic, patient-specific ECG signals, while the discriminator evaluates their\nauthenticity, ensuring that the generated signals faithfully capture individual cardiac\ncharacteristics.\nFig. 5 presents a schematic illustration of a GAN architecture tailored for\npersonalized ECG signal generation. The generator network, typically comprising\nconvolutional neural networks (CNNs) or recurrent neural networks (RNNs), learns\nto produce synthetic ECG signals that meticulously mimic the unique characteris-\ntics of individual patient data. Concurrently, the discriminator network distinguishes\nbetween real patient-specific ECG signals and those generated by the model. This\nadversarial interplay drives the generator to create increasingly realistic and person-\nalized ECG data, while the discriminator becomes more adept at detecting subtle,\npatient-specific differences.\nRecent advancements in GAN-based approaches have shown promising results for\npersonalized ECG synthesis and analysis. Golany et al. [35] introduced PGANs (Per-\nsonalized Generative Adversarial Networks), which learn to generate patient-specific\nECG signals by conditioning the generator on individual patient characteristics.\nThis approach significantly improved the quality and personalization of synthetic\nECG data, enhancing diagnostic accuracy for patient-specific arrhythmia detection.\nSimilarly, Delaney et al. [36] proposed a GAN-based method for synthesizing realis-\ntic, patient-specific 12-lead ECG signals, successfully capturing intricate correlations\nbetween different ECG leads while preserving individual patient characteristics.\nIn the domain of personalized ECG diagnosis, GANs have demonstrated remark-\nable capability in generating high-fidelity synthetic ECG data that closely mimics a\npatient’s unique cardiac patterns. This synthetic data serves as a valuable augmen-\ntation to limited patient-specific datasets, significantly enriching the training set and\nenhancing the robustness and accuracy of personalized diagnostic models. By metic-\nulously capturing the nuances of individual patients’ ECGs, GANs effectively address\ninter-patient variability and contribute to more personalized and precise diagnostic\noutcomes.\nThe application of GANs in personalized ECG analysis extends beyond data\nsynthesis. For instance, Shaker et al. [37] utilized GANs to address the challenge of gen-\neralization in ECG classification across different patients, improving the performance\nof ECG classification models on unseen patients and enhancing the personalization of\ndiagnostic systems.\nIn synopsis, GAN-generated, high-fidelity, patient-tailored synthetic ECGs criti-\ncally empower personalized diagnostic model development, heralding transformative\npotential for individualized cardiac care and outcome optimization, with anticipated\nbreakthroughs forthcoming as this synergistic research frontier continues to evolve.\n3.3.2 Leveraging GAN-Based Models for Enhanced Personalized\nECG Signal Processing\nGANs have been extensively utilized in personalized ECG signal processing to address\nchallenges such as patient-specific data scarcity, individual privacy concerns, and\n10\nG\nD\nreal or fake\nreal or fake\nsample\ninput\nFig. 5: Schematic illustration of a Generative Adversarial Network (GAN). A Gen-\nerator (G) synthesizes data aiming to mimic the true data distribution, and a\nDiscriminator (D) evaluates the authenticity of the generated data against real sam-\nples. The Generator receives a random noise vector (z) as input and produces an\noutput that attempts to pass as a real sample. The Discriminator, trained to distin-\nguish between real data and generated samples, provides feedback to the Generator\nto improve its synthesis process. This adversarial training framework pushes the Gen-\nerator to produce increasingly realistic data over time.\nthe need for high-quality synthetic data that captures unique cardiac characteris-\ntics. Chen et al. [38] introduced ME-GAN, a disease-aware GAN for multi-view ECG\nsynthesis conditioned on individual heart diseases, which significantly improves the\nrepresentation of patient-specific ECG signals by precisely injecting personalized dis-\nease information into suitable locations. This approach enhances the model’s ability\nto capture individual variations in cardiac pathology.\nGolany et al. [39] proposed ECG ODE-GAN, which learns the dynamics of person-\nalized ECG signals through ordinary differential equations, enhancing ECG heartbeat\nclassification for individual patients. This method adapts to the unique temporal char-\nacteristics of each patient’s cardiac signals, improving diagnostic accuracy [35]. Neifar\net al. [40] leveraged statistical shape priors in GAN-based ECG synthesis to gener-\nate realistic, patient-specific ECG signals, effectively addressing class imbalance in\nindividual training datasets.\nSarkar and Etemad [41] developed CardioGAN, which synthesizes personalized\nECG from PPG signals using an attention-based generator and dual discriminators.\nThis approach significantly improves heart rate measurement accuracy for individual\npatients by capturing patient-specific correlations between PPG and ECG signals.\nKim and Pan [42] utilized an auxiliary classifier GAN to generate synthetic ECG\nsignals for user recognition, demonstrating high recognition performance even with\ninconsistent data sizes across individuals.\nGolany et al. [43] introduced SimGANs, integrating a biological simulator into\nthe GAN framework to generate biologically plausible, patient-specific ECG training\n11\nexamples. This innovative approach improves heartbeat classification by incorporating\nindividual physiological constraints. Kang et al. [44] demonstrated a multi-task GAN\nmodel for ECG authentication and arrhythmia detection, effectively hiding sensitive\nhealth information while preserving individual cardiac characteristics.\nWang et al. [45] presented a hierarchical deep-learning framework with GAN for\nautomatic cardiac diagnosis from ECG signals, addressing data-lacking and imbal-\nanced issues in personalized datasets. Byeon and Kwak [46] leveraged semi-supervised\ndomain adaptation with CycleGAN to account for electrode placement discrepancies\nin individual identification from ECG signals, enhancing the robustness of personalized\nECG analysis.\nRafi and Ko [47] introduced SF-ECG, a source-free domain adaptation approach\nusing GANs to synthesize patient-specific ECG data and improve arrhythmia classi-\nfication. This method adapts to individual variations in ECG morphology, enhancing\nthe personalization of arrhythmia detection algorithms. Vo et al. [48] developed P2E-\nWGAN, a conditional Wasserstein GAN for synthesizing personalized ECG waveforms\nfrom PPG, demonstrating effectiveness in augmenting patient-specific training data.\nJoo et al. [49] developed a GAN to reconstruct 12-lead ECG signals from single-\nlead inputs, enhancing the detection of complex cardiovascular diseases by preserving\nindividual patient characteristics across leads. Kuo et al. [50] applied a self-attention\nGAN for personalized sleep scoring, significantly improving classification accuracy by\ncapturing individual sleep patterns in ECG signals.\nThese studies collectively highlight the effectiveness of GAN-based models in\ngenerating high-quality, patient-specific synthetic ECG data, improving personal-\nized classification performance, and addressing privacy concerns in individualized\nECG signal processing. The ability of GANs to capture and replicate unique cardiac\ncharacteristics of individual patients represents a significant advancement in person-\nalized ECG analysis, paving the way for more accurate and tailored diagnostic and\nmonitoring solutions in cardiology.\n3.4 Diffusion Models\n3.4.1 Generating High-Fidelity Personalized ECG Signals\nDiffusion models, a class of generative models that reverse a stochastic diffusion pro-\ncess, have emerged as a powerful tool for generating high-fidelity ECG signals [51]. In\nthe realm of personalized ECG diagnosis, these models excel at learning the underlying\ndistribution of patient-specific heartbeat patterns. By iteratively refining noisy ECG\nsignals, diffusion models produce realistic, individualized data that accurately cap-\nture the unique cardiac characteristics of each patient. This capability is particularly\nadvantageous in scenarios with limited or noisy patient data, as diffusion models can\naugment training datasets with high-quality synthetic signals that preserve patient-\nspecific features [52, 53]. Consequently, these models effectively address inter-patient\nvariability and significantly enhance the personalization of diagnostic algorithms.\nFig. 6 illustrates the architecture and functionality of a diffusion model tailored\nfor ECG signal processing. The model incorporates a sophisticated combination of\n12\nUNet architecture, ResNet blocks, skip connections, and self-attention layers to pro-\ncess noisy ECG data and generate high-fidelity, patient-specific signals. The input\nECG data, containing noise and artifacts, undergoes a series of denoising steps, where\nthe model progressively refines the signal while preserving individual patient charac-\nteristics. Through the utilization of residual blocks and skip connections, the model\neffectively captures both local and global dependencies within the ECG data, ensuring\nthat important temporal features and patient-specific patterns are preserved.\na\nb\n...\n...\nTime\nRepresentation\nFully-connected\nLayers\nFig. 6: Illustration of the diffusion process in Diffusion Models. (a) The forward\ndiffusion process, where x0 transitions through a Markov chain to xt, depicts the\nstochastic process of transitioning from one state to another in the state space, with\ntime information synchronously embedded at each step. (b) A common architecture of\na diffusion model utilizes a UNet structure, residual blocks, and skip connections, as\nwell as embedding time information at various layers to facilitate the reverse diffusion\nprocess. This architecture efficiently reconstructs images from the noise distribution\nback to the data distribution by synchronously incorporating temporal embeddings.\n13\n3.4.2 Applications of Diffusion Models in Personalized ECG Signal\nProcessing\nRecent studies have demonstrated the significant potential of diffusion models in\nadvancing personalized ECG diagnosis through various tasks, including patient-\nspecific synthetic ECG generation, individualized noise and baseline wander removal,\nand cross-modal signal-to-signal translation tailored to individual patients. Adib et al.\n[54] introduced an innovative pipeline utilizing Improved Denoising Diffusion Proba-\nbilistic Models (DDPM) for generating synthetic ECG signals by embedding 1D ECG\ntime series data into 2D space. This approach enables the generation of highly per-\nsonalized ECG signals, thereby enhancing the training dataset and supporting the\ndevelopment of individualized diagnostic systems.\nLopez Alcaraz and Strodthoff [55] proposed SSSD-ECG, a diffusion model under-\npinned by structured state-space models for generating conditional 12-lead ECGs\ncustomized to individual patient profiles. This model demonstrates superior per-\nformance in capturing patient-specific ECG characteristics compared to traditional\ngenerative adversarial networks (GANs). Zama and Schwenker [56] developed a\ndiffusion-based model coupled with a State Space Augmented Transformer for synthe-\nsizing conditional 12-lead ECGs based on the PTB-XL dataset [57]. Their approach\nsignificantly enhances personalization by learning distinct patient-specific signal\ncharacteristics, enabling the generation of highly individualized ECG signals.\nShome et al. [58] introduced the Region-Disentangled Diffusion Model (RDDM) for\ntranslating Photoplethysmography (PPG) signals to ECG. This innovative approach\nenables cross-modal signal translation that can improve patient-specific monitoring by\naccurately capturing individual cardiovascular characteristics across different modal-\nities. Li et al. [59] proposed the Deep Score-Based Diffusion Model for ECG Baseline\nWander and Noise Removal (DeScoD-ECG), offering personalized noise reduction by\nadapting to individual signal characteristics. This model achieved at least a 20% over-\nall improvement compared to the best baseline method, providing cleaner and more\naccurate patient-specific signals for enhanced diagnostic accuracy.\nA key advantage of diffusion models in personalized ECG analysis lies in their\nability to capture the complex temporal dynamics and individual variations of ECG\nsignals, enabling robust personalization. By incorporating advanced techniques such\nas embedding 1D ECG time series data into 2D space [54], utilizing structured state-\nspace models [55], and employing region-disentangled diffusion processes [58], these\nmodels can generate high-quality synthetic ECG signals that closely resemble real\nECG recordings while accurately reflecting individual patient differences. This capa-\nbility is crucial for developing personalized diagnostic and monitoring systems that\ncan adapt to the unique cardiovascular profiles of individual patients.\n3.5 Meta-Learning\n3.5.1 Rapid Adaptation with Minimal Data\nFew-shot learning and meta-learning techniques are designed to enable models to\nlearn new tasks rapidly with minimal data, which is critical for personalized ECG\ndiagnosis. These approaches allow diagnostic models to adapt to a new patient’s ECG\n14\ndata using only a few examples. Meta-learning frameworks, such as Model-Agnostic\nMeta-Learning (MAML), train models on a variety of tasks, equipping them with\nthe ability to quickly adjust to new, unseen tasks. This rapid adaptability is essential\nfor personalized diagnosis, as it enables the model to accurately interpret the unique\nECG patterns of individual patients, even with limited training data. By addressing\ninter-patient variability, few-shot learning and meta-learning significantly enhance the\nmodel’s ability to provide personalized and precise diagnostic insights.\nFig. 7 illustrates the concept of meta-learning for personalized ECG diagnosis. The\nmodel is trained on a variety of tasks, each representing a different patient’s ECG data.\nThis training enables the model to learn a generalizable representation of ECG signals,\nwhich can be fine-tuned for a new patient’s data using only a few examples. This\nrapid adaptation enables the model to accurately diagnose the patient’s condition,\neven with minimal training data.\n3.5.2 Applications of Meta-Learning-based Model in Personalized\nECG Signal Processing\nMeta-learning approaches have shown significant promise in enhancing personal-\nized ECG signal processing by addressing individual variability and the scarcity of\nlabeled data. Akbari et al. [60] introduced a meta-learning framework for translat-\ning bio-impedance (Bio-Z) signals to ECG, which adapts to new users with minimal\nsamples, reducing the percentage root mean square difference (PRD) substantially\ncompared to traditional methods. Jia et al. [61] proposed a personalized neural net-\nwork for patient-specific health monitoring in IoT, leveraging a meta-learning method\nto quickly adapt a well-generalized model to new patient data, achieving notable\nimprovements in VF detection, AF detection, and human activity recognition. Liu\net al. [62] developed a Meta Siamese Network (MSN) for few-shot ECG diagnosis,\neffectively improving the robustness of arrhythmia detection with limited records by\nemploying a metric-based meta-learning framework. Meqdad et al. [63] proposed an\ninterpretable meta-structural learning algorithm for arrhythmia detection across mul-\ntiple sessions, achieving high accuracy and competitive performance by combining\nCNNs and genetic programming. Musa et al. [64] conducted a comprehensive system-\natic review and meta-data analysis on the applications of deep-learning in ECG signal\nprocessing, highlighting the various domains and challenges, and providing insights\ninto potential research opportunities. Sun et al. [65] proposed a federated learning and\nblockchain framework for physiological signal classification, integrating meta-learning\nto address dynamic distribution changes and privacy concerns, demonstrating superior\nperformance and privacy protection.\nLiu et al. [66] introduced a meta-transfer-based few-shot learning method for\narrhythmia detection using ECG data from wearable devices, which effectively handles\nthe data scarcity issue by converting ECG signals into spectrograms and leveraging\na pre-trained feature extractor. Rjoob et al. [67] reviewed the evolution of machine\nlearning applications in ECG over two decades, noting the increasing prominence of\ndeep-learning techniques and their superior performance in arrhythmia detection.\nSun et al. [68] addressed the challenge of classifying medical time series with\nfew-shot class-incremental learning by proposing the Meta self-attention Prototype\n15\nSource data\nTask 1\nTask 2\nTask n\n......\nPre-train\nPretrained network\nFine-tune\nFinetuned network\nTarget data (limited)\nPersonalized ECG Signals\nFig. 7: Schematic illustration of meta-learning for personalized ECG diagnosis. The\nmodel is trained on a variety of tasks, each representing a different patient’s ECG\ndata, and can be fine-tuned for a new patient’s data using only a few examples.\nIncrementer (MAPIC), which significantly outperforms state-of-the-art methods in\nhandling new classes without forgetting old ones. Essa and Xie [69] developed an\nensemble of deep-learning-based multi-model systems for ECG heartbeat classifica-\ntion, combining CNN-LSTM and RRHOS-LSTM models to achieve high accuracy and\nrobustness.\n16\n3.6 Comparative Analysis\nTable 1 presents a comprehensive overview of recent advancements in deep-learning\ntechniques for personalized ECG diagnosis. This table highlights the significant\nperformance improvements achieved through personalization, demonstrating the effec-\ntiveness of these techniques in capturing individual-specific cardiac patterns and\nenhancing diagnostic accuracy.\nThis analysis reveals a clear trend towards personalized ECG diagnosis, driven by\nthe success of deep-learning techniques. These techniques can be broadly categorized\ninto two main approaches: Adaptation and Generation, with Meta-learning offering a\nunique bridge between the two.\nAdaptation techniques aim to tailor pre-trained models to individual patient data.\nThis approach utilizes real patient data and leverages transfer learning to quickly\nlearn patient-specific characteristics. Examples include fine-tuning and domain adap-\ntation. Fine-tuning directly adapts a pre-trained model to a target patient’s ECG\ndata, enhancing its ability to capture subtle individual variations. Domain adaptation\ntackles the challenge of transferring knowledge from a general source domain to a spe-\ncific target domain by aligning feature distributions between heterogeneous datasets\nand patient-specific data. While effective, both approaches often require a significant\namount of labeled patient data, which remains a significant challenge in personalized\nECG diagnosis.\nGeneration techniques address the issue of limited patient data by generating\nsynthetic ECG signals. These techniques leverage generative models to create realistic\nECG recordings that capture individual variations. GANs and diffusion models are\nprominent examples. GANs learn to generate high-fidelity synthetic ECG data by\ncapturing complex patterns from real data. Diffusion models excel in generating high-\nquality synthetic ECG signals and removing noise from recordings, capturing intricate\ntemporal dynamics. These techniques offer a promising avenue for overcoming data\nscarcity and enabling more personalized ECG analysis.\nMeta-learning stands as a powerful technique for rapid adaptation to new tasks\nwith minimal data, making it an essential tool for personalized ECG diagnosis. This\napproach trains models on a variety of tasks, equipping them with the ability to\nquickly adjust to new, unseen tasks. This rapid adaptability is crucial for accurately\ninterpreting the unique ECG patterns of individual patients, even with limited training\ndata. By bridging the gap between adaptation and generation, meta-learning offers a\nunique path to personalized ECG diagnosis, especially when data is scarce.\nIn conclusion, the integration of advanced deep-learning techniques for personal-\nized ECG diagnosis holds transformative potential. These techniques not only improve\ndiagnostic accuracy and reliability but also address the inherent inter-individual vari-\nability in ECG signals. Future research should focus on developing efficient annotation\ntechniques, enhancing model interpretability, and ensuring the clinical validity of syn-\nthetic data. By addressing these challenges, the field can move closer to realizing the\nfull potential of personalized ECG diagnosis in clinical practice.\n17\nTable 1: Overview of Recent Advances in Deep-Learning Techniques for Personalized ECG Analysis\nStudy\nTechnique\nTask\nDataset\nSample\nSize\nLeads\nBefore\nPer-\nsonalization\nAfter\nPer-\nsonalization\nNg\net\nal.\n2023 [19]\nFine-\nTuning\nAtrial Fibrilla-\ntion Detection\nPrivate\nDataset\n1,000\n1\nF1 Score: 95%\nF1 Score: 97%\nHu\net\nal.\n2023 [20]\nFine-\nTuning\nSleep\nApnea\nDetection\nMIT-BIH\nPolysomno-\ngraphic\n18\n1\nAccuracy:\n0.8412\nAccuracy:\n0.8537\nHong et al.\n2021 [22]\nFine-\nTuning\nBlood Pressure\nEstimation\nPrivate\nDataset\n85\n1\nMAE:\n13.43\nmmHg\nMAE:\n9.49\nmmHg\nSuhas et al.\n2024 [23]\nFine-\nTuning\nBlood Pressure\nMonitoring\nPrivate\nDataset\n510\n1\nMAE:\n1.5\nmmHg\nMAE:\n1.08\nmmHg\nHe\net\nal.\n2021 [29]\nDomain\nAdaptation\nEmotion\nRecognition\nPrivate\nDataset\n32\n1\nBaseline\nPer-\nformance\n12% improve-\nment\nWang et al.\n2021 [30]\nDomain\nAdaptation\nArrhythmia\nClassification\nMIT-BIH\nArrhythmia\n47\n2\nAccuracy:\n97.0%\nAccuracy:\n97.59%\nChen et al.\n2020 [31]\nDomain\nAdaptation\nArrhythmia\nClassification\nMIT-BIH\nArrhythmia\n47\n2\nVEB F1: 88%,\nSVEB F1: 70%\nVEB F1: 95%,\nSVEB F1: 88%\nChen et al.\n2022 [38]\nGANs\nECG Synthesis\nPrivate\nDataset\n200\n12\nS: (0.4, 0.39),\nV: (0.85, 0.87),\nF: (0.2, 0.07)\nS: (0.4, 0.5), V:\n(0.85, 0.87), F:\n(0.2, 0.1)\nGolany\net\nal.\n2021\n[39]\nGANs\nECG\nHeartbeat\nClassification\nPrivate\nDataset\n168\n2\nS: (0.40/0.70),\nF: (0.20/0.25),\nV: (0.90/0.86)\nS: (0.40/0.83),\nF: (0.20/0.45),\nV: (0.90/0.90)\n18\nTABLE 1 - Continued from previous page\nStudy\nTechnique\nTask\nDataset\nSample\nSize\nLeads\nBefore\nPer-\nsonalization\nAfter\nPer-\nsonalization\nNeifar et al.\n2024 [40]\nGANs\nECG Synthesis\nPrivate\nDataset\n250\n12\nRMSE:\nN(1.86e-\n3,\n2.45e-2),\nV(2.05e-\n3,\n2.56e-2),\nF(2.21e-3,\n2.78e-2)\nRMSE:\nN(1.66e-\n3,\n1.84e-2),\nV(1.95e-\n3,\n2.12e-2),\nF(2.05e-3,\n2.35e-2)\nSarkar and\nEtemad\n2021 [41]\nGANs\nECG\nfrom\nPPG Synthesis\nPrivate\nDataset\n42\n1\nHeart\nRate\nError:\n9.74\nbpm\nHeart\nRate\nError:\n2.89\nbpm\nAdib et al.\n2023 [54]\nDiffusion\nModels\nECG\nGenera-\ntion\nMIT-BIH\nArrhythmia\n47\n2\nAverage Preci-\nsion: 0.76\nAverage Preci-\nsion: 0.96\nLopez\nAlcaraz\net\nal.\n2023\n[55]\nDiffusion\nModels\nConditional\nECG\nGenera-\ntion\nPTB-XL\n21,837\n12\nAUROC:\n0.5968\nAUROC:\n0.8402\nZama\nand\nSchwenker\n2023 [56]\nDiffusion\nModels\nConditional\nECG Synthesis\nPTB-XL\n21,837\n12\nAccuracy:\n95.01%\nAccuracy:\n95.84%\nShome\net\nal.\n2024\n[58]\nDiffusion\nModels\nPPG to ECG\nTranslation\nMultiple\nDatasets\n>10,000\n1\nMAE-DALIA:\nBaseline,\nMAE-\nWESAD:\nBaseline,\nF1:\nBaseline, Accu-\nracy: Baseline\nMAE-\nDALIA:\n-1.53\nbpm,\nMAE-\nWESAD: -8.10\nbpm,\nF1:\n+16%,\nAccu-\nracy: +4-15%\nLi\net\nal.\n2023 [59]\nDiffusion\nModels\nNoise Removal\nQT\nDatabase,\nMIT-BIH\n155\n2-12\nCosine Similar-\nity: 0.897\nCosine Similar-\nity: 0.926\nJia\net\nal.\n2022 [61]\nMeta-\nLearning\nHealth\nMoni-\ntoring\nPrivate\nDataset\n250\n1\nVF\nAccuracy:\nBaseline,\nAF\nAccuracy:\nBaseline\nVF\nAccu-\nracy:\n+8.2%,\nAF\nAccuracy:\n+2.5%\nLiu\net\nal.\n2023 [62]\nMeta-\nLearning\nArrhythmia\nDetection\nMIT-BIH\nArrhythmia\n47\n2\nAccuracy:\n96.96%\nAccuracy:\n99.34%\n19\nTABLE 1 - Continued from previous page\nStudy\nTechnique\nTask\nDataset\nSample\nSize\nLeads\nBefore\nPer-\nsonalization\nAfter\nPer-\nsonalization\nMeqdad\net al. 2022\n[63]\nMeta-\nLearning\nArrhythmia\nDetection\nPrivate\nDataset\n100\n1\nAccuracy:\n97.15%\nAccuracy:\n98.29%\nSun et al.\n2023 [68]\nMeta-\nLearning\nTime\nSeries\nClassification\nPrivate\nDataset\n1,000\n1\nAccuracy:\nBaseline\nAccuracy:\n+27.99%,\n+18.4%,\n+3.95%\n(3\ndatasets)\nEssa\nand\nXie\n2021\n[69]\nMeta-\nLearning\nHeartbeat\nClassification\nMIT-BIH\nArrhythmia\n47\n2\nF1 Score: Base-\nline\nF1\nScore:\n+3%,\nAccu-\nracy: 95.81%\n20\n4 Challenges\nThis section explores the multifaceted challenges shaping the landscape of personalized\nECG analysis using deep learning. While this domain harbors immense potential to\nrevolutionize cardiac diagnostics and patient care, it is confronted with a series of\ntechnical, ethical, and practical hurdles that must be addressed to fully realize its\ntransformative potential.\n4.1 Real-time Learning and Adaptation\nA critical limitation of current models is their static nature, which relies on pre-existing\ndatasets. True clinical utility, however, requires capabilities for real-time processing\nand learning from streaming ECG data. Future research should focus on developing\ndynamic algorithms that not only adapt and update in real-time as new data accrues\nbut also do so with minimal computational overhead. Techniques such as online learn-\ning and incremental learning are promising but require significant advancements to\nhandle the high-dimensional, continuous influx of ECG data efficiently. Edge comput-\ning could play a crucial role here, facilitating rapid data processing close to the data\nsource (e.g., wearable devices), thus minimizing latency issues [70–72]. Furthermore,\nimplementing federated learning could allow for decentralized model updating across\nnumerous devices while safeguarding patient privacy, offering a balanced approach to\ncollaborative healthcare innovation.\n4.2 Addressing Intra-patient Variability\nPersonalized ECG systems must account for the substantial variability in a patient’s\nECG signals, influenced by daily physiological changes and external factors like activ-\nity levels and stress. To capture this intra-patient variability effectively, it is essential to\ndevelop robust data collection strategies that gather comprehensive ECG data under\nvarying conditions. Advanced machine learning strategies, such as multi-task learn-\ning, contextual modeling and cross-modal learning, should be explored to integrate\nand leverage this variability. These models could incorporate additional data streams\n(e.g., from wearable sensors) to enrich the ECG data, providing a more holistic view\nof the patient’s health status at any given time [73–77].\n4.3 Mitigating Negative Transfer Learning\nTransfer learning is pivotal in personalizing models with limited data but carries\nthe risk of negative transfer, where irrelevant knowledge from the source model may\nimpair learning in the target model. This necessitates the development of sophisti-\ncated mechanisms to assess and ensure the relevance and benefit of the transferred\nfeatures. Adaptive strategies that can discern and extract beneficial knowledge specific\nto each patient’s data profile are required. Incorporating meta-learning could refine\nthese processes by enabling systems to learn how to learn more effectively from lim-\nited patient data, ensuring that transfer learning enhances rather than detracts from\nmodel performance [78].\n21\n4.4 Overcoming Data Scarcity\nThe scarcity of patient-specific ECG data poses a significant barrier to effective per-\nsonalization, particularly for rare cardiac conditions or newly onboarded patients.\nInnovative solutions such as few-shot learning and sophisticated data augmentation\ntechniques designed for temporal data can help mitigate these issues. Furthermore, the\nuse of synthetic data generation through advanced GANs offers a dual opportunity:\naugmenting training datasets and preserving privacy. However, this approach requires\ncareful validation to ensure that synthetic data maintain high fidelity to real physio-\nlogical signals and do not introduce biases or artifacts that could mislead diagnostic\nmodels [79, 80].\n4.5 Ethical and Regulatory Considerations\nAs the boundaries of personalized ECG analysis are pushed further, ethical and regula-\ntory challenges become increasingly pertinent. Ensuring patient consent, data security,\nand privacy in the age of AI-driven diagnostics is paramount. The development of\nthese technologies must also consider potential biases in training data that could lead\nto disparities in healthcare outcomes. Regulatory frameworks will need to evolve to\naddress these issues, ensuring that innovations in personalized ECG analysis are both\nsafe and beneficial across diverse patient populations.\nAddressing these challenges necessitates a concerted effort from multidisciplinary\nteams, encompassing data scientists and cardiologists alongside ethicists and policy-\nmakers. By confronting these challenges directly, the full potential of personalized\nECG analysis can be realized, transforming cardiac care with more accurate, timely,\nand individualized diagnostics.\n5 Conclusion and Future Perspective\nDespite the numerous challenges that lie ahead, the prospects for deep learning in\npersonalized ECG diagnosis are undeniably promising. The future trajectory of this\nfield is likely to be shaped by several key developments. Paramount among these is\nthe enhancement of data collection efforts and the refinement of annotation practices.\nHigh-quality, diverse datasets are critical for training robust deep-learning models that\ncan generalize well across different patient populations. Furthermore, the exploration\nand development of novel deep learning architectures, specifically tailored to capture\nthe intricate and nuanced patterns within ECG signals, will be essential.\nImproving model interpretability remains a vital objective to build trust and\nacceptance within clinical environments. Clinicians need to understand and trust the\noutputs of AI systems to integrate them effectively into their diagnostic workflows [81].\nTo this end, research into explainable AI (XAI) methods that elucidate the decision-\nmaking processes of deep learning models will be instrumental. Privacy-preserving\nmachine learning techniques, such as federated learning and differential privacy, will\nplay a crucial role in ensuring patient data is handled with the utmost care and confi-\ndentiality. These techniques will enable the development of robust AI models without\n22\ncompromising patient privacy, thus addressing one of the major ethical concerns in\nthe deployment of AI in healthcare.\nCollaboration with regulatory bodies will be essential to establish a comprehensive\nframework for the ethical and compliant deployment of AI technologies in healthcare\nsettings [82]. This collaboration will facilitate the development of guidelines and stan-\ndards that ensure the safety, efficacy, and fairness of AI-based diagnostic tools. The\ndesign and development of user-centric systems that prioritize user experience and\nseamless clinical integration will be crucial for the widespread adoption of these tech-\nnologies. Healthcare professionals must find these systems intuitive and beneficial to\ntheir workflows, which will encourage their acceptance and routine use.\nLastly, fostering cross-disciplinary collaboration will be key to creating solutions\nthat are both technically advanced and clinically relevant [83]. The integration of\ninsights from cardiologists, data scientists, and engineers will be vital in developing\nAI systems that address real-world clinical needs and challenges [84, 85].\nIn conclusion, while the journey toward integrating deep learning into personalized\nECG diagnosis is replete with challenges, the collective efforts of the scientific, medi-\ncal, and engineering communities have the potential to overcome these obstacles. The\nfuture of AI in cardiac care is poised to revolutionize diagnostic capabilities, enhance\npatient outcomes, and harmonize technology with the nuanced art of medicine,\nultimately leading to a new era of precision cardiology [86].\nAcknowledgements\nThis work was supported by the\nCompeting interests\nThe authors declare no competing interests.\nReferences\n[1] Bhatia, R.S., Dorian, P.: Screening for cardiovascular disease risk with electro-\ncardiography. JAMA Internal Medicine 178(9), 1163–1164 (2018)\n[2] Martis, R.J., Acharya, U.R., Adeli, H.: Current methods in electrocardiogram\ncharacterization. Computers in biology and medicine 48, 133–149 (2014)\n[3] Liu, X., Wang, H., Li, Z., Qin, L.: Deep learning in ecg diagnosis: A review.\nKnowledge-Based Systems 227, 107187 (2021)\n[4] Rafie, N., Kashou, A.H., Noseworthy, P.A.: Ecg interpretation: clinical relevance,\nchallenges, and advances. Hearts 2(4), 505–513 (2021)\n[5] Khera, R., Oikonomou, E.K., Nadkarni, G.N., Morley, J.R., Wiens, J., Butte,\nA.J., Topol, E.J.: Transforming cardiovascular care with artificial intelligence:\n23\nFrom discovery to practice: Jacc state-of-the-art review. Journal of the American\nCollege of Cardiology 84(1), 97–114 (2024)\n[6] Ni, J., Tang, H., Haque, S.T., Yan, Y., Ngu, A.H.: A survey on multimodal wear-\nable sensor-based human action recognition. arXiv preprint arXiv:2404.15349\n(2024)\n[7] Hammad, M., Maher, A., Wang, K., Jiang, F., Amrani, M.: Detection of abnor-\nmal heart conditions based on characteristics of ecg signals. Measurement 125,\n634–644 (2018)\n[8] Berkaya, S.K., Uysal, A.K., Gunal, E.S., Ergin, S., Gunal, S., Gulmezoglu, M.B.:\nA survey on ecg analysis. Biomedical Signal Processing and Control 43, 216–235\n(2018)\n[9] Ribeiro, A.H., Ribeiro, M.H., Paixão, G.M., Oliveira, D.M., Gomes, P.R.,\nCanazart, J.A., Ferreira, M.P., Andersson, C.R., Macfarlane, P.W., Meira Jr,\nW., et al.: Automatic diagnosis of the 12-lead ecg using a deep neural network.\nNature communications 11(1), 1760 (2020)\n[10] Fratini, A., Sansone, M., Bifulco, P., Cesarelli, M.: Individual identification via\nelectrocardiogram analysis. Biomedical engineering online 14, 1–23 (2015)\n[11] Anbalagan, T., Nath, M.K., Vijayalakshmi, D., Anbalagan, A.: Analysis of vari-\nous techniques for ecg signal in healthcare, past, present, and future. Biomedical\nEngineering Advances, 100089 (2023)\n[12] Li, Y., Pang, Y., Wang, J., Li, X.: Patient-specific ecg classification by deeper\ncnn from generic to dedicated. Neurocomputing 314, 336–346 (2018)\n[13] Ebrahimi, Z., Loni, M., Daneshtalab, M., Gharehbaghi, A.: A review on\ndeep learning methods for ecg arrhythmia classification. Expert Systems with\nApplications: X 7, 100033 (2020)\n[14] Siontis,\nK.C.,\nNoseworthy,\nP.A.,\nAttia,\nZ.I.,\nFriedman,\nP.A.:\nArtificial\nintelligence-enhanced electrocardiography in cardiovascular disease manage-\nment. Nature Reviews Cardiology 18(7), 465–478 (2021)\n[15] Weimann, K., Conrad, T.O.: Transfer learning for ecg classification. Scientific\nreports 11(1), 5251 (2021)\n[16] Pal, A., Srivastva, R., Singh, Y.N.: Cardionet: An efficient ecg arrhythmia\nclassification system using transfer learning. Big Data Research 26, 100271\n(2021)\n[17] Maray, N., Ngu, A.H., Ni, J., Debnath, M., Wang, L.: Transfer learning on small\ndatasets for improved fall detection. Sensors 23(3), 1105 (2023)\n24\n[18] Mohebbanaaz, Kumar, L.R., Sai, Y.P.: A new transfer learning approach to\ndetect cardiac arrhythmia from ecg signals. Signal, Image and Video Processing\n16(7), 1945–1953 (2022)\n[19] Ng, Y., Liao, M.-T., Chen, T.-L., Lee, C.-K., Chou, C.-Y., Wang, W.: Few-shot\ntransfer learning for personalized atrial fibrillation detection using patient-based\nsiamese network with single-lead ecg records. Artificial Intelligence in Medicine\n144, 102644 (2023)\n[20] Hu, S., Wang, Y., Liu, J., Yang, C.: Personalized transfer learning for single-\nlead ecg-based sleep apnea detection: Exploring the label mapping length\nand transfer strategy using hybrid transformer model. IEEE Transactions on\nInstrumentation and Measurement (2023)\n[21] Hu, S., Liu, J., Yang, C., Wang, A., Li, K., Liu, W., et al.: Semi-supervised\nlearning for low-cost personalized obstructive sleep apnea detection using unsu-\npervised deep learning and single-lead electrocardiogram. IEEE Journal of\nBiomedical and Health Informatics (2023)\n[22] Hong, J., Gao, J., Liu, Q., Zhang, Y., Zheng, Y.: Deep learning model with\nindividualized fine-tuning for dynamic and beat-to-beat blood pressure estima-\ntion. In: 2021 IEEE 17th International Conference on Wearable and Implantable\nBody Sensor Networks (BSN), pp. 1–4 (2021). IEEE\n[23] Suhas, B., Srinivasa, R.S., Saidutta, Y.M., Cho, J., Lee, C.-H., Yang, C., Shen,\nY., Jin, H.: End-to-end personalized cuff-less blood pressure monitoring using\necg and ppg signals. In: ICASSP 2024-2024 IEEE International Conference\non Acoustics, Speech and Signal Processing (ICASSP), pp. 2101–2105 (2024).\nIEEE\n[24] Liu, C., Wan, Z., Cheng, S., Zhang, M., Arcucci, R.: Etp: Learning transferable\necg representations via ecg-text pre-training. In: ICASSP 2024-2024 IEEE Inter-\nnational Conference on Acoustics, Speech and Signal Processing (ICASSP), pp.\n8230–8234 (2024). IEEE\n[25] Jia, Z., Wang, Z., Hong, F., Ping, L., Shi, Y., Hu, J.: Learning to learn per-\nsonalized neural network for ventricular arrhythmias detection on intracardiac\negms. In: IJCAI, pp. 2606–2613 (2021)\n[26] Jia, Z., Shi, Y., Saba, S., Hu, J.: On-device prior knowledge incorporated\nlearning for personalized atrial fibrillation detection. ACM Transactions on\nEmbedded Computing Systems (TECS) 20(5s), 1–25 (2021)\n[27] Ullah, H., Heyat, M.B.B., Akhtar, F., Muaad, A.Y., Ukwuoma, C.C., Bilal, M.,\nMiraz, M.H., Bhuiyan, M.A.S., Wu, K., Damaševičius, R., et al.: An automatic\npremature ventricular contraction recognition system based on imbalanced\ndataset and pre-trained residual network using transfer learning on ecg signal.\n25\nDiagnostics 13(1), 87 (2022)\n[28] Ma, C., Long, X., Sheng, W., Vullings, R., Yang, M., Zhao, L., Aarts, R.M.,\nLi, J., Liu, C.: An atrial fibrillation detection strategy in dynamic ecgs with\nsignificant individual differences. IEEE Transactions on Instrumentation and\nMeasurement (2023)\n[29] He, W., Ye, Y., Li, Y., Pan, T., Lu, L.: Online cross-subject emotion recognition\nfrom ecg via unsupervised domain adaptation. In: 2021 43rd Annual Inter-\nnational Conference of the IEEE Engineering in Medicine & Biology Society\n(EMBC), pp. 1001–1005 (2021). IEEE\n[30] Wang, G., Chen, M., Ding, Z., Li, J., Yang, H., Zhang, P.: Inter-patient ecg\narrhythmia heartbeat classification based on unsupervised domain adaptation.\nNeurocomputing 454, 339–349 (2021)\n[31] Chen, M., Wang, G., Ding, Z., Li, J., Yang, H.: Unsupervised domain adaptation\nfor ecg arrhythmia classification. In: 2020 42nd Annual International Conference\nof the IEEE Engineering in Medicine & Biology Society (EMBC), pp. 304–307\n(2020). IEEE\n[32] Yuan, L., Siyal, M.Y.: Target-oriented augmentation privacy-protection domain\nadaptation for imbalanced ecg beat classification. Biomedical Signal Processing\nand Control 86, 105308 (2023)\n[33] Du, M., Yang, Y., Zhang, L.: Diagnosis of atrial fibrillation based on unsu-\npervised domain adaptation. Computers in Biology and Medicine 164, 107275\n(2023)\n[34] Feng, P., Fu, J., Ge, Z., Wang, H., Zhou, Y., Zhou, B., Wang, Z.: Unsuper-\nvised semantic-aware adaptive feature fusion network for arrhythmia detection.\nInformation Sciences 582, 509–528 (2022)\n[35] Golany, T., Radinsky, K.: Pgans: Personalized generative adversarial networks\nfor ecg synthesis to improve patient-specific deep ecg classification. In: Pro-\nceedings of the AAAI Conference on Artificial Intelligence, vol. 33, pp. 557–564\n(2019)\n[36] Delaney, A.M., Brophy, E., Ward, T.E.: Synthesis of Realistic ECG using\nGenerative Adversarial Networks (2019)\n[37] Shaker, A.M., Tantawi, M., Shedeed, H.A., Tolba, M.F.: Generalization of con-\nvolutional neural networks for ecg classification using generative adversarial\nnetworks. IEEE Access 8, 35592–35605 (2020)\n[38] Chen, J., Liao, K., Wei, K., Ying, H., Chen, D.Z., Wu, J.: Me-gan: Learning\npanoptic electrocardio representations for multi-view ecg synthesis conditioned\n26\non heart diseases. In: International Conference on Machine Learning, pp. 3360–\n3370 (2022). PMLR\n[39] Golany, T., Freedman, D., Radinsky, K.: Ecg ode-gan: Learning ordinary dif-\nferential equations of ecg dynamics via generative adversarial learning 35(1),\n134–141 (2021)\n[40] Neifar, N., Ben-Hamadou, A., Mdhaffar, A., Jmaiel, M., Freisleben, B.: Lever-\naging statistical shape priors in gan-based ecg synthesis. IEEE Access (2024)\n[41] Sarkar, P., Etemad, A.: Cardiogan: Attentive generative adversarial network\nwith dual discriminators for synthesis of ecg from ppg. In: Proceedings of the\nAAAI Conference on Artificial Intelligence, vol. 35, pp. 488–496 (2021)\n[42] Kim, M.-G., Pan, S.B.: A study on user recognition using the generated synthetic\nelectrocardiogram signal. Sensors 21(5), 1887 (2021)\n[43] Golany, T., Radinsky, K., Freedman, D.: Simgans: Simulator-based generative\nadversarial networks for ecg synthesis to improve deep ecg classification. In:\nInternational Conference on Machine Learning, pp. 3597–3606 (2020). PMLR\n[44] Kang, Y., Yang, G., Eom, H., Han, S., Baek, S., Noh, S., Shin, Y., Park, C.: Gan-\nbased patient information hiding for an ecg authentication system. Biomedical\nEngineering Letters 13(2), 197–207 (2023)\n[45] Wang, Z., Stavrakis, S., Yao, B.: Hierarchical deep learning with generative\nadversarial network for automatic cardiac diagnosis from ecg signals. Computers\nin Biology and Medicine 155, 106641 (2023)\n[46] Byeon, Y.-H., Kwak, K.-C.: Semi-supervised domain adaptation for individual\nidentification from electrocardiogram signals. Applied Sciences 13(24), 13259\n(2023)\n[47] Rafi, T.H., Ko, Y.-W.: Sf-ecg: Source-free intersubject domain adaptation for\nelectrocardiography-based arrhythmia classification. Applied Sciences 13(14),\n8551 (2023)\n[48] Vo, K., Naeini, E.K., Naderi, A., Jilani, D., Rahmani, A.M., Dutt, N., Cao, H.:\nP2e-wgan: Ecg waveform synthesis from ppg with conditional wasserstein gener-\native adversarial networks. In: Proceedings of the 36th Annual ACM Symposium\non Applied Computing, pp. 1030–1036 (2021)\n[49] Joo, J., Joo, G., Kim, Y., Jin, M.-N., Park, J., Im, H.: Twelve-lead ecg recon-\nstruction from single-lead signals using generative adversarial networks. In:\nInternational Conference on Medical Image Computing and Computer-Assisted\nIntervention, pp. 184–194 (2023). Springer\n27\n[50] Kuo, C.-E., Lu, T.-H., Chen, G.-T., Liao, P.-Y.: Towards precision sleep\nmedicine: Self-attention gan as an innovative data augmentation technique for\ndeveloping personalized automatic sleep scoring classification. Computers in\nBiology and Medicine 148, 105828 (2022)\n[51] Ho, J., Jain, A., Abbeel, P.: Denoising diffusion probabilistic models. Advances\nin neural information processing systems 33, 6840–6851 (2020)\n[52] Ouyang, Y., Xie, L., Zha, H., Cheng, G.: Transfer learning for diffusion models.\narXiv preprint arXiv:2405.16876 (2024)\n[53] Debnath, M., Kabir, M.S., Ni, J., Ngu, A.H.H.: The impact of synthetic data on\nfall detection application. In: International Conference on Artificial Intelligence\nin Medicine, pp. 204–209 (2024). Springer\n[54] Adib, E., Fernandez, A.S., Afghah, F., Prevost, J.J.: Synthetic ecg signal\ngeneration using probabilistic diffusion models. IEEE Access (2023)\n[55] Alcaraz, J.M.L., Strodthoff, N.: Diffusion-based conditional ecg generation with\nstructured state space models. Computers in Biology and Medicine 163, 107115\n(2023)\n[56] Zama, M.H., Schwenker, F.: Ecg synthesis via diffusion-based state space\naugmented transformer. Sensors 23(19), 8328 (2023)\n[57] Wagner, P., Strodthoff, N., Bousseljot, R.-D., Kreiseler, D., Lunze, F.I., Samek,\nW., Schaeffter, T.: Ptb-xl, a large publicly available electrocardiography dataset.\nScientific data 7(1), 1–15 (2020)\n[58] Shome, D., Sarkar, P., Etemad, A.: Region-disentangled diffusion model for\nhigh-fidelity ppg-to-ecg translation. In: Proceedings of the AAAI Conference on\nArtificial Intelligence, vol. 38, pp. 15009–15019 (2024)\n[59] Li, H., Ditzler, G., Roveda, J., Li, A.: Descod-ecg: Deep score-based diffusion\nmodel for ecg baseline wander and noise removal. IEEE Journal of Biomedical\nand Health Informatics (2023)\n[60] Akbari, A., Martinez, J., Jafari, R.: A meta-learning approach for fast personal-\nization of modality translation models in wearable physiological sensing. IEEE\njournal of biomedical and health informatics 26(4), 1516–1527 (2021)\n[61] Jia, Z., Shi, Y., Hu, J.: Personalized neural network for patient-specific health\nmonitoring in iot: a metalearning approach. IEEE Transactions on Computer-\nAided Design of Integrated Circuits and Systems 41(12), 5394–5407 (2022)\n[62] Liu, Z., Chen, Y., Zhang, Y., Ran, S., Cheng, C., Yang, G.: Diagnosis of\narrhythmias with few abnormal ecg samples using metric-based meta learning.\n28\nComputers in Biology and Medicine 153, 106465 (2023)\n[63] Meqdad, M.N., Abdali-Mohammadi, F., Kadry, S.: Meta structural learning\nalgorithm with interpretable convolutional neural networks for arrhythmia\ndetection of multisession ecg. IEEE Access 10, 61410–61425 (2022)\n[64] Musa, N., Gital, A.Y., Aljojo, N., Chiroma, H., Adewole, K.S., Mojeed, H.A.,\nFaruk, N., Abdulkarim, A., Emmanuel, I., Folawiyo, Y.Y., et al.: A systematic\nreview and meta-data analysis on the applications of deep learning in electro-\ncardiogram. Journal of ambient intelligence and humanized computing 14(7),\n9677–9750 (2023)\n[65] Sun, L., Wu, J., Xu, Y., Zhang, Y.: A federated learning and blockchain\nframework for physiological signal classification based on continual learning.\nInformation Sciences 630, 586–598 (2023)\n[66] Liu, T., Yang, Y., Fan, W., Wu, C.: Few-shot learning for cardiac arrhythmia\ndetection based on electrocardiogram data from wearable devices. Digital Signal\nProcessing 116, 103094 (2021)\n[67] Rjoob, K., Bond, R., Finlay, D., McGilligan, V., Leslie, S.J., Rababah, A.,\nIftikhar, A., Guldenring, D., Knoery, C., McShane, A., et al.: Machine learn-\ning and the electrocardiogram over two decades: Time series and meta-analysis\nof the algorithms, evaluation metrics and applications. Artificial Intelligence in\nMedicine 132, 102381 (2022)\n[68] Sun, L., Zhang, M., Wang, B., Tiwari, P.: Few-shot class-incremental learning\nfor medical time series classification. IEEE journal of biomedical and health\ninformatics (2023)\n[69] Essa, E., Xie, X.: An ensemble of deep learning-based multi-model for ecg\nheartbeats arrhythmia classification. ieee access 9, 103452–103464 (2021)\n[70] Hoi, S.C., Sahoo, D., Lu, J., Zhao, P.: Online learning: A comprehensive survey.\nNeurocomputing 459, 249–289 (2021)\n[71] Bonomi, L., Wu, Z., Fan, L.: Sharing personal ecg time-series data privately.\nJournal of the American Medical Informatics Association 29(7), 1152–1160\n(2022)\n[72] Ngu, A.H., Eyitayo, J.S., Yang, G., Campbell, C., Sheng, Q.Z., Ni, J.: An iot\nedge computing framework using cordova accessor host. IEEE Internet of Things\nJournal 9(1), 671–683 (2021)\n[73] Ni, J., Sarbajna, R., Liu, Y., Ngu, A.H., Yan, Y.: Cross-modal knowledge dis-\ntillation for vision-to-sensor action recognition. In: ICASSP 2022-2022 IEEE\nInternational Conference on Acoustics, Speech and Signal Processing (ICASSP),\n29\npp. 4448–4452 (2022). IEEE\n[74] Ni, J., Ngu, A.H., Yan, Y.: Progressive cross-modal knowledge distillation\nfor human action recognition. In: Proceedings of the 30th ACM International\nConference on Multimedia, pp. 5903–5912 (2022)\n[75] Mehari, T., Strodthoff, N.: Towards quantitative precision for ecg analysis:\nLeveraging state space models, self-supervision and patient metadata. IEEE\nJournal of Biomedical and Health Informatics (2023)\n[76] Patro, B.N., Agneeswaran, V.S.: Mamba-360: Survey of state space models as\ntransformer alternative for long sequence modelling: Methods, applications, and\nchallenges. arXiv preprint arXiv:2404.16112 (2024)\n[77] Ni, J., Tang, H., Shang, Y., Duan, B., Yan, Y.: Adaptive cross-architecture\nmutual knowledge distillation. In: 2024 IEEE 18th International Conference on\nAutomatic Face and Gesture Recognition (FG), pp. 1–5 (2024). IEEE\n[78] Hong, S., Zhou, Y., Shang, J., Xiao, C., Sun, J.: Opportunities and challenges\nof deep learning methods for electrocardiogram data: A systematic review.\nComputers in biology and medicine 122, 103801 (2020)\n[79] Thambawita, V., Isaksen, J.L., Hicks, S.A., Ghouse, J., Ahlberg, G., Linneberg,\nA., Grarup, N., Ellervik, C., Olesen, M.S., Hansen, T., et al.: Deepfake electro-\ncardiograms using generative adversarial networks are the beginning of the end\nfor privacy issues in medicine. Scientific reports 11(1), 21896 (2021)\n[80] Mason, F., Pandey, A.C., Gadaleta, M., Topol, E.J., Muse, E.D., Quer, G.:\nAi-enhanced reconstruction of the 12-lead electrocardiogram via 3-leads with\naccurate clinical assessment. npj Digital Medicine 7(1), 201 (2024)\n[81] Alahmadi, A., Davies, A., Royle, J., Goodwin, L., Cresswell, K., Arain, Z.,\nVigo, M., Jay, C.: An explainable algorithm for detecting drug-induced qt-\nprolongation at risk of torsades de pointes (tdp) regardless of heart rate and\nt-wave morphology. Computers in Biology and Medicine 131, 104281 (2021)\n[82] Ma, W., Sheng, B., Liu, Y., Qian, J., Liu, X., Li, J., Ouyang, D., Wang, H.,\nAtanasov, A.G., Keane, P.A., et al.: Evolution of Future Medical AI Mod-\nels—From Task-Specific, Disease-Centric to Universal Health. Massachusetts\nMedical Society (2024)\n[83] Topol, E.J.: High-performance medicine: the convergence of human and artificial\nintelligence. Nature medicine 25(1), 44–56 (2019)\n[84] Dai, L., Sheng, B., Chen, T., Wu, Q., Liu, R., Cai, C., Wu, L., Yang, D., Hamzah,\nH., Liu, Y., et al.: A deep learning system for predicting time to progression of\ndiabetic retinopathy. Nature Medicine 30(2), 584–594 (2024)\n30\n[85] Li, J., Guan, Z., Wang, J., Cheung, C.Y., Zheng, Y., Lim, L.-L., Lim, C.C.,\nRuamviboonsuk, P., Raman, R., Corsino, L., et al.: Integrated image-based deep\nlearning and language models for primary diabetes care. Nature Medicine, 1–11\n(2024)\n[86] Khera, R.: AI-enabled diagnosis from an electrocardiogram image: the next\nfrontier of innovation in a century-old technology. BMJ Publishing Group Ltd\nand British Cardiovascular Society (2024)\n[87] Rajpurkar, P., Chen, E., Banerjee, O., Topol, E.J.: Ai in health and medicine.\nNature medicine 28(1), 31–38 (2022)\n[88] Jia, Z., Wang, Z., Hong, F., Ping, L., Shi, Y., Hu, J.: Personalized deep learning\nfor ventricular arrhythmias detection on medical iot systems. In: Proceedings of\nthe 39th International Conference on Computer-aided Design, pp. 1–9 (2020)\n[89] Jia, Z., Hong, F., Ping, L., Shi, Y., Hu, J.: Enabling on-device model personal-\nization for ventricular arrhythmias detection by generative adversarial networks.\nIn: 2021 58th ACM/IEEE Design Automation Conference (DAC), pp. 163–168\n(2021). IEEE\n[90] Qin, K., Huang, W., Zhang, T., Zhang, H., Cheng, X.: A lightweight self-\nonn model for general ecg classification with pretraining. Biomedical Signal\nProcessing and Control 89, 105780 (2024)\n[91] Sun, L., Zhong, Z., Qu, Z., Xiong, N.: Perae: an effective personalized autoen-\ncoder for ecg-based biometric in augmented reality system. IEEE journal of\nbiomedical and health informatics 26(6), 2435–2446 (2022)\n[92] Xu, S.S., Mak, M.-W., Chang, C.: Inter-patient ecg classification with i-vector\nbased unsupervised patient adaptation. Expert Systems with Applications 210,\n118410 (2022)\n[93] Chao, L., Li, Z., Zhang, H.: Research on arrhythmia classification based\non domain adaptation. In: 2023 9th International Conference on Control,\nAutomation and Robotics (ICCAR), pp. 147–152 (2023). IEEE\n[94] Tian, X., Zhu, Q., Li, Y., Wu, M.: Cross-domain joint dictionary learning for ecg\ninference from ppg. IEEE Internet of Things Journal 10(9), 8140–8154 (2022)\n[95] Zhai, X., Zhou, Z., Tin, C.: Semi-supervised learning for ecg classification with-\nout patient-specific labeled data. Expert Systems with Applications 158, 113411\n(2020)\n[96] Wu, Y., Spathis, D., Jia, H., Perez-Pozuelo, I., Gonzales, T.I., Brage, S.,\nWareham, N., Mascolo, C.: Udama: Unsupervised domain adaptation through\nmulti-discriminator adversarial training with noisy labels improves cardio-fitness\n31\nprediction. In: Machine Learning for Healthcare Conference, pp. 863–883 (2023).\nPMLR\n[97] De Giovanni, E., Teijeiro, T., Millet, G.P., Atienza, D.: Adaptive r-peak detec-\ntion on wearable ecg sensors for high-intensity exercise. IEEE Transactions on\nBiomedical Engineering 70(3), 941–953 (2022)\n[98] Kantharaju, P., Vakacherla, S.S., Jacobson, M., Jeong, H., Mevada, M.N., Zhou,\nX., Major, M.J., Kim, M.: Framework for personalizing wearable devices using\nreal-time physiological measures. IEEE Access (2023)\n[99] Scrugli, M.A., Loi, D., Raffo, L., Meloni, P.: An adaptive cognitive sensor node\nfor ecg monitoring in the internet of medical things. IEEE Access 10, 1688–1705\n(2021)\n[100] Li, J., Wang, G., Chen, M., Ding, Z., Yang, H.: Mixup asymmetric tri-training\nfor heartbeat classification under domain shift. IEEE Signal Processing Letters\n28, 718–722 (2021)\n[101] Wang, N., Feng, P., Ge, Z., Zhou, Y., Zhou, B., Wang, Z.: Adversarial spatiotem-\nporal contrastive learning for electrocardiogram signals. IEEE Transactions on\nNeural Networks and Learning Systems (2023)\n[102] Kumari, L., Sai, Y.P., et al.: Classification of ecg beats using optimized decision\ntree and adaptive boosted optimized decision tree. Signal, Image and Video\nProcessing 16(3), 695–703 (2022)\n[103] Rajani Kumari, L., Chalapathi Rao, Y.: Ecg beat classification using pro-\nposed pattern adaptive wavelet-based hybrid classifiers. Signal, Image and Video\nProcessing 17(6), 2827–2835 (2023)\n[104] Xia, Y., Xu, Y., Chen, P., Zhang, J., Zhang, Y.: Generative adversarial network\nwith transformer generator for boosting ecg classification. Biomedical Signal\nProcessing and Control 80, 104276 (2023)\n[105] Dasgupta, S., Das, S., Bhattacharya, U.: Cardiogan: an attention-based gen-\nerative adversarial network for generation of electrocardiograms. In: 2020 25th\nInternational Conference on Pattern Recognition (ICPR), pp. 3193–3200 (2021).\nIEEE\n[106] Yoon, G.-W., Joo, S.: Classification feasibility test on multi-lead electrocardio-\ngraphy signals generated from single-lead electrocardiography signals. Scientific\nReports 14(1), 1888 (2024)\n[107] Qin, J., Gao, F., Wang, Z., Wong, D.C., Zhao, Z., Relton, S.D., Fang, H.: A\nnovel temporal generative adversarial network for electrocardiography anomaly\ndetection. Artificial Intelligence in Medicine 136, 102489 (2023)\n32\n[108] Simone, L., Bacciu, D.: Ecgan: Self-supervised generative adversarial network\nfor electrocardiography. In: International Conference on Artificial Intelligence\nin Medicine, pp. 276–280 (2023). Springer\n[109] Monachino, G., Zanchi, B., Fiorillo, L., Conte, G., Auricchio, A., Tzovara, A.,\nFaraci, F.D.: Deep generative models: The winning key for large and easily\naccessible ecg datasets? Computers in biology and medicine, 107655 (2023)\n[110] Cao, F., Budhota, A., Chen, H., Rajput, K.S.: Feature matching based ecg\ngenerative network for arrhythmia event augmentation. In: 2020 42nd Annual\nInternational Conference of the IEEE Engineering in Medicine & Biology Society\n(EMBC), pp. 296–299 (2020). IEEE\n[111] Sun, L., Wang, Y., Qu, Z., Xiong, N.N.: Beatclass: a sustainable ecg classification\nsystem in iot-based ehealth. IEEE Internet of Things Journal 9(10), 7178–7195\n(2021)\n[112] Zhou, Z., Zhai, X., Tin, C.: Fully automatic electrocardiogram classification\nsystem based on generative adversarial network with auxiliary classifier. Expert\nSystems with Applications 174, 114809 (2021)\n[113] Sanamdikar, S., Karajanagi, N., Kowdiki, K., Kamble, S.: Classification of ecg\nsignal for cardiac arrhythmia detection using gan method. In: Intelligent Com-\nmunication Technologies and Virtual Mobile Networks: Proceedings of ICICV\n2022, pp. 257–271 (2022). Springer\n[114] Yoon, G.-W., Joo, S.: Generated ecg signal feasibility evaluation for classi-\nfication. In: 2023 Computing in Cardiology (CinC), vol. 50, pp. 1–4 (2023).\nIEEE\n[115] Gyawali, P.K., Murkute, J.V., Toloubidokhti, M., Jiang, X., Horacek, B.M.,\nSapp, J.L., Wang, L.: Learning to disentangle inter-subject anatomical variations\nin electrocardiographic data. IEEE Transactions on Biomedical Engineering\n69(2), 860–870 (2021)\n[116] Nankani, D., Dutta Baruah, R.: Improved diagnostic performance of arrhyth-\nmia classification using conditional gan augmented heartbeats. In: Generative\nAdversarial Learning: Architectures and Applications, pp. 275–304 (2022).\nSpringer\n[117] Agrawal, A., Chauhan, A., Shetty, M.K., Gupta, M.D., Gupta, A., et al.: Ecg-\nicovidnet: Interpretable ai model to identify changes in the ecg signals of post-\ncovid subjects. Computers in Biology and Medicine 146, 105540 (2022)\n[118] Zubair, M., Woo, S., Lim, S., Kim, D.: Deep representation learning with sample\ngeneration and augmented attention module for imbalanced ecg classification.\nIEEE Journal of Biomedical and Health Informatics (2023)\n33\n[119] Tao, Y., Li, Z., Gu, C., Jiang, B., Zhang, Y.: Ecg-based expert-knowledge atten-\ntion network to tachyarrhythmia recognition. Biomedical Signal Processing and\nControl 76, 103649 (2022)\n[120] Rosa, B.M., Yang, G.Z.: A flexible wearable device for measurement of cardiac,\nelectrodermal, and motion parameters in mental healthcare applications. IEEE\nJournal of Biomedical and Health Informatics 23(6), 2276–2285 (2019)\n[121] Rosa, B.M.G., Anastasova-Ivanova, S., Yang, G.Z.: Nfc-powered flexible chest\npatch for fast assessment of cardiac, hemodynamic, and endocrine parame-\nters. IEEE Transactions on Biomedical Circuits and Systems 13(6), 1603–1614\n(2019)\n[122] Mazaheri, V., Khodadadi, H.: Heart arrhythmia diagnosis based on the com-\nbination of morphological, frequency and nonlinear features of ecg signals and\nmetaheuristic feature selection algorithm. Expert Systems with Applications\n161, 113697 (2020)\n[123] Li, M., Si, Y., Yang, W., Yu, Y.: Et-umap integration feature for ecg biometrics\nusing stacking. Biomedical Signal Processing and Control 71, 103159 (2022)\n[124] Safdar, M.F., Nowak, R.M., Pałka, P.: Exploring artificial intelligence algo-\nrithms for electrocardiogram (ecg) signal analysis: A comprehensive review.\nComputers in Biology and Medicine, 107908 (2023)\n[125] Hong, S., Wang, C., Fu, Z.: Cardioid: learning to identification from electrocar-\ndiogram data. Neurocomputing 412, 11–18 (2020)\n[126] Kumar, S., Mallik, A., Kumar, A., Del Ser, J., Yang, G.: Fuzz-clustnet: Coupled\nfuzzy clustering and deep neural networks for arrhythmia detection from ecg\nsignals. Computers in Biology and Medicine 153, 106511 (2023)\n[127] Ma, Y., Sun, S., Zhang, M., Guo, D., Liu, A.R., Wei, Y., Peng, C.-K.:\nElectrocardiogram-based sleep analysis for sleep apnea screening and diagnosis.\nSleep and Breathing 24, 231–240 (2020)\n[128] Rosa, B.M., Yang, G.Z.: A low-powered capacitive device for detection of heart\nbeat and cardiovascular parameters. In: 2019 IEEE Biomedical Circuits and\nSystems Conference (BioCAS), pp. 1–4 (2019). IEEE\n[129] Ginsburg, G.S., Picard, R.W., Friend, S.H.: Key issues as wearable digital health\ntechnologies enter clinical care. New England Journal of Medicine 390(12),\n1118–1127 (2024)\n[130] Thirunavukarasu, A.J., Ting, D.S.J., Elangovan, K., Gutierrez, L., Tan, T.F.,\nTing, D.S.W.: Large language models in medicine. Nature medicine 29(8), 1930–\n1940 (2023)\n34\n[131] Rashidinejad, P., Hu, X., Russell, S.: Patient-adaptable intracranial pressure\nmorphology analysis using a probabilistic model-based approach. Physiological\nmeasurement 41(10), 104003 (2020)\n[132] Wu, M.-H., Chang, E.J., Chu, T.-H.: Personalizing a generic ecg heartbeat clas-\nsification for arrhythmia detection: a deep learning approach. In: 2018 IEEE\nConference on Multimedia Information Processing and Retrieval (MIPR), pp.\n92–99 (2018). IEEE\n[133] Banluesombatkul, N., Ouppaphan, P., Leelaarporn, P., Lakhan, P., Chaitu-\nsaney, B., Jaimchariyatam, N., Chuangsuwanich, E., Chen, W., Phan, H.,\nDilokthanakul, N., et al.: Metasleeplearner: A pilot study on fast adaptation\nof bio-signals-based sleep stage classifier to new individual subject using meta-\nlearning. IEEE Journal of Biomedical and Health Informatics 25(6), 1949–1963\n(2020)\n[134] Hwang, D.Y., Taha, B., Hatzinakos, D.: Pbgan: Learning ppg representations\nfrom gan for time-stable and unique verification system. IEEE Transactions on\nInformation Forensics and Security 16, 5124–5137 (2021)\n[135] Jin, Y., Qin, C., Liu, J., Lin, K., Shi, H., Huang, Y., Liu, C.: A novel domain\nadaptive residual network for automatic atrial fibrillation detection. Knowledge-\nBased Systems 203, 106122 (2020)\n35\n",
  "categories": [
    "eess.SP"
  ],
  "published": "2024-09-12",
  "updated": "2024-09-12"
}