{
  "id": "http://arxiv.org/abs/2409.10023v1",
  "title": "Reinforcement learning-based statistical search strategy for an axion model from flavor",
  "authors": [
    "Satsuki Nishimura",
    "Coh Miyao",
    "Hajime Otsuka"
  ],
  "abstract": "We propose a reinforcement learning-based search strategy to explore new\nphysics beyond the Standard Model. The reinforcement learning, which is one of\nmachine learning methods, is a powerful approach to find model parameters with\nphenomenological constraints. As a concrete example, we focus on a minimal\naxion model with a global $U(1)$ flavor symmetry. Agents of the learning\nsucceed in finding $U(1)$ charge assignments of quarks and leptons solving the\nflavor and cosmological puzzles in the Standard Model, and find more than 150\nrealistic solutions for the quark sector taking renormalization effects into\naccount. For the solutions found by the reinforcement learning-based analysis,\nwe discuss the sensitivity of future experiments for the detection of an axion\nwhich is a Nambu-Goldstone boson of the spontaneously broken $U(1)$. We also\nexamine how fast the reinforcement learning-based searching method finds the\nbest discrete parameters in comparison with conventional optimization methods.\nIn conclusion, the efficient parameter search based on the reinforcement\nlearning-based strategy enables us to perform a statistical analysis of the\nvast parameter space associated with the axion model from flavor.",
  "text": "KYUSHU-HET-296\nReinforcement learning-based statistical search\nstrategy for an axion model from flavor\nSatsuki Nishimura, Coh Miyao, and Hajime Otsuka\nDepartment of Physics, Kyushu University, 744 Motooka, Nishi-ku, Fukuoka 819-0395, Japan\nE-mail: nishimura.satsuki@phys.kyushu-u.ac.jp,\nmiyao.coh@phys.kyushu-u.ac.jp, otsuka.hajime@phys.kyushu-u.ac.jp\nAbstract:\nWe propose a reinforcement learning-based search strategy to explore new\nphysics beyond the Standard Model. The reinforcement learning, which is one of machine\nlearning methods, is a powerful approach to find model parameters with phenomenologi-\ncal constraints. As a concrete example, we focus on a minimal axion model with a global\nU(1) flavor symmetry. Agents of the learning succeed in finding U(1) charge assignments\nof quarks and leptons solving the flavor and cosmological puzzles in the Standard Model,\nand find more than 150 realistic solutions for the quark sector taking renormalization ef-\nfects into account. For the solutions found by the reinforcement learning-based analysis,\nwe discuss the sensitivity of future experiments for the detection of an axion which is a\nNambu-Goldstone boson of the spontaneously broken U(1).\nWe also examine how fast\nthe reinforcement learning-based searching method finds the best discrete parameters in\ncomparison with conventional optimization methods. In conclusion, the efficient parameter\nsearch based on the reinforcement learning-based strategy enables us to perform a statistical\nanalysis of the vast parameter space associated with the axion model from flavor.\narXiv:2409.10023v1  [hep-ph]  16 Sep 2024\nContents\n1\nIntroduction\n1\n2\nFlaxion model and constraints\n2\n2.1\nModel\n3\n2.2\nConstraints from flavor physics\n6\n2.3\nConstraints from cosmology\n6\n3\nReinforcement learning\n7\n3.1\nThe environment\n8\n3.2\nNeural Network\n8\n3.3\nAgent\n9\n4\nComparison with traditional methods\n11\n5\nExploring the flaxion physics\n14\n6\nConclusion\n20\nA Benchmark points for lepton sector\n22\nA.1 The case of 1015 GeV\n22\nA.2 The case of 1016 GeV\n33\n1\nIntroduction\nThe machine learning-based search strategy is of particular attention not only for collider\nphysics but also for particle phenomenology. So far, the quantitative evaluation of physical\nobservables relied on various optimization methods to search for desirable parameters in a\nmodel and to predict new phenomena at high-energy scales. However, the analysis often\nrequires computational costs to exhaust huge parameter spaces in the model. Therefore,\nthe machine learning-based analysis will be expected as a powerful approach to searching\nfor physics beyond the Standard Model and reducing the computational costs.\nAmong\nthe machine learning techniques, we focus on the reinforcement learning (RL). In contrast\nto supervised learning and unsupervised learning, the RL allows us to find solutions au-\ntonomously from a small amount of data.\nIn this paper, we propose a new approach to search for physics beyond the Standard\nModel, i.e., a RL-based search strategy. In particular, we apply the RL-based search strat-\negy to the minimal axion model with a global U(1) flavor symmetry proposed in Refs.\n[1, 2], as a fascinating example solving the flavor and cosmological puzzles in the Standard\n– 1 –\nModel, i.e., mass hierarchies and mixing angles of quarks and leptons, an origin of dark\nmatter, and the inflation. In this model, the flavor structure of quarks and leptons can be\nexplained by using the Froggatt-Nielsen (FN) mechanism [3]. Since the U(1) flavor symme-\ntry is identified with the Peccei-Quinn (PQ) symmetry, the QCD axion originated from the\nNambu-Goldstone (NG) boson of the spontaneously broken U(1), so-called a flaxion field,\ncan solve the strong CP problem via the PQ mechanism [4, 5]. Then, a proper value of the\nflaxion decay constant also explains the dark matter abundance in our universe. Further-\nmore, the successful inflation mechanism can be realized by the radial component of the\nU(1) breaking field with the proper Lagrangian.\nSo far, the flavor structure of quarks and leptons was studied by using the RL-based\nmethod in Ref. [6]. In particular, agents of RL succeeded in finding the best solutions to\nbe consistent with the mass hierarchies and the mixing angles of quarks and leptons. This\nwork motivates us to apply the RL-based strategy to explore the cosmological aspects of\nthe minimal axion model with the global U(1) flavor symmetry. Since couplings between\nthe flaxion and quarks/leptons are determined by their U(1) charges, the flaxion-photon\ncoupling as well as the flaxion decay constant is sensitive to U(1) charge assignment. We\nutilize the RL-based strategy to find the best U(1) charges of quarks/leptons solving the\nflavor and cosmological puzzles in the Standard Model.\nBy comparing the traditional\noptimization methods with the RL-based search strategy, we argue that the RL-based search\nmethod for discrete parameters is faster than conventional computational methods. Since\nthe predicted flavor structure will be completely different for the choice of U(1) charge\nassignment, the evaluation function of the model rapidly fluctuates under the change of\ndiscrete parameters. In such a situation, the traditional numerical optimization with the\ngradient descent method is difficult to apply to this system, and the RL-strategy for discrete\nparameters has an advantage over the conventional methods.\nThis paper is organized as follows. After briefly reviewing the flaxion model and con-\nstraints from flavor physics and cosmology in Sec.\n2, we organize the RL-based search\nstrategy in Sec. 3. In Sec. 4, we verify how fast the RL-based method finds the proper\nU(1) charge assignments solving the problems in the Standard Model. In Sec. 5, we show\ntraining results and discuss the phenomenology of the flaxion with an emphasis on the\nflaxion-photon coupling which will be explored in the future experiments such as DMRadio-\nm3 [7]. Sec. 6 is devoted to conclusion and discussion. In Appendix A, we list our finding\nU(1) charge assignments of the leptons.\n2\nFlaxion model and constraints\nIn this section, we introduce a flaxion model proposed in Refs. [1, 2], which explains not\nonly the flavor structure of quarks and leptons through the FN mechanism [3] but also\nthe strong CP problem through the PQ mechanism [4, 5]. Moreover, it provides a good\ncandidate for the dark matter [8–10].\n– 2 –\n2.1\nModel\nThe model is given by the Yukawa terms as follows:\n−L ⊃yu\nij\n\u0012 ϕ\nM\n\u0013nu\nij ¯QiHcuj + yd\nij\n\u0012 ϕ\nM\n\u0013nd\nij ¯QiHdj + yl\nij\n\u0012 ϕ\nM\n\u0013nl\nij ¯LiHlj\n+ yν\nij\n\u0012 ϕ\nM\n\u0013nν\nij ¯LiHcNj +\nyN\nij\n2\n\u0012 ϕ\nM\n\u0013nN\nij\nM ¯Nc\ni Nj + h.c.,\n(2.1)\nwhere {Qi, ui, di, Li, li, Ni, H} denote the left-handed quarks, the right-handed up-type\nquarks, the right-handed down-type quarks, the left-handed leptons, the right-handed\ncharged leptons, the right-handed neutrinos, and the SM Higgs doublet with Hc = iσ2H∗,\nrespectively. We assume that a mass of the right-handed neutrinos M is corresponding\nto a cut-off scale of the model to explain the light neutrino masses through the seesaw\nmechanism [11–14]. The Yukawa couplings {yu\nij, yd\nij, yl\nij, yν\nij, yN\nij } are O(1) real constants.\nWe denote U(1) charges of the SM fields and the flavon field by\n{q(Qi), q(ui), q(di), q(Li), q(li), q(Ni), q(H), q(ϕ)}.\n(2.2)\nSince this study focuses on the charge of the quark sector primarily, the lepton sector will\nbe omitted in the following:\n{q(Qi), q(ui), q(di), q(H), q(ϕ)}.\n(2.3)\nThe reason for this omission is explained in Sec. 3. The U(1) symmetry makes the indices\nnij satisfy the following relations:\nnu\nij = −q( ¯QiHcuj)\nq(ϕ)\n= −−q(Qi) −q(H) + q(uj)\nq(ϕ)\n,\n(2.4)\nnd\nij = −q( ¯QiHdj)\nq(ϕ)\n= −−q(Qi) + q(H) + q(dj)\nq(ϕ)\n.\n(2.5)\nIn this study, nij is restricted to an integer to simplify its interpretation within a field\ntheory.\nWhen ϕ and H develop vacuum expectation values (VEVs), ⟨ϕ⟩= vϕ and ⟨H⟩= vEW =\n174 GeV, the mass matrices are given by\nmu\nij = yu\nijηnu\nijvEW,\n(2.6)\nmd\nij = yd\nijηnd\nijvEW,\n(2.7)\nwith η = vϕ/M. The masses of the quarks are decided from diagonalized components as\nmu = Uudiag(mu)V u†,\n(2.8)\nmd = Uddiag(md)V d†,\n(2.9)\n– 3 –\nand the flavor mixing is defined as the difference between mass eigenstates and flavor\neigenstates:\nVCKM = U u†U d\n=\n\n\nc12c13\ns12c13\ns13e−iδCP\n−s12c23 −c12s23s13eiδCP\nc12c23 −s12s23s13eiδCP\ns23c13\ns12s23 −c12c23s13eiδCP\n−c12s23 −s12c23s13eiδCP\nc23c13\n\n,\n(2.10)\nwith cij = cos θij and sij = sin θij. Thus, the smallness of |η| with the FN mechanism\nmakes the hierarchical structure of flavor physics, and a similar explanation holds for the\nlepton sector.\nWhen the flavon and Higgs are expanded as\nϕ = vϕ + 1\n√\n2 (s + ia) ,\nH =\n \n0\nvEW +\nh\n√\n2\n!\n,\n(2.11)\nthe Lagrangian for the quarks and the charged leptons is written in the following form:\nLf =\nX\nf=u,d,l\n\"\nmf\nij\n\u0012\n1 +\nh\n√\n2vEW\n\u0013\n+\nmf\nijnf\nij(s + ia)\n√\n2vϕ\n#\nfLifRj + h.c..\n(2.12)\nNow the Higgs Yukawa interactions can be diagonalized through rotations with unitary\nmatrices Uf and V f:\nfRj ≡V f†\nji f′\nRi,\nfLi ≡Uf†\nij f′\nLj.\n(2.13)\nHere, the fields with prime sign denote in the mass basis. In this basis, although the mass\nterm is diagonalized, the Yukawa couplings relating to the flavon field are not diagonalized\nas follows:\nLf =\nX\nf=u,d,l\n\"\nmf\ni\n\u0012\n1 +\nh\n√\n2vEW\n\u0013\nf′\nLif′\nRi + κf\nij\ns + ia\n√\n2vϕ\nf′\nLif′\nRj\n#\n+ h.c..\n(2.14)\nHere, the matrix κf\nij is given by\nκf\nij ≡Uf\nik(mf\nknnf\nkn)V f†\nnj .\n(2.15)\nIn particular, the off-diagonal interactions of the pseudo-scalar field a can be written as\nLa =\nia\n√\n2vϕ\nX\nf=u′,d′,l′\n\u0014\u0010\nκf\nH\n\u0011\nij fiγ5fj +\n\u0010\nκf\nAH\n\u0011\nij fifj\n\u0015\n,\n(2.16)\nwith κf\nH = (κf + κf†)/2 and κf\nAH = (κf −κf†)/2, which mean Hermitian part and anti-\nHermitian part of κf respectively. After diagonalizing the quark masses, we found useful\nformulas for κf\nH and κf\nAH as following forms:\n(κf\nH)ij = 1\n2(V f †ˆqQV f −Uf †ˆqfUf)ij(mf\nj + mf\ni ),\n(2.17)\n(κf\nAH)ij = 1\n2(V f †ˆqQV f + Uf †ˆqfUf)ij(mf\nj −mf\ni ),\n(2.18)\n– 4 –\nwhere f = u, d and (ˆqX)ij = qXiδij.\nThe pseudo-scalar a can play the same role as the QCD axion, so it is called the flaxion.\nThe effective Lagrangian of flaxion-gluon-gluon interaction is given as follows:\nLeff =\ng2\ns\n32π2\na\nfa\nGa\nµν eGµνa.\n(2.19)\nHere, gs is a coupling constant of strong interaction and fa is a decay constant of the flaxion\ngiven by\nfa ≡\n√\n2vϕ\nNDW\n=\n√\n2ηM\nNDW\n,\n(2.20)\nwith a domain wall number\nNDW = Tr\nh\nnu + ndi\n.\n(2.21)\nWhen the flaxion works as the QCD axion, a flaxion mass is related to the PQ scale as\nma ≃6 × 10−6 eV\n\u00121012 GeV\nfa\n\u0013\n.\n(2.22)\nFor phenomenological study, it is also useful to consider an effective coupling between\nthe flaxion and the photon. The effective Lagrangian of the interaction is given by\nL = gaγ\n4 aFµν ˜F µν,\n(2.23)\nwhere gaγ is given in Ref. [15] as follows:\ngaγ = 8π2fa\ne2\n\n\n2\nNDW\nX\nf=u,d,l\n\u0014\nNfTr(nf)\n\u0010\nq(em)\nf\n\u00112\u0015\n−2(4 + z)\n3(1 + z)\n\n,\n(2.24)\nwith z = mu/md. Here, q(em)\nf\nis the electromagnetic charge of the quarks and the leptons.\nIn addition, Nf is 3 for the quarks and 1 for the leptons.\nIn general, NDW corresponds to the number of minima of a potential. Based on the\ndiscussion of the QCD instanton, the strong CP phase is canceled at a minimum of the\nflaxion potential. Thus, the flaxion a solves the strong CP problem.\nIncidentally, domain walls are two-dimensional phase defects that arise from symmetry\nbreaking in the early universe, and the number NDW governs whether the domain walls are\nstable or not. When NDW = 1, the domain wall is unstable because it undergoes cleavage\nand contraction on its own. Numerical simulations have confirmed that such domain wall\ndisappears quickly after its formation [16]. On the other hand, when NDW > 1, the domain\nwalls are stable and their energy density decays very slowly. This means that the dominant\nenergy of the universe is composed of the domain walls even at present. However, that\nscenario violates uniform isotropy and contradicts cosmological observations, so it is called\nthe domain wall problem. In the case of NDW > 1, the problem is avoided by considering\nan additional term in the Lagrangian and breaking the symmetry before the inflation, or\nby adding a new scalar field during the inflation [17].\n– 5 –\n2.2\nConstraints from flavor physics\nThe flaxion a has flavor-changing neutral current interactions with the quarks and the\nleptons. The strictest bound on fa is given by K+ →π+a process. In the previous work\n[1], a decay rate is calculated as follows:\nΓ(K+ →π+a) =\nm3\nK\n32πv2\nϕ\n\u0012\n1 −m2\nπ\nm2\nK\n\u00133 \f\f\f\f\n(κd\nAH)12\nms −md\n\f\f\f\f\n2\n.\n(2.25)\nBy using (mK+, mπ, md, ms) ∼(493.677, 139.570, 4.67, 93.4) MeV, the rate gives following\nbraching ratio:\nBr(K+ →π+a) ≃3.5 × 1013 GeV\nf2aN2\nDW\n\f\f\f\f\n(κd\nAH)12\nms −md\n\f\f\f\f\n2\n.\n(2.26)\nComparing with a current experimental bound from NA62 collaboration [18, 19], Br(K+ →\nπ+a) ≲(3 −6) × 10−11 at 90% C.L., a lower bound on fa is given by\nfa ≳7.6 × 1011 GeV\nNDW\n\f\f\f\f\n(κd\nAH)12\nms −md\n\f\f\f\f .\n(2.27)\nThis bound can be evaluated by determining appropriate parameters of the FN model.\n2.3\nConstraints from cosmology\nThe flaxion is related to some cosmological topics (e.x., dark matter, isocurvature pertur-\nbation, and inflation). Here, we review constraints from these topics.\nDark Matter\nWhen the flaxion is regarded as the dark matter, the density parameter\nof the flaxion is given in Ref. [20] as\nΩah2 = 0.18 × θ2\ni\n\u0012\nfa\n1012 GeV\n\u00131.19\n,\n(2.28)\nwhere Ωa is the energy density parameter of flaxion, h is the dimensionless Hubble constant\nand θi is the misalignment angle, respectively. By fixing Ωah2 = 0.12, we arrive at a relation\nbetween the misalignment angle and the PQ scale as\nθi = 0.82 ×\n\u00121012 GeV\nfa\n\u00130.595\n.\n(2.29)\nFrom this relation, the misalignment angle θi is determined by searching results of RL\nthrough Eq. (2.20).\nIsocurvature Perturbation\nThe Planck2018 result [21] gives the latest constraint on a\npower spectrum of the isocurvature perturbation. This constraint provides an upper bound\nof the inflationary scale Hinf as\nHinf ≲3 × 107 GeV θ−1\ni\n\u00121012 GeV\nfa\n\u00130.19\n.\n(2.30)\nAs discussed later, the misalignment angle is fixed through Eq. (2.29) for each model found\nby RL, so the upper bounds of Hinf is given for each of the models.\n– 6 –\nInflation\nLet us identify the flavon field as an inflaton field. Following Ref. [1], we adopt\nthe following Lagrangian for the flavon field:\nL = −\n|∂ϕ|2\n\u0010\n1 −|ϕ|2\nΛ2\n\u0011 −(|ϕ|2 −v2\nϕ)2,\n(2.31)\nleading to the successful slow-roll inflation with the inflaton φ =\n√\n2Re(ϕ). It is consistent\nwith the Planck data [21].\nNote that when the inflaton φ develops a large field value\nduring the inflation φ ≫vϕ, there exists the domain wall problem after the QCD phase\ntransition. Since the inflaton oscillates around the origin during the reheating epoch, it leads\nto the parametric resonant enhancement of the flaxion and the symmetry is restored [22].\nHowever, such a problem does not occur for the small-field inflation in which the inflation\nstarts around the origin. In our inflation model, the non-trivial kinetic term of the flavon\nfield makes the potential flatten at the large field value. Furthermore, if vϕ < Λ <\n√\n2vϕ,\nthe flavon does not reach the origin after the inflation, and the symmetry is not restored,\ni.e., there is no domain wall problem as discussed in Ref. [1].\nThe inflationary scale is given by\nHinf ≃5 × 108 GeV\n\u0012\nΛ\n1014 GeV\n\u0013\n≳5 × 107 GeV.\n(2.32)\nIn the last line, we apply the lower bound of the inflationary scale as Λ ≳1013 GeV. In\nsummary, if the value of the upper bound Eq. (2.30) for a certain model is less than the\nlower bound Eq. (2.32), that model is excluded.\n3\nReinforcement learning\nIn RL, the subject of learning is called an agent, and the problem to be solved is called\nan environment.\nThe learning process is constructed from three stages: observing the\nenvironment, choosing an action, and getting rewards. By repeating these procedures, it is\nknown that the agent autonomously acquires a principle of actions that maximizes the sum\nof rewards. Details of RL and Q-learning, which are basic ingredients in RL, are explained\nin Ref. [23]. In this paper, we adopt Deep Q-Network (DQN) as a RL algorithm, and use\nthe package “gym” developed by OpenAI. Since the architecture in this work is similar to\nour previous work [6], we briefly review the RL, and setups of the learning will be explained\nby focusing on the key points. For more details about the architecture, see Ref. [6].\nThe flavor structure of quarks and leptons is determined by the charge shown in Eq.\n(2.2). In Ref. [6], many realistic models of the lepton sector are found in contrast to the\nquark sector. In other words, there are many varieties of the U(1) charges of leptons with\nsuccessful mass hierarchies and flavor structure in the quark sector. Hence, at the moment,\nwe will perform RL with an emphasis on the quark sector.\n– 7 –\n3.1\nThe environment\nWe impose two constraints on the environment. First, the indices nij are considered positive\nintegers.\nSecond, to ensure the value of top quark mass, the Yukawa term ¯Q3Hcu3 is\nirrelevant to q(ϕ):\nq( ¯Q3Hcu3) = 0 ⇔q(H) = q(u3) −q(Q3),\n(3.1)\nfrom which the U(1) charge of the Higgs is specified by the quarks. Based on this equation,\nthe flavor structure of the quarks is specified by the following charge vector:\nQa := {q(Qi), q(ui), q(di), q(ϕ)},\n(3.2)\nwith i = 1, 2, 3, so the vector has 10 elements. This is an input data for neural networks\nwhich decide an action of the agent. To avoid a hierarchy of U(1) charges, we take the\nvalue of each charge within:\n−9 ≤Qa ≤9,\n(3.3)\ncorresponding to total 1910 ∼1012 possibilities for only the quark sector. In a general\nU(1) charge pair, non-integers nij can be realized. Therefore, when the set of charges is\ninitialized, q(ϕ) is chosen to be ±1 with a probability of 50% each. This makes it easier to\ngenerate pairs of charges such that the denominator of Eq. (2.4) and Eq. (2.5) is ±1, so\nintegers nij are preferentially realized.\n3.2\nNeural Network\nWe utilize neural networks to determine an action of the agent.\nTheir architecture is\nsummarized in Table 1. The activation function is chosen as the SELU function for hidden\nlayers and the softmax function for an output layer. We employ the ADAM optimizer in\nTensorFlow [24], and the Huber function is used as a loss function. Hyper-parameters are\nset as Nep = 105 for an episode number and Nstep = 32 for a step number. Moreover, a\nbatch size is 32, an epoch number is 32, and a learning rate is α = 2.5 × 10−4, respectively\n1.\nlayer\nInput\nHidden 1\nHidden 2\nHidden 3\nOutput\nDimension\nZ10\nR64\nR64\nR64\nR20\nTable 1. In the neural networks, the input is the charge assignment Qa. The activation functions\nare the SELU function for the hidden layers {1, 2, 3}, and the softmax function for the output layer.\n1For simplicity, we use the same hyper-parameters as in the previous study, but the choice of hyper-\nparameters is also important as a factor that determines the success or failure of the learning. There are\nvarious optimization methods for hyper-parameters. Then, “Hyperopt” [25] and “Optuna” [26] are known\nas libraries that provide tuning methods based on Bayesian optimization. In general, a “black box function”\nrefers to a function whose functional form cannot be revealed in advance and whose value is determined\nonly after the arguments are given. Bayesian optimization and genetic algorithms are effective methods for\nsolving optimization problems for black box functions.\n– 8 –\n3.3\nAgent\nThe action a of the agent is realized in the following way at each step:\na : Qa →Qa ± 1 (a ∈A),\n(3.4)\nwhere A corresponds to {Qi, ui, di, ϕ}. At an initial stage of the learning, for each environ-\nment, the O(1) coefficients in Yukawa terms Eq. (2.1) are picked up from the two Gaussian\ndistribution with an average ±1 and a standard deviation 0.25. After the training with\nthe neural networks introduced in the previous subsection, the coefficients are optimized to\nproper values by the Monte-Carlo simulation. Note that the coefficient yu\n33 was fixed at 0.4\nin both the initialization and the optimization to ensure that the mass of the top quark is\nreproduced. In addition, the agent chooses an action based on ε-greedy method. Following\nthe same way as Ref. [6], we adopt ε0 = 1, r = 0.99999 and εmin = 0.01.\nThen, to evaluate how well the values calculated from the FN model reproduce reference\nvalues such as renormalized masses, an intrinsic value is defined as follows:\nV(Q) = −minη\n\u0002\nMquark + C\n\u0003\n,\n(3.5)\nwhose components will be defined below.\nThe flavon VEV is defined to maximize the\nintrinsic value, and we search for the VEV within\n0.01 ≤|η| ≤0.3,\n−π ≤arg(η) ≤π.\n(3.6)\n1. Masses:\nMquark evaluates errors of quark masses:\nMquark =\nX\nα=u,d\nEα,\n(3.7)\nwith\nEα =\n\f\f\f\flog10\n\u0012 |mα|\n|mα,RG|\n\u0013 \f\f\f\f.\n(3.8)\nHere, mα is a predicted mass by the agent, and mα,RG is a renormalized mass. mα,RG\nat energy scale M is extrapolated from calculated masses in Ref. [27]. Specifically, we\nconsider cases of M = 1014, 1015, 1016, 1017 GeV, and the referred values are shown in\nTable 2.\n2. Mixing angles:\nC evaluates errors of quark mixings:\nC =\nX\ni,j\nEij\nC ,\n(3.9)\nwith\nEij\nC =\n\f\f\f\flog10\n \n|V ij\nCKM|\n|V ij\nCKM, exp|\n! \f\f\f\f.\n(3.10)\n– 9 –\nFrom Table 3, the CKM matrix is given by the following form:\n|VCKM| =\n\n\n\n0.97435 ± 0.00016 0.22501 ± 0.00068 0.003732+0.000090\n−0.000085\n0.22487 ± 0.00068 0.97349 ± 0.00016\n0.04183+0.00079\n−0.00069\n0.00858+0.00019\n−0.00017\n0.04111+0.00077\n−0.00068\n0.999118+0.000029\n−0.000034\n\n\n.\n(3.11)\nFor the mixing angles, we focused on the reproduction of the feature of weak mixing\nrather than exact values that take the effect of renormalization into account.\nIn\naddition, only one flavon field is introduced in the Lagrangian Eq. (2.1). Thus, C\ndoes not include the evaluation of the CP phase.\nEnergy scale\nmu,RG/MeV\nmc,RG/GeV\nmt,RG/GeV\n108 GeV\n0.69 ± 0.12\n0.350 ± 0.011\n102.49 ± 0.89\n1012 GeV\n0.56 ± 0.10\n0.283 ± 0.009\n85.07 ± 0.89\n1014 GeV (ext)\n0.49\n0.248\n77.10\n1015 GeV (ext)\n0.46\n0.235\n73.91\n1016 GeV (ext)\n0.44\n0.223\n70.93\n1017 GeV (ext)\n0.42\n0.211\n68.13\nEnergy scale\nmd,RG/MeV\nms,RG/MeV\nmb,RG/GeV\n108 GeV\n1.52 ± 0.11\n30.34 ± 2.65\n1.502 ± 0.018\n1012 GeV\n1.24 ± 0.09\n24.76 ± 2.17\n1.194 ± 0.015\n1014 GeV (ext)\n1.09\n21.76\n1.009\n1015 GeV (ext)\n1.03\n20.67\n0.945\n1016 GeV (ext)\n0.98\n19.65\n0.886\n1017 GeV (ext)\n0.93\n18.68\n0.830\nTable 2. This shows the renormalized masses and the extrapolated masses (ext) at each energy\nscale for the quarks. The renormalized masses are evaluated based on Ref. [27].\ns12\ns13\ns23\nδCP\n0.22501 ± 0.0006\n0.003732+0.000090\n−0.00008\n0.04183+0.00079\n−0.0006\n1.147 ± 0.02\nTable 3. Mixing angles and CP phase in the quark sector [28].\nA large intrinsic value indicates that an obtained charge assignment well reproduces\nthe renormalized masses and mixings 2. Such charge assignment is called a terminal state.\nSpecifically, the terminal state is defined to satisfy following requirements:\n|V(Q)| < V0,\nEα < V1\n(for ∀α),\nEij\nC < V2\n(for ∀i, j).\n(3.12)\nIn this paper, we adopt V0 = 10.0, V1 = 1.75, and V2 = 0.2. Here, V1 = 1.75 (V2 = 0.2)\nmeans that a ratio of the calculated masses (mixings) to the renormalized masses (observed\nmixings) satisfies 1.78 × 10−2 ≤rmass ≤56.2 (0.63 ≤rmixings ≤1.58).\n2In the present study, the intrinsic value is defined the same as in Ref. [6] to be based on the findings\nof the previous study. If the χ2 value is adopted for intrinsic value, the search can be conducted with more\nstatistical significance.\n– 10 –\nNote that we change the threshold value from V1 = 1.0 used in Ref. [6] to V1 = 1.75. In\nthat work, experimental masses at the electroweak scale, which are shown in Particle Data\nGroup [29], were used. On the other hand, this study considers renormalized masses that\nare smaller than those used in the previous research. For example, the up-quark mass shown\nin Ref. [28] is mu,exp = 2.16 MeV, and an allowed range for a terminal state in the case of\nV1 = 1.0 is 0.216 MeV ≤mu ≤21.6 MeV. However, mu,RG = 0.49 MeV for M = 1014 GeV\nas shown in Table 2, so an allowed range with the same V1 is 0.049 MeV ≤mu ≤4.9 MeV.\nIn other words, a tolerance ∆mu to reach a terminal state varies in the following way:\n∆mexp\nu\n(V1 = 1.0) =\n\u000010V1 −10−V1\u0001\nmu,exp = 21.4\n→∆mRG\nu\n(V1 = 1.0) =\n\u000010V1 −10−V1\u0001\nmu,RG = 4.9.\n(3.13)\nFor the agent, the smaller ∆mu becomes, the harder it is to reach a terminal state and the\nless experience it has to receive Rterm which is mentioned below. This means that the agent\ncannot learn the appropriate behavior to reach a terminal state. Thus, we adopt V1 = 1.75\nto promote the learning, and this allows the tolerance to remain comparable to the previous\nwork:\n∆mRG\nu\n(V1 = 1.75) = 27.5.\n(3.14)\nSince changes of the renormalized masses from 1014 GeV to 1017 GeV are relatively small,\nthe difference of tolerance has little effect on search results at each scale.\nThen, after\noptimizing the O(1) coefficients, we manually extract terminal states where nij is positive.\nMoreover, at this time, the reproducibility of the masses is ensured by extracting models\nthat satisfy V1 = 1.75 (0.1 ≤rmass ≤10.0).\nLet us denote the charge assignment Q as observed by the agent, and Q′ followed by\nthe action a. For a pair of the assignment and the action (Q, a), we give the agent rewards\nR. The rewarding procedure is exactly the same as in Ref. [6]; thereby we omit a detailed\ndescription in this paper 3. We adopt Roffset = −10 and Rterm = 100.\n4\nComparison with traditional methods\nIn this section, we show the distribution of terminal states of the quark sector, which is\nfound by the RL. We made 20 agents for each energy scale, and in total, it took 6 days to\ntrain the neural networks on a single CPU. The loss functions tend to be minimized, and\nwe also check for an increase in the sum of rewards. Thus, overfittings did not occur.\n3In many cases, the appropriate design of rewards requires heuristic construction depending on the\nenvironment and action space. In contrast, it has been pointed out that the design may be systematized\nby combining Bayesian statistics with RL [30]. Alternatively, by learning based on models in Bayesian\nstatistics, various algorithms have been developed that can perform learning even with small amounts of\ndata. “PILCO” [31] is one example.\n– 11 –\nBy performing the Monte-Carlo search with the Gaussian distribution described in\nSec. 3.3, the O(1) coefficients yij are optimized to more realistic ones. In other words,\nthe intrinsic values are surely optimized. We summarize the number of terminal states\nfound by the agents in Table 4. From this, the terminal states are relatively easy to find at\n1014, 1015 GeV.\nEnergy scale M\n1014 GeV\n1015 GeV\n1016 GeV\n1017 GeV\nTotal\nTerminal states\n710\n555\n374\n546\n2,185\nPositive nij\n434\n323\n236\n323\n1,316\nExtracted in V1 = 1.0\n44\n52\n24\n36\n156\nTable 4. The number of models at each scale. The terminal states consist of non-integer nij, so\nwe should narrow down according to the value of nij. Then, since they are searched in V1 = 1.75,\nwe extract models that satisfy V1 = 1.0 so that the errors of masses are within single-digit finally.\nOur statistical approach with RL is practically more efficient than brute force compu-\ntation. Let p be the fraction of charge pairs that satisfy V1 = 1.0 in the parameter space\ngenerated by the charge combinations. In our learning, we generated the following number\nof random sets of charges as initial states of each episode:\n4 scales × 20 agents × 105 episodes = 8 × 106 sets.\n(4.1)\nIn those, no terminal state is found. Therefore, it is reasonable to estimate p < 1/\n\u00008 × 106\u0001\n.\nLet t be the time required to find one terminal state that satisfies V1 = 1.75 using a method\nother than RL. Then, the total time T, which is required to find realistic models with a\nsimilar number of charges as those found in this work, can be estimated as T = 2,185 · t/p.\nWe tested various optimization methods of “SciPy”, which is a library of Python, to\nfind η satisfying Eq. (5.5). In Table 5, we show the results of actual measurements using\nthe same computer as in the case of RL. It turns out that the time required to find the\noptimal value of η relating to a particular set of FN charges is at least about 0.274 ms.\nThus, the total time T is estimated as follows:\nT > 2,185 × 0.274 ms ×\n\u00008 × 106\u0001\n∼55 days.\n(4.2)\nIn practice, optimization of couplings yij must also be performed, so the efficiency of the\nsearch by RL has a very large impact. Note that the SLSQP method is also used in our\nRL algorithm, and sufficiently fast optimization of η has been performed.\nMethod\nCalculation time (ms)\nMethod\nCalculation time (ms)\nNelder-Mead\n7.225 ± 0.063\nTNC\n0.737 ± 0.012\nPowell\n5.132 ± 0.033\nCOBYLA\n1.687 ± 0.011\nL-BFGS-B\n0.597 ± 0.012\nSLSQP\n0.274 ± 0.005\nTable 5. The scipy.optimize.minimize is used for searching an appropriate η.\n– 12 –\nWe show the distribution for all terminal states in Fig. 1. In addition, the distribution\nof the top 10 models with the highest intrinsic value is also shown to compare with an\naligned number of terminal states at each energy scale. In these, terminal states have high\nintrinsic values around M = 1014, 1015 GeV.\nThe distribution of the domain wall number NDW at each energy scale is shown in\nFig. 2. For all scales, the models are located around NDW = 30. In addition, Table 6\nshows the average of intrinsic values V for each NDW category at each scale. The table\nshows that the distribution of V varies from scale to scale. For example, the intrinsic value\ntends to be highest in the region of NDW ≥36 at M = 1014, 1017 GeV, so some cases\nwith small NDW are not expected to reproduce the renormalized masses.\nThe scale of\nM = 1015 GeV also tends to have large V at about NDW = 30 even considering the 1σ\nerror range. Since the model with the highest intrinsic value among the 156 terminal states\nis located at (M/GeV, NDW) =\n\u00001015, 36\n\u0001\n, it is still expected to be difficult to reproduce\nrenormalized masses with small NDW. On the other hand, for M = 1016 GeV, the category\nwith smaller NDW tends to have higher V. Although the analysis with M = 1016 GeV\nincludes the uncertainty due to the relatively large error, it would be possible that there\nare even smaller NDW terminal states at M = 1016 GeV.\nIn a previous study [1], an example with NDW = 26 was treated as a benchmark for\nroughly reproducing the flavor structure. By statistical analysis with RL as described above,\nthe lower limit of NDW reproducing the flavor structure may be around NDW = 20. In any\ncase, RL is useful as a flexible method to explore discrete parameters such as FN charges\nand to consider the constraints from cosmology and so on.\nFigure 1. k = log10 M means the energy scale and n is the number of models found in our numerical\nanalysis. The left figure shows the distribution of intrinsic values V for the whole terminal states.\nOn the other hand, we extract 10 models with high intrinsic values at each k in the right figure.\nRealistic models are numerous for k = 14, 15. In addition, their intrinsic values tend to be high.\nNote that the range of the vertical axis is different in each graph.\n– 13 –\nFigure 2.\nk = log10 M means the energy scale and n is the number of models found in our\nnumerical analysis. Our finding models are located around NDW = 30, and a minimum value is\nNDW = 20 at k = 17.\nNDW ∈[20, 28)\nNDW ∈[28, 36)\nNDW ∈[36, 44]\nk = 14\n−2.78 ± 0.13\n−2.71 ± 0.19\n−2.61 ± 0.20\nk = 15\n−2.89 ± 0.20\n−2.55 ± 0.15\n−2.91 ± 0.24\nk = 16\n−2.47 ± 0.27\n−2.77 ± 0.17\n−3.12 ± 0.26\nk = 17\n−2.69 ± 0.16\n−2.86 ± 0.17\n−2.44 ± 0.10\nTable 6. The terminal states at each energy scale are divided into three categories according to\nNDW, and the average intrinsic value in each category is shown with k = log10 M. The largest\naverages among the three categories are written in bold.\nThe distribution of intrinsic value is\ndifferent at each energy scale. Especially at k = 16, the smaller the NDW, the higher the intrinsic\nvalue.\n5\nExploring the flaxion physics\nFrom the results of RL, the flaxion decay constant fa, as well as the misalignment angle θi\ngiven by Eq. (2.29), can be fixed. Then we can set the upper bound for the inflationary\nscale Hinf through Eq. (2.30). Fig. 3 shows the correlation between inflationary scales and\nthe misalignment angles for each model. The colors of the data classify energy scales. The\nblue, red, green, and orange mean M = 1014, 1015, 1016, and 1017GeV respectively. The\ngray shaded region is excluded by Eq. (2.32). Therefore, we can state that M ≳1015 GeV\nmodels are favored by cosmology.\nIn this section, we discuss the flaxion phenomenology. To calculate the flaxion-photon\ncoupling, we should determine the FN charges for both quarks and leptons.\nThus, we\nrun some training for the lepton sector. Two benchmark points of the quark sector are\nshown in Table 7 and Table 8. Benchmark 1 has the highest intrinsic value in the case of\nM = 1015 GeV. On the other hand, benchmark 2 has the highest intrinsic value in the case\nof M = 1016 GeV.\n– 14 –\nFigure 3. The point clouds are formed at M = 1014 GeV (blue), 1015 GeV (red), 1016 GeV (green)\nand 1017 GeV (orange) in ascending order of Hinf. The gray area is the excluded region from the\ninflation scenario. Thus, all of the terminal states found at M = 1014 GeV are unsuitable due to\ncosmological constraints.\nCharges\nQ =\n \nQ1 Q2 Q3 u1 u2 u3 d1 d2 d3 H ϕ\n5\n5\n2\n1 −3 4 −4 −6 −4 2 1\n!\nO (1) coeff.\nyu ≃\n\n\n\n−1.483 −1.021 −0.996\n−1.513\n0.960\n0.866\n−1.219 −0.500\n0.400\n\n\n, yd ≃\n\n\n\n−1.117\n0.793\n1.291\n−1.087\n0.507 −1.313\n−0.868 −1.618 −0.929\n\n\n\nVEV\nη ≃0.255 · e1.533i\nIntrinsic value\nVopt ≃−0.953\nMasses\n(output)\n \nmu/MeV mc/GeV mt/GeV\nmd/MeV ms/MeV mb/GeV\n!\n≃\n \n0.289 0.222 69.79\n2.13\n20.70 0.938\n!\nRatios\n(masses)\n \nEu Ec Et\nEd Es Eb\n!\n≃\n \n0.205 0.025 0.025\n0.313 0.001 0.004\n!\nCKM matrix\n(output)\n|VCKM| ≃\n\n\n\n0.983 0.185 0.004\n0.184 0.982 0.041\n0.012 0.039 0.999\n\n\n\nRatios\n(mixings)\nEC ≃\n\n\n\n0.004 0.086 0.041\n0.086 0.004 0.010\n0.128 0.019 0.000\n\n\n\nTable 7. Benchmark 1 for the quark sector at M = 1015 GeV.\n– 15 –\nCharges\nQ =\n \nQ1 Q2 Q3 u1 u2 u3 d1 d2 d3 H\nϕ\n−2 −1 2\n1\n1 −2 7\n7\n8 −3 −1\n!\nO (1) coeff.\nyu ≃\n\n\n\n−0.980 −1.125 1.128\n−1.004 −0.660 1.076\n1.535\n1.148 0.400\n\n\n, yd ≃\n\n\n\n1.138 −1.178 −1.184\n−1.281 −0.899\n1.612\n−1.106\n1.243 −1.421\n\n\n\nVEV\nη ≃0.148 · e1.505i\nIntrinsic value\nVopt ≃−1.684\nMasses\n(output)\n \nmu/MeV mc/GeV mt/GeV\nmd/MeV ms/MeV mb/GeV\n!\n≃\n \n0.718 0.080 697.33\n0.67\n19.70 0.952\n!\nRatios\n(masses)\n \nEu Ec Et\nEd Es Eb\n!\n≃\n \n0.214 0.443 0.007\n0.163 0.001 0.032\n!\nCKM matrix\n(output)\n|VCKM| ≃\n\n\n\n0.985 0.170 0.003\n0.170 0.984 0.058\n0.013 0.057 0.998\n\n\n\nRatios\n(mixings)\nEC ≃\n\n\n\n0.005 0.121 0.074\n0.123 0.005 0.145\n0.179 0.142 0.000\n\n\n\nTable 8. Benchmark 2 for the quark sector at M = 1016 GeV.\nBy using those benchmarks, we also make the agent learn the lepton sector. We adopt\nNep = 6 × 104 and the other hyper-parameters are the same as the learning of the quark\nsector. We considered renormalized masses of the charged leptons shown in Table 9 and a\nconstraint for the sum of neutrino masses Σmν < 85 meV based on the ΛCDM model in\nRef. [32]. Moreover, we also check constraints for the mixing angles based on NuFIT v5.3.\nAn intrinsic value for the lepton sector is defined as\nV(Q) = Mlepton + P,\n(5.1)\nwith\nMlepton =\nX\nα=l\nEα,\n(5.2)\nP =\nX\ni,j\nEij\nP .\n(5.3)\nThe errors Eα,P are calculated in following ways:\nEα =\n\f\f\f\flog10\n\u0012 |mα|\n|mα,RG|\n\u0013 \f\f\f\f,\n(5.4)\nEij\nP =\n\n\n\n0.0\n(in 3σ CL ranges of Eq. (5.6))\n\f\f\f\flog10\n\u0012\n|V ij\nPMNS|\n|V ij\nPMNS, exp|\n\u0013 \f\f\f\f\n(other)\n.\n(5.5)\n– 16 –\nFrom NuFIT v5.3 and Ref. [33], 3σ CL ranges of the PMNS matrix are given by\n|VPMNS| =\n\n\n\n0.801 →0.842, 0.518 →0.580, 0.142 →0.155\n0.236 →0.507, 0.458 →0.691, 0.630 →0.779\n0.264 →0.527, 0.471 →0.700, 0.610 →0.762\n\n\n.\n(5.6)\nenergy\nme,RG/MeV\nmµ,RG/GeV\nmτ,RG/GeV\n108 GeV\n0.49691 ± 0.00098\n0.104681 ± 0.000183\n1.77852 ± 0.00308\n1012 GeV\n0.48388 ± 0.00139\n0.101936 ± 0.000277\n1.73194 ± 0.00466\n1014 GeV (ext)\n0.47856\n0.100813\n1.71303\n1015 GeV (ext)\n0.47733\n0.100550\n1.70871\n1016 GeV (ext)\n0.47747\n0.100577\n1.70936\n1017 GeV (ext)\n0.47931\n0.100961\n1.71614\nTable 9. This shows the renormalized masses and the extrapolated masses (ext) at each energy\nscale for the charged leptons. The renormalized masses are evaluated based on Ref. [27].\nWe make 6 agents for each of the benchmarks and need 15 hours on a single CPU\nfor the whole learning process. In the training, we fix the normal ordering of neutrino\nmasses. The number of terminal states found by the agent is summarized in Table 10.\nFor M = 1015 GeV, we find 4,732 terminal states, and among them, 23 models satisfy the\n3σ constraints for the mixing angles θ12, θ13, θ23. On the other hand, for M = 1016 GeV,\nwe find few terminal states with V2 = 0.2, and no state satisfies all of the constraints for\nthe mixing angles. Thus, similar to the evaluation of renormalized masses, we repeat the\nlearning process with V2 = 0.3 and then narrow down terminal states to V2 = 0.2. We then\nobtain 6,219 terminal states, and among them, 7 models satisfy the 3σ constraints for the\nmixing angles. Finally, 30 models were extracted by considering the mixing constraints,\nwhich were chosen as benchmarks for the lepton sector. The details of these benchmarks\nfor the lepton sector are summarized in Appendix A.\nThe tendency for the number of terminal states at M = 1015, 1016 GeV are different\ndue to the value of M in the neutrino mass matrix. In other words, the change in M\ncomplicates the reproduction of the mixing matrix. The appropriate value of V2 at each\nenergy scale needs to be analyzed, but we leave this issue for future work.\nThe flaxion-photon coupling is given by using the charges obtained from the results of\nRL. Note that the charges of both quarks and leptons are needed to calculate the coupling.\nTherefore, we chose the charge pairs for benchmark 1 in Tables 7 and 11 or benchmark 2\nin Tables 8 and 12. Fig. 4 shows the effective coupling constant based on the charges of\nthe benchmark models. This mass range will be explored in the future experiment, ex.,\nDMRadio-m3 in Ref. [7]. In this figure, only the results at M = 1015 GeV are within the\nsensitivity region of the DMRadio-m3. However, the calculated values at M = 1016 GeV are\nalso close to the sensitivity region. Therefore, it is expected that the RL with the appro-\npriate value of V2 will lead to the discovery of models that overlap in the same sensitivity\nregion in a short time.\n– 17 –\nBenchmark 1\nBenchmark 2\nEnergy scale M\n1015 GeV\n1016 GeV\nTerminal states\n4,732\n6,219\nPositive nij\n575\n451\nExtracted in (V1, V2) = (1.0, 0.2)\n364\n197\nExtracted in Σmν < 85 meV\n361\n197\nExtracted in mixing angles\n23\n7\nTable 10. This shows the number of models for the lepton sector based on the benchmark point of\nthe quark sector. The terminal states include non-integer nij, so we should narrow down according\nto the value of nij. Since they are limited by V1 = 1.75, we extract models that satisfy V1 = 1.0 so\nthat the errors of masses are within single-digit. Finally, the constraint Σmν < 85 meV from Ref.\n[32] and the 3σ constraints for the mixing angles from NuFIT v5.3 are considered.\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n3\n3\n4 −4 −4 −5 −8 −4 −2 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.810 −1.032 −0.321\n1.169 −0.925 −0.784\n−0.910 −0.714 −0.939\n\n\n, yν ≃\n\n\n\n−0.928 0.674 −1.224\n0.743 1.088\n1.250\n1.152 0.613 −1.377\n\n\n\nyN ≃\n\n\n\n−1.095 −1.146 0.987\n−1.146 −1.352 0.721\n0.987\n0.721 1.209\n\n\n\nIntrinsic value\nVopt ≃−0.321\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.57815\n0.116738\n2.54709\n4.475 × 10−7 8.178 × 10−7 3.761 × 10−6\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.825 0.544 0.151\n0.298 0.647 0.702\n0.479 0.534 0.696\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.185π 0.048π 0.251π\n\u0011\nTable 11. Benchmark point for the lepton sector. The VEV is same as Table 7, and this has the\nhighest intrinsic value among the models which are found by the agent.\n– 18 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H\nϕ\n−4 −4 −4 3\n8\n1\n6 3 2 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.652 −1.396\n1.040\n−1.175 −1.376 −1.075\n1.171 −1.295 −0.925\n\n\n, yν ≃\n\n\n\n0.815\n0.553 −0.837\n0.903 −1.349\n1.040\n1.326 −1.310 −0.467\n\n\n\nyN ≃\n\n\n\n1.068 −1.147\n0.874\n−1.147\n1.003\n1.487\n0.874\n1.487 −0.885\n\n\n\nIntrinsic value\nVopt ≃−0.595\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.46065\n0.188688\n1.00064\n1.724 × 10−12 9.254 × 10−12 2.056 × 10−11\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.834 0.531 0.151\n0.456 0.508 0.731\n0.311 0.679 0.665\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.180π 0.048π 0.265π\n\u0011\nTable 12. Benchmark point for the lepton sector. The VEV is the same as Table 8, and this has\nthe highest intrinsic value among the models which are found by the agent.\nFigure 4. Right circles (Red) and left triangles (green) are the results calculated by using the\nFN charges of the lepton sector corresponding to Benchmarks 1 and 2, respectively. The gray area\nindicates the region excluded by existing experiments. On the other hand, the blue area indicates\nthe sensitivity of DMRadio-m3 proposed in Ref. [7].\n– 19 –\n6\nConclusion\nFlavor symmetries give many insights into new physics beyond the Standard Model. Re-\ncently, there have been many works analyzing theoretical models with machine learning.\nUnder these circumstances, RL can be a new statistical analysis method to capture features\nof the models that are difficult to observe in sequential calculations. In particular, RL is\nuseful for solving issues which are difficult within conventional descent approaches.\nIn this paper, we constructed a new algorithm to search for the model parameters in\nthe minimal axion model from flavor following the RL-based search strategy, where the\nflavor structure had been analyzed in Ref. [34] and Ref. [6]. In Sec. 2, we introduced\nthe U(1) flavor model with the FN mechanism, and a pseudo-scalar field arising from the\nimaginary component of the flavon. Then, in Sec. 3, we designed RL to find U(1) charge\nassignments of the quark sector and considered renormalizing effects for masses. In Sec. 4,\nwe studied the statistical differences at the four energy scales, i.e., M = 1014, 1015, 1016, 1017\nGeV, by training 20 agents at each scale. Through 6 days of neural network training, the\nagents found a total of 156 terminal states that had errors within single-digit from the\nrenormalized masses. In addition, we estimated the time required to discover the same\nnumber of terminal states without using RL. For various optimization methods, we require\nthe total time of at least 55 days. This indicates that the RL-based search method for\ndiscrete parameters is faster than conventional computational methods. We also discussed\nthe phenomenology of the flaxion in Sec. 5, taking the constraints from the dark matter,\nthe isocurvature perturbation and the inflation into account. It turned out that U(1) charge\nassignments with high intrinsic values are realized around M = 1014, 1015 GeV, although\nthe isocurvature constraint puts a lower bound on M, i.e., M ≳1015 GeV. Note that\nthe reproducibility of renormalized masses depends on the energy scales. Furthermore, we\nran additional training for the lepton sector for the benchmarks of quarks. As a result,\nwe found some terminal states of the leptons that satisfy the constraints of the sum of\nneutrino masses and mixing angles. From those states, we show the distribution of the\nflaxion mass and flaxion-photon coupling at M = 1015, 1016 GeV, which will be explored\nin future experiments such as DMRadio-m3 [7]. Our proposed RL-based efficient analysis\nmay provide a statistical perspective not only for our discussion of the cosmological axion\nmodel but also for other particle phenomenology as well as cosmology.\nBefore closing our paper, we will mention possible future works:\n• In this work, since only one flavon field is introduced, we are not able to derive the\nCP-symmetry breaking in the quark sector. One way to improve this situation is to\nintroduce two flavons and consider the phase difference between them. In this case,\none of the two flaxions will be regarded as the QCD axion, and the mechanism of mass\ngeneration for the other flaxion in the orthogonal direction should be discussed. Al-\nternatively, another way to derive CP-symmetry breaking is to consider the complex\nYukawa couplings. In this case, it is nontrivial whether RL can find many terminal\nstates immediately. That is because the parameter space of Yukawa couplings gener-\nated in the first step of learning is expanded. Then, it is also useful to discuss how\n– 20 –\nthe degree of the FN charge space has been explored by the agent when no terminal\nstate is found in a single training session for fixed Yukawa couplings.\n• We focused on the specific axion model with U(1) flavor symmetry, but our neural\nnetwork architecture can be applied to other axion models as well as flavors by replac-\ning the input data with the appropriate ones. Furthermore, it would be interesting to\nverify the axion from other experiments and cosmological observations by using the\nRL-based strategy, but we leave comprehensive studies for future work.\n• Our architecture of the neural network follows a previous study [6]. This network\nhas about 10,000 parameters, so in total, one agent has 20,000 parameters to be\noptimized since two types of neural networks are used in DQN (Q network and target\nnetwork). In this study, the parameters of the two networks were initialized in the first\nepisode. Since each agent works through a different learning process independently,\nthe parameters of the networks differ for each agent.\nOn the other hand, neural\nnetworks are known to exhibit the phenomenon of “generalization”. This is the ability\nto make appropriate classifications or predictions for unknown data that have never\nbeen observed.\nOur networks output optimal actions even for sets of FN charges\nthat have not been inputted before. This attempt itself is established based on the\ngeneralization ability.\nHowever, in the sense that the generalization is only valid\nfor certain fixed Yukawa couplings, this study does not fully make good use of the\nunique strengths of neural networks. Thus, preparing a larger-scale architecture is a\nstepping stone to realizing a more generalized search strategy by RL. If we construct\nneural networks that can output the optimal action for arbitrary Yukawa couplings,\nthe learning itself can be done only once, and further reduction of computational time\nis expected.\nAcknowledgments\nThis work was supported in part by Kyushu University’s Innovator Fellowship Program (S.\nN., C. M.), JSPS KAKENHI Grant Numbers JP23H04512 (H.O).\n– 21 –\nA\nBenchmark points for lepton sector\nA.1\nThe case of 1015 GeV\nWe show benchmarks for the leptons at M = 1015 GeV. Note that the VEV is the same as\nTable 7. Following tables are ordered by the intrinsic values.\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n3\n3\n4 −4 −4 −5 −8 −4 −2 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.810 −1.032 −0.321\n1.169 −0.925 −0.784\n−0.910 −0.714 −0.939\n\n\n, yν ≃\n\n\n\n−0.928 0.674 −1.224\n0.743 1.088\n1.250\n1.152 0.613 −1.377\n\n\n\nyN ≃\n\n\n\n−1.095 −1.146 0.987\n−1.146 −1.352 0.721\n0.987\n0.721 1.209\n\n\n\nIntrinsic value\nVopt ≃−0.321\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.57815\n0.116738\n2.54709\n4.475 × 10−6 8.178 × 10−5 3.761 × 10−4\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.825 0.544 0.151\n0.298 0.647 0.702\n0.479 0.534 0.696\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.185π 0.048π 0.251π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n4\n5 −2 −9 −7 −5 −2 −4 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.963 0.894\n0.873\n1.020 1.320 −1.311\n0.908 0.616\n1.089\n\n\n, yν ≃\n\n\n\n0.536 −0.883\n0.921\n−1.371 −0.904 −0.975\n−0.959 −1.103\n1.298\n\n\n\nyN ≃\n\n\n\n1.143 −1.011\n1.444\n−1.011\n1.287\n0.649\n1.444\n0.649 −1.082\n\n\n\nIntrinsic value\nVopt ≃−0.335\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.50593\n0.071445\n1.17743\n3.316 × 10−7 5.354 × 10−7 7.069 × 10−6\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.825 0.544 0.153\n0.491 0.556 0.671\n0.280 0.628 0.726\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.186π 0.049π 0.237π\n\u0011\n– 22 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H ϕ\n8\n8\n9 −2 −8 0\n2 −2 0 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n1.398\n1.025 −1.205\n1.179 −0.946\n0.882\n−0.973 −1.312\n1.064\n\n\n, yν ≃\n\n\n\n−1.013\n1.028 0.860\n−1.250 −1.370 1.168\n1.408\n1.130 0.635\n\n\n\nyN ≃\n\n\n\n1.197 −0.612\n1.020\n−0.612 −0.735 −0.890\n1.020 −0.890 −0.984\n\n\n\nIntrinsic value\nVopt ≃−0.463\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.29641\n0.070178\n1.35618\n4.884 × 10−12 3.498 × 10−11 3.151 × 10−10\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.821 0.551 0.146\n0.484 0.538 0.690\n0.302 0.638 0.709\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.188π 0.047π 0.246π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n2\n2\n3 −8 −5 −7 −3 −8 −6 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.406\n0.979\n0.625\n0.816\n1.028 −1.222\n−0.890 −1.556 −1.123\n\n\n, yν ≃\n\n\n\n−1.140 −0.935 −1.551\n−0.897\n0.761\n1.083\n−0.902 −1.061\n1.135\n\n\n\nyN ≃\n\n\n\n−1.397 −1.127 −1.309\n−1.127\n0.516 −1.077\n−1.309 −1.077 −1.393\n\n\n\nIntrinsic value\nVopt ≃−0.578\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.35035\n0.057377\n2.70682\n8.581 × 10−5 6.419 × 10−4 1.336 × 10−2\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.818 0.554 0.154\n0.278 0.616 0.737\n0.503 0.561 0.658\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.189π 0.049π 0.268π\n\u0011\n– 23 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n5\n4\n5 −7 −5 −8 −5 −1 −4 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.850 −0.895\n1.098\n1.145\n0.584\n0.945\n−1.057 −0.914 −0.950\n\n\n, yν ≃\n\n\n\n0.966 −0.676 −0.774\n0.427 −1.293\n1.260\n−1.075\n0.965 −0.950\n\n\n\nyN ≃\n\n\n\n1.116 0.968 1.203\n0.968 1.136 1.075\n1.203 1.075 1.059\n\n\n\nIntrinsic value\nVopt ≃−0.637\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.54572\n0.029910\n1.92809\n1.164 × 10−8 5.437 × 10−6 1.966 × 10−5\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.814 0.560 0.153\n0.499 0.541 0.677\n0.297 0.628 0.720\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.192π 0.049π 0.240π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n3\n4 −1 −3 −2 −7 −3 −4 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.717\n0.716 0.960\n−1.300 −1.192 1.586\n−1.240 −0.578 1.225\n\n\n, yν ≃\n\n\n\n−1.022 −1.462\n0.763\n−0.515 −0.946 −0.931\n−0.924\n1.167\n0.668\n\n\n\nyN ≃\n\n\n\n1.081\n1.196\n1.299\n1.196\n1.172 −0.455\n1.299 −0.455 −0.887\n\n\n\nIntrinsic value\nVopt ≃−0.710\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.19203\n0.088546\n0.93953\n5.174 × 10−6 7.689 × 10−6 1.482 × 10−5\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.809 0.569 0.145\n0.338 0.654 0.676\n0.480 0.498 0.722\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.195π 0.046π 0.240π\n\u0011\n– 24 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H ϕ\n8\n8\n9 −3 −8 −6 2 −1 1 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.948 −1.089 −0.508\n1.817 −1.052\n1.125\n1.488 −1.128\n1.333\n\n\n, yν ≃\n\n\n\n−0.804 −1.092 −0.790\n−0.644\n0.620 −0.793\n1.113 −0.928\n1.219\n\n\n\nyN ≃\n\n\n\n1.005 −1.203 −1.475\n−1.203\n0.550 −1.382\n−1.475 −1.382 −0.796\n\n\n\nIntrinsic value\nVopt ≃−0.778\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n1.40507\n0.184622\n1.53861\n1.124 × 10−14 3.755 × 10−11 3.824 × 10−11\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.806 0.574 0.144\n0.323 0.632 0.705\n0.495 0.522 0.695\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.197π 0.046π 0.252π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n4\n5\n0 −9 −2 −2 −5 −3 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.996 0.700\n0.367\n1.067 0.802\n1.142\n0.964 1.077 −1.064\n\n\n, yν ≃\n\n\n\n−0.947 −0.389 −0.819\n−1.113\n0.951\n0.777\n1.197 −0.949 −0.942\n\n\n\nyN ≃\n\n\n\n−1.015\n0.769 −0.747\n0.769\n0.765 −0.894\n−0.747 −0.894 −0.946\n\n\n\nIntrinsic value\nVopt ≃−0.822\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n1.14824\n0.125244\n1.10475\n1.517 × 10−9 1.953 × 10−6 6.610 × 10−6\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.823 0.547 0.154\n0.465 0.491 0.737\n0.328 0.678 0.658\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.187π 0.049π 0.268π\n\u0011\n– 25 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n1\n1\n2 −1 −7 −1 −5 −7 −6 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.369\n0.760 −1.134\n−0.968 −0.850 −0.777\n−1.004 −0.839 −0.776\n\n\n, yν ≃\n\n\n\n1.286 −0.867 1.232\n−0.895\n1.418 0.894\n−1.083 −0.940 1.211\n\n\n\nyN ≃\n\n\n\n−0.494 0.849\n1.207\n0.849 1.357\n0.957\n1.207 0.957 −1.132\n\n\n\nIntrinsic value\nVopt ≃−0.830\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.59596\n0.251105\n0.78891\n2.244 × 10−3 3.333 × 10−3 9.258 × 10−2\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.829 0.538 0.152\n0.479 0.543 0.690\n0.288 0.645 0.708\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.183π 0.049π 0.246π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n4\n5 −2 −3 −3 −7 −3 −4 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n1.035 −0.908 −1.208\n1.088\n1.092 −1.579\n−1.249\n0.405 −1.881\n\n\n, yν ≃\n\n\n\n0.946 −0.940 1.418\n0.888\n1.071 1.011\n−0.955 −1.163 1.186\n\n\n\nyN ≃\n\n\n\n−0.942 −1.342 −1.523\n−1.342\n1.276\n1.198\n−1.523\n1.198\n0.919\n\n\n\nIntrinsic value\nVopt ≃−0.868\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.51886\n0.094567\n0.26772\n1.401 × 10−7 2.510 × 10−6 7.317 × 10−5\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.821 0.550 0.155\n0.253 0.592 0.766\n0.513 0.589 0.624\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.188π 0.049π 0.282π\n\u0011\n– 26 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n3\n4\n4 −1 −4 −8 −2 −6 −7 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.390 −1.245 −0.905\n1.056\n1.442\n0.743\n1.159\n1.087\n1.182\n\n\n, yν ≃\n\n\n\n1.001\n1.276\n1.324\n−1.020 −0.978 −0.749\n−0.818\n1.201\n0.999\n\n\n\nyN ≃\n\n\n\n0.858 −0.914 −0.839\n−0.914\n0.854 −0.988\n−0.839 −0.988\n1.293\n\n\n\nIntrinsic value\nVopt ≃−0.949\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.38264\n0.014974\n1.60993\n4.912 × 10−8 2.981 × 10−6 1.844 × 10−4\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.823 0.548 0.151\n0.258 0.597 0.760\n0.506 0.587 0.632\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.187π 0.048π 0.279π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n6\n6\n7 −5 −9 0 −3 −1 −1 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.546\n1.157 −0.515\n0.874 −1.025\n1.105\n−0.883\n0.700 −1.044\n\n\n, yν ≃\n\n\n\n−1.006 0.713 −1.098\n0.847 0.822\n1.051\n1.290 1.127 −1.126\n\n\n\nyN ≃\n\n\n\n−0.985 −1.079 −1.145\n−1.079 −1.029 −1.071\n−1.145 −1.071 −0.604\n\n\n\nIntrinsic value\nVopt ≃−0.954\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.33117\n0.075216\n0.36599\n5.619 × 10−9 7.186 × 10−9 2.842 × 10−7\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.823 0.548 0.148\n0.466 0.502 0.729\n0.326 0.669 0.668\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.187π 0.047π 0.264π\n\u0011\n– 27 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n4\n5 −7 −7 −6 −6 −3 −4 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−1.156 −1.212 −0.915\n−0.706\n0.674 −1.390\n−1.084\n1.150 −1.238\n\n\n, yν ≃\n\n\n\n−0.885\n1.215 −1.136\n−0.995 −0.873 −1.130\n0.847 −1.302 −0.920\n\n\n\nyN ≃\n\n\n\n0.907\n0.839\n1.212\n0.839 −1.634 −0.799\n1.212 −0.799\n0.696\n\n\n\nIntrinsic value\nVopt ≃−0.958\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.51912\n0.080900\n0.26552\n4.688 × 10−7 2.551 × 10−6 7.757 × 10−6\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.833 0.534 0.143\n0.303 0.657 0.690\n0.462 0.532 0.710\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.181π 0.046π 0.246π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n4\n5 −4 0 −7 −7 −4 −3 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−1.166\n1.411 −1.216\n−0.939\n0.645\n1.066\n−1.001 −0.892 −1.028\n\n\n, yν ≃\n\n\n\n1.091 −1.437 −0.851\n−0.971 −0.766\n1.027\n−0.585 −1.023\n1.345\n\n\n\nyN ≃\n\n\n\n1.048 −0.507\n1.165\n−0.507\n1.182\n1.298\n1.165\n1.298 −1.406\n\n\n\nIntrinsic value\nVopt ≃−0.958\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.42420\n0.069048\n0.30810\n2.754 × 10−8 1.989 × 10−6 4.726 × 10−6\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.807 0.573 0.145\n0.485 0.502 0.716\n0.338 0.648 0.683\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.197π 0.046π 0.258π\n\u0011\n– 28 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H ϕ\n7\n6\n7 −4 −7 −7 0 2 −5 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.615\n1.039 −1.143\n0.477\n0.677 −1.155\n−1.099 −1.004 −0.832\n\n\n, yν ≃\n\n\n\n−0.985 −1.396 −0.960\n0.657\n1.157 −1.294\n−0.703 −0.948 −1.041\n\n\n\nyN ≃\n\n\n\n−1.006\n0.882\n0.558\n0.882 −1.056 −0.847\n0.558 −0.847\n0.589\n\n\n\nIntrinsic value\nVopt ≃−1.112\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.47722\n0.255129\n8.71773\n3.531 × 10−15 9.909 × 10−9 6.345 × 10−8\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.812 0.565 0.147\n0.290 0.609 0.739\n0.507 0.557 0.658\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.193π 0.047π 0.268π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H ϕ\n6\n7\n7 −6 −8 −8 2 0 −4 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.695\n0.703 0.702\n−1.072 −1.293 0.816\n1.013\n0.934 1.073\n\n\n, yν ≃\n\n\n\n1.355 −0.705 1.423\n0.986 −1.266 0.730\n0.788 −0.984 1.567\n\n\n\nyN ≃\n\n\n\n1.103\n1.093\n0.772\n1.093 −1.115\n0.905\n0.772\n0.905 −1.038\n\n\n\nIntrinsic value\nVopt ≃−1.122\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.50280\n0.041922\n8.95755\n2.236 × 10−10 8.061 × 10−10 5.388 × 10−9\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.818 0.556 0.147\n0.304 0.635 0.710\n0.489 0.536 0.688\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.190π 0.047π 0.255π\n\u0011\n– 29 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n2\n2 −5 −8 0 −8 −3 −7 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.993 −1.019 −0.765\n1.091\n1.168 −1.515\n−1.132\n0.729\n0.885\n\n\n, yν ≃\n\n\n\n1.556\n0.977 −0.725\n1.116 −0.906\n1.181\n0.395 −1.202 −0.935\n\n\n\nyN ≃\n\n\n\n1.288\n0.347 1.142\n0.347 −1.248 0.900\n1.142\n0.900 0.967\n\n\n\nIntrinsic value\nVopt ≃−1.144\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.41096\n0.019511\n3.97394\n5.937 × 10−5 1.185 × 10−4 8.285 × 10−3\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.826 0.545 0.145\n0.263 0.600 0.756\n0.499 0.586 0.638\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.186π 0.046π 0.277π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n4\n5 −1 0 −6 −7 −3 −4 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−1.029\n1.092\n1.035\n1.138\n0.861 −0.925\n−0.784 −1.103 −0.706\n\n\n, yν ≃\n\n\n\n1.088 −1.299 0.974\n−0.889 −0.740 1.129\n1.169\n1.114 1.271\n\n\n\nyN ≃\n\n\n\n−0.972\n0.902 −1.050\n0.902 −0.775\n1.136\n−1.050\n1.136 −0.839\n\n\n\nIntrinsic value\nVopt ≃−1.220\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.28375\n0.065479\n0.26595\n1.923 × 10−6 2.699 × 10−6 6.037 × 10−4\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.839 0.524 0.145\n0.452 0.525 0.721\n0.302 0.671 0.678\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.178π 0.046π 0.260π\n\u0011\n– 30 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n5\n5\n6 −1 −6 −5 −5 −2 −3 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n1.165\n1.350 −0.629\n−1.176 −0.856 −1.143\n1.718\n0.740 −0.643\n\n\n, yν ≃\n\n\n\n−1.354 −0.963\n1.316\n−0.626 −1.025 −0.999\n−1.139\n0.651 −0.451\n\n\n\nyN ≃\n\n\n\n−0.712 −0.744 −1.013\n−0.744\n1.545\n0.950\n−1.013\n0.950 −0.926\n\n\n\nIntrinsic value\nVopt ≃−1.237\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.90616\n0.062690\n0.30145\n2.554 × 10−8 5.640 × 10−8 1.407 × 10−6\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.801 0.580 0.147\n0.346 0.650 0.676\n0.488 0.491 0.722\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.199π 0.047π 0.240π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n4\n4\n5 −5 −9 −5 −1 −7 −5 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.725 −0.861 −0.907\n1.049\n0.620 −1.094\n−1.168\n1.079 −0.770\n\n\n, yν ≃\n\n\n\n0.844\n0.937 −0.705\n−1.417\n0.903 −1.098\n1.359 −1.399 −0.783\n\n\n\nyN ≃\n\n\n\n−1.024 −0.748 −1.253\n−0.748 −1.321\n0.791\n−1.253\n0.791\n1.241\n\n\n\nIntrinsic value\nVopt ≃−1.335\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.43970\n0.016993\n3.77445\n3.177 × 10−7 1.472 × 10−6 7.500 × 10−6\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.843 0.519 0.143\n0.466 0.571 0.676\n0.269 0.636 0.723\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.176π 0.046π 0.239π\n\u0011\n– 31 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n3\n3\n4 −1 −4 −5 −8 −2 −1 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.995\n0.891\n0.892\n−1.111\n1.040\n0.904\n−0.835 −1.267 −1.245\n\n\n, yν ≃\n\n\n\n1.145\n0.929 0.803\n−1.055\n0.881 0.641\n−1.163 −1.461 0.902\n\n\n\nyN ≃\n\n\n\n1.153 −0.802 1.079\n−0.802 −1.238 1.087\n1.079\n1.087 1.255\n\n\n\nIntrinsic value\nVopt ≃−1.433\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.43090\n0.274049\n15.33941\n6.446 × 10−6 2.046 × 10−5 8.656 × 10−5\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.835 0.529 0.149\n0.287 0.651 0.703\n0.469 0.545 0.695\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.180π 0.048π 0.252π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1\nl2\nl3 H ϕ\n1\n1\n2 −7 −9 0 −3 −7 −6 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−1.394\n1.351 −1.084\n−0.496\n0.590\n1.240\n0.893 −0.953 −1.379\n\n\n, yν ≃\n\n\n\n−1.285 −0.877\n0.999\n1.073\n1.395 −1.372\n−0.755 −0.588 −0.539\n\n\n\nyN ≃\n\n\n\n−1.647 −0.933\n0.916\n−0.933 −0.810 −0.952\n0.916 −0.952 −1.052\n\n\n\nIntrinsic value\nVopt ≃−1.572\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.60598\n0.298396\n16.92295\n2.110 × 10−4 5.616 × 10−3 9.628 × 10−3\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.818 0.557 0.147\n0.317 0.649 0.692\n0.480 0.519 0.707\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.190π 0.047π 0.246π\n\u0011\n– 32 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2\nl3 H ϕ\n7\n8\n8 −2 −4 −8 2 −2 −5 2 1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.720\n1.157 0.683\n−1.058\n1.405 0.757\n1.298 −0.971 1.274\n\n\n, yν ≃\n\n\n\n0.919 −1.133\n0.728\n0.890\n1.450\n1.382\n1.003 −1.161 −1.245\n\n\n\nyN ≃\n\n\n\n1.206 −0.872 −1.036\n−0.872 −0.978\n0.591\n−1.036\n0.591 −1.118\n\n\n\nIntrinsic value\nVopt ≃−2.070\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.06487\n0.011648\n2.41311\n8.151 × 10−11 1.627 × 10−10 4.678 × 10−10\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.806 0.573 0.147\n0.278 0.586 0.761\n0.522 0.573 0.632\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.197π 0.047π 0.279π\n\u0011\nA.2\nThe case of 1016 GeV\nWe show benchmarks for the leptons at M = 1016 GeV. Note that the VEV is the same as\nTable 8. Following tables are ordered by the intrinsic values.\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H\nϕ\n−4 −4 −4 3\n8\n1\n6 3 2 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.652 −1.396\n1.040\n−1.175 −1.376 −1.075\n1.171 −1.295 −0.925\n\n\n, yν ≃\n\n\n\n0.815\n0.553 −0.837\n0.903 −1.349\n1.040\n1.326 −1.310 −0.467\n\n\n\nyN ≃\n\n\n\n1.068 −1.147\n0.874\n−1.147\n1.003\n1.487\n0.874\n1.487 −0.885\n\n\n\nIntrinsic value\nVopt ≃−0.595\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.46065\n0.188688\n1.00064\n1.724 × 10−12 9.254 × 10−12 2.056 × 10−11\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.834 0.531 0.151\n0.456 0.508 0.731\n0.311 0.679 0.665\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.180π 0.048π 0.265π\n\u0011\n– 33 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3\nH\nϕ\n−7 −7 −8 0\n8\n7 −2 1 −1 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n0.914\n1.041\n1.494\n0.895 −0.960\n1.102\n−0.626\n1.497 −0.701\n\n\n, yν ≃\n\n\n\n1.006 −0.919\n0.684\n−0.766 −0.547 −0.671\n1.029\n1.115 −1.081\n\n\n\nyN ≃\n\n\n\n1.238 −0.823 −0.964\n−0.823\n1.372\n1.099\n−0.964\n1.099 −1.332\n\n\n\nIntrinsic value\nVopt ≃−0.852\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.80136\n0.145047\n5.01901\n7.459 × 10−18 2.919 × 10−17 1.434 × 10−16\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.803 0.578 0.146\n0.348 0.653 0.673\n0.484 0.489 0.725\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.199π 0.047π 0.238π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H\nϕ\n−4 −4 −4 3\n1\n7\n5 1 2 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.852 −0.887 1.019\n−1.008 −1.517 1.229\n−1.024 −1.058 0.705\n\n\n, yν ≃\n\n\n\n−1.082 −0.531 −0.937\n−1.280\n0.913\n0.857\n−1.075\n0.843\n1.381\n\n\n\nyN ≃\n\n\n\n0.961 1.197 0.678\n1.197 0.721 0.963\n0.678 0.963 1.007\n\n\n\nIntrinsic value\nVopt ≃−1.025\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.56125\n0.187528\n7.91476\n2.236 × 10−12 6.171 × 10−12 6.840 × 10−11\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.820 0.554 0.143\n0.487 0.545 0.683\n0.300 0.630 0.716\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.189π 0.046π 0.242π\n\u0011\n– 34 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H\nϕ\n−6 −6 −6 0\n2\n7\n5 1 0 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.904\n0.448 −0.970\n1.449\n0.821\n0.675\n0.780 −0.970 −1.099\n\n\n, yν ≃\n\n\n\n−1.044 −0.849 −0.503\n0.940 −1.495 −0.779\n−0.970\n1.413\n0.590\n\n\n\nyN ≃\n\n\n\n1.232 −0.812 0.917\n−0.812\n0.809 1.028\n0.917\n1.028 0.990\n\n\n\nIntrinsic value\nVopt ≃−1.124\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.07069\n0.094949\n0.91865\n3.144 × 10−16 3.918 × 10−16 1.417 × 10−14\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.815 0.561 0.147\n0.489 0.528 0.694\n0.311 0.637 0.705\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.192π 0.047π 0.247π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H\nϕ\n−4 −4 −4 9\n9\n8\n4 1 2 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n1.309 −0.891 −1.023\n0.774 −1.253 −1.132\n−0.956 −1.078 −0.395\n\n\n, yν ≃\n\n\n\n0.843 −0.959 −0.725\n0.890 −0.690\n1.089\n1.230\n1.485\n0.862\n\n\n\nyN ≃\n\n\n\n1.069\n1.671 −0.779\n1.671\n1.767 −0.738\n−0.779 −0.738 −0.553\n\n\n\nIntrinsic value\nVopt ≃−1.560\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n1.26735\n0.325209\n7.23693\n3.831 × 10−12 2.887 × 10−11 8.116 × 10−11\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.825 0.544 0.154\n0.468 0.504 0.726\n0.317 0.670 0.671\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.186π 0.049π 0.263π\n\u0011\n– 35 –\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H\nϕ\n−4 −4 −4 0\n6\n0\n6 4 3 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n1.051 −0.993\n1.379\n0.842\n0.924 −1.288\n−1.070\n1.056\n1.029\n\n\n, yν ≃\n\n\n\n−1.075\n0.901\n0.903\n1.154 −1.072 −1.325\n−1.228 −1.251 −0.825\n\n\n\nyN ≃\n\n\n\n−1.126\n1.229 −0.679\n1.229\n0.914 −0.885\n−0.679 −0.885 −1.182\n\n\n\nIntrinsic value\nVopt ≃−1.993\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.36609\n0.019676\n0.18129\n6.045 × 10−13 1.651 × 10−12 3.870 × 10−11\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.831 0.537 0.146\n0.495 0.593 0.635\n0.255 0.600 0.758\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.183π 0.047π 0.222π\n\u0011\nCharges\nQ =\n \nL1 L2 L3 N1 N2 N3 l1 l2 l3 H\nϕ\n−7 −7 −7 4\n9\n5\n4 1 0 −3 −1\n!\nO (1) coeff.\nyl ≃\n\n\n\n−0.893\n1.493 −0.743\n−0.833 −1.364 −1.453\n−1.026\n1.150\n1.274\n\n\n, yν ≃\n\n\n\n−1.235 −0.730 −1.313\n1.024\n0.990 −1.357\n−1.271 −1.372\n1.223\n\n\n\nyN ≃\n\n\n\n−1.364 −1.711\n0.874\n−1.711 −0.857 −1.227\n0.874 −1.227 −1.230\n\n\n\nIntrinsic value\nVopt ≃−2.605\nMasses\n(output)\n \nme/MeV mµ/GeV mτ/GeV\nmν1/meV mν2/meV mν3/meV\n!\n≃\n \n0.05448\n0.025337\n0.17501\n5.824 × 10−18 1.987 × 10−17 2.256 × 10−16\n!\nPMNS matrix\n(output)\n|VPMNS| ≃\n\n\n\n0.841 0.519 0.151\n0.451 0.520 0.726\n0.298 0.678 0.671\n\n\n\nMixing angles\n(output)\n\u0010\nθ12 θ13 θ23\n\u0011\n≃\n\u0010\n0.176π 0.048π 0.262π\n\u0011\nReferences\n[1] Y. Ema, K. Hamaguchi, T. Moroi and K. Nakayama, Flaxion: a minimal extension to solve\npuzzles in the standard model, JHEP 01 (2017) 096 [1612.05492].\n[2] L. Calibbi, F. Goertz, D. Redigolo, R. Ziegler and J. Zupan, Minimal axion model from\nflavor, Phys. Rev. D 95 (2017) 095009 [1612.08040].\n[3] C.D. Froggatt and H.B. Nielsen, Hierarchy of Quark Masses, Cabibbo Angles and CP\nViolation, Nucl. Phys. B 147 (1979) 277.\n[4] R.D. Peccei and H.R. Quinn, CP conservation in the presence of pseudoparticles, Phys. Rev.\nLett. 38 (1977) 1440.\n[5] R.D. Peccei and H.R. Quinn, Constraints imposed by CP conservation in the presence of\npseudoparticles, Phys. Rev. D 16 (1977) 1791.\n– 36 –\n[6] S. Nishimura, C. Miyao and H. Otsuka, Exploring the flavor structure of quarks and leptons\nwith reinforcement learning, JHEP 12 (2023) 021 [2304.14176].\n[7] DMRadio collaboration, Projected sensitivity of DMRadio-m3: A search for the QCD axion\nbelow 1 µeV, Phys. Rev. D 106 (2022) 103008 [2204.13781].\n[8] J. Preskill, M.B. Wise and F. Wilczek, Cosmology of the Invisible Axion, Phys. Lett. B 120\n(1983) 127.\n[9] L.F. Abbott and P. Sikivie, A Cosmological Bound on the Invisible Axion, Phys. Lett. B 120\n(1983) 133.\n[10] M. Dine and W. Fischler, The Not So Harmless Axion, Phys. Lett. B 120 (1983) 137.\n[11] P. Minkowski, µ →eγ at a Rate of One Out of 109 Muon Decays?, Phys. Lett. B 67 (1977)\n421.\n[12] T. Yanagida, Horizontal gauge symmetry and masses of neutrinos, Conf. Proc. C 7902131\n(1979) 95.\n[13] M. Gell-Mann, P. Ramond and R. Slansky, Complex Spinors and Unified Theories, Conf.\nProc. C 790927 (1979) 315 [1306.4669].\n[14] R.N. Mohapatra and G. Senjanovic, Neutrino Mass and Spontaneous Parity\nNonconservation, Phys. Rev. Lett. 44 (1980) 912.\n[15] J.E. Kim, Light pseudoscalars, particle physics and cosmology, Physics Reports 150 (1987) 1.\n[16] T. Hiramatsu, M. Kawasaki, K. Saikawa and T. Sekiguchi, Production of dark matter axions\nfrom collapse of string-wall systems, Phys. Rev. D 85 (2012) 105020 [1202.5851].\n[17] M. Ibe, S. Kobayashi, M. Suzuki and T.T. Yanagida, Dynamical solution to the axion\ndomain wall problem, Phys. Rev. D 101 (2020) 035029 [1909.01604].\n[18] NA62 collaboration, Search for π0 decays to invisible particles, JHEP 02 (2021) 201\n[2010.07644].\n[19] NA62 collaboration, Measurement of the very rare K+→π+νν decay, JHEP 06 (2021) 093\n[2103.15389].\n[20] M.S. Turner, Cosmic and local mass density of “invisible” axions, Phys. Rev. D 33 (1986)\n889.\n[21] Planck collaboration, Planck 2018 results. X. Constraints on inflation, Astron. Astrophys.\n641 (2020) A10 [1807.06211].\n[22] L. Kofman, A.D. Linde and A.A. Starobinsky, Nonthermal phase transitions after inflation,\nPhys. Rev. Lett. 76 (1996) 1011 [hep-th/9510119].\n[23] R.S. Sutton and A.G. Barto, Reinforcement learning: An introduction, MIT press (2018).\n[24] M. Abadi, A. Agarwal, P. Barham, E. Brevdo, Z. Chen, C. Citro et al., Tensorflow:\nLarge-scale machine learning on heterogeneous distributed systems, CoRR abs/1603.04467\n(2016) [1603.04467].\n[25] J. Bergstra, B. Komer, C. Eliasmith, D. Yamins and D.D. Cox, Hyperopt: a python library\nfor model selection and hyperparameter optimization, Computational Science & Discovery 8\n(2015) 014008.\n[26] T. Akiba, S. Sano, T. Yanase, T. Ohta and M. Koyama, Optuna: A next-generation\nhyperparameter optimization framework, in Proceedings of the 25th ACM SIGKDD\n– 37 –\nInternational Conference on Knowledge Discovery & Data Mining, KDD ’19, (New York,\nNY, USA), p. 2623–2631, Association for Computing Machinery, 2019, DOI.\n[27] G.-y. Huang and S. Zhou, Precise Values of Running Quark and Lepton Masses in the\nStandard Model, Phys. Rev. D 103 (2021) 016010 [2009.04851].\n[28] Particle Data Group collaboration, Review of Particle Physics, to be published in Phys.\nRev. D 110 (2024) 030001.\n[29] Particle Data Group collaboration, Review of Particle Physics, PTEP 2022 (2022)\n083C01.\n[30] S. Levine, Reinforcement learning and control as probabilistic inference: Tutorial and review,\n2018.\n[31] M.P. Deisenroth and C.E. Rasmussen, Pilco: a model-based and data-efficient approach to\npolicy search, in Proceedings of the 28th International Conference on International\nConference on Machine Learning, ICML’11, (Madison, WI, USA), p. 465–472, Omnipress,\n2011.\n[32] S. Brieden, H. Gil-Marín and L. Verde, Model-agnostic interpretation of 10 billion years of\ncosmic evolution traced by BOSS and eBOSS data, JCAP 08 (2022) 024 [2204.11868].\n[33] I. Esteban, M.C. Gonzalez-Garcia, M. Maltoni, T. Schwetz and A. Zhou, The fate of hints:\nupdated global analysis of three-flavor neutrino oscillations, JHEP 09 (2020) 178\n[2007.14792].\n[34] T.R. Harvey and A. Lukas, Quark Mass Models and Reinforcement Learning, JHEP 08\n(2021) 161 [2103.04759].\n– 38 –\n",
  "categories": [
    "hep-ph",
    "cs.LG",
    "hep-th"
  ],
  "published": "2024-09-16",
  "updated": "2024-09-16"
}