{
  "id": "http://arxiv.org/abs/2501.11003v1",
  "title": "Building low-resource African language corpora: A case study of Kidawida, Kalenjin and Dholuo",
  "authors": [
    "Audrey Mbogho",
    "Quin Awuor",
    "Andrew Kipkebut",
    "Lilian Wanzare",
    "Vivian Oloo"
  ],
  "abstract": "Natural Language Processing is a crucial frontier in artificial intelligence,\nwith broad applications in many areas, including public health, agriculture,\neducation, and commerce. However, due to the lack of substantial linguistic\nresources, many African languages remain underrepresented in this digital\ntransformation. This paper presents a case study on the development of\nlinguistic corpora for three under-resourced Kenyan languages, Kidaw'ida,\nKalenjin, and Dholuo, with the aim of advancing natural language processing and\nlinguistic research in African communities. Our project, which lasted one year,\nemployed a selective crowd-sourcing methodology to collect text and speech data\nfrom native speakers of these languages. Data collection involved (1) recording\nconversations and translation of the resulting text into Kiswahili, thereby\ncreating parallel corpora, and (2) reading and recording written texts to\ngenerate speech corpora. We made these resources freely accessible via\nopen-research platforms, namely Zenodo for the parallel text corpora and\nMozilla Common Voice for the speech datasets, thus facilitating ongoing\ncontributions and access for developers to train models and develop Natural\nLanguage Processing applications. The project demonstrates how grassroots\nefforts in corpus building can support the inclusion of African languages in\nartificial intelligence innovations. In addition to filling resource gaps,\nthese corpora are vital in promoting linguistic diversity and empowering local\ncommunities by enabling Natural Language Processing applications tailored to\ntheir needs. As African countries like Kenya increasingly embrace digital\ntransformation, developing indigenous language resources becomes essential for\ninclusive growth. We encourage continued collaboration from native speakers and\ndevelopers to expand and utilize these corpora.",
  "text": "Building Low-Resource African Language\nCorpora: A Case Study of Kidaw’ida, Kalenjin\nand Dholuo\nAudrey Mbogho1*, Quin Awuor1†, Andrew Kipkebut2†,\nLilian Wanzare3†, vivian Oloo3†\n1*School of Science and Technology, USIU-Africa, Nairobi, Kenya.\n2Department of Computer Science, Kabarak University, Nakuru, Kenya.\n3Department of Computer Science, Maseno University, Maseno, Kenya.\n*Corresponding author(s). E-mail(s): ambogho@usiu.ac.ke;\nContributing authors: qawuor@usiu.ac.ke; akipkebut@kabarak.ac.ke;\nldwanzare@maseno.ac.ke; voloo@maseno.ac.ke;\n†These authors contributed equally to this work.\nAbstract\nNatural Language Processing is a crucial frontier in artificial intelligence, with\nbroad applications in many areas, including public health, agriculture, education,\nand commerce. However, due to the lack of substantial linguistic resources, many\nAfrican languages remain underrepresented in this digital transformation. This\npaper presents a case study on the development of linguistic corpora for three\nunder-resourced Kenyan languages, Kidaw’ida, Kalenjin, and Dholuo, with the\naim of advancing natural language processing and linguistic research in African\ncommunities. Our project, which lasted one year, employed a selective crowd-\nsourcing methodology to collect text and speech data from native speakers of\nthese languages. Data collection involved (1) recording conversations and trans-\nlation of the resulting text into Kiswahili, thereby creating parallel corpora, and\n(2) reading and recording written texts to generate speech corpora. We made\nthese resources freely accessible via open-research platforms, namely Zenodo for\nthe parallel text corpora and Mozilla Common Voice for the speech datasets,\nthus facilitating ongoing contributions and access for developers to train models\nand develop Natural Language Processing applications. The project demonstrates\nhow grassroots efforts in corpus building can support the inclusion of African\nlanguages in artificial intelligence innovations. In addition to filling resource\ngaps, these corpora are vital in promoting linguistic diversity and empowering\n1\narXiv:2501.11003v1  [cs.CL]  19 Jan 2025\nlocal communities by enabling Natural Language Processing applications tai-\nlored to their needs. As African countries like Kenya increasingly embrace digital\ntransformation, developing indigenous language resources becomes essential for\ninclusive growth. We encourage continued collaboration from native speakers and\ndevelopers to expand and utilize these corpora.\nKeywords: Natural language processing, Low-resource languages, African languages,\nCorpus building, Crowd sourcing, Artificial intelligence, Kidaw’ida, Kalenjin, Dholuo\n1 Introduction\nNatural Language Processing (NLP) has become a vital component of modern artifi-\ncial intelligence (AI), shaping various sectors from healthcare to commerce. In recent\nyears, advances in hardware, sophisticated algorithms, and the availability of large\ntext data sets have enabled NLP systems to deliver unprecedented capabilities, trans-\nforming many aspects of human activity [1]. Generative AI tools, such as ChatGPT,\nexemplify the reach and impact of NLP innovations. However, these advances have\nexacerbated the global digital divide, particularly in linguistic terms. Many African\nlanguages, including those indigenous to Kenya, remain excluded from these develop-\nments, limiting access to critical information and technological benefits for speakers\nof these languages [2].\nThe linguistic divide is rooted in historical inequalities, mainly from colonialism,\nwhich imposed foreign languages like English, French, and Portuguese as the official\nmedia of communication in Africa. These languages dominate education, governance,\nand technology, often at the expense of indigenous languages [3]. This legacy has led\nto the marginalization of the majority of the African population, who do not speak\nthese colonial languages fluently, restricting their access to essential information and\ntechnological tools developed in those languages [4]. During the COVID-19 pandemic,\nfor example, critical public health information in Kenya was predominantly dissemi-\nnated in English and Kiswahili, excluding speakers of indigenous languages, especially\nin rural areas.\nThis linguistic exclusion underscores the urgent need for African languages to be\nintegrated into AI and NLP technologies. Building high-quality linguistic corpora for\nunderrepresented languages is crucial to enable language technologies such as machine\ntranslation, speech recognition, and speech synthesis for African languages. In this con-\ntext, our project focused on developing language corpora for three Kenyan languages:\nKidaw’ida, Kalenjin, and Dholuo, by collecting text and speech data and translating\nthe text data into Kiswahili to generate parallel corpora. These resources are intended\nto facilitate the development of NLP applications that cater to the needs of African\ncommunities, thus promoting linguistic diversity in AI development.\nIn the last five years, there has been a surge in NLP activity for African languages.\nThere is a need to get an overall picture of what is being done and where. A search\nfor “African language NLP” reveals a concentration of activity in only a handful of\ncountries, among them South Africa, Nigeria, Ethiopia, Kenya, and Ghana. This state\n2\nof affairs is depicted in Figure 1 based on the number of mentions of specific African\nlanguages in publicly available Internet sources. While our project focused on only\nthree Kenyan languages, one of the aims of this paper is to serve as a call to action to\ninitiate similar projects across the African continent and to ensure no language is left\nbehind.\nFig. 1 Distribution of NLP activity in Africa based on the number of NLP terms appearing in\nrelation to each country in public sources\nThis research aimed to answer the following questions:\n1. What methods are effective in acquiring data for building language corpora for\nlow-resource languages?\n2. What can motivate members of the target language communities to contribute to\nlanguage data?\n3. What methods can be applied to ensure the quality of the language data collected?\n2 Background on Kidaw’ida, Kalenjin and Dholuo\nIn this section, we provide background information on each language and describe any\nlanguage data available for it. We also describe the status of the language insofar as\nNLP resources are concerned.\n2.1 Kidaw’ida (ISO 639-3 Code: dav)\nKidaw’ida is a Bantu language spoken in Taita Taveta County in Southeastern Kenya\nby approximately half a million people. Apart from the Bible, and the Anglican Hymn\nBook, few publications in Kidaw’ida can be found. Frank Mcharo and Peter Bostock\npublished, in Kidaw’ida, a small 71-page book on the customs and traditions of the\nW’adaw’ida [5]. This is a copyrighted resource and can only be used with permission.\nFurthermore, it is only available in print. Although online articles, social media posts\n3\nand self-published story books written in Kidaw’ida are known to exist, they are\nhard to discover and consolidate. Indeed, social media platforms like Facebook, X and\nWhatsApp could be a rich source of Kidaw’ida text, but to extract it from the mixture\nof languages used on such platforms presents a significant challenge.\nKidaw’ida faces the threat of glottophagy from the more dominant Kiswahili due\nto their close geographical proximity and the intermingling of speakers of different\nKenyan languages. Glottophagy is a term coined by the French linguist Louis-Jean\nCalvet [6] to describe the “eating” of a language by a more dominant one. It perfectly\ncaptures what is arguably the most significant current threat to Kidaw’ida. This threat\nis witnessed in real time as Kiswahili words are rapidly replacing Kidaw’ida words in\nday to day conversations. Under normal circumstances, borrowing of words is a boon\nto a language as it gives the language words that it lacks, thus strengthening the\nexpressive power of the language. But the replacement of words when not necessary\nis very concerning as it could mean the erosion of the culture and the loss of crucial\nindigenous knowledge. This is not to deny the inevitable evolution of all languages,\nbut rather to raise an alarm about the rapidity of the change affecting languages\nlike Kidaw’ida that are spoken by a small population and that are threatened by a\ndominant language.\n2.2 Status of Kidaw’ida in NLP\nTo our knowledge, no other project has been carried out to develop NLP resources\nfor Kidaw’ida. A possible reason for this is the small size and marginalization of the\nKidaw’ida speaking population. There has been some interest in Kidaw’ida from lin-\nguists and anthropologists, for example, [7], but not from NLP researchers. Another\nimportant thing to note is that low-resource language research will typically be spear-\nheaded by speakers of that language, or at least involve them in significant roles. The\nsmall population of Kidaw’ida speakers makes it less likely to find among them a\nresearcher with the relevant training and the right level of awareness to initiate NLP\nwork. This project, while primarily aiming to generate digital resources for Kidaw’ida\nfor use in NLP, is critical for stemming the rapid decline of the language. It is not\nfar-fetched to imagine that a language that is not useful in the present digital age will\nsoon fall silent.\nMobilising community involvement for the collection of Kidaw’ida language data\nis crucial. At the same time, we found that it is not easy to get community mem-\nbers involved. There is initial excitement but this does not necessarily translate to\na willingness to participate long term. This challenge requires sustained commu-\nnity engagement to overcome, including reasonable remuneration for participation in\nlanguage projects.\n2.3 Kalenjin (ISO 639-3 Code: kln)\nKalenjin is a Nilotic language, belonging to the Eastern Nilotic branch of the\nNilo-Saharan language family. It is primarily spoken by the Kalenjin people, who pre-\ndominantly reside in the Rift Valley region of Kenya, particularly in counties such as\nUasin Gishu, Elgeyo-Marakwet, Bomet, Baringo, Nandi, and Kericho. The language is\n4\nalso spoken by smaller populations in parts of Uganda and Tanzania [8]. The Kalenjin\npeople are part of the larger Nilotic group that migrated from the Nile Valley to the\nEast African Great Lakes region thousands of years ago [9]. The migration process,\nwhich began around the fifteenth century, saw the Kalenjin spread across the Rift Val-\nley and into the surrounding areas. As a member of the Eastern Nilotic group, Kalenjin\nshares linguistic features with other languages such as Turkana, Pokot, and Maasai, all\nof which are spoken by ethnic groups in the same region [8]. Kalenjin holds significant\nimportance in the cultural and social life of its speakers. It is used for daily commu-\nnication, in traditional ceremonies, and in storytelling, with oral literature being a\nvital part of Kalenjin cultural identity. However, similar to many African languages,\nKalenjin’s use in formal domains like education, governance, and media is limited. In\nKenya, English and Kiswahili dominate in these sectors, relegating Kalenjin primarily\nto informal communication [10]. Kalenjin, like other indigenous languages in Kenya,\nfaces the challenge of language shift, where younger generations tend to prefer English\nand Kiswahili for social mobility and economic opportunities. Despite this, the lan-\nguage remains a central part of Kalenjin identity and continues to be passed down\nthrough generations, particularly in rural areas.\n2.4 Status of Kalenjin in NLP\nKalenjin, similar to other languages in Kenya, is under-resourced in terms of Natural\nLanguage Processing (NLP) capabilities. The lack of comprehensive linguistic data,\nsuch as text corpora, speech recordings, and annotated resources, hampers the devel-\nopment of effective NLP tools for the language. This scarcity places Kalenjin among\nthe many African languages that are classified as “low-resource languages” within the\nNLP field. Without sufficient linguistic data, it becomes challenging to develop appli-\ncations like speech recognition, machine translation, or language generation models\nthat can support Kalenjin speakers in the digital world. In the face of rapid techno-\nlogical advancement and the increasing global dominance of English and Kiswahili\nin digital platforms, Kalenjin risks being digitally marginalised. Without substantial\nefforts to build linguistic resources, including corpora and NLP tools, Kalenjin could\nbecome excluded from AI-powered communication technologies. This exclusion would\nfurther deepen the divide between speakers of major global languages and those of\nindigenous languages, leaving Kalenjin speakers without adequate access to digital ser-\nvices, content, and resources that are increasingly available to speakers of dominant\nlanguages [3].\nHowever, there is potential for revitalising Kalenjin in the digital space. Just as\ninitiatives in other African languages are showing success in developing NLP tools,\nsimilar efforts can be made for Kalenjin. By collecting text and speech data, building\nannotated corpora, and fostering community involvement, there is an opportunity to\nensure that Kalenjin is represented in the digital landscape. These steps would not\nonly preserve the language for future generations but also empower its speakers to\ntake part in technological advancements and digital platforms in a meaningful way.\nTo address these challenges, various stakeholders, including linguists, technologists,\ngovernment institutions, and community organisations, must collaborate to create a\nsustainable ecosystem for Kalenjin language preservation and digital integration. Such\n5\nefforts would help ensure that Kalenjin retains its cultural and linguistic relevance in\nan increasingly interconnected world.\n2.5 Dholuo (ISO 639-3 Code: luo)\nDholuo is a Nilotic language belonging to the Western Nilotic branch of the Nilo-\nSaharan language family. It is primarily spoken by the Luo ethnic group, which resides\npredominantly in the western parts of Kenya, along the shores of Lake Victoria, and\nparts of Tanzania and Uganda [11]. The language traces its origins to the migration of\nNilotic peoples from southern Sudan, who gradually settled in the Great Lakes region\nof East Africa around the 15th century [12]. As a Western Nilotic language, Dholuo\nshares linguistic similarities with other languages in that family, such as Acholi and\nLango spoken in Uganda and South Sudan.\nDholuo plays an important role in the cultural and social life of the Luo people,\nserving as a medium of communication in daily life, traditional practices, and artistic\nexpressions such as music and oral literature. However, its usage is restricted to infor-\nmal settings, as English and Kiswahili dominate formal domains such as education,\ngovernance, and commerce in Kenya [4].\n2.6 Status of Dholuo in NLP\nLinguistic data for Dholuo, including text and speech corpora, are limited in availabil-\nity, which is crucial for developing NLP applications like machine translation, speech\nrecognition, and language generation systems. This paucity of resources places Dholuo\nin the category of low-resource languages, meaning it needs more extensive datasets\nand digital tools for robust AI and NLP model development [2]. This lack of linguistic\nresources compounds the risk of Dholuo marginalisation in the digital age. Without\nconcerted efforts to build corpora and develop NLP tools, Dholuo faces the threat of\ndigital extinction, where its speakers are excluded from technological advancements,\nparticularly in AI-powered communication platforms. This further exacerbates the lan-\nguage’s vulnerability as it struggles to maintain relevance in a globalised world where\ndominant languages continue to shape technological access and innovation [3].\nTo address this, efforts are needed to develop NLP resources for Dholuo by col-\nlecting text and speech data, creating annotated corpora, and encouraging community\nparticipation in language preservation projects. Such interventions are necessary for\nDholuo to avoid becoming even more marginalised, both linguistically and digitally.\n3 Related Work\nMany African languages are primarily oral, with limited written materials and even\nless electronically available. This means that standard approaches that harvest online\ndata, such as web crawling, are excluded in many cases. Therefore, for many African\nlanguages, researchers must rely on other methods to collect data, such as fieldwork,\ncommunity engagement, and collaborations with native speakers. By actively seeking\nout and collecting data through these means, researchers can ensure that their work is\ninclusive and representative of the diverse linguistic landscape of Africa. This section\n6\nreviews a few examples of other researchers’ approaches to building African language\ncorpora from which we drew inspiration for our own project.\nKencorpus [13] is a corpus of Swahili, Dholuo, and Luhya, three of the more com-\nmonly spoken languages in Kenya. The corpus includes text documents, voice files,\nand a question-answering dataset. Data collection was done by researchers who were\ndeployed to communities, schools and media houses. Kencorpus collected 4,442 text\nsentences and 177 hours of recorded speech. From the raw data, the project annotated\nDholuo and Luhya texts with part of speech tags and created question-answer pairs\nfor the Kiswahili corpus. In addition, a parallel corpus was created by translating the\nDholuo and Luhya datasets into Kiswahili.\nAdelani et al. [14] used online news sites to develop named entity recognition (NER)\ndatasets for ten African languages, namely, Amharic, Hausa, Igbo, Kinyarwanda,\nLuganda, Luo, Nigerian-Pidgin, Swahili, Wolof and Yor`ub´a. The data consisted of\nabout 30,000 sentences in total, annotated for the NER task. The population sizes of\nthe speakers of the ten languages range from 4 million for Dholuo to 98 million for\nSwahili. Volunteers annotated the raw data with entity labels for person, location,\norganisation and date. The annotators were part of the Masakhane community and\nwere not paid, but were included as co-authors on the paper. Multiple annotators of\nthe same entities provided redundancy and quality assurance. This approach offers a\nviable alternative to the more common paid or unpaid crowdsourcing approach. Vol-\nunteers who are part of a community such as Masakhane that has been set up for\nlanguage work are already motivated and knowledgeable and may be better prepared\nto participate.\nNakatumba-Nabende et al. [15] developed text and speech resources for four Ugan-\ndan languages and Swahili. The four Ugandan languages are Luganda, Runyankore-\nRukinga, Lumasaba, and Acholi. Some of the text data was created by translating\nEnglish text into the five African languages. The English text was obtained from\ndifferent published sources, including English Wikipedia, social media, online local\nnewspapers, story books, novels and human rights charters. This process, as well as\ngenerating data for the African languages, also generated parallel corpora for English\nand the African languages. Additional text data was obtained by recruiting native\nspeakers through crowdsourcing to write sentences and review them for quality. Due\nto lack of access to computers, some of the contributors wrote their sentences down\nby hand, and these had to subsequently be typed. Text sentences were later read by\nnative speakers, again through crowdsourcing, and recorded to generate speech cor-\npora. Five parallel corpora were created consisting of 40,000 sentence pairs each. A\ntotal of sentences of monolingual data for five languages was collected. The project\nalso recorded 582 hours of Luganda speech and 1100 hours of Swahili speech.\nOgayo et al. [16] built a speech synthesis dataset for eleven African languages,\nnamely, Dhouo, Lingala, Kikuyu, Yoruba, Hausa, Luganda, Ibibio, Kiswahili, Wolof,\nFongbe and Suba. The data consisted of a total of 65,537 utterances distributed\nunevenly across languages, ranging from 125 to 11,971 utterances. These utterances\ncorresponded to a total of 113.84 hours of recordings, ranging from 0.33 to 24.82\nhours. Religious texts and other online and print sources were used as data sources.\nThe data was supplemented with contributions from recruited participants. To help\n7\nencourage community participation, comprehensive guidance on data collection meth-\nods and data licensing was provided. Because of the quality of speech required for\nspeech synthesis, voice talents were carefully vetted and were remunerated in cash and\nkind.\nThe examples discussed in this section give an idea of the kinds of activities that\nare going on in corpus building for African language NLP, and suggest approaches that\nhave been shown to work well and that others can emulate. It is essential to note that\nthese examples focus on specific regions and languages and only partially represent\nAfrica’s linguistic diversity. They also only offer a glimpse into the vast amount of NLP\nwork (including corpus building) that is currently going on in Africa. As momentum in\nAfrican language technologies picks up, researchers need to be intentional in ensuring\nthat no language is left behind and that global inequalities are not replicated locally.\nAs these examples show, current African language projects, regardless of the meth-\nods used, only generate modest amounts of data, typically in the order of tens of\nthousands of tokens or hundreds of hours of recorded speech. On the other hand, the\nlatest NLP advancements are in large language models (LLMs), which require massive\ndatasets, with Llama 2 from Meta having been trained on 2 trillion tokens [17]. Ope-\nnAI’s latest LLM has been trained on even more data than this (the specifics have not\nbeen officially published). It is therefore important that the methods employed for data\ncollection are scalable and sustainable to support more expansive research endeavours\nacross the continent. This is a significant challenge that requires innovative solutions.\n4 Our Methodology\nOur main objective was to collect text and speech data for three indigenous Kenyan\nlanguages, namely, Kidaw’ida, Kalenjin and Dholuo. These languages were chosen\nbecause they are the home languages of the research team. The project proposed to\nsource the data from members of the language communities through crowdsourcing.\nThe data collection was realised through a grant from the Lacuna Fund, which was\nused to pay small stipends to compensate language data contributors for their time,\neffort and the knowledge shared.\n4.1 Text Data Collection\nTwo approaches were used for generating text data:\n1. Contributors wrote down sentences in the three languages covered by this project.\nThese could be made up sentences or sentences from materials that are in the public\ndomain. Some contributors wanted to use the bible but most local language bibles\nin Kenya are copyrighted by the Bible Society of Kenya and the British and Foreign\nBible Society. However we advised that they could use such copyrighted materials\nfor inspiration. For example, a Bible story could remind them of something else\nthey could write about. The issue of cultural appropriateness of data is often cited\nas militating against using texts of foreign origin, but we propose that such text\ncan catalyse ideas.\n8\n2. Contributors recorded conversations in the three languages, which were later tran-\nscribed. The participants in the conversations were informed about the recording\nin advance and were asked to sign a consent form. During transcription, words that\nwere in a language different from the target language were replaced as code-switched\nspeech was outside the scope of the project.\nThe sentences collected were translated into Kiswahili to generate three parallel\ncorpora. Microsoft Excel and Google Sheets were used to compose and translate sen-\ntences. The resulting spreadsheets were stored on Google Drive and GitHub while the\nproject was in progress.\nQuality Assurance was achieved by identifying contributors with high levels of\nlanguage proficiency who were designated the role of Data Collection Leads (DCLs)\nand were paid a monthly salary. The DCLs identified language contributors they knew\nwere qualified and recommended them for recruitment. DCLs also contributed data\nand checked the contributors’ data for correct spelling, grammar, fluency, and proper\ntranslation into Kiswahili. The DCLs corrected any errors they found in the data.\nTo boost female representation in NLP work, 7 of the DCLs were female and 5\nwere male, and 5 of the researchers were female and 1 was male. Women were also well\nrepresented among the contributors as can be seen in Table 1 below. It is important\nto have gender balance in language projects to ensure applications work for everyone\nand also to avoid bias, for example, in generative AI.\n4.2 Voice Data Collection\nTo allow our geographically distributed contributors to make voice data contribu-\ntions easily, we determined that an open-access online platform would be ideal.\nQuite surprisingly, we were only able to find two options, namely, Living Dictionar-\nies (https://livingdictionaries.app) and Mozilla Common Voice (https://commonvoice.\nmozilla.org).\nInitially, it seemed that Living Dictionaries would be easier to use. Mozilla Common\nVoice involves a rather steep on-ramp, which we explain below. Living Dictionaries,\nalthough easy to get started on, turned out not to be fit for purpose as the main aim\nof that platform is language documentation and it is tailored for linguistic work rather\nthan NLP projects. For example, when recording voice for NLP, it is required that the\nsame phrase be read by multiple people. This is not well supported on Living Dictio-\nnaries as the interest there is in capturing how something is said and one person saying\nit suffices. However, in NLP, and more specifically in automatic speech recognition\n(ASR), the different characteristics of people’s voices while saying the same phrase\nmust be captured, so that applications built on this data can work for everyone.\nThus, in the end we had to go with Mozilla Common Voice. The first step in order\nto get onto Mozilla Common Voice is to make a language request. Once this request\nwas approved for each of our three languages, we had to localize the pages associated\nwith our languages using a platform provided by Mozilla known as Pontoon (https://\npontoon.mozilla.org). This entails translating over one thousand technical strings into\neach language, a task that requires both technical expertise and language proficiency,\nincluding the ability to invent appropriate words for technical terms that do not yet\n9\nexist in the language, such as “database”, “download” or “speech recognition.” This\nwas quite time-consuming and was a required step before the language was launched on\nMozilla Common Voice. Once launched, we were now able to upload the text sentences\nwe had collected earlier, and once enough sentences were available on the platform,\nwe were able to start reading and recording. Our DCLs recruited more people to read\nand record, to ensure the diversity of voices required in speech data.\nThe Kidaw’ida, Kalenjin and Dholuo text sentences were uploaded onto Mozilla\nCommon Voice to allow members of the three language communities to contribute\ntheir voices.\n5 Results\nWe collected 30,000 text sentences for each of the three languages and had contributors\nproficient in both their mother tongue and Kiswahili provide translations. This resulted\nin the creation of three parallel corpora: Kidaw’ida - Kiswahili, Kalenjin - Kiswahili\nand Dholuo - Kiswahili. These parallel corpora are freely available for download from\nhttps://zenodo.org/records/13355021 (Mbogho et al., 2024). The same repository is\non Github where it can be updated and reuploaded to Zenodo. This is important\nnot only for the continual expansion of the dataset but also for making any needed\ncorrections and quality improvements.\nThe collection of voice data is ongoing, but at present the speech data on Mozilla\nCommon Voice is as shown in Table 1.\nTable 1 Speech Data for Kidaw’ida, Kalenjin\nand Dholuo on Mozilla Common Voice\nLanguage\nHours\nSpeakers\nFemale\nMale\nKidaw’ida\n56\n24\n60%\n40%\nKalenjin\n92\n41\n70%\n30%\nDholuo\n120\n44\n58%\n42%\n6 Discussion\nSelected crowdsourcing was found to be a useful approach to developing corpora\nfor African languages which balances rapid data generation with quality assurance.\nAlthough many people are keen to contribute data for the languages to promote and\npreserve them, funding is essential to motivate broader participation, especially to the\nlevel required for generating large datasets within a reasonable amount of time.\nAnyone who wishes to download the voice data from Mozilla Common Voice can\ndo so at no cost and without the need for attribution because the license is CC0.\nDevelopers are encouraged to take advantage of this unrestricted access to the data to\ntrain models and create applications for these three languages. The language commu-\nnities are encouraged to continue to add to the repositories so that greater accuracies\nin models trained from the data can be achieved.\n10\n7 Conclusions and Future Work\nThe project ran for a year and generated 30,000 sentences per language. This still needs\nto be increased to train NLP models effectively. Future work will look at obtaining\na more substantial amount of funding to recruit more contributors. However, the\ndatasets should still be used in their current state to train models in order to establish\na baseline that is an indication of the level of accuracy achievable currently. It is also\nimportant to document what is possible with small datasets as not all applications\nrequire massive amounts of data.\nAs the amount of data grows and reaches levels that can train accurate models for\ndata-hungry tasks, NLP developers in Kenya need to turn their attention to developing\napplications with local languages. Areas where local language NLP technology can\nbe beneficial include health, agriculture, transport, education, and commerce, among\nmany others. Successful applications will, in turn, generate more data, leading to\nimprovements in model accuracy in the future.\nWe have referred to the type of crowd-sourcing we used as “selective” because\nthe contributors were known to members of the project team. This was important\nbecause language proficiency was a key consideration, and using a “random” crowd\ncould have negatively impacted the quality of the data. However, this approach may\nnot be sustainable for large projects that are looking to get a large amount of data in\na short time. In that case, a project has to risk collecting low quality data and then\napplying quality control measures afterwards.\nLicensing issues are a major concern in corpus building for low-resource languages.\nA greater involvement of intellectual property specialists is essential to ensure that\nlanguage communities are not disadvantaged but rather stand to benefit from the\nresulting data and associated applications.\nAcknowledgements\nThis work was carried out with support from Lacuna Fund, an initiative co-founded\nby The Rockefeller Foundation, Google.org, Canada’s International Development\nResearch Centre, and GIZ on behalf of the German Federal Ministry for Economic\nCooperation and Development (BMZ). The authors also wish to thank the Kidaw’ida,\nKalenjin and Dholuo language communities for sharing their languages with the world.\nDeclarations\nThe views expressed herein do not necessarily represent those of Lacuna Fund, its\nSteering Committee, its funders, or Meridian Institute.\nReferences\n[1] Bender, E.M., Gebru, T., McMillan-Major, A., Shmitchell, S.: On the dangers of\nstochastic parrots: Can language models be too big? In: Proceedings of the 2021\nACM Conference on Fairness, Accountability, and Transparency, pp. 610–623\n(2021)\n11\n[2] Nekoto, W., Marivate, V., Matsila, T., Fasubaa, T., Kolawole, T., Fagbohungbe,\nT., Akinola, S.O., Muhammad, S.H., Kabongo, S., Osei, S., et al.: Participatory\nresearch for low-resourced machine translation: A case study in african languages.\narXiv preprint arXiv:2010.02353 (2020)\n[3] Bamgbose, A.: African languages today: The challenge of and prospects for\nempowerment under globalization. In: Selected Proceedings of the 40th Annual\nConference on African Linguistics, pp. 1–14 (2011). Cascadilla Proceedings\nProject Somerville\n[4] Nduati, R.N.: The post-colonial language and identity experiences of transna-\ntional kenyan teachers in us universities. PhD thesis, Syracuse University\n(2016)\n[5] Mcharo, A.F.: Mizango na Maza Ra Kidawida Ra Kufuma Kokala. Peter Bostock,\nKenya (1995). https://books.google.co.ke/books?id=0zOBHAAACAAJ\n[6] Calvet, L.-J.: Linguistique et colonialisme. Petit trait´e de glottophagie, Paris,\nPayot (1974)\n[7] Sakamoto, K.: Social organization and ritual among the taita of kenya the process\nof the social change from kichuku type to muzi type. Journal of African Studies\n1986(28), 27–47 (1986)\n[8] Naibei Faith, K., Lwangale, D.: A comparative study of the kalenjin dialects.\nInternational Journal of Academic Research in Business and Social Sciences 8(8),\n476–503 (2018)\n[9] Chelimo, F.J., Chelelgo, K.: Pre-colonial political organization of the kalenjin of\nkenya: An overview. International journal of innovative research and development\n5 (2016)\n[10] Ogot, B.A.: Historical portrait of western kenya up to 1895 bethwell a. ogot.\nHistorical Studies and Social Change in Western Kenya: Essays in Memory of\nProfessor Gideon S. Were 13(4), 99–120 (2002)\n[11] Omulo, A.G., Williams, J.J.: A survey of the influence of ‘ethnicity’, in african\ngovernance, with special reference to its impact in kenya vis-`a-vis its luo\ncommunity. African Identities 16(1), 87–102 (2018)\n[12] Heine, B., Nurse, D.: African Languages: An Introduction. Cambridge University\nPress, United Kingdom (2000)\n[13] Wanjawa, B., Wanzare, L., Indede, F., McOnyango, O., Ombui, E., Muchemi, L.:\nKencorpus: A kenyan language corpus of Swahili, dholuo and luhya for natural\nlanguage processing tasks. In: Wartena, C. (ed.) Journal for Language Technology\nand Computational Linguistics, Vol. 36 No. 2, pp. 1–27. German Society for\n12\nComputational Linguistics and Language Technology, unknown (2023). https:\n//doi.org/10.21248/jlcl.36.2023.243\n[14] Adelani, D.I., Abbott, J., Neubig, G., D’souza, D., Kreutzer, J., Lignos, C.,\nPalen-Michel, C., Buzaaba, H., Rijhwani, S., Ruder, S., et al.: Masakhaner:\nNamed entity recognition for african languages. Transactions of the Association\nfor Computational Linguistics 9, 1116–1131 (2021)\n[15] Nakatumba-Nabende, J., Babirye, C., Nabende, P., Tusubira, J.F., Mukiibi, J.,\nWairagala, E.P., Mutebi, C., Bateesa, T.S., Nahabwe, A., Tusiime, H., et al.:\nBuilding text and speech benchmark datasets and models for low-resourced east\nafrican languages: Experiences and lessons. Applied AI Letters 5(2), 92 (2024)\n[16] Ogayo, P., Neubig, G., Black, A.W.: Building tts systems for low resource\nlanguages under resource constraints. In: Proc. S4SG 2022 (2022)\n[17] Touvron, H., Martin, L., Stone, K.R., Albert, P., Almahairi, A., Babaei, Y., Bash-\nlykov, N., Batra, S., Bhargava, P., et al.: Llama 2: Open foundation and fine-tuned\nchat models. ArXiv abs/2307.09288 (2023)\n13\n",
  "categories": [
    "cs.CL"
  ],
  "published": "2025-01-19",
  "updated": "2025-01-19"
}