{
  "id": "http://arxiv.org/abs/cmp-lg/9806009v1",
  "title": "Methods and Tools for Building the Catalan WordNet",
  "authors": [
    "Laura Benitez",
    "Sergi Cervell",
    "Gerard Escudero",
    "Monica Lopez",
    "German Rigau",
    "Mariona Taule"
  ],
  "abstract": "In this paper we introduce the methodology used and the basic phases we\nfollowed to develop the Catalan WordNet, and shich lexical resources have been\nemployed in its building. This methodology, as well as the tools we made use\nof, have been thought in a general way so that they could be applied to any\nother language.",
  "text": "cmp-lg/9806009   11 Jun 1998\nAbstract\nIn this paper we introduce the methodology used and\nthe basic phases we followed to develop the Catalan WordNet,\nand which lexical resources have been employed in its building.\nThis methodology, as well as the tools we made use of, have\nbeen thought in a general way so that they could be applied to\nany other language.\n1. Introduction\nIn recent years the research in the Natural\nLanguage Processing (NLP) field has proved the need for\nextensive and complete Lexical Knowledge Bases\n(LKBs). Acquiring such lexical/semantic structures is a\nhard problem and has been usually approached by\nreusing, merging and tuning existing lexical material.\nWhile in English the \"lexical bottleneck\" problem seems\nto be softened (e.g. WordNet (Miller, 1990), Alvey\nLexicon (Grover et al. 1993), COMLEX (Grishman et al.\n1994) and so on) there are no available wide range\nlexicons \nfor \nNLP \nfor \nother \nlanguages. \nManual\nconstruction of lexicons is the most reliable technique for\nobtaining structured lexicons but it is costly and highly\ntime-consuming. This is the reason for many researchers\nto have focussed on the massive acquisition of lexical\nknowledge and semantic information from pre-existing\nstructured lexical resources as automatically as possible.\nThe work presented here shows a fast production\nmethodology to build large scale multilingual LKBs from\nconventional dictionaries.\nIn this way, the English WordNet developed at\nPrinceton University is consolidating as a standard de\nfacto for the lexical-semantic representation of the natural\nlanguage for English. Considering this English WordNet\nas a reference, new WordNets in some other languages are\nbeing built, such as the ones for Galician, Basque, Spanish\nand Catalan, for instance. Besides, multilingual links are\nestablished automatically through the connections with\nthe English WordNet.\nThe research we are now presenting is embedded\nin the Catalan WordNet project, which is being carried out\nby the Grup de Tractament de Llenguatge Natural\n(GTLN-UPC-UB) of the Centre de Referència en\nEnginyeria Lingüística (CREL)\n2.\n                                                          \n1 The members of the GTLN-UPC-UB group (Grup de\nTractament de Llenguatge Natural) are from the Universitat\nPolitècnica de Catalunya and from the Universitat de\nBarcelona.\n2 The research reported in this paper was carried out within the\ncontext of the projects ITEM (TIC96-1243-C03-03), EWN\nThe aim of this paper is then to show the\nmethodology followed for the building of the Catalan\nWordNet, as well as which available resources we took\nadvantage of and which ones we had to develop.\nThe Catalan WordNet is a monolingual lexical\nknowledge base which initially follows WordNet model\ndeveloped at Princeton\n3, but it is going to be adapted to\nthe EuroWordNet\n4 model. In WordNet the concepts are\ndefined as synonymy sets called synsets linked one each\nother through semantic relations (hypernymy, hyponymy,\nmeronymy, antonymy and so on). The grammatical\ncategories represented in WordNet are nouns, verbs,\nadjectives and adverbs. At present we are working on the\nnouns and verbs representation.\nThis paper is organized in three parts. Firstly, it\ndescribes the methods which managed the automatic\nextraction of the noun concepts and their further\nvalidation (section 2.1), as well as the methodology for\nthe verbal concepts. Secondly, it explains the developed\ncomputing tools. In fact, it describes the design of the\ndatabase (section 3.1) and the interface which allows the\nuser to consult and modify the Catalan WordNet (section\n3.2). Finally, some conclusions are drawn and we\ncomment the main results, besides further research on the\ntopic (section 4).\n2. Development Of The Catalan Wordnet\nAs we previously mentioned, the Catalan\nWordnet is a monolingual lexical knowledge base.\nAlthough its final aim is the representation of nouns,\nverbs, adjectives and adverbs, this first stage has been\nfocused in the treatment of noun and verbal concepts, as\nthe Catalan WordNet has followed the same methodology\nwhich was  applied  to Spanish WordNet\n5. Let’s see how\nthese concepts are defined in WordNet.\nThe nouns or nominal concepts are organized\nhierarchycally which hangs from several nodes, from\nwhich  the rest of nodes are connected directly or\nindirectly through the semantic relation of hyponymy. The\nverbs are arranged hierarchically through the relation of\n                                                                                              \n(LE2-4003) and CREL (it is one of the centers of the\nGeneralitat de Catalunya that states references for research and\ndevelopment).\n3 Concretely the WordNet version is 1.5.\n4 EuroWordNet LE2-4003, this project aims to develop a generic\nmultilingual database with WordNets for several European\nlanguages.\n5 ITEM TIC96-1243-C03-03, the main aim of this project is to\nexplore and evaluate to which extend the use of NLP techniques\ncan improve the processes of information recovery and\nextraction in textual or multimedia systems, enabling a\nmultilingual access to them.\nMETHODS AND TOOLS FOR  BUILDING THE CATALAN WORDNET\nLaura Benítez, Sergi Cervell, Gerard Escudero,\nMònica López, German Rigau and Mariona Taulé.\nGTLN-UPC-UB\n1\n{laurab, escudero, g.rigau}@lsi.upc.es\n{cervell, lopez, mtaule}@lingua.fil.ub.es\ntroponymy and are classified into different semantic fields\n(verbs of communication, movement, state, change, and\nso on).\nTaking into account the methodology of the\nEuroWordNet project, a set of base concepts has been\ngenerated. These are considered the most important\nconcepts which are also common to all the languages\ninvolved in this project\n6. This set of base concepts are put\nto use as the starting point for the construction of the\nCatalan WordNet. To be exact, they are a total of 793\nbase noun concepts and 228 base verbal concepts\ntranslated by hand. The aim is to try to assure that any of\nthe nodes in the hierarchy is connected, directly or\nindirectly, to one of these base concepts.\nNext, we will explain the methodology employed\nin extracting, generating and validating the noun and\nverbal concepts which are not base concepts.\n2.1. Noun Concepts\nThe generation of noun concepts has been done\nautomatically from machine readeable versions of\nbilingual dictionaries following (Atserias et al. 1997). In\nthis project the Diccionari Anglès-Català Català-Anglès\nde la Enciclopèdia Catalana (DEC, 1996) has been used.\nAll the possible pairs of English word - Catalan word  are\ntaken out of this concrete dictionary, so that they could be\nconnected to the synsets of WordNet (Benítez et al. a,\n1998). Once we obtained these pairs, some methods are\napplied to generate this set of three elements, Catalan\nword - English word - synset and to disambiguate them in\nrelation to Wordnet. Such methods are the class methods\n(Atserias et al. 1997). Their application consists in doing a\ncomplete and discrete partition of the set of pairs Catalan\nword - English word into 4 disjoint subsets:\na) In the first of these subsets there are the\nCatalan Words (CW) which have only one translation into\na unique English Word (EW) and, besides, this EW can\nonly be translated into that CW.\nFigure 1: Criterion 1.\nb) In the second one there are the CWs which\nhave more than one translation into English and each one\nof these EWs can only be translated into that unique CW.\nFigure 2: Criterion 2.\n                                                          \n6 The languages involved in the EuroWordNet project are\nEnglish, Spanish, Italian and Dutch. The base concepts has been\nextracted by means of the evaluation of  the frequencies from\ntextual \ncorpora \nand \ngenus \nfrom \nMachine \nReadeable\nDictionaries.\nc) In the third subset we find the EWs which\nhave only one translation into a unique CW and, besides,\nthis CW can only be translated into that EW.\nFigure 3: Criterion 3.\nd) Finally, in the fourth one there are the CWs\nwhich have more than one translation into EWs and every\none of these EWs is translated into more than one CW.\nFigure 4: Criterion 4.\nSubsequently, the set of English word - synset\npairs is divided into two subsets: the one of monosemic\npairs and that of polysemic ones. Then these two subsets\nof English word - synset are joined with those four\nCatalan word - English word subsets. As a result we\nobtain 8 new groups of sets of three elements, Catalan\nword - English word - synset, where the English word is\nthe same in every two joined subsets (Benítez et al. b,\n1998)\n7.\nUp to here, we have explained the application of\nmonosemic and polysemic criteria of the class methods.\nWe have also used the variant criterion, an hybrid\ncriterion from the class methods, which consists in linking\nCatalan words to synsets. The link is established when the\nsynset contains a set of English words and two or more of\nthese English words have as a translation the same\nCatalan word.\nFigure 5: Variant criterion\nFrom each of those obtained 9 sets, a representative\nrandom sample has been extracted and validated by hand,\nin order to calculate every confidence score. The\nreliability obtained from the sample is assigned to the\nwhole set. We have validated  1515 out of  49069 Catalan\nword - English word - synset links in this thorough way.\n                                                          \n7 In this paper we can see the practical application of the class\nmethods explained in the paper Combining Multiple Methods for\nthe Automatic Construction of Multilingual WordNets (Atserias\net al. 1997), as well as an implementation with Unix tools.\nThe subsets with a confidence score over 85 %\nhave been added to the noun concepts, in order to increase\nthe Catalan WordNet.\nTable 1: Results of class methods.\nAt the present, the represented noun synsets are\n7509, which means 6961 noun forms and 10705 links.\n2.2. Verbal Concepts\nThe methodology employed in representing the\nverbal concepts has been slightly different from the one in\nthe noun concepts. Bearing in mind the accented\npolysemy we can find in the verbs and considering the\nlower number of verbs too, a complete manual building\nwas chosen.\nOn one side and thanks to the Pirápides\n8 project,\nwhere some of the members of our team took part, a list\nof English verbs was available, being these ones classified\nsemantically, as in the proposal of Beth Levin\n9 (Levin,\n1993), with their translations into Spanish and Catalan.\nOn the other side, the professor Bonnie Dorr at the\nMaryland University kindly provided us with the\ncorrespondence English verb - Levin class - synset (Dorr\net al. 1997). From these two lists the link Catalan verb -\nsynset was generated automatically before we validated\nevery link carefully.\nThe total amount of verbal concepts is 3244,\nwhich means a whole of 3359 verbal forms and 9121\nlinks.\n3. Software\nThe Catalan WordNet is being modifying and\nupdating constantly. What is more, all these changes have\nto be done by any of the members of our group at the\nsame time. This is why we need a database which assures\nthe integrity of the information contained and this\nsimultaneous access, in short, its consistency. To make the\nuser work easier, a friendly interface has been created.\nFirstly, this one allows the user to search and manipulate\nthe data easily and effectively. The user also can consult\nmultilingual data and have an intuitive view of the\nhierarchy of the synsets. Secondly, some lexical data\n                                                          \n8 Pirápides is a project in which the Universitat de Barcelona,\nUniversitat Autònoma de Barcelona, Universitat de Lleida and\nUniversidad de San Sebastián take part. Its main aim is to create\nlexical corpora for natural language processing and dictionaries\nof use.\n9 The verbal classification proposed by Beth Levin is based on\nthe hypothesis which states that the syntactic behaviour is\ndetermined by the meaning of a verb, therefore, it is useful to\nstudy the diathesis alternations to classify verbs semantically.\n(mainly monolingual and bilingual dictionaries) are\navailable.\n3.1.Database\nTo minimize the developing expenses and to let\nthe free access to the data, a freeware database, the Mini\nSQL de Hughes Technologies\n10 (Mini SQL) was used.\nThis one can be installed in any Unix system (including\nLinux) and offers Application Program Interfaces (APIs)\nfor the main computing languages.\nThe main objectives in the relational database\ndesign are the storage of the general information of the\ndifferent WordNets, as well as to keep all this information\nin a well defined structure (Benítez et al. c, 1998). At the\nmoment our design includes the complete loading of\nWordNet 1.5, which means the following:\na) The synsets and their related information (the gloss,\nthe semantic field and the total amount of direct\nand indirect hyponyms),\nb) the different meanings of every word and its\nconnection to the synset, and\nc) the semantic relations stored as connections for\nsynsets  (hyperonymy, hyponymy, antonymy,\nmeronymy, \nholonymy, \nattribute, \ncause \nand\nentailment).\nBut for the rest of WordNets we kept:\na) the meanings of every word with its connection to\nthe synset in WordNet 1.5 besides the reliability\nobtained through the methods explained in section\n2, and\nb) the gloss related to the synset.\nRight now the semantic relations in WordNet 1.5\nform the skeleton of the hierarchy of all the WordNets in\nthe system. The multilingual connection of the meanings\nof the words is also done through the synsets. The present\nloaded WordNets are fragments of the Spanish, Basque\nand Catalan ones.\nIntegrating new WordNets in new languages can\nbe easily done, and the structure of the database allows to\ndevelop exporting software easily, too. Actually, a\nprototype for exporting monolingual Wordnets capable\nfor the tools\n11 in EuroWordNet (Novell, 1996-1998)  has\nalready been implemented.\n3.2. The Interface\nIn order to build the Catalan WordNet or any\nother monolingual WordNet it is necessary the creation of\nan accessing interface to the database and to the different\navailable lexical resources.  Due to the physical distance\nbetween  the different members of the project who handle\nthe data and to allow any user to consult it openly, the\ninterface has been developed to work through the Web\n(Benítez et al. c,d, 1998).\nThe operations the interface offers are the\nfollowing:\n• Consult Multilingual WordNet. Its main goal is to\naid the checking of errors and gaps in the hierarchic\narrangement of the different WordNets. To make this\npossible the interface shows the path through the\nsemantic hierarchy of one of the WordNets, for any\n                                                          \n10 The address of this company is “http://www.Hughes.com.au”.\n11 Polaris 1.3. of Novell Inc.\nCriteria\n#links\n#synsets\n#words\n%ok\nmono1\n1226\n1212\n1221\n95.9\nmono2\n419\n337\n258\n97.6\nmono3\n448\n208\n396\n93.3\nmono4\n3012\n1532\n2178\n94\npoly1\n2298\n2244\n864\n90.4\npoly2\n568\n519\n158\n77.9\npoly3\n1125\n477\n357\n71.7\npoly4\n37714\n9151\n4266\n54.5\nvariant\n2259\n1517\n1516\n96\nsemantic relation, having as a starting point a synset, a\nsense or a word of one of the available languages.\n• Edit Multilingual WordNet. Obviously its basic\ntarget is the edition of the words and glosses of all of\nthe WordNets, except for those of  WordNet 1.5. For\nevery verb it is also possible to edit its corresponding\nLevin semantic classes (see section 2.2).\n• Consult Lexical Resources. It allows to consult the\ndifferent bilingual and monolingual dictionaries. This\ninformation is not storaged in the database, but into\ntext files. At the moment these lexical resources\navailables for Catalan are the Diccionari general de la\nllengua catalana (Fabra, 1984), and the Diccionari\nbàsic català-anglès anglès-català de l’Enciclopèdia\nCatalana (DEC, 1996).\n• Edit Statistics. This option shows an historic list of\nthe changes and updates done through the interface.\nIn the implementation of the interface we made\nuse of some programming languages such as Perl, HTML\nand JavaScript (Aronson & Lowery, 1997; CGI;\nGoodman, 1996; Muelver, 1996; Wall et al., 1996].\n4. Conclusions And Future Perspectives\nThe first steps that have been taken towards\nproducing a preliminary version of the Catalan WordNet\nhas been described. This work proposes the automatic\nconstruction of the core of a multilingual Lexical\nKnowledge Base from preexisting lexical resources. First,\nfollowing (Atserias et al 1997), we explain a set of\nautomatic and complementary techniques for linking\nCatalan words collected from bilingual MRDs (for nouns)\nand lexicons (for verbs) to English WordNet synsets. As\nthe Catalan WordNet produced in this way is neither error\nfree nor complete, we implemented a Web interface\nallowing manual interaction (that is, consulting and\nediting) with the multilingual WordNet. Currently, due to\nthe smaller coverage  we achieved by mapping the\nCatalan/English bilingual MRD (compared to the size of\nWordNet1.5), we are planning to join Catalan taxonomies\nacquired automatically from a monolingual MRD (Rigau\net al. 1997). The results show that the construction of\nmultilingual LKBs can be performed quickly using a\nmixed methodology. That is, building a multilingual LKB\nderived from bilingual MRDs by using automatic\nprocedures, and then performing, in a second stage, a\nmanual refinement of the acquired data.\nReferences\nAronson, A. & Lowery, J. (1997). HTML 3.2. Manual of\nStyle. - Emeryville: Ziff Davis Press, 1997. - ISBN: 1-\n56276-529-9.\nAtserias, J.; Climent, S.; Farreras, J.; Rigau, G. &\nRodríguez, H. (1997). “Combining Multiple Methods\nfor the Automatic Construction of Mutilingual\nWordNets”. In proceedings of Conference on Recent\nAdvances on NLP. (RANLP’97). Tzigov Chark,\nBulgaria 1997.\nBenítez, L.; Escudero, G.; Farreras, J. & Rigau, G.\n(1998a). \n“Making \nTractable \nthe \nEncliclopèdia\nCatalana Bilingual Dictionary”. Technical Report\nFigure 6: Example of Consult Multilingual WordNet.\nLSI-98-3-T. LSI Department, Universitat Politècnica\nde Catalunya, 1998.\nBenítez, L.; Escudero, G.; Farreras, J. & Rigau, G.\n(1998b). “The Application of some Automatic\nMethods for the Construction of Multilingual\nWordNets”. \nTechnical \nReport \nLSI-98-4-T. \nLSI\nDepartment, Universitat Politècnica de Catalunya,\n1998.\nBenítez, L.; Escudero, G.; Farreras, J. & Rigau, G.\n(1998c). “WWI: A Multilingual WordNet Interface\nusing the Web. Technical Manual”. Technical Report\nLSI-98-5-T. LSI Department, Universitat Politècnica\nde Catalunya, 1998.\nBenítez, L.; Escudero, G.; Farreras, J. & Rigau, G.\n(1998d). “WWI: A Multilingual WordNet Interface\nusing the Web. User Manual”. Technical Report LSI-\n98-6-T. LSI Department, Universitat Politècnica de\nCatalunya, 1998.\nCGI. The Common Gateway Interface Specification.\n[Web Page]\n“http://hoohoo.ncsa.uiuc.edu/cgi/interface.html”.\nCookies. Client Side State - HTTP Cookies. [Web Page]\n“http://home.netscape.com/newsref/std/\ncookiespec.html”.\nDEC (1996). Diccionari bàsic català-anglès anglès-\ncatalà. - Barcelona: Enciclopèdia Catalana, 1996. -\nISBN: B4-412-2582-6.\nDorr, B.; Martí, M.A. & Castellón, I. (1997). “Spanish\nEuroWordNet and LCS-Based Interlingual mt”. In\nfirst \nworkshop \non \nInterlinguas \nAMTA/SIG-1L\nworkshop at MT Summit 1997.\nFabra (1984). Diccionari general de la llengua catalana. -\nBarcelona: Fundació Enciclopèdia Catalana, 1984. -\nISBN 84-350-5000-9.\nGoodman, D. (1996). Danny Goodman's JavaScript\nHandbook. - Foster City: IDG Books Worldwide,\n1996. (tr: Programación en JavaScript. - Madrid:\nAnaya Multimedia, 1997. - ISBN: 84-415- 0080-0).\nGrishman, R.; Macleod, C. & Meyers, A. (1994).\n“Comlex syntax: building a computational lexicon”. In\nproceedings of the 15th Annual Meeting of the\nAssociation \nfor \nComputational \nLinguistics.\n(Coling'94). 268-272. Kyoto, Japan, 1994.\nGrover, C.; Carroll, J. & Reckers, J. (1993). “The Alvey\nNatural Language Tools grammar (4th realese)”.\nTechnical \nReport \n284. \nComputer \nLaboratory,\nCambridge University, UK. 1993.\nLevin, B. (1993). English Verb Classes and Alternations.\n- Chicago: The University of Chicago Press, 1993. -\nISBN: 0-226-47532-8.\nMiller, G. (1990). \"Five papers on WordNet\". In Special\nIssue of International Journal of Lexicography: actas\n1990.\nMini SQL. Hughes Technologies. Mini SQL 2.0 User\nGuide. [Web page]\n     “http://www.Hughes.com.au/”.\nMuelver, J. (1996). Creating CoolT M Web Pages with\nPerl. - Foster City: IDG Books Worldwide, 1996. (tr:\nCreación de páginas Web con PERL. - Madrid: Anaya\nMultimedia, 1997. - ISBN: 84-415-0076-2).\nNovell (1996-1998). The EWN Database Tool. Version\n1.3.3. Copyright, Novell Inc. 1996-1998.\nRigau, G.; Atserias, J. & Agirre, E. (1997). “Combining\nUnsupervised Lexical Knowledge Methods for Word\nSense Disambiguation”. In proceedings of the 34th\nAnnual Meeting of the Association for Computational\nLinguistics (ACL'97). Madrid, Spain, 1997.\nWall, L.; Christiansen, T. & Schwartz, R. L. (1996).\nProgramming Perl. - Second Edition. - Sebastopol:\nO'Relly & Associates, 1996. - ISBN: 1-56592-149-6.\n",
  "categories": [
    "cmp-lg",
    "cs.CL"
  ],
  "published": "1998-06-11",
  "updated": "1998-06-11"
}